#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Weapon_UmbrellaSword

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Weapon_UmbrellaSword.ABP_Weapon_UmbrellaSword_C.ExecuteUbergraph_ABP_Weapon_UmbrellaSword
// 0x0008 (0x0008 - 0x0000)
struct ABP_Weapon_UmbrellaSword_C_ExecuteUbergraph_ABP_Weapon_UmbrellaSword final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_3;        // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_Weapon_UmbrellaSword_C_ExecuteUbergraph_ABP_Weapon_UmbrellaSword) == 0x000004, "Wrong alignment on ABP_Weapon_UmbrellaSword_C_ExecuteUbergraph_ABP_Weapon_UmbrellaSword");
static_assert(sizeof(ABP_Weapon_UmbrellaSword_C_ExecuteUbergraph_ABP_Weapon_UmbrellaSword) == 0x000008, "Wrong size on ABP_Weapon_UmbrellaSword_C_ExecuteUbergraph_ABP_Weapon_UmbrellaSword");
static_assert(offsetof(ABP_Weapon_UmbrellaSword_C_ExecuteUbergraph_ABP_Weapon_UmbrellaSword, EntryPoint) == 0x000000, "Member 'ABP_Weapon_UmbrellaSword_C_ExecuteUbergraph_ABP_Weapon_UmbrellaSword::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_UmbrellaSword_C_ExecuteUbergraph_ABP_Weapon_UmbrellaSword, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000004, "Member 'ABP_Weapon_UmbrellaSword_C_ExecuteUbergraph_ABP_Weapon_UmbrellaSword::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_UmbrellaSword_C_ExecuteUbergraph_ABP_Weapon_UmbrellaSword, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000005, "Member 'ABP_Weapon_UmbrellaSword_C_ExecuteUbergraph_ABP_Weapon_UmbrellaSword::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_UmbrellaSword_C_ExecuteUbergraph_ABP_Weapon_UmbrellaSword, CallFunc_EqualEqual_NameName_ReturnValue_2) == 0x000006, "Member 'ABP_Weapon_UmbrellaSword_C_ExecuteUbergraph_ABP_Weapon_UmbrellaSword::CallFunc_EqualEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_UmbrellaSword_C_ExecuteUbergraph_ABP_Weapon_UmbrellaSword, CallFunc_EqualEqual_NameName_ReturnValue_3) == 0x000007, "Member 'ABP_Weapon_UmbrellaSword_C_ExecuteUbergraph_ABP_Weapon_UmbrellaSword::CallFunc_EqualEqual_NameName_ReturnValue_3' has a wrong offset!");

// Function ABP_Weapon_UmbrellaSword.ABP_Weapon_UmbrellaSword_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Weapon_UmbrellaSword_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Weapon_UmbrellaSword_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Weapon_UmbrellaSword_C_AnimGraph");
static_assert(sizeof(ABP_Weapon_UmbrellaSword_C_AnimGraph) == 0x000010, "Wrong size on ABP_Weapon_UmbrellaSword_C_AnimGraph");
static_assert(offsetof(ABP_Weapon_UmbrellaSword_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Weapon_UmbrellaSword_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

