#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Soldier_Range

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Soldier_Range.ABP_Soldier_Range_C.ExecuteUbergraph_ABP_Soldier_Range
// 0x002C (0x002C - 0x0000)
struct ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue_1;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_2;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range) == 0x000004, "Wrong alignment on ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range");
static_assert(sizeof(ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range) == 0x00002C, "Wrong size on ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range");
static_assert(offsetof(ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range, EntryPoint) == 0x000000, "Member 'ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range, CallFunc_GetCurveValue_ReturnValue) == 0x000004, "Member 'ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000008, "Member 'ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000009, "Member 'ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range, CallFunc_GetCurveValue_ReturnValue_1) == 0x00000C, "Member 'ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range::CallFunc_GetCurveValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range, CallFunc_GetCurveValue_ReturnValue_2) == 0x000010, "Member 'ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range::CallFunc_GetCurveValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range, CallFunc_Not_PreBool_ReturnValue) == 0x000014, "Member 'ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range, CallFunc_FMax_ReturnValue) == 0x000018, "Member 'ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x00001C, "Member 'ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range, CallFunc_FMax_ReturnValue_1) == 0x000020, "Member 'ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range, CallFunc_BooleanAND_ReturnValue_1) == 0x000024, "Member 'ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range, CallFunc_Lerp_ReturnValue) == 0x000028, "Member 'ABP_Soldier_Range_C_ExecuteUbergraph_ABP_Soldier_Range::CallFunc_Lerp_ReturnValue' has a wrong offset!");

// Function ABP_Soldier_Range.ABP_Soldier_Range_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Soldier_Range_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Soldier_Range_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Soldier_Range_C_AnimGraph");
static_assert(sizeof(ABP_Soldier_Range_C_AnimGraph) == 0x000010, "Wrong size on ABP_Soldier_Range_C_AnimGraph");
static_assert(offsetof(ABP_Soldier_Range_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Soldier_Range_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Soldier_Range.ABP_Soldier_Range_C.AnimLayer_Additive
// 0x0030 (0x0030 - 0x0000)
struct ABP_Soldier_Range_C_AnimLayer_Additive final
{
public:
	struct FPoseLink                              MainStateBasePose;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AdditivePose;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimLayer_Additive_0;                              // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Soldier_Range_C_AnimLayer_Additive) == 0x000008, "Wrong alignment on ABP_Soldier_Range_C_AnimLayer_Additive");
static_assert(sizeof(ABP_Soldier_Range_C_AnimLayer_Additive) == 0x000030, "Wrong size on ABP_Soldier_Range_C_AnimLayer_Additive");
static_assert(offsetof(ABP_Soldier_Range_C_AnimLayer_Additive, MainStateBasePose) == 0x000000, "Member 'ABP_Soldier_Range_C_AnimLayer_Additive::MainStateBasePose' has a wrong offset!");
static_assert(offsetof(ABP_Soldier_Range_C_AnimLayer_Additive, AdditivePose) == 0x000010, "Member 'ABP_Soldier_Range_C_AnimLayer_Additive::AdditivePose' has a wrong offset!");
static_assert(offsetof(ABP_Soldier_Range_C_AnimLayer_Additive, AnimLayer_Additive_0) == 0x000020, "Member 'ABP_Soldier_Range_C_AnimLayer_Additive::AnimLayer_Additive_0' has a wrong offset!");

}

