#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_RedButterfly

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "LModifyFinalPose_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_RedButterfly.ABP_RedButterfly_C
// 0x15C0 (0x1CB0 - 0x06F0)
class UABP_RedButterfly_C final : public ULAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x06F8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x0720(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x0748(0x00C0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0808(0x0118)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0920(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x0A38(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x0B90(0x0158)()
	struct FLAnimNode_ModifyFinalPose             LAnimGraphNode_ModifyFinalPose;                    // 0x0CE8(0x00E8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0DD0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0DF0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0E10(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0E40(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0EC0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x0EF0(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0FA0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0FE8(0x0158)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x1140(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x1168(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x1190(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x11B8(0x00C0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1278(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x12F8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1328(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x1350(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x1380(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1430(0x00A0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x14D0(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1500(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x1548(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x1570(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x1598(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x15C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x15E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x1610(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1638(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x16B8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x16E8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1768(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1798(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1818(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1848(0x00B0)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x18F8(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x19C0(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1A70(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1A98(0x0158)()
	struct FAnimNode_PoseSnapshot                 AnimGraphNode_PoseSnapshot;                        // 0x1BF0(0x0090)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1C80(0x0028)()
	bool                                          AdditivePlaying;                                   // 0x1CA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_RedButterfly(int32 EntryPoint);
	void AnimNotify_AdditiveStop();
	void AnimNotify_AdditivePlaying();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_RedButterfly_AnimGraphNode_TransitionResult_2EDEA0594FD1FA4448AC169DE77F8720();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_RedButterfly_AnimGraphNode_TransitionResult_B91C888F4E1A9B85306092A9DF7338CC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_RedButterfly_AnimGraphNode_TransitionResult_88360770401E0E2CEF21C28799FBBB6E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_RedButterfly_AnimGraphNode_TransitionResult_72406B1440019D1CC18BFB8A2574D12D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_RedButterfly_AnimGraphNode_TransitionResult_4B8F4DEB413389400772829DDA32D598();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_RedButterfly_AnimGraphNode_TransitionResult_B569B58040F9FD4E543B90BBD692EBBE();
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimLayer_Additive(const struct FPoseLink& MainStateBasePose, const struct FPoseLink& AdditivePose, struct FPoseLink* AnimLayer_Additive_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_RedButterfly_C">();
	}
	static class UABP_RedButterfly_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_RedButterfly_C>();
	}
};
static_assert(alignof(UABP_RedButterfly_C) == 0x000010, "Wrong alignment on UABP_RedButterfly_C");
static_assert(sizeof(UABP_RedButterfly_C) == 0x001CB0, "Wrong size on UABP_RedButterfly_C");
static_assert(offsetof(UABP_RedButterfly_C, UberGraphFrame) == 0x0006F0, "Member 'UABP_RedButterfly_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_UseCachedPose_5) == 0x0006F8, "Member 'UABP_RedButterfly_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_UseCachedPose_4) == 0x000720, "Member 'UABP_RedButterfly_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_LayeredBoneBlend_1) == 0x000748, "Member 'UABP_RedButterfly_C::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_LinkedInputPose_1) == 0x000808, "Member 'UABP_RedButterfly_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_LinkedInputPose) == 0x000920, "Member 'UABP_RedButterfly_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_SaveCachedPose_3) == 0x000A38, "Member 'UABP_RedButterfly_C::AnimGraphNode_SaveCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_SaveCachedPose_2) == 0x000B90, "Member 'UABP_RedButterfly_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, LAnimGraphNode_ModifyFinalPose) == 0x000CE8, "Member 'UABP_RedButterfly_C::LAnimGraphNode_ModifyFinalPose' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_LocalToComponentSpace) == 0x000DD0, "Member 'UABP_RedButterfly_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_ComponentToLocalSpace) == 0x000DF0, "Member 'UABP_RedButterfly_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_Root_1) == 0x000E10, "Member 'UABP_RedButterfly_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_SequencePlayer_4) == 0x000E40, "Member 'UABP_RedButterfly_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_StateResult_5) == 0x000EC0, "Member 'UABP_RedButterfly_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_StateMachine_2) == 0x000EF0, "Member 'UABP_RedButterfly_C::AnimGraphNode_StateMachine_2' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_Slot_1) == 0x000FA0, "Member 'UABP_RedButterfly_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_SaveCachedPose_1) == 0x000FE8, "Member 'UABP_RedButterfly_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_TransitionResult_7) == 0x001140, "Member 'UABP_RedButterfly_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_TransitionResult_6) == 0x001168, "Member 'UABP_RedButterfly_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_UseCachedPose_3) == 0x001190, "Member 'UABP_RedButterfly_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_LayeredBoneBlend) == 0x0011B8, "Member 'UABP_RedButterfly_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_SequencePlayer_3) == 0x001278, "Member 'UABP_RedButterfly_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_StateResult_4) == 0x0012F8, "Member 'UABP_RedButterfly_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_UseCachedPose_2) == 0x001328, "Member 'UABP_RedButterfly_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_StateResult_3) == 0x001350, "Member 'UABP_RedButterfly_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_StateMachine_1) == 0x001380, "Member 'UABP_RedButterfly_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_BlendListByBool) == 0x001430, "Member 'UABP_RedButterfly_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_Root) == 0x0014D0, "Member 'UABP_RedButterfly_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_Slot) == 0x001500, "Member 'UABP_RedButterfly_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_TransitionResult_5) == 0x001548, "Member 'UABP_RedButterfly_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_TransitionResult_4) == 0x001570, "Member 'UABP_RedButterfly_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_TransitionResult_3) == 0x001598, "Member 'UABP_RedButterfly_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_TransitionResult_2) == 0x0015C0, "Member 'UABP_RedButterfly_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_TransitionResult_1) == 0x0015E8, "Member 'UABP_RedButterfly_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_TransitionResult) == 0x001610, "Member 'UABP_RedButterfly_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_SequencePlayer_2) == 0x001638, "Member 'UABP_RedButterfly_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_StateResult_2) == 0x0016B8, "Member 'UABP_RedButterfly_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_SequencePlayer_1) == 0x0016E8, "Member 'UABP_RedButterfly_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_StateResult_1) == 0x001768, "Member 'UABP_RedButterfly_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_SequencePlayer) == 0x001798, "Member 'UABP_RedButterfly_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_StateResult) == 0x001818, "Member 'UABP_RedButterfly_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_StateMachine) == 0x001848, "Member 'UABP_RedButterfly_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_ApplyAdditive) == 0x0018F8, "Member 'UABP_RedButterfly_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_LinkedAnimLayer) == 0x0019C0, "Member 'UABP_RedButterfly_C::AnimGraphNode_LinkedAnimLayer' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_UseCachedPose_1) == 0x001A70, "Member 'UABP_RedButterfly_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_SaveCachedPose) == 0x001A98, "Member 'UABP_RedButterfly_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_PoseSnapshot) == 0x001BF0, "Member 'UABP_RedButterfly_C::AnimGraphNode_PoseSnapshot' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AnimGraphNode_UseCachedPose) == 0x001C80, "Member 'UABP_RedButterfly_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_RedButterfly_C, AdditivePlaying) == 0x001CA8, "Member 'UABP_RedButterfly_C::AdditivePlaying' has a wrong offset!");

}

