#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_NPC_Geppetto

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_NPC_Geppetto.ABP_NPC_Geppetto_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_NPC_Geppetto_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_NPC_Geppetto_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_NPC_Geppetto_C_AnimGraph");
static_assert(sizeof(ABP_NPC_Geppetto_C_AnimGraph) == 0x000010, "Wrong size on ABP_NPC_Geppetto_C_AnimGraph");
static_assert(offsetof(ABP_NPC_Geppetto_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_NPC_Geppetto_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_NPC_Geppetto.ABP_NPC_Geppetto_C.ExecuteUbergraph_ABP_NPC_Geppetto
// 0x0014 (0x0014 - 0x0000)
struct ABP_NPC_Geppetto_C_ExecuteUbergraph_ABP_NPC_Geppetto final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_1;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_NPC_Geppetto_C_ExecuteUbergraph_ABP_NPC_Geppetto) == 0x000004, "Wrong alignment on ABP_NPC_Geppetto_C_ExecuteUbergraph_ABP_NPC_Geppetto");
static_assert(sizeof(ABP_NPC_Geppetto_C_ExecuteUbergraph_ABP_NPC_Geppetto) == 0x000014, "Wrong size on ABP_NPC_Geppetto_C_ExecuteUbergraph_ABP_NPC_Geppetto");
static_assert(offsetof(ABP_NPC_Geppetto_C_ExecuteUbergraph_ABP_NPC_Geppetto, EntryPoint) == 0x000000, "Member 'ABP_NPC_Geppetto_C_ExecuteUbergraph_ABP_NPC_Geppetto::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Geppetto_C_ExecuteUbergraph_ABP_NPC_Geppetto, CallFunc_GetCurveValue_ReturnValue) == 0x000004, "Member 'ABP_NPC_Geppetto_C_ExecuteUbergraph_ABP_NPC_Geppetto::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Geppetto_C_ExecuteUbergraph_ABP_NPC_Geppetto, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'ABP_NPC_Geppetto_C_ExecuteUbergraph_ABP_NPC_Geppetto::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Geppetto_C_ExecuteUbergraph_ABP_NPC_Geppetto, CallFunc_GetCurveValue_ReturnValue_1) == 0x00000C, "Member 'ABP_NPC_Geppetto_C_ExecuteUbergraph_ABP_NPC_Geppetto::CallFunc_GetCurveValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Geppetto_C_ExecuteUbergraph_ABP_NPC_Geppetto, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000010, "Member 'ABP_NPC_Geppetto_C_ExecuteUbergraph_ABP_NPC_Geppetto::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");

}

