#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Judge_Boss

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "ControlRig_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "LModifyFinalPose_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Judge_Boss.ABP_Judge_Boss_C
// 0x46B0 (0x4DA0 - 0x06F0)
class UABP_Judge_Boss_C final : public ULAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0x06F8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x0850(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x0878(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0x0938(0x0158)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0A90(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x0B50(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0x0B78(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x0C40(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x0C68(0x0028)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x0C90(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x0DA8(0x0158)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0F00(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1018(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1048(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x10C8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x10F8(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x11A8(0x0158)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x1300(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x1328(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x1350(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x1438(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1468(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x14E8(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x1518(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x1600(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x1630(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x16E0(0x0158)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1838(0x00A0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x18D8(0x0118)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_1;                        // 0x19F0(0x0368)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x1D58(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x1E20(0x0158)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1F78(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x1FA8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x1FD0(0x0028)()
	struct FAnimNode_PoseSnapshot                 AnimGraphNode_PoseSnapshot;                        // 0x1FF8(0x0090)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x2088(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x20D0(0x0048)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x2118(0x00A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x21B8(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x22C0(0x0020)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x22E0(0x0270)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x2550(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x2570(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x2678(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x2698(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x26B8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x26E0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x2708(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x2730(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x2758(0x0158)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x28B0(0x08A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x3150(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x3170(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x3A10(0x08A0)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x42B0(0x0368)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x4618(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x4640(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x4668(0x0028)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x4690(0x00D0)()
	struct FLAnimNode_ModifyFinalPose             LAnimGraphNode_ModifyFinalPose;                    // 0x4760(0x00E8)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x4848(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x4868(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x4890(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x48B8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x4938(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x4968(0x0030)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x4998(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x4A60(0x0080)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x4AE0(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x4BC8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x4BF8(0x00B0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x4CA8(0x00B0)()
	bool                                          __CustomProperty_doBakeIK_42E8573042BEC4075764239CBD257696; // 0x4D58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D59[0x3];                                     // 0x4D59(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __CustomProperty_AutoLandTraceAlpha_42FA829445AFBDF94318E0A865706A1E; // 0x4D5C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_doBakeIK_42FA829445AFBDF94318E0A865706A1E; // 0x4D60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D61[0x3];                                     // 0x4D61(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PhaseIndex;                                        // 0x4D64(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKawaiiPhysicsSettings                 KP_Chain;                                          // 0x4D68(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 KP_Cable;                                          // 0x4D80(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          Is_Playing_Action;                                 // 0x4D98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_Judge_Boss(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Judge_Boss_AnimGraphNode_TransitionResult_C9E64AD741B35801FA341492EC2E5201();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Judge_Boss_AnimGraphNode_TransitionResult_AD1929A74BEF497DDA83CF8E4B329C4E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Judge_Boss_AnimGraphNode_TransitionResult_CC74E085434EECC2D034AE98E46F1CFB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Judge_Boss_AnimGraphNode_TransitionResult_933265354150CE5849F8758E804702CA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Judge_Boss_AnimGraphNode_TwoWayBlend_67662241459556F5ECF4A9A349AEA637();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Judge_Boss_AnimGraphNode_TwoWayBlend_8A632C204EE9A275A3F1D78ADF31DDD3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Judge_Boss_AnimGraphNode_ApplyMeshSpaceAdditive_E62A465E42B907066F13AAA31324FC2D();
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimLayer_Additive(const struct FPoseLink& MainStateBasePose, const struct FPoseLink& Mesh_AdditivePose, const struct FPoseLink& Local_AdditivePose, struct FPoseLink* AnimLayer_Additive_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Judge_Boss_C">();
	}
	static class UABP_Judge_Boss_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Judge_Boss_C>();
	}
};
static_assert(alignof(UABP_Judge_Boss_C) == 0x000010, "Wrong alignment on UABP_Judge_Boss_C");
static_assert(sizeof(UABP_Judge_Boss_C) == 0x004DA0, "Wrong size on UABP_Judge_Boss_C");
static_assert(offsetof(UABP_Judge_Boss_C, UberGraphFrame) == 0x0006F0, "Member 'UABP_Judge_Boss_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_SaveCachedPose_6) == 0x0006F8, "Member 'UABP_Judge_Boss_C::AnimGraphNode_SaveCachedPose_6' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_UseCachedPose_12) == 0x000850, "Member 'UABP_Judge_Boss_C::AnimGraphNode_UseCachedPose_12' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_LayeredBoneBlend_1) == 0x000878, "Member 'UABP_Judge_Boss_C::AnimGraphNode_LayeredBoneBlend_1' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_SaveCachedPose_5) == 0x000938, "Member 'UABP_Judge_Boss_C::AnimGraphNode_SaveCachedPose_5' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_LayeredBoneBlend) == 0x000A90, "Member 'UABP_Judge_Boss_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_UseCachedPose_11) == 0x000B50, "Member 'UABP_Judge_Boss_C::AnimGraphNode_UseCachedPose_11' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_TwoWayBlend_1) == 0x000B78, "Member 'UABP_Judge_Boss_C::AnimGraphNode_TwoWayBlend_1' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_UseCachedPose_10) == 0x000C40, "Member 'UABP_Judge_Boss_C::AnimGraphNode_UseCachedPose_10' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_UseCachedPose_9) == 0x000C68, "Member 'UABP_Judge_Boss_C::AnimGraphNode_UseCachedPose_9' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_LinkedInputPose_2) == 0x000C90, "Member 'UABP_Judge_Boss_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_SaveCachedPose_4) == 0x000DA8, "Member 'UABP_Judge_Boss_C::AnimGraphNode_SaveCachedPose_4' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_LinkedInputPose_1) == 0x000F00, "Member 'UABP_Judge_Boss_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_Root_1) == 0x001018, "Member 'UABP_Judge_Boss_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_SequencePlayer_3) == 0x001048, "Member 'UABP_Judge_Boss_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_StateResult_6) == 0x0010C8, "Member 'UABP_Judge_Boss_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_StateMachine_2) == 0x0010F8, "Member 'UABP_Judge_Boss_C::AnimGraphNode_StateMachine_2' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_SaveCachedPose_3) == 0x0011A8, "Member 'UABP_Judge_Boss_C::AnimGraphNode_SaveCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_TransitionResult_3) == 0x001300, "Member 'UABP_Judge_Boss_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_TransitionResult_2) == 0x001328, "Member 'UABP_Judge_Boss_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_BlendSpacePlayer_2) == 0x001350, "Member 'UABP_Judge_Boss_C::AnimGraphNode_BlendSpacePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_StateResult_5) == 0x001438, "Member 'UABP_Judge_Boss_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_SequencePlayer_2) == 0x001468, "Member 'UABP_Judge_Boss_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_StateResult_4) == 0x0014E8, "Member 'UABP_Judge_Boss_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_BlendSpacePlayer_1) == 0x001518, "Member 'UABP_Judge_Boss_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_StateResult_3) == 0x001600, "Member 'UABP_Judge_Boss_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_StateMachine_1) == 0x001630, "Member 'UABP_Judge_Boss_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_SaveCachedPose_2) == 0x0016E0, "Member 'UABP_Judge_Boss_C::AnimGraphNode_SaveCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_BlendListByBool) == 0x001838, "Member 'UABP_Judge_Boss_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_LinkedInputPose) == 0x0018D8, "Member 'UABP_Judge_Boss_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_ControlRig_1) == 0x0019F0, "Member 'UABP_Judge_Boss_C::AnimGraphNode_ControlRig_1' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_ApplyAdditive) == 0x001D58, "Member 'UABP_Judge_Boss_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_SaveCachedPose_1) == 0x001E20, "Member 'UABP_Judge_Boss_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_Root) == 0x001F78, "Member 'UABP_Judge_Boss_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_UseCachedPose_8) == 0x001FA8, "Member 'UABP_Judge_Boss_C::AnimGraphNode_UseCachedPose_8' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_UseCachedPose_7) == 0x001FD0, "Member 'UABP_Judge_Boss_C::AnimGraphNode_UseCachedPose_7' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_PoseSnapshot) == 0x001FF8, "Member 'UABP_Judge_Boss_C::AnimGraphNode_PoseSnapshot' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_Slot_1) == 0x002088, "Member 'UABP_Judge_Boss_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_Slot) == 0x0020D0, "Member 'UABP_Judge_Boss_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_BlendListByInt) == 0x002118, "Member 'UABP_Judge_Boss_C::AnimGraphNode_BlendListByInt' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_ModifyBone_1) == 0x0021B8, "Member 'UABP_Judge_Boss_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_LocalToComponentSpace_2) == 0x0022C0, "Member 'UABP_Judge_Boss_C::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_LookAt) == 0x0022E0, "Member 'UABP_Judge_Boss_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_ComponentToLocalSpace_2) == 0x002550, "Member 'UABP_Judge_Boss_C::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_ModifyBone) == 0x002570, "Member 'UABP_Judge_Boss_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_LocalToComponentSpace_1) == 0x002678, "Member 'UABP_Judge_Boss_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x002698, "Member 'UABP_Judge_Boss_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_UseCachedPose_6) == 0x0026B8, "Member 'UABP_Judge_Boss_C::AnimGraphNode_UseCachedPose_6' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_UseCachedPose_5) == 0x0026E0, "Member 'UABP_Judge_Boss_C::AnimGraphNode_UseCachedPose_5' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_UseCachedPose_4) == 0x002708, "Member 'UABP_Judge_Boss_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_UseCachedPose_3) == 0x002730, "Member 'UABP_Judge_Boss_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_SaveCachedPose) == 0x002758, "Member 'UABP_Judge_Boss_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_KawaiiPhysics_2) == 0x0028B0, "Member 'UABP_Judge_Boss_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_LocalToComponentSpace) == 0x003150, "Member 'UABP_Judge_Boss_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_KawaiiPhysics_1) == 0x003170, "Member 'UABP_Judge_Boss_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_KawaiiPhysics) == 0x003A10, "Member 'UABP_Judge_Boss_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_ControlRig) == 0x0042B0, "Member 'UABP_Judge_Boss_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_UseCachedPose_2) == 0x004618, "Member 'UABP_Judge_Boss_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_UseCachedPose_1) == 0x004640, "Member 'UABP_Judge_Boss_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_UseCachedPose) == 0x004668, "Member 'UABP_Judge_Boss_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_ApplyMeshSpaceAdditive) == 0x004690, "Member 'UABP_Judge_Boss_C::AnimGraphNode_ApplyMeshSpaceAdditive' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, LAnimGraphNode_ModifyFinalPose) == 0x004760, "Member 'UABP_Judge_Boss_C::LAnimGraphNode_ModifyFinalPose' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_ComponentToLocalSpace) == 0x004848, "Member 'UABP_Judge_Boss_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_TransitionResult_1) == 0x004868, "Member 'UABP_Judge_Boss_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_TransitionResult) == 0x004890, "Member 'UABP_Judge_Boss_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_SequencePlayer_1) == 0x0048B8, "Member 'UABP_Judge_Boss_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_StateResult_2) == 0x004938, "Member 'UABP_Judge_Boss_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_StateResult_1) == 0x004968, "Member 'UABP_Judge_Boss_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_TwoWayBlend) == 0x004998, "Member 'UABP_Judge_Boss_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_SequencePlayer) == 0x004A60, "Member 'UABP_Judge_Boss_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_BlendSpacePlayer) == 0x004AE0, "Member 'UABP_Judge_Boss_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_StateResult) == 0x004BC8, "Member 'UABP_Judge_Boss_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_StateMachine) == 0x004BF8, "Member 'UABP_Judge_Boss_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, AnimGraphNode_LinkedAnimLayer) == 0x004CA8, "Member 'UABP_Judge_Boss_C::AnimGraphNode_LinkedAnimLayer' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, __CustomProperty_doBakeIK_42E8573042BEC4075764239CBD257696) == 0x004D58, "Member 'UABP_Judge_Boss_C::__CustomProperty_doBakeIK_42E8573042BEC4075764239CBD257696' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, __CustomProperty_AutoLandTraceAlpha_42FA829445AFBDF94318E0A865706A1E) == 0x004D5C, "Member 'UABP_Judge_Boss_C::__CustomProperty_AutoLandTraceAlpha_42FA829445AFBDF94318E0A865706A1E' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, __CustomProperty_doBakeIK_42FA829445AFBDF94318E0A865706A1E) == 0x004D60, "Member 'UABP_Judge_Boss_C::__CustomProperty_doBakeIK_42FA829445AFBDF94318E0A865706A1E' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, PhaseIndex) == 0x004D64, "Member 'UABP_Judge_Boss_C::PhaseIndex' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, KP_Chain) == 0x004D68, "Member 'UABP_Judge_Boss_C::KP_Chain' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, KP_Cable) == 0x004D80, "Member 'UABP_Judge_Boss_C::KP_Cable' has a wrong offset!");
static_assert(offsetof(UABP_Judge_Boss_C, Is_Playing_Action) == 0x004D98, "Member 'UABP_Judge_Boss_C::Is_Playing_Action' has a wrong offset!");

}

