#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Watchdog

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Watchdog.ABP_Watchdog_C.AnimLayer_Additive
// 0x0030 (0x0030 - 0x0000)
struct ABP_Watchdog_C_AnimLayer_Additive final
{
public:
	struct FPoseLink                              MainStateBasePose;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AdditivePose;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimLayer_Additive_0;                              // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Watchdog_C_AnimLayer_Additive) == 0x000008, "Wrong alignment on ABP_Watchdog_C_AnimLayer_Additive");
static_assert(sizeof(ABP_Watchdog_C_AnimLayer_Additive) == 0x000030, "Wrong size on ABP_Watchdog_C_AnimLayer_Additive");
static_assert(offsetof(ABP_Watchdog_C_AnimLayer_Additive, MainStateBasePose) == 0x000000, "Member 'ABP_Watchdog_C_AnimLayer_Additive::MainStateBasePose' has a wrong offset!");
static_assert(offsetof(ABP_Watchdog_C_AnimLayer_Additive, AdditivePose) == 0x000010, "Member 'ABP_Watchdog_C_AnimLayer_Additive::AdditivePose' has a wrong offset!");
static_assert(offsetof(ABP_Watchdog_C_AnimLayer_Additive, AnimLayer_Additive_0) == 0x000020, "Member 'ABP_Watchdog_C_AnimLayer_Additive::AnimLayer_Additive_0' has a wrong offset!");

// Function ABP_Watchdog.ABP_Watchdog_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Watchdog_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Watchdog_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Watchdog_C_AnimGraph");
static_assert(sizeof(ABP_Watchdog_C_AnimGraph) == 0x000010, "Wrong size on ABP_Watchdog_C_AnimGraph");
static_assert(offsetof(ABP_Watchdog_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_Watchdog_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_Watchdog.ABP_Watchdog_C.ExecuteUbergraph_ABP_Watchdog
// 0x000C (0x000C - 0x0000)
struct ABP_Watchdog_C_ExecuteUbergraph_ABP_Watchdog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_Watchdog_C_ExecuteUbergraph_ABP_Watchdog) == 0x000004, "Wrong alignment on ABP_Watchdog_C_ExecuteUbergraph_ABP_Watchdog");
static_assert(sizeof(ABP_Watchdog_C_ExecuteUbergraph_ABP_Watchdog) == 0x00000C, "Wrong size on ABP_Watchdog_C_ExecuteUbergraph_ABP_Watchdog");
static_assert(offsetof(ABP_Watchdog_C_ExecuteUbergraph_ABP_Watchdog, EntryPoint) == 0x000000, "Member 'ABP_Watchdog_C_ExecuteUbergraph_ABP_Watchdog::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_Watchdog_C_ExecuteUbergraph_ABP_Watchdog, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000004, "Member 'ABP_Watchdog_C_ExecuteUbergraph_ABP_Watchdog::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Watchdog_C_ExecuteUbergraph_ABP_Watchdog, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'ABP_Watchdog_C_ExecuteUbergraph_ABP_Watchdog::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Watchdog_C_ExecuteUbergraph_ABP_Watchdog, CallFunc_Not_PreBool_ReturnValue) == 0x000006, "Member 'ABP_Watchdog_C_ExecuteUbergraph_ABP_Watchdog::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_Watchdog_C_ExecuteUbergraph_ABP_Watchdog, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000007, "Member 'ABP_Watchdog_C_ExecuteUbergraph_ABP_Watchdog::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Watchdog_C_ExecuteUbergraph_ABP_Watchdog, CallFunc_BooleanAND_ReturnValue_1) == 0x000008, "Member 'ABP_Watchdog_C_ExecuteUbergraph_ABP_Watchdog::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_Watchdog_C_ExecuteUbergraph_ABP_Watchdog, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000009, "Member 'ABP_Watchdog_C_ExecuteUbergraph_ABP_Watchdog::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

}

