#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AMB_OS_Cathedral_Insect_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AMB_OS_Cathedral_Insect_BP.AMB_OS_Cathedral_Insect_BP_C.ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP
// 0x0178 (0x0178 - 0x0000)
struct AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USplineComponent*>               CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue_1;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x004C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x00D4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineComponent*                       CallFunc_Array_Get_Item_1;                         // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP) == 0x000008, "Wrong alignment on AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP");
static_assert(sizeof(AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP) == 0x000178, "Wrong size on AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP");
static_assert(offsetof(AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP, EntryPoint) == 0x000000, "Member 'AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP, Temp_int_Array_Index_Variable) == 0x000004, "Member 'AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP, Temp_bool_IsClosed_Variable) == 0x000008, "Member 'AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP, Temp_bool_Has_Been_Initd_Variable) == 0x000009, "Member 'AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000010, "Member 'AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP, CallFunc_GetSplineLength_ReturnValue) == 0x000020, "Member 'AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000024, "Member 'AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP, CallFunc_RandomInteger_ReturnValue) == 0x00002C, "Member 'AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP, CallFunc_Array_Get_Item) == 0x000030, "Member 'AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP, CallFunc_GetSplineLength_ReturnValue_1) == 0x000038, "Member 'AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP::CallFunc_GetSplineLength_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00003C, "Member 'AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x000040, "Member 'AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x00004C, "Member 'AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x0000D4, "Member 'AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP, Temp_int_Loop_Counter_Variable) == 0x00015C, "Member 'AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP, CallFunc_Add_IntInt_ReturnValue) == 0x000160, "Member 'AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP, CallFunc_Array_Get_Item_1) == 0x000168, "Member 'AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP, CallFunc_Array_Length_ReturnValue_1) == 0x000170, "Member 'AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP, CallFunc_Less_IntInt_ReturnValue) == 0x000174, "Member 'AMB_OS_Cathedral_Insect_BP_C_ExecuteUbergraph_AMB_OS_Cathedral_Insect_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

