#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AMB_OS_NewTown_Rat_TR_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AMB_OS_NewTown_Rat_TR_BP.AMB_OS_NewTown_Rat_TR_BP_C.ExecuteUbergraph_AMB_OS_NewTown_Rat_TR_BP
// 0x00B0 (0x00B0 - 0x0000)
struct AMB_OS_NewTown_Rat_TR_BP_C_ExecuteUbergraph_AMB_OS_NewTown_Rat_TR_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0028(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(AMB_OS_NewTown_Rat_TR_BP_C_ExecuteUbergraph_AMB_OS_NewTown_Rat_TR_BP) == 0x000008, "Wrong alignment on AMB_OS_NewTown_Rat_TR_BP_C_ExecuteUbergraph_AMB_OS_NewTown_Rat_TR_BP");
static_assert(sizeof(AMB_OS_NewTown_Rat_TR_BP_C_ExecuteUbergraph_AMB_OS_NewTown_Rat_TR_BP) == 0x0000B0, "Wrong size on AMB_OS_NewTown_Rat_TR_BP_C_ExecuteUbergraph_AMB_OS_NewTown_Rat_TR_BP");
static_assert(offsetof(AMB_OS_NewTown_Rat_TR_BP_C_ExecuteUbergraph_AMB_OS_NewTown_Rat_TR_BP, EntryPoint) == 0x000000, "Member 'AMB_OS_NewTown_Rat_TR_BP_C_ExecuteUbergraph_AMB_OS_NewTown_Rat_TR_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(AMB_OS_NewTown_Rat_TR_BP_C_ExecuteUbergraph_AMB_OS_NewTown_Rat_TR_BP, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000008, "Member 'AMB_OS_NewTown_Rat_TR_BP_C_ExecuteUbergraph_AMB_OS_NewTown_Rat_TR_BP::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(AMB_OS_NewTown_Rat_TR_BP_C_ExecuteUbergraph_AMB_OS_NewTown_Rat_TR_BP, K2Node_ComponentBoundEvent_OtherActor) == 0x000010, "Member 'AMB_OS_NewTown_Rat_TR_BP_C_ExecuteUbergraph_AMB_OS_NewTown_Rat_TR_BP::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(AMB_OS_NewTown_Rat_TR_BP_C_ExecuteUbergraph_AMB_OS_NewTown_Rat_TR_BP, K2Node_ComponentBoundEvent_OtherComp) == 0x000018, "Member 'AMB_OS_NewTown_Rat_TR_BP_C_ExecuteUbergraph_AMB_OS_NewTown_Rat_TR_BP::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(AMB_OS_NewTown_Rat_TR_BP_C_ExecuteUbergraph_AMB_OS_NewTown_Rat_TR_BP, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000020, "Member 'AMB_OS_NewTown_Rat_TR_BP_C_ExecuteUbergraph_AMB_OS_NewTown_Rat_TR_BP::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(AMB_OS_NewTown_Rat_TR_BP_C_ExecuteUbergraph_AMB_OS_NewTown_Rat_TR_BP, K2Node_ComponentBoundEvent_bFromSweep) == 0x000024, "Member 'AMB_OS_NewTown_Rat_TR_BP_C_ExecuteUbergraph_AMB_OS_NewTown_Rat_TR_BP::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(AMB_OS_NewTown_Rat_TR_BP_C_ExecuteUbergraph_AMB_OS_NewTown_Rat_TR_BP, K2Node_ComponentBoundEvent_SweepResult) == 0x000028, "Member 'AMB_OS_NewTown_Rat_TR_BP_C_ExecuteUbergraph_AMB_OS_NewTown_Rat_TR_BP::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");

// Function AMB_OS_NewTown_Rat_TR_BP.AMB_OS_NewTown_Rat_TR_BP_C.BndEvt__AMB_OS_OldTown_Castle_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct AMB_OS_NewTown_Rat_TR_BP_C_BndEvt__AMB_OS_OldTown_Castle_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(AMB_OS_NewTown_Rat_TR_BP_C_BndEvt__AMB_OS_OldTown_Castle_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on AMB_OS_NewTown_Rat_TR_BP_C_BndEvt__AMB_OS_OldTown_Castle_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(AMB_OS_NewTown_Rat_TR_BP_C_BndEvt__AMB_OS_OldTown_Castle_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on AMB_OS_NewTown_Rat_TR_BP_C_BndEvt__AMB_OS_OldTown_Castle_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(AMB_OS_NewTown_Rat_TR_BP_C_BndEvt__AMB_OS_OldTown_Castle_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'AMB_OS_NewTown_Rat_TR_BP_C_BndEvt__AMB_OS_OldTown_Castle_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(AMB_OS_NewTown_Rat_TR_BP_C_BndEvt__AMB_OS_OldTown_Castle_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'AMB_OS_NewTown_Rat_TR_BP_C_BndEvt__AMB_OS_OldTown_Castle_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(AMB_OS_NewTown_Rat_TR_BP_C_BndEvt__AMB_OS_OldTown_Castle_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'AMB_OS_NewTown_Rat_TR_BP_C_BndEvt__AMB_OS_OldTown_Castle_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(AMB_OS_NewTown_Rat_TR_BP_C_BndEvt__AMB_OS_OldTown_Castle_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'AMB_OS_NewTown_Rat_TR_BP_C_BndEvt__AMB_OS_OldTown_Castle_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(AMB_OS_NewTown_Rat_TR_BP_C_BndEvt__AMB_OS_OldTown_Castle_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'AMB_OS_NewTown_Rat_TR_BP_C_BndEvt__AMB_OS_OldTown_Castle_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(AMB_OS_NewTown_Rat_TR_BP_C_BndEvt__AMB_OS_OldTown_Castle_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'AMB_OS_NewTown_Rat_TR_BP_C_BndEvt__AMB_OS_OldTown_Castle_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

}

