#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BDeco_CheckNPCInfo

#include "Basic.hpp"

#include "ProjectP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BDeco_CheckNPCInfo.BDeco_CheckNPCInfo_C
// 0x0018 (0x00C0 - 0x00A8)
class UBDeco_CheckNPCInfo_C final : public ULBDecorator_BlueprintBase
{
public:
	TArray<class FName>                           CodeName;                                          // 0x00A8(0x0010)(Edit, BlueprintVisible)
	bool                                          CheckNpcCodeName;                                  // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CheckNpcAssetCodeName;                             // 0x00B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CheckNpcActionGroupCodeName;                       // 0x00BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	bool PerformConditionCheckAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BDeco_CheckNPCInfo_C">();
	}
	static class UBDeco_CheckNPCInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBDeco_CheckNPCInfo_C>();
	}
};
static_assert(alignof(UBDeco_CheckNPCInfo_C) == 0x000008, "Wrong alignment on UBDeco_CheckNPCInfo_C");
static_assert(sizeof(UBDeco_CheckNPCInfo_C) == 0x0000C0, "Wrong size on UBDeco_CheckNPCInfo_C");
static_assert(offsetof(UBDeco_CheckNPCInfo_C, CodeName) == 0x0000A8, "Member 'UBDeco_CheckNPCInfo_C::CodeName' has a wrong offset!");
static_assert(offsetof(UBDeco_CheckNPCInfo_C, CheckNpcCodeName) == 0x0000B8, "Member 'UBDeco_CheckNPCInfo_C::CheckNpcCodeName' has a wrong offset!");
static_assert(offsetof(UBDeco_CheckNPCInfo_C, CheckNpcAssetCodeName) == 0x0000B9, "Member 'UBDeco_CheckNPCInfo_C::CheckNpcAssetCodeName' has a wrong offset!");
static_assert(offsetof(UBDeco_CheckNPCInfo_C, CheckNpcActionGroupCodeName) == 0x0000BA, "Member 'UBDeco_CheckNPCInfo_C::CheckNpcActionGroupCodeName' has a wrong offset!");

}

