#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BDeco_InHomeLocation

#include "Basic.hpp"

#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BDeco_InHomeLocation.BDeco_InHomeLocation_C.PerformConditionCheckAI
// 0x0048 (0x0048 - 0x0000)
struct BDeco_InHomeLocation_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLAIMovementGoal                       CallFunc_GoalAsType_ReturnValue;                   // 0x0014(0x002C)(NoDestructor)
	bool                                          CallFunc_HasMoveGoalReached_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BDeco_InHomeLocation_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BDeco_InHomeLocation_C_PerformConditionCheckAI");
static_assert(sizeof(BDeco_InHomeLocation_C_PerformConditionCheckAI) == 0x000048, "Wrong size on BDeco_InHomeLocation_C_PerformConditionCheckAI");
static_assert(offsetof(BDeco_InHomeLocation_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BDeco_InHomeLocation_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BDeco_InHomeLocation_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BDeco_InHomeLocation_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BDeco_InHomeLocation_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BDeco_InHomeLocation_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(BDeco_InHomeLocation_C_PerformConditionCheckAI, CallFunc_GoalAsType_ReturnValue) == 0x000014, "Member 'BDeco_InHomeLocation_C_PerformConditionCheckAI::CallFunc_GoalAsType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BDeco_InHomeLocation_C_PerformConditionCheckAI, CallFunc_HasMoveGoalReached_ReturnValue) == 0x000040, "Member 'BDeco_InHomeLocation_C_PerformConditionCheckAI::CallFunc_HasMoveGoalReached_ReturnValue' has a wrong offset!");

}

