#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BDeco_CanReachTarget

#include "Basic.hpp"


namespace SDK::Params
{

// Function BDeco_CanReachTarget.BDeco_CanReachTarget_C.PerformConditionCheckAI
// 0x0018 (0x0018 - 0x0000)
struct BDeco_CanReachTarget_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanReachTarget_ReturnValue;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BDeco_CanReachTarget_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BDeco_CanReachTarget_C_PerformConditionCheckAI");
static_assert(sizeof(BDeco_CanReachTarget_C_PerformConditionCheckAI) == 0x000018, "Wrong size on BDeco_CanReachTarget_C_PerformConditionCheckAI");
static_assert(offsetof(BDeco_CanReachTarget_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BDeco_CanReachTarget_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BDeco_CanReachTarget_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BDeco_CanReachTarget_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BDeco_CanReachTarget_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BDeco_CanReachTarget_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(BDeco_CanReachTarget_C_PerformConditionCheckAI, CallFunc_CanReachTarget_ReturnValue) == 0x000011, "Member 'BDeco_CanReachTarget_C_PerformConditionCheckAI::CallFunc_CanReachTarget_ReturnValue' has a wrong offset!");

}

