#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BDeco_CheckUsedSkillCodeName

#include "Basic.hpp"


namespace SDK::Params
{

// Function BDeco_CheckUsedSkillCodeName.BDeco_CheckUsedSkillCodeName_C.PerformConditionCheckAI
// 0x0050 (0x0050 - 0x0000)
struct BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetLastUsedSkillCodeName_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetLastUsedSkillCodeName_ReturnValue_1;   // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI");
static_assert(sizeof(BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI) == 0x000050, "Wrong size on BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI");
static_assert(offsetof(BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI, CallFunc_Array_Get_Item) == 0x000020, "Member 'BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI, CallFunc_GetLastUsedSkillCodeName_ReturnValue) == 0x000030, "Member 'BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI::CallFunc_GetLastUsedSkillCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000038, "Member 'BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI, CallFunc_GetLastUsedSkillCodeName_ReturnValue_1) == 0x00003C, "Member 'BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI::CallFunc_GetLastUsedSkillCodeName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI, CallFunc_Array_Length_ReturnValue_1) == 0x000044, "Member 'BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000048, "Member 'BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI, CallFunc_Greater_IntInt_ReturnValue) == 0x000049, "Member 'BDeco_CheckUsedSkillCodeName_C_PerformConditionCheckAI::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

