#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BDeco_CheckSight

#include "Basic.hpp"

#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BDeco_CheckSight.BDeco_CheckSight_C.PerformConditionCheckAI
// 0x0048 (0x0048 - 0x0000)
struct BDeco_CheckSight_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLAIObjective                          CallFunc_ObjectiveAsType_ReturnValue;              // 0x0014(0x0024)(NoDestructor)
	class AActor*                                 CallFunc_ObjectiveGetActor_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Sight_Check_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BDeco_CheckSight_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on BDeco_CheckSight_C_PerformConditionCheckAI");
static_assert(sizeof(BDeco_CheckSight_C_PerformConditionCheckAI) == 0x000048, "Wrong size on BDeco_CheckSight_C_PerformConditionCheckAI");
static_assert(offsetof(BDeco_CheckSight_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'BDeco_CheckSight_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BDeco_CheckSight_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'BDeco_CheckSight_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BDeco_CheckSight_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'BDeco_CheckSight_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(BDeco_CheckSight_C_PerformConditionCheckAI, CallFunc_ObjectiveAsType_ReturnValue) == 0x000014, "Member 'BDeco_CheckSight_C_PerformConditionCheckAI::CallFunc_ObjectiveAsType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BDeco_CheckSight_C_PerformConditionCheckAI, CallFunc_ObjectiveGetActor_ReturnValue) == 0x000038, "Member 'BDeco_CheckSight_C_PerformConditionCheckAI::CallFunc_ObjectiveGetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BDeco_CheckSight_C_PerformConditionCheckAI, CallFunc_Sight_Check_ReturnValue) == 0x000040, "Member 'BDeco_CheckSight_C_PerformConditionCheckAI::CallFunc_Sight_Check_ReturnValue' has a wrong offset!");

}

