#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Jump

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_Jump.BP_Action_Jump_C.ExecuteUbergraph_BP_Action_Jump
// 0x04B8 (0x04B8 - 0x0000)
struct BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetActionTime_Start_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable;                              // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Up_ReturnValue;                    // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Up_ReturnValue_1;                  // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetActionTime_Start_ReturnValue_1;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindActionState_ReturnValue;              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter_1;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindActionState_ReturnValue_1;            // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindActionState_ReturnValue_2;            // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindActionState_ReturnValue_3;            // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter_2;                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable_1;                            // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindActionState_ReturnValue_4;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindActionState_ReturnValue_5;            // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_TryLockInput_Movement_ReturnValue; // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_TryLockInput_Rotation_ReturnValue; // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALCharacter*                            K2Node_CustomEvent_Instigator;                     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter_3;                 // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter_4;                 // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetTickable_ReturnValue;                  // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetCurrMontageInstanceID_AnimInstance;    // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_GetCurrMontageInstanceID_Branches;        // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrMontageInstanceID_ReturnValue;     // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_GetActionFromTable_ReturnValue;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_Event_Montage_1;                            // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted_1;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MontageInstanceID_1;                  // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Event_Montage;                              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted;                         // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MontageInstanceID;                    // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionStopReason_UnexpectedBehaviour_ReturnValue; // 0x019C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_1;         // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter_5;                 // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ProcessAction_ReturnValue;                // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FA[0x2];                                      // 0x01FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ProjectVectorOnToPlane_ReturnValue;       // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x022C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue_1;                // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ALCharacter* Instigator)> K2Node_CreateDelegate_OutputDelegate;              // 0x0268(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRealTimeSeconds_ReturnValue_1;         // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULCharacterMovementComponent*           K2Node_DynamicCast_AsLCharacter_Movement_Component; // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScaledCapsuleRadius_ReturnValue;       // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCollisionProfileName_ReturnValue;      // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_WithoutHemisphere_ReturnValue; // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x02BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULCharacterMovementComponent*           K2Node_DynamicCast_AsLCharacter_Movement_Component_1; // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue; // 0x02D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue_1;                       // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetActionTime_Start_ReturnValue_2;        // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter_6;                 // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindActionState_ReturnValue_6;            // 0x02F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Stop_ReturnValue_2;                       // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_Ignore_FallingLateralFriction_ReturnValue; // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayCommomAnimBP_MontageInstanceID;       // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PlayCommomAnimBP_Montage;                 // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayCommomAnimBP_Branches;                // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_312[0x2];                                      // 0x0312(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayCommomAnimBP_MontageInstanceID_1;     // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_PlayCommomAnimBP_Montage_1;               // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayCommomAnimBP_Branches_1;              // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayCommomAnimBP_MontageInstanceID_2;     // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_PlayCommomAnimBP_Montage_2;               // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayCommomAnimBP_Branches_2;              // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0332(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_333[0x1];                                      // 0x0333(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayCommomAnimBP_MontageInstanceID_3;     // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_PlayCommomAnimBP_Montage_3;               // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayCommomAnimBP_Branches_3;              // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayCommomAnimBP_MontageInstanceID_4;     // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_PlayCommomAnimBP_Montage_4;               // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayCommomAnimBP_Branches_4;              // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x0352(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_353[0x1];                                      // 0x0353(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayCommomAnimBP_MontageInstanceID_5;     // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_PlayCommomAnimBP_Montage_5;               // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayCommomAnimBP_Branches_5;              // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0368(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess_6;                    // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379[0x3];                                      // 0x0379(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_SphereTraceSingleByProfile_OutHit;        // 0x037C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleByProfile_ReturnValue;   // 0x0404(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_405[0x3];                                      // 0x0405(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRealTimeSeconds_ReturnValue_2;         // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x040C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x040D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40E[0x2];                                      // 0x040E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0414(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0418(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0424(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0430(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x043C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0458(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0474(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0480(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0494(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_495[0x3];                                      // 0x0495(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_DegAcos_ReturnValue;                      // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x049C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x04A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x04AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump) == 0x000008, "Wrong alignment on BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump");
static_assert(sizeof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump) == 0x0004B8, "Wrong size on BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, EntryPoint) == 0x000000, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_GetActionTime_Start_ReturnValue) == 0x000004, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_GetActionTime_Start_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, Temp_struct_Variable) == 0x000008, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_Vector_Up_ReturnValue) == 0x000014, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_Vector_Up_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_Vector_Up_ReturnValue_1) == 0x000020, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_Vector_Up_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, Temp_bool_Has_Been_Initd_Variable) == 0x00002C, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x000030, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_GetActionTime_Start_ReturnValue_1) == 0x000034, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_GetActionTime_Start_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000038, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00003C, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_DynamicCast_AsLCharacter) == 0x000040, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_DynamicCast_AsLCharacter' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_FindActionState_ReturnValue) == 0x000049, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_FindActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_DynamicCast_AsLCharacter_1) == 0x000050, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_DynamicCast_AsLCharacter_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_FindActionState_ReturnValue_1) == 0x000059, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_FindActionState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_FindActionState_ReturnValue_2) == 0x00005A, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_FindActionState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_FindActionState_ReturnValue_3) == 0x00005B, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_FindActionState_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_DynamicCast_AsLCharacter_2) == 0x000060, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_DynamicCast_AsLCharacter_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_DynamicCast_bSuccess_2) == 0x000068, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, Temp_struct_Variable_1) == 0x00006C, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_FindActionState_ReturnValue_4) == 0x000078, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_FindActionState_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_FindActionState_ReturnValue_5) == 0x000079, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_FindActionState_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_Event_ReasonAction) == 0x000080, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_Event_Reason) == 0x000088, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_Event_DeltaTime) == 0x000090, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_ActionState_TryLockInput_Movement_ReturnValue) == 0x000094, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_ActionState_TryLockInput_Movement_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_ActionState_TryLockInput_Rotation_ReturnValue) == 0x00009C, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_ActionState_TryLockInput_Rotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_CustomEvent_Instigator) == 0x0000A8, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_CustomEvent_Instigator' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_DynamicCast_AsLCharacter_3) == 0x0000B0, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_DynamicCast_AsLCharacter_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_DynamicCast_bSuccess_3) == 0x0000B8, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_DynamicCast_AsLCharacter_4) == 0x0000C0, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_DynamicCast_AsLCharacter_4' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_DynamicCast_bSuccess_4) == 0x0000C8, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_SetTickable_ReturnValue) == 0x0000C9, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_SetTickable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, Temp_bool_IsClosed_Variable) == 0x0000CA, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_IsValid_ReturnValue) == 0x0000CB, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000CC, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_BreakVector_X) == 0x0000D8, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_BreakVector_Y) == 0x0000DC, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_BreakVector_Z) == 0x0000E0, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000E4, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_GetCurrMontageInstanceID_AnimInstance) == 0x0000F0, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_GetCurrMontageInstanceID_AnimInstance' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_GetCurrMontageInstanceID_Branches) == 0x0000F8, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_GetCurrMontageInstanceID_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_GetCurrMontageInstanceID_ReturnValue) == 0x0000FC, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_GetCurrMontageInstanceID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_BreakVector_X_1) == 0x000100, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_BreakVector_Y_1) == 0x000104, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_BreakVector_Z_1) == 0x000108, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_SwitchEnum_CmpSuccess) == 0x00010C, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_Add_FloatFloat_ReturnValue) == 0x000110, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000114, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_GetActionFromTable_ReturnValue) == 0x000118, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_GetActionFromTable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_Event_Montage_1) == 0x000120, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_Event_Montage_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_Event_bInterrupted_1) == 0x000128, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_Event_bInterrupted_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_Event_MontageInstanceID_1) == 0x00012C, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_Event_MontageInstanceID_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_IsPlaying_ReturnValue) == 0x000130, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_Event_Montage) == 0x000138, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_Event_Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_Event_bInterrupted) == 0x000140, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_Event_bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_Event_MontageInstanceID) == 0x000144, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_Event_MontageInstanceID' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_GetVelocity_ReturnValue) == 0x000148, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_BreakVector_X_2) == 0x000154, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_BreakVector_Y_2) == 0x000158, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_BreakVector_Z_2) == 0x00015C, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_Conv_VectorToString_ReturnValue) == 0x000160, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_Conv_VectorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_Conv_FloatToString_ReturnValue) == 0x000170, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_Concat_StrStr_ReturnValue) == 0x000180, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_MakeVector_ReturnValue) == 0x000190, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_ActionStopReason_UnexpectedBehaviour_ReturnValue) == 0x00019C, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_ActionStopReason_UnexpectedBehaviour_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_VSize_ReturnValue) == 0x0001A4, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_Stop_ReturnValue) == 0x0001A8, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_Conv_FloatToString_ReturnValue_1) == 0x0001B0, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_Conv_FloatToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0001C0, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0001D0, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0001E0, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_DynamicCast_AsLCharacter_5) == 0x0001F0, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_DynamicCast_AsLCharacter_5' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_DynamicCast_bSuccess_5) == 0x0001F8, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_ProcessAction_ReturnValue) == 0x0001F9, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_ProcessAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_GetActorForwardVector_ReturnValue) == 0x0001FC, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_ProjectVectorOnToPlane_ReturnValue) == 0x000208, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_ProjectVectorOnToPlane_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000214, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_Normal_ReturnValue) == 0x000220, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x00022C, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_GetVelocity_ReturnValue_1) == 0x000238, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_GetVelocity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_Add_VectorVector_ReturnValue) == 0x000244, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_BreakVector_X_3) == 0x000250, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_BreakVector_Y_3) == 0x000254, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_BreakVector_Z_3) == 0x000258, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x00025C, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_CreateDelegate_OutputDelegate) == 0x000268, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000278, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_GetRealTimeSeconds_ReturnValue_1) == 0x000284, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_GetRealTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_DynamicCast_AsLCharacter_Movement_Component) == 0x000288, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_DynamicCast_AsLCharacter_Movement_Component' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_DynamicCast_bSuccess_6) == 0x000290, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_GetScaledCapsuleRadius_ReturnValue) == 0x000294, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_GetScaledCapsuleRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_GetCollisionProfileName_ReturnValue) == 0x000298, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_GetCollisionProfileName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_GetScaledCapsuleHalfHeight_WithoutHemisphere_ReturnValue) == 0x0002A0, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_GetScaledCapsuleHalfHeight_WithoutHemisphere_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0002A4, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_MakeVector_ReturnValue_1) == 0x0002B0, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0002BC, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_DynamicCast_AsLCharacter_Movement_Component_1) == 0x0002C8, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_DynamicCast_AsLCharacter_Movement_Component_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_DynamicCast_bSuccess_7) == 0x0002D0, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue) == 0x0002D4, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_Stop_ReturnValue_1) == 0x0002DC, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_Stop_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_GetActionTime_Start_ReturnValue_2) == 0x0002E0, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_GetActionTime_Start_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0002E4, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump, K2Node_DynamicCast_AsLCharacter_6) == 0x0002E8, "Member 'BP_Action_Jump_C_ExecuteUbergraph_BP_Action_Jump::K2Node_DynamicCast_AsLCharacter_6' has a wrong offset!");
