#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_HoldThrow

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_HoldThrow.BP_Action_HoldThrow_C.ExecuteUbergraph_BP_Action_HoldThrow
// 0x00F0 (0x00F0 - 0x0000)
struct BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ConsumeSlaveMagazinePoint_ReturnValue;    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Event_Montage;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MontageInstanceID;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayTargetAnim_ReturnValue;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_1;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BindOnCurrMontageEnded_ReturnValue;       // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Stop_ReturnValue_1;                       // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLUseItemSlot                          CallFunc_GetChosenUseItem_ReturnValue;             // 0x0068(0x0014)(NoDestructor)
	bool                                          CallFunc_SetAxisValueUpperLimit_ReturnValue;       // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetAxisValueUpperLimit_ReturnValue_1;     // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActMgrComponent*                      K2Node_CustomEvent_ActMgrComponent;                // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_TargetActor;                    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Command;                        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Lever;                          // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SkipCommandPrerequisitiesCheck; // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInst_ReturnValue;                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetMontage_NextSection_ReturnValue;       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetReadyToUseItem_OutUseCount;            // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 CallFunc_GetReadyToUseItem_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCodeName_ReturnValue;                  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlaySkillActionBP_Branches;               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_PlaySkillActionBP_ReturnValue;            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ULActMgrComponent* ActMgrComponent, class AActor* TargetActor, class FName Command, const struct FVector& Lever, bool SkipCommandPrerequisitiesCheck)> K2Node_CreateDelegate_OutputDelegate;              // 0x00DC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EquipUseItem_SpecifiedLine_ReturnValue;   // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow) == 0x000008, "Wrong alignment on BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow");
static_assert(sizeof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow) == 0x0000F0, "Wrong size on BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, EntryPoint) == 0x000000, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, K2Node_DynamicCast_AsLPCCharacter) == 0x000008, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::K2Node_DynamicCast_AsLPCCharacter' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, CallFunc_ConsumeSlaveMagazinePoint_ReturnValue) == 0x000011, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::CallFunc_ConsumeSlaveMagazinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, K2Node_Event_Montage) == 0x000018, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::K2Node_Event_Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, K2Node_Event_bInterrupted) == 0x000020, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::K2Node_Event_bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, K2Node_Event_MontageInstanceID) == 0x000024, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::K2Node_Event_MontageInstanceID' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, CallFunc_Stop_ReturnValue) == 0x000028, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, CallFunc_PlayTargetAnim_ReturnValue) == 0x00002C, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::CallFunc_PlayTargetAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, K2Node_DynamicCast_AsLPCCharacter_1) == 0x000030, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::K2Node_DynamicCast_AsLPCCharacter_1' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, CallFunc_BindOnCurrMontageEnded_ReturnValue) == 0x000039, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::CallFunc_BindOnCurrMontageEnded_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, CallFunc_Stop_ReturnValue_1) == 0x00003A, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::CallFunc_Stop_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, K2Node_Event_ReasonAction) == 0x000040, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, K2Node_Event_Reason) == 0x000048, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000050, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000058, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, CallFunc_GetPlayerEquipment_ReturnValue) == 0x000060, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::CallFunc_GetPlayerEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, CallFunc_GetChosenUseItem_ReturnValue) == 0x000068, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::CallFunc_GetChosenUseItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, CallFunc_SetAxisValueUpperLimit_ReturnValue) == 0x00007C, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::CallFunc_SetAxisValueUpperLimit_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, CallFunc_SetAxisValueUpperLimit_ReturnValue_1) == 0x00007D, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::CallFunc_SetAxisValueUpperLimit_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, K2Node_CustomEvent_ActMgrComponent) == 0x000080, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::K2Node_CustomEvent_ActMgrComponent' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, K2Node_CustomEvent_TargetActor) == 0x000088, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::K2Node_CustomEvent_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, K2Node_CustomEvent_Command) == 0x000090, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::K2Node_CustomEvent_Command' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, K2Node_CustomEvent_Lever) == 0x000098, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::K2Node_CustomEvent_Lever' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, K2Node_CustomEvent_SkipCommandPrerequisitiesCheck) == 0x0000A4, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::K2Node_CustomEvent_SkipCommandPrerequisitiesCheck' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, K2Node_SwitchName_CmpSuccess) == 0x0000A5, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, CallFunc_GetAnimInst_ReturnValue) == 0x0000A8, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::CallFunc_GetAnimInst_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, CallFunc_SetMontage_NextSection_ReturnValue) == 0x0000B0, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::CallFunc_SetMontage_NextSection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, CallFunc_GetReadyToUseItem_OutUseCount) == 0x0000B4, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::CallFunc_GetReadyToUseItem_OutUseCount' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, CallFunc_GetReadyToUseItem_ReturnValue) == 0x0000B8, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::CallFunc_GetReadyToUseItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, CallFunc_GetCodeName_ReturnValue) == 0x0000C0, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::CallFunc_GetCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, CallFunc_PlaySkillActionBP_Branches) == 0x0000C8, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::CallFunc_PlaySkillActionBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, CallFunc_PlaySkillActionBP_ReturnValue) == 0x0000D0, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::CallFunc_PlaySkillActionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000D8, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, K2Node_SwitchEnum_CmpSuccess) == 0x0000D9, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, K2Node_CreateDelegate_OutputDelegate) == 0x0000DC, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, CallFunc_IsValid_ReturnValue) == 0x0000EC, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow, CallFunc_EquipUseItem_SpecifiedLine_ReturnValue) == 0x0000ED, "Member 'BP_Action_HoldThrow_C_ExecuteUbergraph_BP_Action_HoldThrow::CallFunc_EquipUseItem_SpecifiedLine_ReturnValue' has a wrong offset!");

// Function BP_Action_HoldThrow.BP_Action_HoldThrow_C.ä¤@t¤¸_0
// 0x0028 (0x0028 - 0x0000)
struct BP_Action_HoldThrow_C____t___0 final
{
public:
	class ULActMgrComponent*                      ActMgrComponent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Command;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Lever;                                             // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipCommandPrerequisitiesCheck;                    // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_HoldThrow_C____t___0) == 0x000008, "Wrong alignment on BP_Action_HoldThrow_C____t___0");
static_assert(sizeof(BP_Action_HoldThrow_C____t___0) == 0x000028, "Wrong size on BP_Action_HoldThrow_C____t___0");
static_assert(offsetof(BP_Action_HoldThrow_C____t___0, ActMgrComponent) == 0x000000, "Member 'BP_Action_HoldThrow_C____t___0::ActMgrComponent' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C____t___0, TargetActor) == 0x000008, "Member 'BP_Action_HoldThrow_C____t___0::TargetActor' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C____t___0, Command) == 0x000010, "Member 'BP_Action_HoldThrow_C____t___0::Command' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C____t___0, Lever) == 0x000018, "Member 'BP_Action_HoldThrow_C____t___0::Lever' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C____t___0, SkipCommandPrerequisitiesCheck) == 0x000024, "Member 'BP_Action_HoldThrow_C____t___0::SkipCommandPrerequisitiesCheck' has a wrong offset!");

// Function BP_Action_HoldThrow.BP_Action_HoldThrow_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_HoldThrow_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_HoldThrow_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_HoldThrow_C_OnStop");
static_assert(sizeof(BP_Action_HoldThrow_C_OnStop) == 0x000010, "Wrong size on BP_Action_HoldThrow_C_OnStop");
static_assert(offsetof(BP_Action_HoldThrow_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_HoldThrow_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_HoldThrow_C_OnStop::Reason' has a wrong offset!");

// Function BP_Action_HoldThrow.BP_Action_HoldThrow_C.OnCurrMontageEnded
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_HoldThrow_C_OnCurrMontageEnded final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MontageInstanceID;                                 // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_HoldThrow_C_OnCurrMontageEnded) == 0x000008, "Wrong alignment on BP_Action_HoldThrow_C_OnCurrMontageEnded");
static_assert(sizeof(BP_Action_HoldThrow_C_OnCurrMontageEnded) == 0x000010, "Wrong size on BP_Action_HoldThrow_C_OnCurrMontageEnded");
static_assert(offsetof(BP_Action_HoldThrow_C_OnCurrMontageEnded, Montage) == 0x000000, "Member 'BP_Action_HoldThrow_C_OnCurrMontageEnded::Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_OnCurrMontageEnded, bInterrupted) == 0x000008, "Member 'BP_Action_HoldThrow_C_OnCurrMontageEnded::bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_OnCurrMontageEnded, MontageInstanceID) == 0x00000C, "Member 'BP_Action_HoldThrow_C_OnCurrMontageEnded::MontageInstanceID' has a wrong offset!");

// Function BP_Action_HoldThrow.BP_Action_HoldThrow_C.OnPreProcessAction
// 0x0028 (0x0028 - 0x0000)
struct BP_Action_HoldThrow_C_OnPreProcessAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetReadyToUseItem_OutUseCount;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 CallFunc_GetReadyToUseItem_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCount_ReturnValue;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_HoldThrow_C_OnPreProcessAction) == 0x000008, "Wrong alignment on BP_Action_HoldThrow_C_OnPreProcessAction");
static_assert(sizeof(BP_Action_HoldThrow_C_OnPreProcessAction) == 0x000028, "Wrong size on BP_Action_HoldThrow_C_OnPreProcessAction");
static_assert(offsetof(BP_Action_HoldThrow_C_OnPreProcessAction, ReturnValue) == 0x000000, "Member 'BP_Action_HoldThrow_C_OnPreProcessAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_OnPreProcessAction, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BP_Action_HoldThrow_C_OnPreProcessAction::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_OnPreProcessAction, CallFunc_GetReadyToUseItem_OutUseCount) == 0x000010, "Member 'BP_Action_HoldThrow_C_OnPreProcessAction::CallFunc_GetReadyToUseItem_OutUseCount' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_OnPreProcessAction, CallFunc_GetReadyToUseItem_ReturnValue) == 0x000018, "Member 'BP_Action_HoldThrow_C_OnPreProcessAction::CallFunc_GetReadyToUseItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_OnPreProcessAction, CallFunc_GetCount_ReturnValue) == 0x000020, "Member 'BP_Action_HoldThrow_C_OnPreProcessAction::CallFunc_GetCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_OnPreProcessAction, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'BP_Action_HoldThrow_C_OnPreProcessAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_HoldThrow_C_OnPreProcessAction, CallFunc_Greater_IntInt_ReturnValue) == 0x000025, "Member 'BP_Action_HoldThrow_C_OnPreProcessAction::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

