#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Teleport_End

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_Teleport_End.BP_Action_Teleport_End_C
// 0x0050 (0x02A8 - 0x0258)
class UBP_Action_Teleport_End_C final : public ULAction_LoopAnim
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimSequenceBase*                      TeleportEndAnim;                                   // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      ReConnectAnim;                                     // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActPayload_Teleport*                  As_LAct_Payload_Teleport;                          // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDilationTime;                                    // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxTimeDilation;                                   // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentTimeDilation;                               // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DilationScale;                                     // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ALStargazerObject*>              StargazerList;                                     // 0x0288(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UCurveFloat*                            DilationTimeCurve;                                 // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMotionBlurEnabled;                               // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Action_Teleport_End(int32 EntryPoint);
	void OnStart();
	void OnStop(class ULActBase* ReasonAction, class FName Reason);
	void Teleport_End();
	void OnCurrMontageEnded(class UAnimMontage* Montage, bool bInterrupted, int32 MontageInstanceID);
	void OnTick(float DeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Action_Teleport_End_C">();
	}
	static class UBP_Action_Teleport_End_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_Teleport_End_C>();
	}
};
static_assert(alignof(UBP_Action_Teleport_End_C) == 0x000008, "Wrong alignment on UBP_Action_Teleport_End_C");
static_assert(sizeof(UBP_Action_Teleport_End_C) == 0x0002A8, "Wrong size on UBP_Action_Teleport_End_C");
static_assert(offsetof(UBP_Action_Teleport_End_C, UberGraphFrame) == 0x000258, "Member 'UBP_Action_Teleport_End_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Action_Teleport_End_C, TeleportEndAnim) == 0x000260, "Member 'UBP_Action_Teleport_End_C::TeleportEndAnim' has a wrong offset!");
static_assert(offsetof(UBP_Action_Teleport_End_C, ReConnectAnim) == 0x000268, "Member 'UBP_Action_Teleport_End_C::ReConnectAnim' has a wrong offset!");
static_assert(offsetof(UBP_Action_Teleport_End_C, As_LAct_Payload_Teleport) == 0x000270, "Member 'UBP_Action_Teleport_End_C::As_LAct_Payload_Teleport' has a wrong offset!");
static_assert(offsetof(UBP_Action_Teleport_End_C, IsDilationTime) == 0x000278, "Member 'UBP_Action_Teleport_End_C::IsDilationTime' has a wrong offset!");
static_assert(offsetof(UBP_Action_Teleport_End_C, MaxTimeDilation) == 0x00027C, "Member 'UBP_Action_Teleport_End_C::MaxTimeDilation' has a wrong offset!");
static_assert(offsetof(UBP_Action_Teleport_End_C, CurrentTimeDilation) == 0x000280, "Member 'UBP_Action_Teleport_End_C::CurrentTimeDilation' has a wrong offset!");
static_assert(offsetof(UBP_Action_Teleport_End_C, DilationScale) == 0x000284, "Member 'UBP_Action_Teleport_End_C::DilationScale' has a wrong offset!");
static_assert(offsetof(UBP_Action_Teleport_End_C, StargazerList) == 0x000288, "Member 'UBP_Action_Teleport_End_C::StargazerList' has a wrong offset!");
static_assert(offsetof(UBP_Action_Teleport_End_C, DilationTimeCurve) == 0x000298, "Member 'UBP_Action_Teleport_End_C::DilationTimeCurve' has a wrong offset!");
static_assert(offsetof(UBP_Action_Teleport_End_C, IsMotionBlurEnabled) == 0x0002A0, "Member 'UBP_Action_Teleport_End_C::IsMotionBlurEnabled' has a wrong offset!");

}

