#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Guard_Reflect

#include "Basic.hpp"

#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_Guard_Reflect.BP_Action_Guard_Reflect_C.ExecuteUbergraph_BP_Action_Guard_Reflect
// 0x0038 (0x0038 - 0x0000)
struct BP_Action_Guard_Reflect_C_ExecuteUbergraph_BP_Action_Guard_Reflect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_PlaySkillActionBP_Branches;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_PlaySkillActionBP_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlaySkillActionBP_Branches_1;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_PlaySkillActionBP_ReturnValue_1;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALNPCCharacter*                         K2Node_DynamicCast_AsLNPCCharacter;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_Guard_Reflect_C_ExecuteUbergraph_BP_Action_Guard_Reflect) == 0x000008, "Wrong alignment on BP_Action_Guard_Reflect_C_ExecuteUbergraph_BP_Action_Guard_Reflect");
static_assert(sizeof(BP_Action_Guard_Reflect_C_ExecuteUbergraph_BP_Action_Guard_Reflect) == 0x000038, "Wrong size on BP_Action_Guard_Reflect_C_ExecuteUbergraph_BP_Action_Guard_Reflect");
static_assert(offsetof(BP_Action_Guard_Reflect_C_ExecuteUbergraph_BP_Action_Guard_Reflect, EntryPoint) == 0x000000, "Member 'BP_Action_Guard_Reflect_C_ExecuteUbergraph_BP_Action_Guard_Reflect::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Reflect_C_ExecuteUbergraph_BP_Action_Guard_Reflect, CallFunc_Stop_ReturnValue) == 0x000004, "Member 'BP_Action_Guard_Reflect_C_ExecuteUbergraph_BP_Action_Guard_Reflect::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Reflect_C_ExecuteUbergraph_BP_Action_Guard_Reflect, CallFunc_PlaySkillActionBP_Branches) == 0x000005, "Member 'BP_Action_Guard_Reflect_C_ExecuteUbergraph_BP_Action_Guard_Reflect::CallFunc_PlaySkillActionBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Reflect_C_ExecuteUbergraph_BP_Action_Guard_Reflect, CallFunc_PlaySkillActionBP_ReturnValue) == 0x000008, "Member 'BP_Action_Guard_Reflect_C_ExecuteUbergraph_BP_Action_Guard_Reflect::CallFunc_PlaySkillActionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Reflect_C_ExecuteUbergraph_BP_Action_Guard_Reflect, CallFunc_PlaySkillActionBP_Branches_1) == 0x000010, "Member 'BP_Action_Guard_Reflect_C_ExecuteUbergraph_BP_Action_Guard_Reflect::CallFunc_PlaySkillActionBP_Branches_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Reflect_C_ExecuteUbergraph_BP_Action_Guard_Reflect, CallFunc_PlaySkillActionBP_ReturnValue_1) == 0x000018, "Member 'BP_Action_Guard_Reflect_C_ExecuteUbergraph_BP_Action_Guard_Reflect::CallFunc_PlaySkillActionBP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Reflect_C_ExecuteUbergraph_BP_Action_Guard_Reflect, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'BP_Action_Guard_Reflect_C_ExecuteUbergraph_BP_Action_Guard_Reflect::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Reflect_C_ExecuteUbergraph_BP_Action_Guard_Reflect, K2Node_SwitchEnum_CmpSuccess_1) == 0x000021, "Member 'BP_Action_Guard_Reflect_C_ExecuteUbergraph_BP_Action_Guard_Reflect::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Reflect_C_ExecuteUbergraph_BP_Action_Guard_Reflect, K2Node_DynamicCast_AsLNPCCharacter) == 0x000028, "Member 'BP_Action_Guard_Reflect_C_ExecuteUbergraph_BP_Action_Guard_Reflect::K2Node_DynamicCast_AsLNPCCharacter' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Reflect_C_ExecuteUbergraph_BP_Action_Guard_Reflect, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_Action_Guard_Reflect_C_ExecuteUbergraph_BP_Action_Guard_Reflect::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

