#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_SlaveArm_Normal

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_SlaveArm_Normal.BP_Action_SlaveArm_Normal_C.ExecuteUbergraph_BP_Action_SlaveArm_Normal
// 0x00C8 (0x00C8 - 0x0000)
struct BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ULActMgrComponent* ActMgrComponent, class AActor* TargetActor, class FName Command, const struct FVector& Lever, bool SkipCommandPrerequisitiesCheck)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActMgrComponent*                      K2Node_CustomEvent_ActMgrComponent;                // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_TargetActor;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Command;                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Lever;                          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SkipCommandPrerequisitiesCheck; // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindActionState_ReturnValue;              // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_PlaySkillActionBP_Branches;               // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_PlaySkillActionBP_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_PlaySkillActionBP_Branches_1;             // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_PlaySkillActionBP_ReturnValue_1;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayTargetAnim_ReturnValue;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActPayload_SlaveArm*                  K2Node_DynamicCast_AsLAct_Payload_Slave_Arm;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_InputCommand_SlaveArmPress_ReturnValue;   // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CH_PC_Pino_C*                       K2Node_DynamicCast_AsBP_CH_PC_Pino;                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CH_PC_Pino_C*                       K2Node_DynamicCast_AsBP_CH_PC_Pino_1;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CH_PC_Pino_C*                       K2Node_DynamicCast_AsBP_CH_PC_Pino_2;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_InputCommand_SlaveArmPress_ReturnValue_1; // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCommandPressed_ReturnValue;             // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal) == 0x000008, "Wrong alignment on BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal");
static_assert(sizeof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal) == 0x0000C8, "Wrong size on BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, EntryPoint) == 0x000000, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, K2Node_CustomEvent_ActMgrComponent) == 0x000018, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::K2Node_CustomEvent_ActMgrComponent' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, K2Node_CustomEvent_TargetActor) == 0x000020, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::K2Node_CustomEvent_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, K2Node_CustomEvent_Command) == 0x000028, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::K2Node_CustomEvent_Command' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, K2Node_CustomEvent_Lever) == 0x000030, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::K2Node_CustomEvent_Lever' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, K2Node_CustomEvent_SkipCommandPrerequisitiesCheck) == 0x00003C, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::K2Node_CustomEvent_SkipCommandPrerequisitiesCheck' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, K2Node_Event_ReasonAction) == 0x000040, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, K2Node_Event_Reason) == 0x000048, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000050, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000051, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, CallFunc_FindActionState_ReturnValue) == 0x000052, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::CallFunc_FindActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, CallFunc_PlaySkillActionBP_Branches) == 0x000053, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::CallFunc_PlaySkillActionBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, CallFunc_PlaySkillActionBP_ReturnValue) == 0x000058, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::CallFunc_PlaySkillActionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, K2Node_SwitchEnum_CmpSuccess) == 0x000060, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, CallFunc_PlaySkillActionBP_Branches_1) == 0x000061, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::CallFunc_PlaySkillActionBP_Branches_1' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, CallFunc_PlaySkillActionBP_ReturnValue_1) == 0x000068, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::CallFunc_PlaySkillActionBP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, K2Node_SwitchEnum_CmpSuccess_1) == 0x000070, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, CallFunc_PlayTargetAnim_ReturnValue) == 0x000074, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::CallFunc_PlayTargetAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, K2Node_DynamicCast_AsLAct_Payload_Slave_Arm) == 0x000078, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::K2Node_DynamicCast_AsLAct_Payload_Slave_Arm' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, CallFunc_InputCommand_SlaveArmPress_ReturnValue) == 0x000084, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::CallFunc_InputCommand_SlaveArmPress_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00008C, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, K2Node_DynamicCast_AsBP_CH_PC_Pino) == 0x000090, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::K2Node_DynamicCast_AsBP_CH_PC_Pino' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, K2Node_DynamicCast_AsBP_CH_PC_Pino_1) == 0x0000A0, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::K2Node_DynamicCast_AsBP_CH_PC_Pino_1' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, K2Node_DynamicCast_bSuccess_2) == 0x0000A8, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, K2Node_DynamicCast_AsBP_CH_PC_Pino_2) == 0x0000B0, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::K2Node_DynamicCast_AsBP_CH_PC_Pino_2' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, K2Node_DynamicCast_bSuccess_3) == 0x0000B8, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, CallFunc_InputCommand_SlaveArmPress_ReturnValue_1) == 0x0000BC, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::CallFunc_InputCommand_SlaveArmPress_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, CallFunc_IsCommandPressed_ReturnValue) == 0x0000C4, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::CallFunc_IsCommandPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, CallFunc_Not_PreBool_ReturnValue) == 0x0000C5, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal, CallFunc_BooleanAND_ReturnValue) == 0x0000C6, "Member 'BP_Action_SlaveArm_Normal_C_ExecuteUbergraph_BP_Action_SlaveArm_Normal::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_Action_SlaveArm_Normal.BP_Action_SlaveArm_Normal_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_SlaveArm_Normal_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_SlaveArm_Normal_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_SlaveArm_Normal_C_OnStop");
static_assert(sizeof(BP_Action_SlaveArm_Normal_C_OnStop) == 0x000010, "Wrong size on BP_Action_SlaveArm_Normal_C_OnStop");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_SlaveArm_Normal_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_SlaveArm_Normal_C_OnStop::Reason' has a wrong offset!");

// Function BP_Action_SlaveArm_Normal.BP_Action_SlaveArm_Normal_C.OnCommandOccurred_Event
// 0x0028 (0x0028 - 0x0000)
struct BP_Action_SlaveArm_Normal_C_OnCommandOccurred_Event final
{
public:
	class ULActMgrComponent*                      ActMgrComponent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Command;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Lever;                                             // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipCommandPrerequisitiesCheck;                    // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_SlaveArm_Normal_C_OnCommandOccurred_Event) == 0x000008, "Wrong alignment on BP_Action_SlaveArm_Normal_C_OnCommandOccurred_Event");
static_assert(sizeof(BP_Action_SlaveArm_Normal_C_OnCommandOccurred_Event) == 0x000028, "Wrong size on BP_Action_SlaveArm_Normal_C_OnCommandOccurred_Event");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_OnCommandOccurred_Event, ActMgrComponent) == 0x000000, "Member 'BP_Action_SlaveArm_Normal_C_OnCommandOccurred_Event::ActMgrComponent' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_OnCommandOccurred_Event, TargetActor) == 0x000008, "Member 'BP_Action_SlaveArm_Normal_C_OnCommandOccurred_Event::TargetActor' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_OnCommandOccurred_Event, Command) == 0x000010, "Member 'BP_Action_SlaveArm_Normal_C_OnCommandOccurred_Event::Command' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_OnCommandOccurred_Event, Lever) == 0x000018, "Member 'BP_Action_SlaveArm_Normal_C_OnCommandOccurred_Event::Lever' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_Normal_C_OnCommandOccurred_Event, SkipCommandPrerequisitiesCheck) == 0x000024, "Member 'BP_Action_SlaveArm_Normal_C_OnCommandOccurred_Event::SkipCommandPrerequisitiesCheck' has a wrong offset!");

}

