#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_TurnAround

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_TurnAround.BP_Action_TurnAround_C.ExecuteUbergraph_BP_Action_TurnAround
// 0x00E8 (0x00E8 - 0x0000)
struct BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue; // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInst_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetCurrentActiveMontage_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActPayload_TurnAround*                K2Node_DynamicCast_AsLAct_Payload_Turn_Around;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Stop_ReturnValue_1;                       // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveAnimRateScaleByInstigator_ReturnValue; // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLGameObjectHandle                     CallFunc_AddAnimRateScale_ReturnValue;             // 0x0064(0x0004)(NoDestructor)
	struct FLAction_StartRotationInfo             K2Node_MakeStruct_LAction_StartRotationInfo;       // 0x0068(0x0028)(NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALNPCController*                        CallFunc_GetAIController_ReturnValue;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayCommomAnimBP_MontageInstanceID;       // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PlayCommomAnimBP_Montage;                 // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayCommomAnimBP_Branches;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALNPCControllerBP_C*                    K2Node_DynamicCast_AsLNPCController_BP;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue_1; // 0x00C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue_2;                       // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Stop_ReturnValue_3;                       // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayCommomAnimBP_MontageInstanceID_1;     // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PlayCommomAnimBP_Montage_1;               // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayCommomAnimBP_Branches_1;              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround) == 0x000008, "Wrong alignment on BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround");
static_assert(sizeof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround) == 0x0000E8, "Wrong size on BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, EntryPoint) == 0x000000, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue) == 0x000004, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, CallFunc_GetAnimInst_ReturnValue) == 0x000010, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::CallFunc_GetAnimInst_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, CallFunc_GetCurrentActiveMontage_ReturnValue) == 0x000018, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::CallFunc_GetCurrentActiveMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, CallFunc_GetPlayLength_ReturnValue) == 0x000024, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::CallFunc_GetPlayLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, K2Node_Event_ReasonAction) == 0x000028, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, K2Node_Event_Reason) == 0x000030, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, CallFunc_Stop_ReturnValue) == 0x000038, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, K2Node_DynamicCast_AsLAct_Payload_Turn_Around) == 0x000040, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::K2Node_DynamicCast_AsLAct_Payload_Turn_Around' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000049, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, CallFunc_MakeRotator_ReturnValue) == 0x00004C, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000058, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, CallFunc_Less_FloatFloat_ReturnValue) == 0x000059, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, CallFunc_Stop_ReturnValue_1) == 0x00005A, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::CallFunc_Stop_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, CallFunc_RemoveAnimRateScaleByInstigator_ReturnValue) == 0x00005B, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::CallFunc_RemoveAnimRateScaleByInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00005C, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000060, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, CallFunc_AddAnimRateScale_ReturnValue) == 0x000064, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::CallFunc_AddAnimRateScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, K2Node_MakeStruct_LAction_StartRotationInfo) == 0x000068, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::K2Node_MakeStruct_LAction_StartRotationInfo' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000090, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, CallFunc_GetAIController_ReturnValue) == 0x000098, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::CallFunc_GetAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, CallFunc_PlayCommomAnimBP_MontageInstanceID) == 0x0000A0, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::CallFunc_PlayCommomAnimBP_MontageInstanceID' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, CallFunc_PlayCommomAnimBP_Montage) == 0x0000A8, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::CallFunc_PlayCommomAnimBP_Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, CallFunc_PlayCommomAnimBP_Branches) == 0x0000B0, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::CallFunc_PlayCommomAnimBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, K2Node_DynamicCast_AsLNPCController_BP) == 0x0000B8, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::K2Node_DynamicCast_AsLNPCController_BP' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, K2Node_SwitchEnum_CmpSuccess) == 0x0000C1, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue_1) == 0x0000C4, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, CallFunc_Stop_ReturnValue_2) == 0x0000CC, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::CallFunc_Stop_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, CallFunc_Stop_ReturnValue_3) == 0x0000CD, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::CallFunc_Stop_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, CallFunc_PlayCommomAnimBP_MontageInstanceID_1) == 0x0000D0, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::CallFunc_PlayCommomAnimBP_MontageInstanceID_1' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, CallFunc_PlayCommomAnimBP_Montage_1) == 0x0000D8, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::CallFunc_PlayCommomAnimBP_Montage_1' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, CallFunc_PlayCommomAnimBP_Branches_1) == 0x0000E0, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::CallFunc_PlayCommomAnimBP_Branches_1' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000E1, "Member 'BP_Action_TurnAround_C_ExecuteUbergraph_BP_Action_TurnAround::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

// Function BP_Action_TurnAround.BP_Action_TurnAround_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_TurnAround_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_TurnAround_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_TurnAround_C_OnStop");
static_assert(sizeof(BP_Action_TurnAround_C_OnStop) == 0x000010, "Wrong size on BP_Action_TurnAround_C_OnStop");
static_assert(offsetof(BP_Action_TurnAround_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_TurnAround_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_TurnAround_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_TurnAround_C_OnStop::Reason' has a wrong offset!");

}

