#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_JumpSkill_Data_Jump13

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct BP_Action_JumpSkill_Data_Jump13.BP_Action_JumpSkill_Data_Jump13
// 0x0030 (0x0030 - 0x0000)
struct FBP_Action_JumpSkill_Data_Jump13 final
{
public:
	struct FVector                                MeshMove_Move_2_7FE07F2A45AFD20001704080AC87EEC2;  // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MoveMeshStartTime_5_EC3AF0C0461835145DA5449E21A7DA58; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AirLoopRot_Duration_7_A34C8C5D48360A1261096F8459A772B9; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration_move_9_865B958E490ECB94FCCB49A25F38A887;  // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveVector*                           Move_Curve_12_B54C6D424E42107EC54A85B7393F402C;    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimSequenceBase*>              TargetAnimArray_19_92ADF18F45400862F644CA991D93E172; // 0x0020(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FBP_Action_JumpSkill_Data_Jump13) == 0x000008, "Wrong alignment on FBP_Action_JumpSkill_Data_Jump13");
static_assert(sizeof(FBP_Action_JumpSkill_Data_Jump13) == 0x000030, "Wrong size on FBP_Action_JumpSkill_Data_Jump13");
static_assert(offsetof(FBP_Action_JumpSkill_Data_Jump13, MeshMove_Move_2_7FE07F2A45AFD20001704080AC87EEC2) == 0x000000, "Member 'FBP_Action_JumpSkill_Data_Jump13::MeshMove_Move_2_7FE07F2A45AFD20001704080AC87EEC2' has a wrong offset!");
static_assert(offsetof(FBP_Action_JumpSkill_Data_Jump13, MoveMeshStartTime_5_EC3AF0C0461835145DA5449E21A7DA58) == 0x00000C, "Member 'FBP_Action_JumpSkill_Data_Jump13::MoveMeshStartTime_5_EC3AF0C0461835145DA5449E21A7DA58' has a wrong offset!");
static_assert(offsetof(FBP_Action_JumpSkill_Data_Jump13, AirLoopRot_Duration_7_A34C8C5D48360A1261096F8459A772B9) == 0x000010, "Member 'FBP_Action_JumpSkill_Data_Jump13::AirLoopRot_Duration_7_A34C8C5D48360A1261096F8459A772B9' has a wrong offset!");
static_assert(offsetof(FBP_Action_JumpSkill_Data_Jump13, Duration_move_9_865B958E490ECB94FCCB49A25F38A887) == 0x000014, "Member 'FBP_Action_JumpSkill_Data_Jump13::Duration_move_9_865B958E490ECB94FCCB49A25F38A887' has a wrong offset!");
static_assert(offsetof(FBP_Action_JumpSkill_Data_Jump13, Move_Curve_12_B54C6D424E42107EC54A85B7393F402C) == 0x000018, "Member 'FBP_Action_JumpSkill_Data_Jump13::Move_Curve_12_B54C6D424E42107EC54A85B7393F402C' has a wrong offset!");
static_assert(offsetof(FBP_Action_JumpSkill_Data_Jump13, TargetAnimArray_19_92ADF18F45400862F644CA991D93E172) == 0x000020, "Member 'FBP_Action_JumpSkill_Data_Jump13::TargetAnimArray_19_92ADF18F45400862F644CA991D93E172' has a wrong offset!");

}

