#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_FloatingHit

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_FloatingHit.BP_Action_FloatingHit_C.ExecuteUbergraph_BP_Action_FloatingHit
// 0x0148 (0x0148 - 0x0000)
struct BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULReasonForDeathInfo*                   CallFunc_GetDeathInfo_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_TryLockInput_Movement_ReturnValue; // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_TryLockInput_Rotation_ReturnValue; // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetCurrMontageInstanceID_AnimInstance;    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_GetCurrMontageInstanceID_Branches;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrMontageInstanceID_ReturnValue;     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue_1;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_GetLCharacterMovementComponentBP_Branches; // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULCharacterMovementComponent*           CallFunc_GetLCharacterMovementComponentBP_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionStopReason_UnexpectedBehaviour_ReturnValue; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue_2;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Event_Montage_1;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted_1;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MontageInstanceID_1;                  // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_Event_Montage;                              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted;                         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MontageInstanceID;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayHitAnimBP_MontageInstanceID;          // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_PlayHitAnimBP_Montage;                    // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayHitAnimBP_Branches;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DB[0x1];                                       // 0x00DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_LockFalling_ReturnValue;      // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00E4(0x0010)(ZeroConstructor, NoDestructor)
	EExecutePin                                   CallFunc_GetLCharacterMovementComponentBP_Branches_1; // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULCharacterMovementComponent*           CallFunc_GetLCharacterMovementComponentBP_ReturnValue_1; // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_GetEndCommonAnimBP_Branches;              // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEndCommonAnimBP_ReturnValue;           // 0x010C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter;                 // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayHitAnimBP_MontageInstanceID_1;        // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_PlayHitAnimBP_Montage_1;                  // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayHitAnimBP_Branches_1;                 // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x2];                                      // 0x0132(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayHitAnimBP_MontageInstanceID_2;        // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_PlayHitAnimBP_Montage_2;                  // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayHitAnimBP_Branches_2;                 // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit) == 0x000008, "Wrong alignment on BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit");
static_assert(sizeof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit) == 0x000148, "Wrong size on BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, EntryPoint) == 0x000000, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, K2Node_DynamicCast_AsLCharacter) == 0x000008, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::K2Node_DynamicCast_AsLCharacter' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_GetDeathInfo_ReturnValue) == 0x000018, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_GetDeathInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_IsDead_ReturnValue) == 0x000020, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, Temp_bool_IsClosed_Variable) == 0x000022, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_ActionState_TryLockInput_Movement_ReturnValue) == 0x000024, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_ActionState_TryLockInput_Movement_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_ActionState_TryLockInput_Rotation_ReturnValue) == 0x00002C, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_ActionState_TryLockInput_Rotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_GetCurrMontageInstanceID_AnimInstance) == 0x000038, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_GetCurrMontageInstanceID_AnimInstance' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_GetCurrMontageInstanceID_Branches) == 0x000040, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_GetCurrMontageInstanceID_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_GetCurrMontageInstanceID_ReturnValue) == 0x000044, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_GetCurrMontageInstanceID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue) == 0x000048, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, K2Node_SwitchEnum_CmpSuccess) == 0x000050, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_Stop_ReturnValue) == 0x000051, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, K2Node_Event_ReasonAction) == 0x000058, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, K2Node_Event_Reason) == 0x000060, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_Stop_ReturnValue_1) == 0x000068, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_Stop_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, K2Node_CreateDelegate_OutputDelegate) == 0x00006C, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000080, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_GetLCharacterMovementComponentBP_Branches) == 0x000088, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_GetLCharacterMovementComponentBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_GetLCharacterMovementComponentBP_ReturnValue) == 0x000090, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_GetLCharacterMovementComponentBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_ActionStopReason_UnexpectedBehaviour_ReturnValue) == 0x000098, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_ActionStopReason_UnexpectedBehaviour_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_Stop_ReturnValue_2) == 0x0000A0, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_Stop_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000A1, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, K2Node_Event_Montage_1) == 0x0000A8, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::K2Node_Event_Montage_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, K2Node_Event_bInterrupted_1) == 0x0000B0, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::K2Node_Event_bInterrupted_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, K2Node_Event_MontageInstanceID_1) == 0x0000B4, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::K2Node_Event_MontageInstanceID_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, K2Node_Event_Montage) == 0x0000B8, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::K2Node_Event_Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, K2Node_Event_bInterrupted) == 0x0000C0, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::K2Node_Event_bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, K2Node_Event_MontageInstanceID) == 0x0000C4, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::K2Node_Event_MontageInstanceID' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_IsPlaying_ReturnValue) == 0x0000C8, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_PlayHitAnimBP_MontageInstanceID) == 0x0000CC, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_PlayHitAnimBP_MontageInstanceID' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_PlayHitAnimBP_Montage) == 0x0000D0, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_PlayHitAnimBP_Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_PlayHitAnimBP_Branches) == 0x0000D8, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_PlayHitAnimBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000D9, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, K2Node_SwitchEnum_CmpSuccess_2) == 0x0000DA, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_ActionState_LockFalling_ReturnValue) == 0x0000DC, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_ActionState_LockFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000E4, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_GetLCharacterMovementComponentBP_Branches_1) == 0x0000F4, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_GetLCharacterMovementComponentBP_Branches_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_GetLCharacterMovementComponentBP_ReturnValue_1) == 0x0000F8, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_GetLCharacterMovementComponentBP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000100, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, K2Node_SwitchEnum_CmpSuccess_3) == 0x000108, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_GetEndCommonAnimBP_Branches) == 0x000109, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_GetEndCommonAnimBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_GetEndCommonAnimBP_ReturnValue) == 0x00010C, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_GetEndCommonAnimBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, K2Node_DynamicCast_AsLPCCharacter) == 0x000118, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::K2Node_DynamicCast_AsLPCCharacter' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, K2Node_DynamicCast_bSuccess_1) == 0x000120, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_PlayHitAnimBP_MontageInstanceID_1) == 0x000124, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_PlayHitAnimBP_MontageInstanceID_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_PlayHitAnimBP_Montage_1) == 0x000128, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_PlayHitAnimBP_Montage_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_PlayHitAnimBP_Branches_1) == 0x000130, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_PlayHitAnimBP_Branches_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, K2Node_SwitchEnum_CmpSuccess_4) == 0x000131, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_PlayHitAnimBP_MontageInstanceID_2) == 0x000134, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_PlayHitAnimBP_MontageInstanceID_2' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_PlayHitAnimBP_Montage_2) == 0x000138, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_PlayHitAnimBP_Montage_2' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, CallFunc_PlayHitAnimBP_Branches_2) == 0x000140, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::CallFunc_PlayHitAnimBP_Branches_2' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit, K2Node_SwitchEnum_CmpSuccess_5) == 0x000141, "Member 'BP_Action_FloatingHit_C_ExecuteUbergraph_BP_Action_FloatingHit::K2Node_SwitchEnum_CmpSuccess_5' has a wrong offset!");

// Function BP_Action_FloatingHit.BP_Action_FloatingHit_C.OnCurrMontageBlendOutStarted
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_FloatingHit_C_OnCurrMontageBlendOutStarted final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MontageInstanceID;                                 // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_FloatingHit_C_OnCurrMontageBlendOutStarted) == 0x000008, "Wrong alignment on BP_Action_FloatingHit_C_OnCurrMontageBlendOutStarted");
static_assert(sizeof(BP_Action_FloatingHit_C_OnCurrMontageBlendOutStarted) == 0x000010, "Wrong size on BP_Action_FloatingHit_C_OnCurrMontageBlendOutStarted");
static_assert(offsetof(BP_Action_FloatingHit_C_OnCurrMontageBlendOutStarted, Montage) == 0x000000, "Member 'BP_Action_FloatingHit_C_OnCurrMontageBlendOutStarted::Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_OnCurrMontageBlendOutStarted, bInterrupted) == 0x000008, "Member 'BP_Action_FloatingHit_C_OnCurrMontageBlendOutStarted::bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_OnCurrMontageBlendOutStarted, MontageInstanceID) == 0x00000C, "Member 'BP_Action_FloatingHit_C_OnCurrMontageBlendOutStarted::MontageInstanceID' has a wrong offset!");

// Function BP_Action_FloatingHit.BP_Action_FloatingHit_C.OnCurrMontageEnded
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_FloatingHit_C_OnCurrMontageEnded final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MontageInstanceID;                                 // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_FloatingHit_C_OnCurrMontageEnded) == 0x000008, "Wrong alignment on BP_Action_FloatingHit_C_OnCurrMontageEnded");
static_assert(sizeof(BP_Action_FloatingHit_C_OnCurrMontageEnded) == 0x000010, "Wrong size on BP_Action_FloatingHit_C_OnCurrMontageEnded");
static_assert(offsetof(BP_Action_FloatingHit_C_OnCurrMontageEnded, Montage) == 0x000000, "Member 'BP_Action_FloatingHit_C_OnCurrMontageEnded::Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_OnCurrMontageEnded, bInterrupted) == 0x000008, "Member 'BP_Action_FloatingHit_C_OnCurrMontageEnded::bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_OnCurrMontageEnded, MontageInstanceID) == 0x00000C, "Member 'BP_Action_FloatingHit_C_OnCurrMontageEnded::MontageInstanceID' has a wrong offset!");

// Function BP_Action_FloatingHit.BP_Action_FloatingHit_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_FloatingHit_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_FloatingHit_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_FloatingHit_C_OnStop");
static_assert(sizeof(BP_Action_FloatingHit_C_OnStop) == 0x000010, "Wrong size on BP_Action_FloatingHit_C_OnStop");
static_assert(offsetof(BP_Action_FloatingHit_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_FloatingHit_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_FloatingHit_C_OnStop::Reason' has a wrong offset!");

// Function BP_Action_FloatingHit.BP_Action_FloatingHit_C.OnLanded
// 0x0228 (0x0228 - 0x0000)
struct BP_Action_FloatingHit_C_OnLanded final
{
public:
	class ACharacter*                             LandingChar;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          Handled;                                           // 0x0091(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter;                   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter_1;                 // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CalcFallingDamage_ReturnValue;            // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLReceiveDamageParams                  K2Node_MakeStruct_LReceiveDamageParams;            // 0x0140(0x00D0)(ContainsInstancedReference)
	struct FLReceiveDamageResults                 CallFunc_ReceiveDamage_ReturnValue;                // 0x0210(0x0014)(NoDestructor)
	bool                                          CallFunc_CancelLoopAnim_ReturnValue;               // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindActionState_ReturnValue;              // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_FloatingHit_C_OnLanded) == 0x000008, "Wrong alignment on BP_Action_FloatingHit_C_OnLanded");
static_assert(sizeof(BP_Action_FloatingHit_C_OnLanded) == 0x000228, "Wrong size on BP_Action_FloatingHit_C_OnLanded");
static_assert(offsetof(BP_Action_FloatingHit_C_OnLanded, LandingChar) == 0x000000, "Member 'BP_Action_FloatingHit_C_OnLanded::LandingChar' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_OnLanded, Hit) == 0x000008, "Member 'BP_Action_FloatingHit_C_OnLanded::Hit' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_OnLanded, ReturnValue) == 0x000090, "Member 'BP_Action_FloatingHit_C_OnLanded::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FloatingHit_C_OnLanded, Handled) == 0x000091, "Member 'BP_Action_FloatingHit_C_OnLanded::Handled' has a wrong offset!");
