#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_NPCHitRepulse

#include "Basic.hpp"

#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_NPCHitRepulse.BP_Action_NPCHitRepulse_C.ExecuteUbergraph_BP_Action_NPCHitRepulse
// 0x0048 (0x0048 - 0x0000)
struct BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayHitAnim_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_TryLockInput_Movement_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_TryLockInput_Rotation_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetCurrMontageInstanceID_AnimInstance;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_GetCurrMontageInstanceID_Branches;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrMontageInstanceID_ReturnValue;     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayHitAnim_ReturnValue_1;                // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindActionState_ReturnValue;              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse) == 0x000008, "Wrong alignment on BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse");
static_assert(sizeof(BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse) == 0x000048, "Wrong size on BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse");
static_assert(offsetof(BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse, EntryPoint) == 0x000000, "Member 'BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse, CallFunc_PlayHitAnim_ReturnValue) == 0x000004, "Member 'BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse::CallFunc_PlayHitAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse, CallFunc_ActionState_TryLockInput_Movement_ReturnValue) == 0x000008, "Member 'BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse::CallFunc_ActionState_TryLockInput_Movement_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse, CallFunc_ActionState_TryLockInput_Rotation_ReturnValue) == 0x000010, "Member 'BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse::CallFunc_ActionState_TryLockInput_Rotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse, CallFunc_GetCurrMontageInstanceID_AnimInstance) == 0x000018, "Member 'BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse::CallFunc_GetCurrMontageInstanceID_AnimInstance' has a wrong offset!");
static_assert(offsetof(BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse, CallFunc_GetCurrMontageInstanceID_Branches) == 0x000020, "Member 'BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse::CallFunc_GetCurrMontageInstanceID_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse, CallFunc_GetCurrMontageInstanceID_ReturnValue) == 0x000024, "Member 'BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse::CallFunc_GetCurrMontageInstanceID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse, CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue) == 0x000028, "Member 'BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse::CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse, K2Node_SwitchEnum_CmpSuccess) == 0x000030, "Member 'BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse, CallFunc_Stop_ReturnValue) == 0x000031, "Member 'BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse, CallFunc_PlayHitAnim_ReturnValue_1) == 0x000034, "Member 'BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse::CallFunc_PlayHitAnim_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse, K2Node_DynamicCast_AsLCharacter) == 0x000038, "Member 'BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse::K2Node_DynamicCast_AsLCharacter' has a wrong offset!");
static_assert(offsetof(BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse, CallFunc_FindActionState_ReturnValue) == 0x000041, "Member 'BP_Action_NPCHitRepulse_C_ExecuteUbergraph_BP_Action_NPCHitRepulse::CallFunc_FindActionState_ReturnValue' has a wrong offset!");

}

