#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_GuardEx_Parry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_GuardEx_Parry.BP_Action_GuardEx_Parry_C.ExecuteUbergraph_BP_Action_GuardEx_Parry
// 0x00C8 (0x00C8 - 0x0000)
struct BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULHitProcContext*                       K2Node_CustomEvent_HitContext;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlaySkillActionBP_Branches;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_PlaySkillActionBP_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindActionState_ReturnValue;              // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLGameObjectHandle                     CallFunc_StartTransformModifier_MoveActor_Walking_MoveOnly_ReturnValue; // 0x005C(0x0004)(NoDestructor)
	class UAnimMontage*                           K2Node_Event_Montage_1;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted_1;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MontageInstanceID_1;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActBase*                              CallFunc_ProcessCommand_ReturnValue;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInst_ReturnValue;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProcessAction_ReturnValue;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StopMontage_ReturnValue;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Event_Montage;                              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted;                         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MontageInstanceID;                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue_1;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_ApplyInput_ReturnValue;       // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ULHitProcContext* HitContext)> K2Node_CreateDelegate_OutputDelegate;              // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_1;               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ConsumeSlaveMagazinePoint_ReturnValue;    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry) == 0x000008, "Wrong alignment on BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry");
static_assert(sizeof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry) == 0x0000C8, "Wrong size on BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, EntryPoint) == 0x000000, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, CallFunc_Stop_ReturnValue) == 0x000004, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, K2Node_DynamicCast_AsLPCCharacter) == 0x000008, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::K2Node_DynamicCast_AsLPCCharacter' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, K2Node_Event_ReasonAction) == 0x000018, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, K2Node_Event_Reason) == 0x000020, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, K2Node_CustomEvent_HitContext) == 0x000028, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::K2Node_CustomEvent_HitContext' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, CallFunc_GetActorForwardVector_ReturnValue) == 0x000030, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00003C, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, CallFunc_PlaySkillActionBP_Branches) == 0x000048, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::CallFunc_PlaySkillActionBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, CallFunc_PlaySkillActionBP_ReturnValue) == 0x000050, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::CallFunc_PlaySkillActionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, K2Node_SwitchEnum_CmpSuccess) == 0x000058, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, CallFunc_FindActionState_ReturnValue) == 0x000059, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::CallFunc_FindActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, CallFunc_StartTransformModifier_MoveActor_Walking_MoveOnly_ReturnValue) == 0x00005C, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::CallFunc_StartTransformModifier_MoveActor_Walking_MoveOnly_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, K2Node_Event_Montage_1) == 0x000060, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::K2Node_Event_Montage_1' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, K2Node_Event_bInterrupted_1) == 0x000068, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::K2Node_Event_bInterrupted_1' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, K2Node_Event_MontageInstanceID_1) == 0x00006C, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::K2Node_Event_MontageInstanceID_1' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, CallFunc_ProcessCommand_ReturnValue) == 0x000070, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::CallFunc_ProcessCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, CallFunc_GetAnimInst_ReturnValue) == 0x000078, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::CallFunc_GetAnimInst_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, CallFunc_ProcessAction_ReturnValue) == 0x000080, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::CallFunc_ProcessAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, CallFunc_StopMontage_ReturnValue) == 0x000081, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::CallFunc_StopMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, K2Node_Event_Montage) == 0x000088, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::K2Node_Event_Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, K2Node_Event_bInterrupted) == 0x000090, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::K2Node_Event_bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, K2Node_Event_MontageInstanceID) == 0x000094, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::K2Node_Event_MontageInstanceID' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, CallFunc_Stop_ReturnValue_1) == 0x000098, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::CallFunc_Stop_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, CallFunc_ActionState_ApplyInput_ReturnValue) == 0x00009C, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::CallFunc_ActionState_ApplyInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, CallFunc_IsPlaying_ReturnValue) == 0x0000A4, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, K2Node_CreateDelegate_OutputDelegate) == 0x0000A8, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, K2Node_DynamicCast_AsLPCCharacter_1) == 0x0000B8, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::K2Node_DynamicCast_AsLPCCharacter_1' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry, CallFunc_ConsumeSlaveMagazinePoint_ReturnValue) == 0x0000C1, "Member 'BP_Action_GuardEx_Parry_C_ExecuteUbergraph_BP_Action_GuardEx_Parry::CallFunc_ConsumeSlaveMagazinePoint_ReturnValue' has a wrong offset!");

// Function BP_Action_GuardEx_Parry.BP_Action_GuardEx_Parry_C.OnCurrMontageEnded
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_GuardEx_Parry_C_OnCurrMontageEnded final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MontageInstanceID;                                 // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_GuardEx_Parry_C_OnCurrMontageEnded) == 0x000008, "Wrong alignment on BP_Action_GuardEx_Parry_C_OnCurrMontageEnded");
static_assert(sizeof(BP_Action_GuardEx_Parry_C_OnCurrMontageEnded) == 0x000010, "Wrong size on BP_Action_GuardEx_Parry_C_OnCurrMontageEnded");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_OnCurrMontageEnded, Montage) == 0x000000, "Member 'BP_Action_GuardEx_Parry_C_OnCurrMontageEnded::Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_OnCurrMontageEnded, bInterrupted) == 0x000008, "Member 'BP_Action_GuardEx_Parry_C_OnCurrMontageEnded::bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_OnCurrMontageEnded, MontageInstanceID) == 0x00000C, "Member 'BP_Action_GuardEx_Parry_C_OnCurrMontageEnded::MontageInstanceID' has a wrong offset!");

// Function BP_Action_GuardEx_Parry.BP_Action_GuardEx_Parry_C.OnCurrMontageBlendOutStarted
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_GuardEx_Parry_C_OnCurrMontageBlendOutStarted final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MontageInstanceID;                                 // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_GuardEx_Parry_C_OnCurrMontageBlendOutStarted) == 0x000008, "Wrong alignment on BP_Action_GuardEx_Parry_C_OnCurrMontageBlendOutStarted");
static_assert(sizeof(BP_Action_GuardEx_Parry_C_OnCurrMontageBlendOutStarted) == 0x000010, "Wrong size on BP_Action_GuardEx_Parry_C_OnCurrMontageBlendOutStarted");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_OnCurrMontageBlendOutStarted, Montage) == 0x000000, "Member 'BP_Action_GuardEx_Parry_C_OnCurrMontageBlendOutStarted::Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_OnCurrMontageBlendOutStarted, bInterrupted) == 0x000008, "Member 'BP_Action_GuardEx_Parry_C_OnCurrMontageBlendOutStarted::bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_OnCurrMontageBlendOutStarted, MontageInstanceID) == 0x00000C, "Member 'BP_Action_GuardEx_Parry_C_OnCurrMontageBlendOutStarted::MontageInstanceID' has a wrong offset!");

// Function BP_Action_GuardEx_Parry.BP_Action_GuardEx_Parry_C.Hit
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_GuardEx_Parry_C_Hit final
{
public:
	class ULHitProcContext*                       HitContext;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_GuardEx_Parry_C_Hit) == 0x000008, "Wrong alignment on BP_Action_GuardEx_Parry_C_Hit");
static_assert(sizeof(BP_Action_GuardEx_Parry_C_Hit) == 0x000008, "Wrong size on BP_Action_GuardEx_Parry_C_Hit");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_Hit, HitContext) == 0x000000, "Member 'BP_Action_GuardEx_Parry_C_Hit::HitContext' has a wrong offset!");

// Function BP_Action_GuardEx_Parry.BP_Action_GuardEx_Parry_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_GuardEx_Parry_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_GuardEx_Parry_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_GuardEx_Parry_C_OnStop");
static_assert(sizeof(BP_Action_GuardEx_Parry_C_OnStop) == 0x000010, "Wrong size on BP_Action_GuardEx_Parry_C_OnStop");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_GuardEx_Parry_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Parry_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_GuardEx_Parry_C_OnStop::Reason' has a wrong offset!");

}

