#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_ToughSpecialHit

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Action_ToughSpecialHit.BP_Action_ToughSpecialHit_C.ExecuteUbergraph_BP_Action_ToughSpecialHit
// 0x0014 (0x0014 - 0x0000)
struct BP_Action_ToughSpecialHit_C_ExecuteUbergraph_BP_Action_ToughSpecialHit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_Immune_Tough_ReturnValue;     // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_SuperArmor_ReturnValue;       // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_ToughSpecialHit_C_ExecuteUbergraph_BP_Action_ToughSpecialHit) == 0x000004, "Wrong alignment on BP_Action_ToughSpecialHit_C_ExecuteUbergraph_BP_Action_ToughSpecialHit");
static_assert(sizeof(BP_Action_ToughSpecialHit_C_ExecuteUbergraph_BP_Action_ToughSpecialHit) == 0x000014, "Wrong size on BP_Action_ToughSpecialHit_C_ExecuteUbergraph_BP_Action_ToughSpecialHit");
static_assert(offsetof(BP_Action_ToughSpecialHit_C_ExecuteUbergraph_BP_Action_ToughSpecialHit, EntryPoint) == 0x000000, "Member 'BP_Action_ToughSpecialHit_C_ExecuteUbergraph_BP_Action_ToughSpecialHit::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_ToughSpecialHit_C_ExecuteUbergraph_BP_Action_ToughSpecialHit, CallFunc_ActionState_Immune_Tough_ReturnValue) == 0x000004, "Member 'BP_Action_ToughSpecialHit_C_ExecuteUbergraph_BP_Action_ToughSpecialHit::CallFunc_ActionState_Immune_Tough_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_ToughSpecialHit_C_ExecuteUbergraph_BP_Action_ToughSpecialHit, CallFunc_ActionState_SuperArmor_ReturnValue) == 0x00000C, "Member 'BP_Action_ToughSpecialHit_C_ExecuteUbergraph_BP_Action_ToughSpecialHit::CallFunc_ActionState_SuperArmor_ReturnValue' has a wrong offset!");

}

