#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Groggy

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"
#include "Engine_structs.hpp"
#include "ProjectP_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_Groggy.BP_Action_Groggy_C.ExecuteUbergraph_BP_Action_Groggy
// 0x01E0 (0x01E0 - 0x0000)
struct BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_LName_None_ReturnValue;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Event_Montage;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MontageInstanceID;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALNPCCharacter*                         K2Node_DynamicCast_AsLNPCCharacter;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELGroggyType                                  CallFunc_GetGroggyTypeBack_ReturnValue;            // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELGroggyType                                  CallFunc_GetGroggyTypeSide_ReturnValue;            // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELGroggyType                                  CallFunc_GetGroggyTypeFront_ReturnValue;           // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELAngleRangeType                              CallFunc_SwitchAngleToType_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALNPCCharacter*                         K2Node_DynamicCast_AsLNPCCharacter_1;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_Immune_Groggy_ReturnValue;    // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionStopReason_UnexpectedBehaviour_ReturnValue; // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGroggyPointResetDelay_ReturnValue;     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLGameObjectHandle                     CallFunc_AddActionState_AutoRemove_ReturnValue;    // 0x0074(0x0004)(NoDestructor)
	class FName                                   CallFunc_ActionState_Groggy_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_Groggy_Enable_ReturnValue;    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClearActionState_ReturnValue;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_LName_None_ReturnValue_1;                 // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULPlayInputSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetCurrMontageInstanceID_AnimInstance;    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_GetCurrMontageInstanceID_Branches;        // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrMontageInstanceID_ReturnValue;     // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePadMode_ReturnValue;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue; // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue_1;                       // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayHitAnim_ReturnValue;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALNPCCharacter*                         K2Node_DynamicCast_AsLNPCCharacter_2;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALNPCCharacter*                         K2Node_DynamicCast_AsLNPCCharacter_3;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetGroggyChangeSkillHitCodeName_ReturnValue; // 0x00E4(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateSkillHitReplace_ReturnValue;        // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_GetEndCommonAnimBP_Branches;              // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EF[0x1];                                       // 0x00EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEndCommonAnimBP_ReturnValue;           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayHitAnimBP_MontageInstanceID;          // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PlayHitAnimBP_Montage;                    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayHitAnimBP_Branches;                   // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10B[0x1];                                      // 0x010B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CalcGroggy_MaintainTime_ReturnValue;      // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALNPCCharacter*                         K2Node_DynamicCast_AsLNPCCharacter_4;              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_GetStatComponentBP_Branches;              // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULStatComponent*                        CallFunc_GetStatComponentBP_ReturnValue;           // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharacterStat_ReturnValue;             // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELHPUIType                                    CallFunc_GetHpUiType_ReturnValue;                  // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0136(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0137(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTime;                            // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_GetStatComponentBP_Branches_1;            // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULStatComponent*                        CallFunc_GetStatComponentBP_ReturnValue_1;         // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharacterStat_ReturnValue_1;           // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharacterStat_ReturnValue_2;           // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ULActionClass_FatalAttack_Victim_BeforeHit_ReturnValue; // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceFeedbackComponent*                CallFunc_SpawnForceFeedbackAttached_ReturnValue;   // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALNPCCharacter*                         K2Node_DynamicCast_AsLNPCCharacter_5;              // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01A0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_PlayCameraShake_ReturnValue;              // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayCameraShake_ReturnValue_1;            // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayCameraShake_ReturnValue_2;            // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELNpcFXSizeType                               CallFunc_GetFxSize_ReturnValue;                    // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C3[0x5];                                      // 0x01C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ALNPCCharacter*                         K2Node_DynamicCast_AsLNPCCharacter_6;              // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D2[0x2];                                      // 0x01D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayHitAnim_ReturnValue_1;                // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_1;          // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy) == 0x000008, "Wrong alignment on BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy");
static_assert(sizeof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy) == 0x0001E0, "Wrong size on BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, EntryPoint) == 0x000000, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_LName_None_ReturnValue) == 0x000004, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_LName_None_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, Temp_bool_IsClosed_Variable) == 0x00000C, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, Temp_bool_Has_Been_Initd_Variable) == 0x00000D, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, K2Node_Event_ReasonAction) == 0x000010, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, K2Node_Event_Reason) == 0x000018, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, K2Node_Event_Montage) == 0x000028, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::K2Node_Event_Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, K2Node_Event_bInterrupted) == 0x000030, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::K2Node_Event_bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, K2Node_Event_MontageInstanceID) == 0x000034, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::K2Node_Event_MontageInstanceID' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, K2Node_DynamicCast_AsLNPCCharacter) == 0x000038, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::K2Node_DynamicCast_AsLNPCCharacter' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, Temp_bool_Variable) == 0x000041, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_GetGroggyTypeBack_ReturnValue) == 0x000042, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_GetGroggyTypeBack_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_GetGroggyTypeSide_ReturnValue) == 0x000043, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_GetGroggyTypeSide_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000044, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000045, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_GetGroggyTypeFront_ReturnValue) == 0x000046, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_GetGroggyTypeFront_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000047, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_SwitchAngleToType_ReturnValue) == 0x000048, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_SwitchAngleToType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, K2Node_SwitchEnum_CmpSuccess) == 0x000049, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, K2Node_DynamicCast_AsLNPCCharacter_1) == 0x000050, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::K2Node_DynamicCast_AsLNPCCharacter_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_ActionState_Immune_Groggy_ReturnValue) == 0x00005C, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_ActionState_Immune_Groggy_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_ActionStopReason_UnexpectedBehaviour_ReturnValue) == 0x000064, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_ActionStopReason_UnexpectedBehaviour_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_GetGroggyPointResetDelay_ReturnValue) == 0x00006C, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_GetGroggyPointResetDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_Stop_ReturnValue) == 0x000070, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_AddActionState_AutoRemove_ReturnValue) == 0x000074, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_AddActionState_AutoRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_ActionState_Groggy_ReturnValue) == 0x000078, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_ActionState_Groggy_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_ActionState_Groggy_Enable_ReturnValue) == 0x000080, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_ActionState_Groggy_Enable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_ClearActionState_ReturnValue) == 0x000088, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_ClearActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_LName_None_ReturnValue_1) == 0x00008C, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_LName_None_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000098, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_GetCurrMontageInstanceID_AnimInstance) == 0x0000A0, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_GetCurrMontageInstanceID_AnimInstance' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_GetCurrMontageInstanceID_Branches) == 0x0000A8, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_GetCurrMontageInstanceID_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_GetCurrMontageInstanceID_ReturnValue) == 0x0000AC, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_GetCurrMontageInstanceID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_IsGamePadMode_ReturnValue) == 0x0000B0, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_IsGamePadMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000B1, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue) == 0x0000B4, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_Stop_ReturnValue_1) == 0x0000BC, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_Stop_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_PlayHitAnim_ReturnValue) == 0x0000C0, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_PlayHitAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, K2Node_DynamicCast_AsLNPCCharacter_2) == 0x0000C8, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::K2Node_DynamicCast_AsLNPCCharacter_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, K2Node_DynamicCast_bSuccess_2) == 0x0000D0, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, K2Node_DynamicCast_AsLNPCCharacter_3) == 0x0000D8, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::K2Node_DynamicCast_AsLNPCCharacter_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, K2Node_DynamicCast_bSuccess_3) == 0x0000E0, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_GetGroggyChangeSkillHitCodeName_ReturnValue) == 0x0000E4, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_GetGroggyChangeSkillHitCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_UpdateSkillHitReplace_ReturnValue) == 0x0000EC, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_UpdateSkillHitReplace_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_NotEqual_NameName_ReturnValue) == 0x0000ED, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_GetEndCommonAnimBP_Branches) == 0x0000EE, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_GetEndCommonAnimBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_GetEndCommonAnimBP_ReturnValue) == 0x0000F0, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_GetEndCommonAnimBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_PlayHitAnimBP_MontageInstanceID) == 0x0000F8, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_PlayHitAnimBP_MontageInstanceID' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_PlayHitAnimBP_Montage) == 0x000100, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_PlayHitAnimBP_Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_PlayHitAnimBP_Branches) == 0x000108, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_PlayHitAnimBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000109, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, K2Node_SwitchEnum_CmpSuccess_2) == 0x00010A, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_CalcGroggy_MaintainTime_ReturnValue) == 0x00010C, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_CalcGroggy_MaintainTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_FMax_ReturnValue) == 0x000110, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, K2Node_DynamicCast_AsLNPCCharacter_4) == 0x000118, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::K2Node_DynamicCast_AsLNPCCharacter_4' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, K2Node_DynamicCast_bSuccess_4) == 0x000120, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_GetStatComponentBP_Branches) == 0x000121, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_GetStatComponentBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_GetStatComponentBP_ReturnValue) == 0x000128, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_GetStatComponentBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_GetCharacterStat_ReturnValue) == 0x000130, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_GetCharacterStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_GetHpUiType_ReturnValue) == 0x000134, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_GetHpUiType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000135, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000136, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, K2Node_SwitchEnum_CmpSuccess_3) == 0x000137, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_BooleanOR_ReturnValue) == 0x000138, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, K2Node_Event_DeltaTime) == 0x00013C, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_GetStatComponentBP_Branches_1) == 0x000140, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_GetStatComponentBP_Branches_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_GetStatComponentBP_ReturnValue_1) == 0x000148, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_GetStatComponentBP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000150, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_GetCharacterStat_ReturnValue_1) == 0x000154, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_GetCharacterStat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_GetCharacterStat_ReturnValue_2) == 0x000158, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_GetCharacterStat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00015C, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, K2Node_SwitchEnum_CmpSuccess_4) == 0x000160, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000164, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000168, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_Less_FloatFloat_ReturnValue) == 0x00016C, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_ULActionClass_FatalAttack_Victim_BeforeHit_ReturnValue) == 0x000170, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_ULActionClass_FatalAttack_Victim_BeforeHit_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000178, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_SpawnForceFeedbackAttached_ReturnValue) == 0x000180, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_SpawnForceFeedbackAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, K2Node_DynamicCast_AsLNPCCharacter_5) == 0x000188, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::K2Node_DynamicCast_AsLNPCCharacter_5' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, K2Node_DynamicCast_bSuccess_5) == 0x000190, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000194, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, K2Node_CreateDelegate_OutputDelegate) == 0x0001A0, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_PlayCameraShake_ReturnValue) == 0x0001B0, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_PlayCameraShake_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001B8, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_PlayCameraShake_ReturnValue_1) == 0x0001C0, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_PlayCameraShake_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_PlayCameraShake_ReturnValue_2) == 0x0001C1, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_PlayCameraShake_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_GetFxSize_ReturnValue) == 0x0001C2, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_GetFxSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, K2Node_DynamicCast_AsLNPCCharacter_6) == 0x0001C8, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::K2Node_DynamicCast_AsLNPCCharacter_6' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, K2Node_DynamicCast_bSuccess_6) == 0x0001D0, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, K2Node_SwitchEnum_CmpSuccess_5) == 0x0001D1, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::K2Node_SwitchEnum_CmpSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_PlayHitAnim_ReturnValue_1) == 0x0001D4, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_PlayHitAnim_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy, CallFunc_NotEqual_NameName_ReturnValue_1) == 0x0001D8, "Member 'BP_Action_Groggy_C_ExecuteUbergraph_BP_Action_Groggy::CallFunc_NotEqual_NameName_ReturnValue_1' has a wrong offset!");

// Function BP_Action_Groggy.BP_Action_Groggy_C.OnTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Action_Groggy_C_OnTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Groggy_C_OnTick) == 0x000004, "Wrong alignment on BP_Action_Groggy_C_OnTick");
static_assert(sizeof(BP_Action_Groggy_C_OnTick) == 0x000004, "Wrong size on BP_Action_Groggy_C_OnTick");
static_assert(offsetof(BP_Action_Groggy_C_OnTick, DeltaTime) == 0x000000, "Member 'BP_Action_Groggy_C_OnTick::DeltaTime' has a wrong offset!");

// Function BP_Action_Groggy.BP_Action_Groggy_C.OnCurrMontageEnded
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_Groggy_C_OnCurrMontageEnded final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MontageInstanceID;                                 // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Groggy_C_OnCurrMontageEnded) == 0x000008, "Wrong alignment on BP_Action_Groggy_C_OnCurrMontageEnded");
static_assert(sizeof(BP_Action_Groggy_C_OnCurrMontageEnded) == 0x000010, "Wrong size on BP_Action_Groggy_C_OnCurrMontageEnded");
static_assert(offsetof(BP_Action_Groggy_C_OnCurrMontageEnded, Montage) == 0x000000, "Member 'BP_Action_Groggy_C_OnCurrMontageEnded::Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_OnCurrMontageEnded, bInterrupted) == 0x000008, "Member 'BP_Action_Groggy_C_OnCurrMontageEnded::bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_OnCurrMontageEnded, MontageInstanceID) == 0x00000C, "Member 'BP_Action_Groggy_C_OnCurrMontageEnded::MontageInstanceID' has a wrong offset!");

// Function BP_Action_Groggy.BP_Action_Groggy_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_Groggy_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Groggy_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_Groggy_C_OnStop");
static_assert(sizeof(BP_Action_Groggy_C_OnStop) == 0x000010, "Wrong size on BP_Action_Groggy_C_OnStop");
static_assert(offsetof(BP_Action_Groggy_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_Groggy_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Groggy_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_Groggy_C_OnStop::Reason' has a wrong offset!");

}

