#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Skill_RushCounter

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"
#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_Skill_RushCounter.BP_Action_Skill_RushCounter_C.ExecuteUbergraph_BP_Action_Skill_RushCounter
// 0x00A0 (0x00A0 - 0x0000)
struct BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ULActionClass_Groggy_ReturnValue;         // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULHitProcContext*                       K2Node_CustomEvent_HitContext;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALProjectile*                           K2Node_DynamicCast_AsLProjectile;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSkillHitInfoPtr                       CallFunc_FindSkillHitInfoByNameBP_ReturnValue;     // 0x0058(0x0008)(NoDestructor)
	bool                                          CallFunc_FindActionState_ReturnValue;              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELHitMotionType                               CallFunc_GetHitMotionType_ReturnValue;             // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELSkillHitType                                CallFunc_GetSkillHitType_ReturnValue;              // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ULHitProcContext* HitContext)> K2Node_CreateDelegate_OutputDelegate;              // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter_1;                 // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_PlayHitActionBP_Branches;                 // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_PlayHitActionBP_ReturnValue;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter) == 0x000008, "Wrong alignment on BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter");
static_assert(sizeof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter) == 0x0000A0, "Wrong size on BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, EntryPoint) == 0x000000, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, CallFunc_ULActionClass_Groggy_ReturnValue) == 0x000004, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::CallFunc_ULActionClass_Groggy_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, K2Node_Event_ReasonAction) == 0x000010, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, K2Node_Event_Reason) == 0x000018, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, K2Node_CustomEvent_HitContext) == 0x000020, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::K2Node_CustomEvent_HitContext' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, K2Node_DynamicCast_AsLCharacter) == 0x000028, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::K2Node_DynamicCast_AsLCharacter' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, K2Node_SwitchName_CmpSuccess) == 0x000031, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, K2Node_DynamicCast_AsLProjectile) == 0x000038, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::K2Node_DynamicCast_AsLProjectile' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, K2Node_DynamicCast_AsLPCCharacter) == 0x000048, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::K2Node_DynamicCast_AsLPCCharacter' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, K2Node_DynamicCast_bSuccess_2) == 0x000050, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, CallFunc_FindSkillHitInfoByNameBP_ReturnValue) == 0x000058, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::CallFunc_FindSkillHitInfoByNameBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, CallFunc_FindActionState_ReturnValue) == 0x000060, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::CallFunc_FindActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, CallFunc_GetHitMotionType_ReturnValue) == 0x000061, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::CallFunc_GetHitMotionType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000062, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, CallFunc_GetSkillHitType_ReturnValue) == 0x000063, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::CallFunc_GetSkillHitType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, CallFunc_Not_PreBool_ReturnValue) == 0x000064, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000065, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000066, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000067, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, CallFunc_BooleanOR_ReturnValue) == 0x000068, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, CallFunc_BooleanAND_ReturnValue) == 0x000069, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, CallFunc_BooleanOR_ReturnValue_1) == 0x00006A, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, K2Node_CreateDelegate_OutputDelegate) == 0x00006C, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, K2Node_DynamicCast_AsLCharacter_1) == 0x000080, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::K2Node_DynamicCast_AsLCharacter_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, K2Node_DynamicCast_bSuccess_3) == 0x000088, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, CallFunc_PlayHitActionBP_Branches) == 0x000089, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::CallFunc_PlayHitActionBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, CallFunc_PlayHitActionBP_ReturnValue) == 0x000090, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::CallFunc_PlayHitActionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter, K2Node_SwitchEnum_CmpSuccess) == 0x000098, "Member 'BP_Action_Skill_RushCounter_C_ExecuteUbergraph_BP_Action_Skill_RushCounter::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_Action_Skill_RushCounter.BP_Action_Skill_RushCounter_C.Hit
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_Skill_RushCounter_C_Hit final
{
public:
	class ULHitProcContext*                       HitContext;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Skill_RushCounter_C_Hit) == 0x000008, "Wrong alignment on BP_Action_Skill_RushCounter_C_Hit");
static_assert(sizeof(BP_Action_Skill_RushCounter_C_Hit) == 0x000008, "Wrong size on BP_Action_Skill_RushCounter_C_Hit");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_Hit, HitContext) == 0x000000, "Member 'BP_Action_Skill_RushCounter_C_Hit::HitContext' has a wrong offset!");

// Function BP_Action_Skill_RushCounter.BP_Action_Skill_RushCounter_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_Skill_RushCounter_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Skill_RushCounter_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_Skill_RushCounter_C_OnStop");
static_assert(sizeof(BP_Action_Skill_RushCounter_C_OnStop) == 0x000010, "Wrong size on BP_Action_Skill_RushCounter_C_OnStop");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_Skill_RushCounter_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Skill_RushCounter_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_Skill_RushCounter_C_OnStop::Reason' has a wrong offset!");

}

