#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Guard

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_Guard.BP_Action_Guard_C
// 0x0018 (0x0270 - 0x0258)
class UBP_Action_Guard_C final : public ULAction_LoopAnim
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   UndoSprintCommand;                                 // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Cached_FromGuardHit;                               // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Action_Guard(int32 EntryPoint);
	void OnStopByMe(class ULActBase* StoppingAction);
	void OnStop(class ULActBase* ReasonAction, class FName Reason);
	void OnStart();
	bool OnLanded(class ACharacter* LandingChar, const struct FHitResult& Hit);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Action_Guard_C">();
	}
	static class UBP_Action_Guard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_Guard_C>();
	}
};
static_assert(alignof(UBP_Action_Guard_C) == 0x000008, "Wrong alignment on UBP_Action_Guard_C");
static_assert(sizeof(UBP_Action_Guard_C) == 0x000270, "Wrong size on UBP_Action_Guard_C");
static_assert(offsetof(UBP_Action_Guard_C, UberGraphFrame) == 0x000258, "Member 'UBP_Action_Guard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Action_Guard_C, UndoSprintCommand) == 0x000260, "Member 'UBP_Action_Guard_C::UndoSprintCommand' has a wrong offset!");
static_assert(offsetof(UBP_Action_Guard_C, Cached_FromGuardHit) == 0x000268, "Member 'UBP_Action_Guard_C::Cached_FromGuardHit' has a wrong offset!");

}

