#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_UseGrinder_Element

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"
#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_UseGrinder_Element.BP_Action_UseGrinder_Element_C.ExecuteUbergraph_BP_Action_UseGrinder_Element
// 0x0120 (0x0120 - 0x0000)
struct BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActPayloadBase*                       CallFunc_GetActPayload_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActPayload_UseItem*                   K2Node_DynamicCast_AsLAct_Payload_Use_Item;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Event_Montage;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MontageInstanceID;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionStopReason_PayloadInvalid_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Stop_ReturnValue_1;                       // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetReadyToUseItem_OutUseCount;            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 CallFunc_GetReadyToUseItem_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Stop_ReturnValue_2;                       // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 CallFunc_GetComplexItem_Unit_ReturnValue;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayTargetAnimBP_Branches;                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayTargetAnimBP_ReturnValue;             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemConsumeInfoPtr                    CallFunc_GetConsumeInfo_ReturnValue;               // 0x00A8(0x0008)(NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetUseSkillCodeName_ReturnValue;          // 0x00B4(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSkillInfoPtr                          CallFunc_FindSkillInfoByNameBP_ReturnValue;        // 0x00C0(0x0008)(NoDestructor)
	class FString                                 CallFunc_GetAnimName_ReturnValue;                  // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FItemConsumeInfoPtr                    CallFunc_GetConsumeInfo_ReturnValue_1;             // 0x00E8(0x0008)(NoDestructor)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetUseSkillCodeName_ReturnValue_1;        // 0x00F8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetCommonAnim_ReturnValue;                // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      CallFunc_GetSkillAnim_ReturnValue;                 // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_AllowInput_Movement_Forced_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLGameObjectHandle                     CallFunc_AddActionState_AutoRemove_ReturnValue;    // 0x0118(0x0004)(NoDestructor)
};
static_assert(alignof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element) == 0x000008, "Wrong alignment on BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element");
static_assert(sizeof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element) == 0x000120, "Wrong size on BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, EntryPoint) == 0x000000, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, K2Node_Event_ReasonAction) == 0x000010, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, K2Node_Event_Reason) == 0x000018, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_GetActPayload_ReturnValue) == 0x000020, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_GetActPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, K2Node_DynamicCast_AsLAct_Payload_Use_Item) == 0x000030, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::K2Node_DynamicCast_AsLAct_Payload_Use_Item' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_Stop_ReturnValue) == 0x000039, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, K2Node_Event_Montage) == 0x000040, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::K2Node_Event_Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, K2Node_Event_bInterrupted) == 0x000048, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::K2Node_Event_bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, K2Node_Event_MontageInstanceID) == 0x00004C, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::K2Node_Event_MontageInstanceID' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_ActionStopReason_PayloadInvalid_ReturnValue) == 0x000050, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_ActionStopReason_PayloadInvalid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000058, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_Stop_ReturnValue_1) == 0x000059, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_Stop_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000060, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_IsValid_ReturnValue_1) == 0x000068, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000070, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_GetReadyToUseItem_OutUseCount) == 0x000078, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_GetReadyToUseItem_OutUseCount' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_GetReadyToUseItem_ReturnValue) == 0x000080, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_GetReadyToUseItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue) == 0x000088, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_IsValid_ReturnValue_2) == 0x000090, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_Stop_ReturnValue_2) == 0x000091, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_Stop_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_GetComplexItem_Unit_ReturnValue) == 0x000098, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_GetComplexItem_Unit_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_PlayTargetAnimBP_Branches) == 0x0000A0, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_PlayTargetAnimBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_PlayTargetAnimBP_ReturnValue) == 0x0000A4, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_PlayTargetAnimBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_GetConsumeInfo_ReturnValue) == 0x0000A8, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_GetConsumeInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, K2Node_SwitchEnum_CmpSuccess) == 0x0000B0, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_GetUseSkillCodeName_ReturnValue) == 0x0000B4, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_GetUseSkillCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_IsValid_ReturnValue_3) == 0x0000BC, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_FindSkillInfoByNameBP_ReturnValue) == 0x0000C0, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_FindSkillInfoByNameBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_GetAnimName_ReturnValue) == 0x0000C8, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_GetAnimName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_Replace_ReturnValue) == 0x0000D8, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_GetConsumeInfo_ReturnValue_1) == 0x0000E8, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_GetConsumeInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_Conv_StringToName_ReturnValue) == 0x0000F0, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_GetUseSkillCodeName_ReturnValue_1) == 0x0000F8, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_GetUseSkillCodeName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_GetCommonAnim_ReturnValue) == 0x000100, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_GetCommonAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_GetSkillAnim_ReturnValue) == 0x000108, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_GetSkillAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_ActionState_AllowInput_Movement_Forced_ReturnValue) == 0x000110, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_ActionState_AllowInput_Movement_Forced_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element, CallFunc_AddActionState_AutoRemove_ReturnValue) == 0x000118, "Member 'BP_Action_UseGrinder_Element_C_ExecuteUbergraph_BP_Action_UseGrinder_Element::CallFunc_AddActionState_AutoRemove_ReturnValue' has a wrong offset!");

// Function BP_Action_UseGrinder_Element.BP_Action_UseGrinder_Element_C.OnCurrMontageEnded
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_UseGrinder_Element_C_OnCurrMontageEnded final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MontageInstanceID;                                 // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_UseGrinder_Element_C_OnCurrMontageEnded) == 0x000008, "Wrong alignment on BP_Action_UseGrinder_Element_C_OnCurrMontageEnded");
static_assert(sizeof(BP_Action_UseGrinder_Element_C_OnCurrMontageEnded) == 0x000010, "Wrong size on BP_Action_UseGrinder_Element_C_OnCurrMontageEnded");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_OnCurrMontageEnded, Montage) == 0x000000, "Member 'BP_Action_UseGrinder_Element_C_OnCurrMontageEnded::Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_OnCurrMontageEnded, bInterrupted) == 0x000008, "Member 'BP_Action_UseGrinder_Element_C_OnCurrMontageEnded::bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_OnCurrMontageEnded, MontageInstanceID) == 0x00000C, "Member 'BP_Action_UseGrinder_Element_C_OnCurrMontageEnded::MontageInstanceID' has a wrong offset!");

// Function BP_Action_UseGrinder_Element.BP_Action_UseGrinder_Element_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_UseGrinder_Element_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_UseGrinder_Element_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_UseGrinder_Element_C_OnStop");
static_assert(sizeof(BP_Action_UseGrinder_Element_C_OnStop) == 0x000010, "Wrong size on BP_Action_UseGrinder_Element_C_OnStop");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_UseGrinder_Element_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_UseGrinder_Element_C_OnStop::Reason' has a wrong offset!");

// Function BP_Action_UseGrinder_Element.BP_Action_UseGrinder_Element_C.OnPreProcessAction
// 0x0110 (0x0110 - 0x0000)
struct BP_Action_UseGrinder_Element_C_OnPreProcessAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULUISystem*                             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0018(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 CallFunc_GetComplexItem_Unit_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALWeapon*                               CallFunc_GetWeaponByAttachPoint_ReturnValue;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemBladeInfoPtr                      CallFunc_GetBladeInfo_ReturnValue;                 // 0x0050(0x0008)(NoDestructor)
	struct FItemBladeInfoPtr                      CallFunc_GetBladeInfo_ReturnValue_1;               // 0x0058(0x0008)(NoDestructor)
	bool                                          CallFunc_GetAbnormalElementDisable_ReturnValue;    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAbnormalElementDisable_ReturnValue_1;  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemBladeInfoPtr                      CallFunc_GetBladeInfo_ReturnValue_2;               // 0x0068(0x0008)(NoDestructor)
	bool                                          CallFunc_GetAbnormalEnchantDisable_ReturnValue;    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetReadyToUseItem_OutUseCount;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 CallFunc_GetReadyToUseItem_ReturnValue;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemConsumeInfoPtr                    CallFunc_GetConsumeInfo_ReturnValue;               // 0x0098(0x0008)(NoDestructor)
	ELItemComplexGroup                            CallFunc_GetComplexGroup_ReturnValue;              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCount_ReturnValue;                     // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemConsumeInfoPtr                    CallFunc_GetConsumeInfo_ReturnValue_1;             // 0x00B0(0x0008)(NoDestructor)
	class FName                                   CallFunc_GetBuffCodeName_ReturnValue;              // 0x00B8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 CallFunc_GetComplexItem_Unit_ReturnValue_1;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAbnormalStateCommonInfoPtr            CallFunc_FindAbnormalStateCommonInfoByNameBP_ReturnValue; // 0x00C8(0x0008)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELElementDamageType                           CallFunc_GetWeaponElementOverride_ReturnValue;     // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D3[0x5];                                       // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemConsumeInfoPtr                    CallFunc_GetConsumeInfo_ReturnValue_2;             // 0x00D8(0x0008)(NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetBuffCodeName_ReturnValue_1;            // 0x00E4(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAbnormalStateCommonInfoPtr            CallFunc_FindAbnormalStateCommonInfoByNameBP_ReturnValue_1; // 0x00F0(0x0008)(NoDestructor)
	ELElementDamageType                           CallFunc_GetWeaponElementOverride_ReturnValue_1;   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FB[0x1];                                       // 0x00FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCount_ReturnValue_1;                   // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetReadyToUseItem_OutUseCount_1;          // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 CallFunc_GetReadyToUseItem_ReturnValue_1;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_UseGrinder_Element_C_OnPreProcessAction) == 0x000008, "Wrong alignment on BP_Action_UseGrinder_Element_C_OnPreProcessAction");
static_assert(sizeof(BP_Action_UseGrinder_Element_C_OnPreProcessAction) == 0x000110, "Wrong size on BP_Action_UseGrinder_Element_C_OnPreProcessAction");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_OnPreProcessAction, ReturnValue) == 0x000000, "Member 'BP_Action_UseGrinder_Element_C_OnPreProcessAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseGrinder_Element_C_OnPreProcessAction, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BP_Action_UseGrinder_Element_C_OnPreProcessAction::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
