#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Raxasia_WeaponCheckSkillUse04

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_Raxasia_WeaponCheckSkillUse04.BP_Action_Raxasia_WeaponCheckSkillUse04_C.ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04
// 0x0048 (0x0048 - 0x0000)
struct BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALNPCCharacter*                         K2Node_DynamicCast_AsLNPCCharacter;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALNPCController*                        CallFunc_Get_ReturnValue;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALWeapon*                               CallFunc_GetWeaponByAttachPoint_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemWeaponMonsterPtr                  CallFunc_GetMonsterWeaponInfo_ReturnValue;         // 0x0028(0x0008)(NoDestructor)
	class FName                                   CallFunc_GetCodeName_ReturnValue;                  // 0x0030(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSkillCooltime_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSkillCooltime_ReturnValue_1;            // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckTargetRangeHeightAngleDist_PrimaryAngle_ReturnValue; // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckTargetRangeHeightAngleDist_PrimaryAngle_ReturnValue_1; // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue_1;       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04) == 0x000008, "Wrong alignment on BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04");
static_assert(sizeof(BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04) == 0x000048, "Wrong size on BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04");
static_assert(offsetof(BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04, EntryPoint) == 0x000000, "Member 'BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000004, "Member 'BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04, K2Node_DynamicCast_AsLNPCCharacter) == 0x000008, "Member 'BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04::K2Node_DynamicCast_AsLNPCCharacter' has a wrong offset!");
static_assert(offsetof(BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000011, "Member 'BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04, CallFunc_Get_ReturnValue) == 0x000018, "Member 'BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04, CallFunc_GetWeaponByAttachPoint_ReturnValue) == 0x000020, "Member 'BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04::CallFunc_GetWeaponByAttachPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04, CallFunc_GetMonsterWeaponInfo_ReturnValue) == 0x000028, "Member 'BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04::CallFunc_GetMonsterWeaponInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04, CallFunc_GetCodeName_ReturnValue) == 0x000030, "Member 'BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04::CallFunc_GetCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04, CallFunc_IsSkillCooltime_ReturnValue) == 0x000038, "Member 'BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04::CallFunc_IsSkillCooltime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000039, "Member 'BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04, CallFunc_IsSkillCooltime_ReturnValue_1) == 0x00003A, "Member 'BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04::CallFunc_IsSkillCooltime_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04, CallFunc_CheckTargetRangeHeightAngleDist_PrimaryAngle_ReturnValue) == 0x00003B, "Member 'BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04::CallFunc_CheckTargetRangeHeightAngleDist_PrimaryAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04, CallFunc_CheckTargetRangeHeightAngleDist_PrimaryAngle_ReturnValue_1) == 0x00003C, "Member 'BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04::CallFunc_CheckTargetRangeHeightAngleDist_PrimaryAngle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04, CallFunc_RandomIntegerInRange_ReturnValue_1) == 0x000040, "Member 'BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04::CallFunc_RandomIntegerInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04, CallFunc_BooleanAND_ReturnValue) == 0x000044, "Member 'BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000045, "Member 'BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04, CallFunc_BooleanAND_ReturnValue_1) == 0x000046, "Member 'BP_Action_Raxasia_WeaponCheckSkillUse04_C_ExecuteUbergraph_BP_Action_Raxasia_WeaponCheckSkillUse04::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

}

