#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_LockOnDash

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_LockOnDash.BP_Action_LockOnDash_C
// 0x0078 (0x02D0 - 0x0258)
class UBP_Action_LockOnDash_C : public ULAction_LoopAnim
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FLGameObjectHandle                     RootMotionScalingHandle_Freeze;                    // 0x0260(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FLGameObjectHandle                     TfModifierHandle_SideMove;                         // 0x0264(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         Cached_LeverAngle;                                 // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Cached_Lever;                                      // 0x026C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Option_RotationTime;                               // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_StartLocation;                                // 0x027C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Hurt_Dash;                                      // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   LockOnDash_F;                                      // 0x028C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LockOnDash_B;                                      // 0x0294(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LockOnDash_R;                                      // 0x029C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LockOnDash_L;                                      // 0x02A4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DashHurt_F;                                        // 0x02AC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DashHurt_B;                                        // 0x02B4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DashHurt_R;                                        // 0x02BC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   DashHurt_L;                                        // 0x02C4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Action_LockOnDash(int32 EntryPoint);
	void OnStopByMe(class ULActBase* StoppingAction);
	void OnStart();
	void OnStop(class ULActBase* ReasonAction, class FName Reason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Action_LockOnDash_C">();
	}
	static class UBP_Action_LockOnDash_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_LockOnDash_C>();
	}
};
static_assert(alignof(UBP_Action_LockOnDash_C) == 0x000008, "Wrong alignment on UBP_Action_LockOnDash_C");
static_assert(sizeof(UBP_Action_LockOnDash_C) == 0x0002D0, "Wrong size on UBP_Action_LockOnDash_C");
static_assert(offsetof(UBP_Action_LockOnDash_C, UberGraphFrame) == 0x000258, "Member 'UBP_Action_LockOnDash_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Action_LockOnDash_C, RootMotionScalingHandle_Freeze) == 0x000260, "Member 'UBP_Action_LockOnDash_C::RootMotionScalingHandle_Freeze' has a wrong offset!");
static_assert(offsetof(UBP_Action_LockOnDash_C, TfModifierHandle_SideMove) == 0x000264, "Member 'UBP_Action_LockOnDash_C::TfModifierHandle_SideMove' has a wrong offset!");
static_assert(offsetof(UBP_Action_LockOnDash_C, Cached_LeverAngle) == 0x000268, "Member 'UBP_Action_LockOnDash_C::Cached_LeverAngle' has a wrong offset!");
static_assert(offsetof(UBP_Action_LockOnDash_C, Cached_Lever) == 0x00026C, "Member 'UBP_Action_LockOnDash_C::Cached_Lever' has a wrong offset!");
static_assert(offsetof(UBP_Action_LockOnDash_C, Option_RotationTime) == 0x000278, "Member 'UBP_Action_LockOnDash_C::Option_RotationTime' has a wrong offset!");
static_assert(offsetof(UBP_Action_LockOnDash_C, Temp_StartLocation) == 0x00027C, "Member 'UBP_Action_LockOnDash_C::Temp_StartLocation' has a wrong offset!");
static_assert(offsetof(UBP_Action_LockOnDash_C, Is_Hurt_Dash) == 0x000288, "Member 'UBP_Action_LockOnDash_C::Is_Hurt_Dash' has a wrong offset!");
static_assert(offsetof(UBP_Action_LockOnDash_C, LockOnDash_F) == 0x00028C, "Member 'UBP_Action_LockOnDash_C::LockOnDash_F' has a wrong offset!");
static_assert(offsetof(UBP_Action_LockOnDash_C, LockOnDash_B) == 0x000294, "Member 'UBP_Action_LockOnDash_C::LockOnDash_B' has a wrong offset!");
static_assert(offsetof(UBP_Action_LockOnDash_C, LockOnDash_R) == 0x00029C, "Member 'UBP_Action_LockOnDash_C::LockOnDash_R' has a wrong offset!");
static_assert(offsetof(UBP_Action_LockOnDash_C, LockOnDash_L) == 0x0002A4, "Member 'UBP_Action_LockOnDash_C::LockOnDash_L' has a wrong offset!");
static_assert(offsetof(UBP_Action_LockOnDash_C, DashHurt_F) == 0x0002AC, "Member 'UBP_Action_LockOnDash_C::DashHurt_F' has a wrong offset!");
static_assert(offsetof(UBP_Action_LockOnDash_C, DashHurt_B) == 0x0002B4, "Member 'UBP_Action_LockOnDash_C::DashHurt_B' has a wrong offset!");
static_assert(offsetof(UBP_Action_LockOnDash_C, DashHurt_R) == 0x0002BC, "Member 'UBP_Action_LockOnDash_C::DashHurt_R' has a wrong offset!");
static_assert(offsetof(UBP_Action_LockOnDash_C, DashHurt_L) == 0x0002C4, "Member 'UBP_Action_LockOnDash_C::DashHurt_L' has a wrong offset!");

}

