#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_SlaveArm_AcidGranade

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_Action_SlaveArm_classes.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_SlaveArm_AcidGranade.BP_Action_SlaveArm_AcidGranade_C
// 0x0010 (0x02A0 - 0x0290)
class UBP_Action_SlaveArm_AcidGranade_C final : public UBP_Action_SlaveArm_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Action_SlaveArm_AcidGranade_C;   // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Shot;                                              // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ChargeOn;                                          // 0x0299(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ChangeOn;                                          // 0x029A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ExposionAcid;                                      // 0x029B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          KeyReleased;                                       // 0x029C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Action_SlaveArm_AcidGranade(int32 EntryPoint);
	void OnTick(float DeltaTime);
	void OnCommandOccurred_Event(class ULActMgrComponent* ActMgrComponent, class AActor* TargetActor, class FName Command, const struct FVector& Lever, bool SkipCommandPrerequisitiesCheck);
	void OnStop(class ULActBase* ReasonAction, class FName Reason);
	void OnStart();
	void SetReinforcedVariableValue(class FName VariableName, class FName Value);
	void ClearReinforcedVariableValues();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Action_SlaveArm_AcidGranade_C">();
	}
	static class UBP_Action_SlaveArm_AcidGranade_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_SlaveArm_AcidGranade_C>();
	}
};
static_assert(alignof(UBP_Action_SlaveArm_AcidGranade_C) == 0x000008, "Wrong alignment on UBP_Action_SlaveArm_AcidGranade_C");
static_assert(sizeof(UBP_Action_SlaveArm_AcidGranade_C) == 0x0002A0, "Wrong size on UBP_Action_SlaveArm_AcidGranade_C");
static_assert(offsetof(UBP_Action_SlaveArm_AcidGranade_C, UberGraphFrame_BP_Action_SlaveArm_AcidGranade_C) == 0x000290, "Member 'UBP_Action_SlaveArm_AcidGranade_C::UberGraphFrame_BP_Action_SlaveArm_AcidGranade_C' has a wrong offset!");
static_assert(offsetof(UBP_Action_SlaveArm_AcidGranade_C, Shot) == 0x000298, "Member 'UBP_Action_SlaveArm_AcidGranade_C::Shot' has a wrong offset!");
static_assert(offsetof(UBP_Action_SlaveArm_AcidGranade_C, ChargeOn) == 0x000299, "Member 'UBP_Action_SlaveArm_AcidGranade_C::ChargeOn' has a wrong offset!");
static_assert(offsetof(UBP_Action_SlaveArm_AcidGranade_C, ChangeOn) == 0x00029A, "Member 'UBP_Action_SlaveArm_AcidGranade_C::ChangeOn' has a wrong offset!");
static_assert(offsetof(UBP_Action_SlaveArm_AcidGranade_C, ExposionAcid) == 0x00029B, "Member 'UBP_Action_SlaveArm_AcidGranade_C::ExposionAcid' has a wrong offset!");
static_assert(offsetof(UBP_Action_SlaveArm_AcidGranade_C, KeyReleased) == 0x00029C, "Member 'UBP_Action_SlaveArm_AcidGranade_C::KeyReleased' has a wrong offset!");

}

