#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_JumpSkill_Data_Jump12

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct BP_Action_JumpSkill_Data_Jump12.BP_Action_JumpSkill_Data_Jump12
// 0x0028 (0x0028 - 0x0000)
struct FBP_Action_JumpSkill_Data_Jump12 final
{
public:
	struct FVector                                Option_MeshMove_Move_2_7FE07F2A45AFD20001704080AC87EEC2; // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MoveMeshStartTime_5_63AAB3BD48748CFA7A8554AC59FB5345; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Move_dist_7_5DD348294719D27674334DA0317F9917;      // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimSequenceBase*>              TargetAnimArray_14_49D51D6749C8BF364EAD63864FD9E71A; // 0x0018(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FBP_Action_JumpSkill_Data_Jump12) == 0x000008, "Wrong alignment on FBP_Action_JumpSkill_Data_Jump12");
static_assert(sizeof(FBP_Action_JumpSkill_Data_Jump12) == 0x000028, "Wrong size on FBP_Action_JumpSkill_Data_Jump12");
static_assert(offsetof(FBP_Action_JumpSkill_Data_Jump12, Option_MeshMove_Move_2_7FE07F2A45AFD20001704080AC87EEC2) == 0x000000, "Member 'FBP_Action_JumpSkill_Data_Jump12::Option_MeshMove_Move_2_7FE07F2A45AFD20001704080AC87EEC2' has a wrong offset!");
static_assert(offsetof(FBP_Action_JumpSkill_Data_Jump12, MoveMeshStartTime_5_63AAB3BD48748CFA7A8554AC59FB5345) == 0x00000C, "Member 'FBP_Action_JumpSkill_Data_Jump12::MoveMeshStartTime_5_63AAB3BD48748CFA7A8554AC59FB5345' has a wrong offset!");
static_assert(offsetof(FBP_Action_JumpSkill_Data_Jump12, Move_dist_7_5DD348294719D27674334DA0317F9917) == 0x000010, "Member 'FBP_Action_JumpSkill_Data_Jump12::Move_dist_7_5DD348294719D27674334DA0317F9917' has a wrong offset!");
static_assert(offsetof(FBP_Action_JumpSkill_Data_Jump12, TargetAnimArray_14_49D51D6749C8BF364EAD63864FD9E71A) == 0x000018, "Member 'FBP_Action_JumpSkill_Data_Jump12::TargetAnimArray_14_49D51D6749C8BF364EAD63864FD9E71A' has a wrong offset!");

}

