#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_SlaveArm_GrappleGun_JumpSmash

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_Action_SlaveArm_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_SlaveArm_GrappleGun_JumpSmash.BP_Action_SlaveArm_GrappleGun_JumpSmash_C
// 0x0030 (0x02C0 - 0x0290)
class UBP_Action_SlaveArm_GrappleGun_JumpSmash_C final : public UBP_Action_SlaveArm_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Action_SlaveArm_GrappleGun_JumpSmash_C; // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FTimerHandle                           PenetrateHandle;                                   // 0x0298(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bLandingStart;                                     // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TargetActor;                                       // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Cached_Location;                                   // 0x02B0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Action_SlaveArm_GrappleGun_JumpSmash(int32 EntryPoint);
	void OnTick(float DeltaTime);
	void ___t___0();
	void OnStop(class ULActBase* ReasonAction, class FName Reason);
	void OnStart();
	bool OnLanded(class ACharacter* LandingChar, const struct FHitResult& Hit);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Action_SlaveArm_GrappleGun_JumpSmash_C">();
	}
	static class UBP_Action_SlaveArm_GrappleGun_JumpSmash_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_SlaveArm_GrappleGun_JumpSmash_C>();
	}
};
static_assert(alignof(UBP_Action_SlaveArm_GrappleGun_JumpSmash_C) == 0x000008, "Wrong alignment on UBP_Action_SlaveArm_GrappleGun_JumpSmash_C");
static_assert(sizeof(UBP_Action_SlaveArm_GrappleGun_JumpSmash_C) == 0x0002C0, "Wrong size on UBP_Action_SlaveArm_GrappleGun_JumpSmash_C");
static_assert(offsetof(UBP_Action_SlaveArm_GrappleGun_JumpSmash_C, UberGraphFrame_BP_Action_SlaveArm_GrappleGun_JumpSmash_C) == 0x000290, "Member 'UBP_Action_SlaveArm_GrappleGun_JumpSmash_C::UberGraphFrame_BP_Action_SlaveArm_GrappleGun_JumpSmash_C' has a wrong offset!");
static_assert(offsetof(UBP_Action_SlaveArm_GrappleGun_JumpSmash_C, PenetrateHandle) == 0x000298, "Member 'UBP_Action_SlaveArm_GrappleGun_JumpSmash_C::PenetrateHandle' has a wrong offset!");
static_assert(offsetof(UBP_Action_SlaveArm_GrappleGun_JumpSmash_C, bLandingStart) == 0x0002A0, "Member 'UBP_Action_SlaveArm_GrappleGun_JumpSmash_C::bLandingStart' has a wrong offset!");
static_assert(offsetof(UBP_Action_SlaveArm_GrappleGun_JumpSmash_C, TargetActor) == 0x0002A8, "Member 'UBP_Action_SlaveArm_GrappleGun_JumpSmash_C::TargetActor' has a wrong offset!");
static_assert(offsetof(UBP_Action_SlaveArm_GrappleGun_JumpSmash_C, Cached_Location) == 0x0002B0, "Member 'UBP_Action_SlaveArm_GrappleGun_JumpSmash_C::Cached_Location' has a wrong offset!");

}

