#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Down_Up

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Action_DMG_STAND_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_Down_Up.BP_Action_Down_Up_C
// 0x0028 (0x0698 - 0x0670)
class UBP_Action_Down_Up_C : public UBP_Action_DMG_STAND_C
{
public:
	EMovementMode                                 MovementMode_Cached;                               // 0x0670(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_671[0x7];                                      // 0x0671(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           BoundPeakTimer;                                    // 0x0678(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Bouncing;                                          // 0x0680(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_681[0x7];                                      // 0x0681(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           HitStunningTimer;                                  // 0x0688(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          HitStunningEnd;                                    // 0x0690(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Flying;                                            // 0x0691(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Action_Down_Up_C">();
	}
	static class UBP_Action_Down_Up_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_Down_Up_C>();
	}
};
static_assert(alignof(UBP_Action_Down_Up_C) == 0x000008, "Wrong alignment on UBP_Action_Down_Up_C");
static_assert(sizeof(UBP_Action_Down_Up_C) == 0x000698, "Wrong size on UBP_Action_Down_Up_C");
static_assert(offsetof(UBP_Action_Down_Up_C, MovementMode_Cached) == 0x000670, "Member 'UBP_Action_Down_Up_C::MovementMode_Cached' has a wrong offset!");
static_assert(offsetof(UBP_Action_Down_Up_C, BoundPeakTimer) == 0x000678, "Member 'UBP_Action_Down_Up_C::BoundPeakTimer' has a wrong offset!");
static_assert(offsetof(UBP_Action_Down_Up_C, Bouncing) == 0x000680, "Member 'UBP_Action_Down_Up_C::Bouncing' has a wrong offset!");
static_assert(offsetof(UBP_Action_Down_Up_C, HitStunningTimer) == 0x000688, "Member 'UBP_Action_Down_Up_C::HitStunningTimer' has a wrong offset!");
static_assert(offsetof(UBP_Action_Down_Up_C, HitStunningEnd) == 0x000690, "Member 'UBP_Action_Down_Up_C::HitStunningEnd' has a wrong offset!");
static_assert(offsetof(UBP_Action_Down_Up_C, Flying) == 0x000691, "Member 'UBP_Action_Down_Up_C::Flying' has a wrong offset!");

}

