#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AssultSlash

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BP_AssultSlash.BP_AssultSlash_C.ExecuteUbergraph_BP_AssultSlash
// 0x00D8 (0x00D8 - 0x0000)
struct BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlaySkillActionBP_Branches;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_PlaySkillActionBP_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActMgrComponent*                      K2Node_CustomEvent_ActMgrComponent;                // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_TargetActor;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Command;                        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Lever;                          // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SkipCommandPrerequisitiesCheck; // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInst_ReturnValue;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_GetMontage_CurrentSectionBP_Branches;     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetMontage_CurrentSectionBP_ReturnValue;  // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ULActMgrComponent* ActMgrComponent, class AActor* TargetActor, class FName Command, const struct FVector& Lever, bool SkipCommandPrerequisitiesCheck)> K2Node_CreateDelegate_OutputDelegate;              // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_1;                    // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTime;                            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInst_ReturnValue_1;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_GetMontage_CurrentSectionBP_Branches_1;   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetMontage_CurrentSectionBP_ReturnValue_1; // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlaySkillActionBP_Branches_1;             // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_PlaySkillActionBP_ReturnValue_1;          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_2;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCommandPressed_ReturnValue;             // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter;                 // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_PlaySkillActionBP_Branches_2;             // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_PlaySkillActionBP_ReturnValue_2;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentFrenzyUnitCount_ReturnValue;    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_PlaySkillActionBP_Branches_3;             // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C7[0x1];                                       // 0x00C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_PlaySkillActionBP_ReturnValue_3;          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash) == 0x000008, "Wrong alignment on BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash");
static_assert(sizeof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash) == 0x0000D8, "Wrong size on BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, EntryPoint) == 0x000000, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, CallFunc_PlaySkillActionBP_Branches) == 0x000004, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::CallFunc_PlaySkillActionBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, CallFunc_PlaySkillActionBP_ReturnValue) == 0x000008, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::CallFunc_PlaySkillActionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, CallFunc_IsValid_ReturnValue_1) == 0x000012, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, K2Node_Event_ReasonAction) == 0x000018, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, K2Node_Event_Reason) == 0x000020, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, K2Node_CustomEvent_ActMgrComponent) == 0x000028, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::K2Node_CustomEvent_ActMgrComponent' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, K2Node_CustomEvent_TargetActor) == 0x000030, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::K2Node_CustomEvent_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, K2Node_CustomEvent_Command) == 0x000038, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::K2Node_CustomEvent_Command' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, K2Node_CustomEvent_Lever) == 0x000040, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::K2Node_CustomEvent_Lever' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, K2Node_CustomEvent_SkipCommandPrerequisitiesCheck) == 0x00004C, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::K2Node_CustomEvent_SkipCommandPrerequisitiesCheck' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, K2Node_SwitchName_CmpSuccess) == 0x00004D, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, CallFunc_GetAnimInst_ReturnValue) == 0x000050, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::CallFunc_GetAnimInst_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, CallFunc_GetMontage_CurrentSectionBP_Branches) == 0x000058, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::CallFunc_GetMontage_CurrentSectionBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, CallFunc_GetMontage_CurrentSectionBP_ReturnValue) == 0x00005C, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::CallFunc_GetMontage_CurrentSectionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, K2Node_CreateDelegate_OutputDelegate) == 0x000064, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, K2Node_SwitchName_CmpSuccess_1) == 0x000074, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::K2Node_SwitchName_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, K2Node_SwitchEnum_CmpSuccess_1) == 0x000075, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, K2Node_Event_DeltaTime) == 0x000078, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, CallFunc_GetAnimInst_ReturnValue_1) == 0x000080, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::CallFunc_GetAnimInst_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, CallFunc_GetMontage_CurrentSectionBP_Branches_1) == 0x000088, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::CallFunc_GetMontage_CurrentSectionBP_Branches_1' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, CallFunc_GetMontage_CurrentSectionBP_ReturnValue_1) == 0x00008C, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::CallFunc_GetMontage_CurrentSectionBP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, CallFunc_PlaySkillActionBP_Branches_1) == 0x000094, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::CallFunc_PlaySkillActionBP_Branches_1' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, CallFunc_PlaySkillActionBP_ReturnValue_1) == 0x000098, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::CallFunc_PlaySkillActionBP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, K2Node_SwitchName_CmpSuccess_2) == 0x0000A0, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::K2Node_SwitchName_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, K2Node_SwitchEnum_CmpSuccess_2) == 0x0000A1, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, K2Node_SwitchEnum_CmpSuccess_3) == 0x0000A2, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, CallFunc_IsCommandPressed_ReturnValue) == 0x0000A3, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::CallFunc_IsCommandPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, K2Node_DynamicCast_AsLPCCharacter) == 0x0000A8, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::K2Node_DynamicCast_AsLPCCharacter' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, CallFunc_PlaySkillActionBP_Branches_2) == 0x0000B1, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::CallFunc_PlaySkillActionBP_Branches_2' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, CallFunc_PlaySkillActionBP_ReturnValue_2) == 0x0000B8, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::CallFunc_PlaySkillActionBP_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, CallFunc_GetCurrentFrenzyUnitCount_ReturnValue) == 0x0000C0, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::CallFunc_GetCurrentFrenzyUnitCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, K2Node_SwitchEnum_CmpSuccess_4) == 0x0000C4, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000C5, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, CallFunc_PlaySkillActionBP_Branches_3) == 0x0000C6, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::CallFunc_PlaySkillActionBP_Branches_3' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, CallFunc_PlaySkillActionBP_ReturnValue_3) == 0x0000C8, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::CallFunc_PlaySkillActionBP_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash, K2Node_SwitchEnum_CmpSuccess_5) == 0x0000D0, "Member 'BP_AssultSlash_C_ExecuteUbergraph_BP_AssultSlash::K2Node_SwitchEnum_CmpSuccess_5' has a wrong offset!");

// Function BP_AssultSlash.BP_AssultSlash_C.OnTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AssultSlash_C_OnTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AssultSlash_C_OnTick) == 0x000004, "Wrong alignment on BP_AssultSlash_C_OnTick");
static_assert(sizeof(BP_AssultSlash_C_OnTick) == 0x000004, "Wrong size on BP_AssultSlash_C_OnTick");
static_assert(offsetof(BP_AssultSlash_C_OnTick, DeltaTime) == 0x000000, "Member 'BP_AssultSlash_C_OnTick::DeltaTime' has a wrong offset!");

// Function BP_AssultSlash.BP_AssultSlash_C.OnCommandOccurred_Event
// 0x0028 (0x0028 - 0x0000)
struct BP_AssultSlash_C_OnCommandOccurred_Event final
{
public:
	class ULActMgrComponent*                      ActMgrComponent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Command;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Lever;                                             // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipCommandPrerequisitiesCheck;                    // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AssultSlash_C_OnCommandOccurred_Event) == 0x000008, "Wrong alignment on BP_AssultSlash_C_OnCommandOccurred_Event");
static_assert(sizeof(BP_AssultSlash_C_OnCommandOccurred_Event) == 0x000028, "Wrong size on BP_AssultSlash_C_OnCommandOccurred_Event");
static_assert(offsetof(BP_AssultSlash_C_OnCommandOccurred_Event, ActMgrComponent) == 0x000000, "Member 'BP_AssultSlash_C_OnCommandOccurred_Event::ActMgrComponent' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_OnCommandOccurred_Event, TargetActor) == 0x000008, "Member 'BP_AssultSlash_C_OnCommandOccurred_Event::TargetActor' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_OnCommandOccurred_Event, Command) == 0x000010, "Member 'BP_AssultSlash_C_OnCommandOccurred_Event::Command' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_OnCommandOccurred_Event, Lever) == 0x000018, "Member 'BP_AssultSlash_C_OnCommandOccurred_Event::Lever' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_OnCommandOccurred_Event, SkipCommandPrerequisitiesCheck) == 0x000024, "Member 'BP_AssultSlash_C_OnCommandOccurred_Event::SkipCommandPrerequisitiesCheck' has a wrong offset!");

// Function BP_AssultSlash.BP_AssultSlash_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_AssultSlash_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AssultSlash_C_OnStop) == 0x000008, "Wrong alignment on BP_AssultSlash_C_OnStop");
static_assert(sizeof(BP_AssultSlash_C_OnStop) == 0x000010, "Wrong size on BP_AssultSlash_C_OnStop");
static_assert(offsetof(BP_AssultSlash_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_AssultSlash_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_AssultSlash_C_OnStop, Reason) == 0x000008, "Member 'BP_AssultSlash_C_OnStop::Reason' has a wrong offset!");

}

