#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Climb_New

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_Climb_New.BP_Action_Climb_New_C
// 0x01D0 (0x0440 - 0x0270)
class UBP_Action_Climb_New_C final : public ULAction_MultiAnim
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimMontage*                           SourceMontage_Up_Start;                            // 0x0278(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           SourceMontage_Up_Right;                            // 0x0280(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           SourceMontage_Up_Right_Fast;                       // 0x0288(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           SourceMontage_Up_Right_End;                        // 0x0290(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           SourceMontage_Idle_Right;                          // 0x0298(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           SourceMontage_Up_Left;                             // 0x02A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           SourceMontage_Up_Left_Fast;                        // 0x02A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           SourceMontage_Up_Left_End;                         // 0x02B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           SourceMontage_Idle_Left;                           // 0x02B8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           SourceMontage_Down_Start;                          // 0x02C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           SourceMontage_Down_Right;                          // 0x02C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           SourceMontage_Down_Right_End;                      // 0x02D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           SourceMontage_Down_Left;                           // 0x02D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           SourceMontage_Down_Left_End;                       // 0x02E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           SourceMontage_Down_Fast_Start;                     // 0x02E8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           SourceMontage_Down_Fast_Loop;                      // 0x02F0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           SourceMontage_Down_Fast_Stop;                      // 0x02F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           SourceMontage_Down_Fast_End;                       // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Option_StepHeight;                                 // 0x0308(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Option_StartSync_Duration;                         // 0x030C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Option_FastMoveSpeedForDown;                       // 0x0310(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Option_ShowDebugVisualize;                         // 0x0314(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Option_ShowDebugLog;                               // 0x0315(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Cached_MoveUp;                                     // 0x0316(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Cached_GrabLeft;                                   // 0x0317(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Cached_FastMoveDown_Interupted;                    // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Cached_ForceMove_StartTime;                        // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cached_ForceMove_Duration;                         // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cached_EventTimer_StartTime;                       // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cached_EventTimer_Duration;                        // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Cached_PlayingMontage;                             // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPropLadderSpot*                       Cached_LadderSpot;                                 // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Cached_Ladder_ActionState;                         // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Cached_LadderStep_Current;                         // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Cached_LadderStep_Max;                             // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Cached_Ladder_StartForUp;                          // 0x0350(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             Cached_Ladder_StartForDown;                        // 0x0380(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<struct FTransform>                     Cached_Ladder_StepArray;                           // 0x03B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTransform                             Cached_Move_Position_Start;                        // 0x03C0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             Cached_Move_Position_End;                          // 0x03F0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UAudioComponent*                        Cached_LadderFastDownSound;                        // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Cached_LadderFastDownFx;                           // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPropComponent*                        Cached_PropComponent;                              // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Action_Climb_New(int32 EntryPoint);
	void FastDownEffectSpawn();
	void FastDownEffectStop();
	void DoExit(bool FromFastMove);
	void DoIdle();
	void OnAbsoluteRootMotionFinished(class UAnimMontage* Montage, bool bInterrupted, int32 MontageInstanceID);
	void OnCurrMontageBlendOutStarted(class UAnimMontage* Montage, bool bInterrupted, int32 MontageInstanceID);
	void OnTick(float DeltaTime);
	void OnCurrMontageEnded(class UAnimMontage* Montage, bool bInterrupted, int32 MontageInstanceID);
	void OnStop(class ULActBase* ReasonAction, class FName Reason);
	void OnStart();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Action_Climb_New_C">();
	}
	static class UBP_Action_Climb_New_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_Climb_New_C>();
	}
};
static_assert(alignof(UBP_Action_Climb_New_C) == 0x000010, "Wrong alignment on UBP_Action_Climb_New_C");
static_assert(sizeof(UBP_Action_Climb_New_C) == 0x000440, "Wrong size on UBP_Action_Climb_New_C");
static_assert(offsetof(UBP_Action_Climb_New_C, UberGraphFrame) == 0x000270, "Member 'UBP_Action_Climb_New_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, SourceMontage_Up_Start) == 0x000278, "Member 'UBP_Action_Climb_New_C::SourceMontage_Up_Start' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, SourceMontage_Up_Right) == 0x000280, "Member 'UBP_Action_Climb_New_C::SourceMontage_Up_Right' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, SourceMontage_Up_Right_Fast) == 0x000288, "Member 'UBP_Action_Climb_New_C::SourceMontage_Up_Right_Fast' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, SourceMontage_Up_Right_End) == 0x000290, "Member 'UBP_Action_Climb_New_C::SourceMontage_Up_Right_End' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, SourceMontage_Idle_Right) == 0x000298, "Member 'UBP_Action_Climb_New_C::SourceMontage_Idle_Right' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, SourceMontage_Up_Left) == 0x0002A0, "Member 'UBP_Action_Climb_New_C::SourceMontage_Up_Left' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, SourceMontage_Up_Left_Fast) == 0x0002A8, "Member 'UBP_Action_Climb_New_C::SourceMontage_Up_Left_Fast' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, SourceMontage_Up_Left_End) == 0x0002B0, "Member 'UBP_Action_Climb_New_C::SourceMontage_Up_Left_End' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, SourceMontage_Idle_Left) == 0x0002B8, "Member 'UBP_Action_Climb_New_C::SourceMontage_Idle_Left' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, SourceMontage_Down_Start) == 0x0002C0, "Member 'UBP_Action_Climb_New_C::SourceMontage_Down_Start' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, SourceMontage_Down_Right) == 0x0002C8, "Member 'UBP_Action_Climb_New_C::SourceMontage_Down_Right' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, SourceMontage_Down_Right_End) == 0x0002D0, "Member 'UBP_Action_Climb_New_C::SourceMontage_Down_Right_End' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, SourceMontage_Down_Left) == 0x0002D8, "Member 'UBP_Action_Climb_New_C::SourceMontage_Down_Left' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, SourceMontage_Down_Left_End) == 0x0002E0, "Member 'UBP_Action_Climb_New_C::SourceMontage_Down_Left_End' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, SourceMontage_Down_Fast_Start) == 0x0002E8, "Member 'UBP_Action_Climb_New_C::SourceMontage_Down_Fast_Start' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, SourceMontage_Down_Fast_Loop) == 0x0002F0, "Member 'UBP_Action_Climb_New_C::SourceMontage_Down_Fast_Loop' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, SourceMontage_Down_Fast_Stop) == 0x0002F8, "Member 'UBP_Action_Climb_New_C::SourceMontage_Down_Fast_Stop' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, SourceMontage_Down_Fast_End) == 0x000300, "Member 'UBP_Action_Climb_New_C::SourceMontage_Down_Fast_End' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, Option_StepHeight) == 0x000308, "Member 'UBP_Action_Climb_New_C::Option_StepHeight' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, Option_StartSync_Duration) == 0x00030C, "Member 'UBP_Action_Climb_New_C::Option_StartSync_Duration' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, Option_FastMoveSpeedForDown) == 0x000310, "Member 'UBP_Action_Climb_New_C::Option_FastMoveSpeedForDown' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, Option_ShowDebugVisualize) == 0x000314, "Member 'UBP_Action_Climb_New_C::Option_ShowDebugVisualize' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, Option_ShowDebugLog) == 0x000315, "Member 'UBP_Action_Climb_New_C::Option_ShowDebugLog' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, Cached_MoveUp) == 0x000316, "Member 'UBP_Action_Climb_New_C::Cached_MoveUp' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, Cached_GrabLeft) == 0x000317, "Member 'UBP_Action_Climb_New_C::Cached_GrabLeft' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, Cached_FastMoveDown_Interupted) == 0x000318, "Member 'UBP_Action_Climb_New_C::Cached_FastMoveDown_Interupted' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, Cached_ForceMove_StartTime) == 0x00031C, "Member 'UBP_Action_Climb_New_C::Cached_ForceMove_StartTime' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, Cached_ForceMove_Duration) == 0x000320, "Member 'UBP_Action_Climb_New_C::Cached_ForceMove_Duration' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, Cached_EventTimer_StartTime) == 0x000324, "Member 'UBP_Action_Climb_New_C::Cached_EventTimer_StartTime' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, Cached_EventTimer_Duration) == 0x000328, "Member 'UBP_Action_Climb_New_C::Cached_EventTimer_Duration' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, Cached_PlayingMontage) == 0x000330, "Member 'UBP_Action_Climb_New_C::Cached_PlayingMontage' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, Cached_LadderSpot) == 0x000338, "Member 'UBP_Action_Climb_New_C::Cached_LadderSpot' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, Cached_Ladder_ActionState) == 0x000340, "Member 'UBP_Action_Climb_New_C::Cached_Ladder_ActionState' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, Cached_LadderStep_Current) == 0x000344, "Member 'UBP_Action_Climb_New_C::Cached_LadderStep_Current' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, Cached_LadderStep_Max) == 0x000348, "Member 'UBP_Action_Climb_New_C::Cached_LadderStep_Max' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, Cached_Ladder_StartForUp) == 0x000350, "Member 'UBP_Action_Climb_New_C::Cached_Ladder_StartForUp' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, Cached_Ladder_StartForDown) == 0x000380, "Member 'UBP_Action_Climb_New_C::Cached_Ladder_StartForDown' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, Cached_Ladder_StepArray) == 0x0003B0, "Member 'UBP_Action_Climb_New_C::Cached_Ladder_StepArray' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, Cached_Move_Position_Start) == 0x0003C0, "Member 'UBP_Action_Climb_New_C::Cached_Move_Position_Start' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, Cached_Move_Position_End) == 0x0003F0, "Member 'UBP_Action_Climb_New_C::Cached_Move_Position_End' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, Cached_LadderFastDownSound) == 0x000420, "Member 'UBP_Action_Climb_New_C::Cached_LadderFastDownSound' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, Cached_LadderFastDownFx) == 0x000428, "Member 'UBP_Action_Climb_New_C::Cached_LadderFastDownFx' has a wrong offset!");
static_assert(offsetof(UBP_Action_Climb_New_C, Cached_PropComponent) == 0x000430, "Member 'UBP_Action_Climb_New_C::Cached_PropComponent' has a wrong offset!");

}

