#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_JumpToFloating

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_JumpToFloating.BP_Action_JumpToFloating_C
// 0x0038 (0x0290 - 0x0258)
class UBP_Action_JumpToFloating_C final : public ULAction_LoopAnim
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         MaxJumpHeight;                                     // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSuccessMoveToCeiling;                             // 0x0264(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bFailMoveToFalling;                                // 0x0265(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bAlreadyCeiling;                                   // 0x0266(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_267[0x1];                                      // 0x0267(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CeilingMoveTargetLocation;                         // 0x0268(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CeilingTraceHeight;                                // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartLocation;                                     // 0x0278(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EndLocation;                                       // 0x0284(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Action_JumpToFloating(int32 EntryPoint);
	void OnReset();
	void OnTick(float DeltaTime);
	void OnStart();
	bool OnPreProcessAction();
	void PrepareJump();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Action_JumpToFloating_C">();
	}
	static class UBP_Action_JumpToFloating_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_JumpToFloating_C>();
	}
};
static_assert(alignof(UBP_Action_JumpToFloating_C) == 0x000008, "Wrong alignment on UBP_Action_JumpToFloating_C");
static_assert(sizeof(UBP_Action_JumpToFloating_C) == 0x000290, "Wrong size on UBP_Action_JumpToFloating_C");
static_assert(offsetof(UBP_Action_JumpToFloating_C, UberGraphFrame) == 0x000258, "Member 'UBP_Action_JumpToFloating_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Action_JumpToFloating_C, MaxJumpHeight) == 0x000260, "Member 'UBP_Action_JumpToFloating_C::MaxJumpHeight' has a wrong offset!");
static_assert(offsetof(UBP_Action_JumpToFloating_C, bSuccessMoveToCeiling) == 0x000264, "Member 'UBP_Action_JumpToFloating_C::bSuccessMoveToCeiling' has a wrong offset!");
static_assert(offsetof(UBP_Action_JumpToFloating_C, bFailMoveToFalling) == 0x000265, "Member 'UBP_Action_JumpToFloating_C::bFailMoveToFalling' has a wrong offset!");
static_assert(offsetof(UBP_Action_JumpToFloating_C, bAlreadyCeiling) == 0x000266, "Member 'UBP_Action_JumpToFloating_C::bAlreadyCeiling' has a wrong offset!");
static_assert(offsetof(UBP_Action_JumpToFloating_C, CeilingMoveTargetLocation) == 0x000268, "Member 'UBP_Action_JumpToFloating_C::CeilingMoveTargetLocation' has a wrong offset!");
static_assert(offsetof(UBP_Action_JumpToFloating_C, CeilingTraceHeight) == 0x000274, "Member 'UBP_Action_JumpToFloating_C::CeilingTraceHeight' has a wrong offset!");
static_assert(offsetof(UBP_Action_JumpToFloating_C, StartLocation) == 0x000278, "Member 'UBP_Action_JumpToFloating_C::StartLocation' has a wrong offset!");
static_assert(offsetof(UBP_Action_JumpToFloating_C, EndLocation) == 0x000284, "Member 'UBP_Action_JumpToFloating_C::EndLocation' has a wrong offset!");

}

