#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ActPayload_FatalAttack

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ActPayload_FatalAttack.BP_ActPayload_FatalAttack_C
// 0x0080 (0x00B0 - 0x0030)
class UBP_ActPayload_FatalAttack_C final : public ULActPayloadBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Victim;                                            // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLFatalAttackInfo                      Cached_FatalAttackInfo;                            // 0x0040(0x0054)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)
	class FName                                   Cached_FatalAttack_ReplacedAnim_BeforeHit;         // 0x0094(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   Cached_FatalAttack_ReplacedAnim;                   // 0x009C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   Cached_FatalAttack_ReplacedAnim_End;               // 0x00A4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ActPayload_FatalAttack(int32 EntryPoint);
	void Reset();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ActPayload_FatalAttack_C">();
	}
	static class UBP_ActPayload_FatalAttack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ActPayload_FatalAttack_C>();
	}
};
static_assert(alignof(UBP_ActPayload_FatalAttack_C) == 0x000008, "Wrong alignment on UBP_ActPayload_FatalAttack_C");
static_assert(sizeof(UBP_ActPayload_FatalAttack_C) == 0x0000B0, "Wrong size on UBP_ActPayload_FatalAttack_C");
static_assert(offsetof(UBP_ActPayload_FatalAttack_C, UberGraphFrame) == 0x000030, "Member 'UBP_ActPayload_FatalAttack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_ActPayload_FatalAttack_C, Victim) == 0x000038, "Member 'UBP_ActPayload_FatalAttack_C::Victim' has a wrong offset!");
static_assert(offsetof(UBP_ActPayload_FatalAttack_C, Cached_FatalAttackInfo) == 0x000040, "Member 'UBP_ActPayload_FatalAttack_C::Cached_FatalAttackInfo' has a wrong offset!");
static_assert(offsetof(UBP_ActPayload_FatalAttack_C, Cached_FatalAttack_ReplacedAnim_BeforeHit) == 0x000094, "Member 'UBP_ActPayload_FatalAttack_C::Cached_FatalAttack_ReplacedAnim_BeforeHit' has a wrong offset!");
static_assert(offsetof(UBP_ActPayload_FatalAttack_C, Cached_FatalAttack_ReplacedAnim) == 0x00009C, "Member 'UBP_ActPayload_FatalAttack_C::Cached_FatalAttack_ReplacedAnim' has a wrong offset!");
static_assert(offsetof(UBP_ActPayload_FatalAttack_C, Cached_FatalAttack_ReplacedAnim_End) == 0x0000A4, "Member 'UBP_ActPayload_FatalAttack_C::Cached_FatalAttack_ReplacedAnim_End' has a wrong offset!");

}

