#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Landing

#include "Basic.hpp"

#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_Landing.BP_Action_Landing_C.ExecuteUbergraph_BP_Action_Landing
// 0x00E0 (0x00E0 - 0x0000)
struct BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_TryLockInput_Movement_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_TryLockInput_Rotation_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetCurrMontageInstanceID_AnimInstance;    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_GetCurrMontageInstanceID_Branches;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrMontageInstanceID_ReturnValue;     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_StoppingAction;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLandingAnimEx_OutOverrideMontageBlendIn; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetLandingAnimEx_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_PlayTargetAnimExBP_Branches;              // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayTargetAnimExBP_ReturnValue;           // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindActionState_ReturnValue;              // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindActionState_ReturnValue_1;            // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayCommomAnimBP_MontageInstanceID;       // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PlayCommomAnimBP_Montage;                 // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayCommomAnimBP_Branches;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayCommomAnimBP_MontageInstanceID_1;     // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_PlayCommomAnimBP_Montage_1;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayCommomAnimBP_Branches_1;              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A3[0x1];                                       // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayCommomAnimBP_MontageInstanceID_2;     // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_PlayCommomAnimBP_Montage_2;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayCommomAnimBP_Branches_2;              // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_FallingFromDownDrag_F_ReturnValue; // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_FallingFromDownDrag_B_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_FallingFromDownDrag_F_ReturnValue_1; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindActionState_ReturnValue_2;            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_FallingFromDownDrag_B_ReturnValue_1; // 0x00D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindActionState_ReturnValue_3;            // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing) == 0x000008, "Wrong alignment on BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing");
static_assert(sizeof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing) == 0x0000E0, "Wrong size on BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, EntryPoint) == 0x000000, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, K2Node_Event_ReasonAction) == 0x000008, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, K2Node_Event_Reason) == 0x000010, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_ActionState_TryLockInput_Movement_ReturnValue) == 0x000018, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_ActionState_TryLockInput_Movement_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_ActionState_TryLockInput_Rotation_ReturnValue) == 0x000020, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_ActionState_TryLockInput_Rotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_GetCurrMontageInstanceID_AnimInstance) == 0x000028, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_GetCurrMontageInstanceID_AnimInstance' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_GetCurrMontageInstanceID_Branches) == 0x000030, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_GetCurrMontageInstanceID_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_GetCurrMontageInstanceID_ReturnValue) == 0x000034, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_GetCurrMontageInstanceID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue) == 0x000038, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, K2Node_SwitchEnum_CmpSuccess) == 0x000040, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_Stop_ReturnValue) == 0x000041, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, K2Node_Event_StoppingAction) == 0x000048, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::K2Node_Event_StoppingAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_GetLandingAnimEx_OutOverrideMontageBlendIn) == 0x000050, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_GetLandingAnimEx_OutOverrideMontageBlendIn' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_GetLandingAnimEx_ReturnValue) == 0x000058, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_GetLandingAnimEx_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_PlayTargetAnimExBP_Branches) == 0x000061, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_PlayTargetAnimExBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_PlayTargetAnimExBP_ReturnValue) == 0x000064, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_PlayTargetAnimExBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, K2Node_SwitchEnum_CmpSuccess_1) == 0x000068, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, K2Node_DynamicCast_AsLCharacter) == 0x000070, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::K2Node_DynamicCast_AsLCharacter' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_FindActionState_ReturnValue) == 0x000079, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_FindActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_FindActionState_ReturnValue_1) == 0x00007A, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_FindActionState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00007B, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00007C, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_PlayCommomAnimBP_MontageInstanceID) == 0x000080, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_PlayCommomAnimBP_MontageInstanceID' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_PlayCommomAnimBP_Montage) == 0x000088, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_PlayCommomAnimBP_Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_PlayCommomAnimBP_Branches) == 0x000090, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_PlayCommomAnimBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_PlayCommomAnimBP_MontageInstanceID_1) == 0x000094, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_PlayCommomAnimBP_MontageInstanceID_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_PlayCommomAnimBP_Montage_1) == 0x000098, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_PlayCommomAnimBP_Montage_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_PlayCommomAnimBP_Branches_1) == 0x0000A0, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_PlayCommomAnimBP_Branches_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, K2Node_SwitchEnum_CmpSuccess_2) == 0x0000A1, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, K2Node_SwitchEnum_CmpSuccess_3) == 0x0000A2, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_PlayCommomAnimBP_MontageInstanceID_2) == 0x0000A4, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_PlayCommomAnimBP_MontageInstanceID_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_PlayCommomAnimBP_Montage_2) == 0x0000A8, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_PlayCommomAnimBP_Montage_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_PlayCommomAnimBP_Branches_2) == 0x0000B0, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_PlayCommomAnimBP_Branches_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_ActionState_FallingFromDownDrag_F_ReturnValue) == 0x0000B4, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_ActionState_FallingFromDownDrag_F_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, K2Node_SwitchEnum_CmpSuccess_4) == 0x0000BC, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_ActionState_FallingFromDownDrag_B_ReturnValue) == 0x0000C0, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_ActionState_FallingFromDownDrag_B_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_ActionState_FallingFromDownDrag_F_ReturnValue_1) == 0x0000C8, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_ActionState_FallingFromDownDrag_F_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_FindActionState_ReturnValue_2) == 0x0000D0, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_FindActionState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_ActionState_FallingFromDownDrag_B_ReturnValue_1) == 0x0000D4, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_ActionState_FallingFromDownDrag_B_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing, CallFunc_FindActionState_ReturnValue_3) == 0x0000DC, "Member 'BP_Action_Landing_C_ExecuteUbergraph_BP_Action_Landing::CallFunc_FindActionState_ReturnValue_3' has a wrong offset!");

// Function BP_Action_Landing.BP_Action_Landing_C.OnStopByMe
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_Landing_C_OnStopByMe final
{
public:
	class ULActBase*                              StoppingAction;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Landing_C_OnStopByMe) == 0x000008, "Wrong alignment on BP_Action_Landing_C_OnStopByMe");
static_assert(sizeof(BP_Action_Landing_C_OnStopByMe) == 0x000008, "Wrong size on BP_Action_Landing_C_OnStopByMe");
static_assert(offsetof(BP_Action_Landing_C_OnStopByMe, StoppingAction) == 0x000000, "Member 'BP_Action_Landing_C_OnStopByMe::StoppingAction' has a wrong offset!");

// Function BP_Action_Landing.BP_Action_Landing_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_Landing_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Landing_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_Landing_C_OnStop");
static_assert(sizeof(BP_Action_Landing_C_OnStop) == 0x000010, "Wrong size on BP_Action_Landing_C_OnStop");
static_assert(offsetof(BP_Action_Landing_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_Landing_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Landing_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_Landing_C_OnStop::Reason' has a wrong offset!");

}

