#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Grab

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_Grab.BP_Action_Grab_C
// 0x0028 (0x0280 - 0x0258)
class UBP_Action_Grab_C final : public ULAction_LoopAnim
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Cached_JumpStartHeight;                            // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Cached_StartJumpFalling;                           // 0x0264(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Cached_WarningMsg;                                 // 0x0268(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class AActor*                                 Cached_GrabbedTargetActor;                         // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Action_Grab(int32 EntryPoint);
	void OnStop(class ULActBase* ReasonAction, class FName Reason);
	void OnStart();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Action_Grab_C">();
	}
	static class UBP_Action_Grab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_Grab_C>();
	}
};
static_assert(alignof(UBP_Action_Grab_C) == 0x000008, "Wrong alignment on UBP_Action_Grab_C");
static_assert(sizeof(UBP_Action_Grab_C) == 0x000280, "Wrong size on UBP_Action_Grab_C");
static_assert(offsetof(UBP_Action_Grab_C, UberGraphFrame) == 0x000258, "Member 'UBP_Action_Grab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Action_Grab_C, Cached_JumpStartHeight) == 0x000260, "Member 'UBP_Action_Grab_C::Cached_JumpStartHeight' has a wrong offset!");
static_assert(offsetof(UBP_Action_Grab_C, Cached_StartJumpFalling) == 0x000264, "Member 'UBP_Action_Grab_C::Cached_StartJumpFalling' has a wrong offset!");
static_assert(offsetof(UBP_Action_Grab_C, Cached_WarningMsg) == 0x000268, "Member 'UBP_Action_Grab_C::Cached_WarningMsg' has a wrong offset!");
static_assert(offsetof(UBP_Action_Grab_C, Cached_GrabbedTargetActor) == 0x000278, "Member 'UBP_Action_Grab_C::Cached_GrabbedTargetActor' has a wrong offset!");

}

