#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_WireAction_NPC

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_WireAction_NPC.BP_Action_WireAction_NPC_C
// 0x0028 (0x0280 - 0x0258)
class UBP_Action_WireAction_NPC_C final : public ULAction_LoopAnim
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimMontage*                           StartMontage;                                      // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           PullingMontage;                                    // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           FailMontage;                                       // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxDistance;                                       // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FollowingOn;                                       // 0x027C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsFollowing;                                       // 0x027D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Action_WireAction_NPC(int32 EntryPoint);
	void OnFollowing();
	void OnStop(class ULActBase* ReasonAction, class FName Reason);
	void OnCurrMontageEnded(class UAnimMontage* Montage, bool bInterrupted, int32 MontageInstanceID);
	void OnStart();
	void OnFail();
	void OnPulling();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Action_WireAction_NPC_C">();
	}
	static class UBP_Action_WireAction_NPC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_WireAction_NPC_C>();
	}
};
static_assert(alignof(UBP_Action_WireAction_NPC_C) == 0x000008, "Wrong alignment on UBP_Action_WireAction_NPC_C");
static_assert(sizeof(UBP_Action_WireAction_NPC_C) == 0x000280, "Wrong size on UBP_Action_WireAction_NPC_C");
static_assert(offsetof(UBP_Action_WireAction_NPC_C, UberGraphFrame) == 0x000258, "Member 'UBP_Action_WireAction_NPC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Action_WireAction_NPC_C, StartMontage) == 0x000260, "Member 'UBP_Action_WireAction_NPC_C::StartMontage' has a wrong offset!");
static_assert(offsetof(UBP_Action_WireAction_NPC_C, PullingMontage) == 0x000268, "Member 'UBP_Action_WireAction_NPC_C::PullingMontage' has a wrong offset!");
static_assert(offsetof(UBP_Action_WireAction_NPC_C, FailMontage) == 0x000270, "Member 'UBP_Action_WireAction_NPC_C::FailMontage' has a wrong offset!");
static_assert(offsetof(UBP_Action_WireAction_NPC_C, MaxDistance) == 0x000278, "Member 'UBP_Action_WireAction_NPC_C::MaxDistance' has a wrong offset!");
static_assert(offsetof(UBP_Action_WireAction_NPC_C, FollowingOn) == 0x00027C, "Member 'UBP_Action_WireAction_NPC_C::FollowingOn' has a wrong offset!");
static_assert(offsetof(UBP_Action_WireAction_NPC_C, IsFollowing) == 0x00027D, "Member 'UBP_Action_WireAction_NPC_C::IsFollowing' has a wrong offset!");

}

