#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_FatalAttack_VictimBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Action_FatalAttack_VictimBase.BP_Action_FatalAttack_VictimBase_C.ExecuteUbergraph_BP_Action_FatalAttack_VictimBase
// 0x0098 (0x0098 - 0x0000)
struct BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_Immune_Groggy_ReturnValue;    // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Event_Montage;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MontageInstanceID;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_LockRotation_ReturnValue;     // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_LockDieAction_ReturnValue;    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue_1;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayHitAnim_ReturnValue;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_LockMovement_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_SuperArmor_ReturnValue;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_LockDieAction_ReturnValue_1;  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ULActionClass_FatalAttack_Victim_End_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_FatalAttack_As_Victim_ReturnValue; // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ULActionClass_FatalAttack_Victim_End_ReturnValue_1; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase) == 0x000008, "Wrong alignment on BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase");
static_assert(sizeof(BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase) == 0x000098, "Wrong size on BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase, EntryPoint) == 0x000000, "Member 'BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase, CallFunc_ActionState_Immune_Groggy_ReturnValue) == 0x000004, "Member 'BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase::CallFunc_ActionState_Immune_Groggy_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase, K2Node_Event_Montage) == 0x000010, "Member 'BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase::K2Node_Event_Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase, K2Node_Event_bInterrupted) == 0x000018, "Member 'BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase::K2Node_Event_bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase, K2Node_Event_MontageInstanceID) == 0x00001C, "Member 'BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase::K2Node_Event_MontageInstanceID' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase, CallFunc_Stop_ReturnValue) == 0x000020, "Member 'BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase, CallFunc_ActionState_LockRotation_ReturnValue) == 0x000024, "Member 'BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase::CallFunc_ActionState_LockRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase, CallFunc_ActionState_LockDieAction_ReturnValue) == 0x000030, "Member 'BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase::CallFunc_ActionState_LockDieAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase, CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue) == 0x000038, "Member 'BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase::CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase, CallFunc_Stop_ReturnValue_1) == 0x000040, "Member 'BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase::CallFunc_Stop_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase, CallFunc_PlayHitAnim_ReturnValue) == 0x000044, "Member 'BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase::CallFunc_PlayHitAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase, CallFunc_ActionState_LockMovement_ReturnValue) == 0x000048, "Member 'BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase::CallFunc_ActionState_LockMovement_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase, K2Node_Event_ReasonAction) == 0x000050, "Member 'BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase, K2Node_Event_Reason) == 0x000058, "Member 'BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase, CallFunc_ActionState_SuperArmor_ReturnValue) == 0x000060, "Member 'BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase::CallFunc_ActionState_SuperArmor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase, CallFunc_ActionState_LockDieAction_ReturnValue_1) == 0x000068, "Member 'BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase::CallFunc_ActionState_LockDieAction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase, CallFunc_ULActionClass_FatalAttack_Victim_End_ReturnValue) == 0x000070, "Member 'BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase::CallFunc_ULActionClass_FatalAttack_Victim_End_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000078, "Member 'BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase, CallFunc_ActionState_FatalAttack_As_Victim_ReturnValue) == 0x00007C, "Member 'BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase::CallFunc_ActionState_FatalAttack_As_Victim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase, K2Node_SwitchName_CmpSuccess) == 0x000084, "Member 'BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase, CallFunc_ULActionClass_FatalAttack_Victim_End_ReturnValue_1) == 0x000088, "Member 'BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase::CallFunc_ULActionClass_FatalAttack_Victim_End_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000090, "Member 'BP_Action_FatalAttack_VictimBase_C_ExecuteUbergraph_BP_Action_FatalAttack_VictimBase::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");

// Function BP_Action_FatalAttack_VictimBase.BP_Action_FatalAttack_VictimBase_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_FatalAttack_VictimBase_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_FatalAttack_VictimBase_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_FatalAttack_VictimBase_C_OnStop");
static_assert(sizeof(BP_Action_FatalAttack_VictimBase_C_OnStop) == 0x000010, "Wrong size on BP_Action_FatalAttack_VictimBase_C_OnStop");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_FatalAttack_VictimBase_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_FatalAttack_VictimBase_C_OnStop::Reason' has a wrong offset!");

// Function BP_Action_FatalAttack_VictimBase.BP_Action_FatalAttack_VictimBase_C.OnCurrMontageEnded
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_FatalAttack_VictimBase_C_OnCurrMontageEnded final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MontageInstanceID;                                 // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_FatalAttack_VictimBase_C_OnCurrMontageEnded) == 0x000008, "Wrong alignment on BP_Action_FatalAttack_VictimBase_C_OnCurrMontageEnded");
static_assert(sizeof(BP_Action_FatalAttack_VictimBase_C_OnCurrMontageEnded) == 0x000010, "Wrong size on BP_Action_FatalAttack_VictimBase_C_OnCurrMontageEnded");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_OnCurrMontageEnded, Montage) == 0x000000, "Member 'BP_Action_FatalAttack_VictimBase_C_OnCurrMontageEnded::Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_OnCurrMontageEnded, bInterrupted) == 0x000008, "Member 'BP_Action_FatalAttack_VictimBase_C_OnCurrMontageEnded::bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_VictimBase_C_OnCurrMontageEnded, MontageInstanceID) == 0x00000C, "Member 'BP_Action_FatalAttack_VictimBase_C_OnCurrMontageEnded::MontageInstanceID' has a wrong offset!");

}

