#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_WireAction_Following_NPC

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_WireAction_Following_NPC.BP_Action_WireAction_Following_NPC_C.ExecuteUbergraph_BP_Action_WireAction_Following_NPC
// 0x0120 (0x0120 - 0x0000)
struct BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULProjectileSystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetTickable_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayTargetAnim_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALCharacter*                            K2Node_CustomEvent_Target;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Speed;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Gravity;                        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_FollowingEndSkillCodeName;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue_1; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FindAngularProjectileAngle_ReturnValue;   // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Event_Montage;                              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted;                         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MontageInstanceID;                    // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue_1;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BB[0x5];                                       // 0x00BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetTickable_ReturnValue_1;                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x00D8(0x0010)(ReferenceParm)
	float                                         K2Node_Event_DeltaTime;                            // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Wire_GrappleGun_NPC_C*              K2Node_DynamicCast_AsBP_Wire_Grapple_Gun_NPC;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_PlaySkillActionBP_Branches;               // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_PlaySkillActionBP_ReturnValue;            // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC) == 0x000008, "Wrong alignment on BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC");
static_assert(sizeof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC) == 0x000120, "Wrong size on BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, EntryPoint) == 0x000000, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_SetTickable_ReturnValue) == 0x00001C, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_SetTickable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_PlayTargetAnim_ReturnValue) == 0x000020, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_PlayTargetAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, K2Node_CustomEvent_Target) == 0x000028, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, K2Node_CustomEvent_Speed) == 0x000030, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::K2Node_CustomEvent_Speed' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, K2Node_CustomEvent_Gravity) == 0x000034, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::K2Node_CustomEvent_Gravity' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, K2Node_CustomEvent_FollowingEndSkillCodeName) == 0x000038, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::K2Node_CustomEvent_FollowingEndSkillCodeName' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x000040, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue_1) == 0x000044, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_BreakVector_X) == 0x000054, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_BreakVector_Y) == 0x000058, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_BreakVector_Z) == 0x00005C, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000060, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00006C, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_Add_FloatFloat_ReturnValue) == 0x000070, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_MakeVector_ReturnValue) == 0x000074, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000080, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_VSize_ReturnValue) == 0x00008C, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_Normal_ReturnValue) == 0x000090, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_FindAngularProjectileAngle_ReturnValue) == 0x00009C, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_FindAngularProjectileAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_Stop_ReturnValue) == 0x0000A0, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, K2Node_Event_Montage) == 0x0000A8, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::K2Node_Event_Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, K2Node_Event_bInterrupted) == 0x0000B0, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::K2Node_Event_bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, K2Node_Event_MontageInstanceID) == 0x0000B4, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::K2Node_Event_MontageInstanceID' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_Stop_ReturnValue_1) == 0x0000B8, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_Stop_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000B9, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_Not_PreBool_ReturnValue) == 0x0000BA, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, K2Node_Event_ReasonAction) == 0x0000C0, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, K2Node_Event_Reason) == 0x0000C8, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_SetTickable_ReturnValue_1) == 0x0000D0, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_SetTickable_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_GetAttachedActors_OutActors) == 0x0000D8, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_GetAttachedActors_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, K2Node_Event_DeltaTime) == 0x0000E8, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, K2Node_DynamicCast_AsBP_Wire_Grapple_Gun_NPC) == 0x0000F8, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::K2Node_DynamicCast_AsBP_Wire_Grapple_Gun_NPC' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_Array_Length_ReturnValue) == 0x000104, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_Less_IntInt_ReturnValue) == 0x000108, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_PlaySkillActionBP_Branches) == 0x000109, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_PlaySkillActionBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, CallFunc_PlaySkillActionBP_ReturnValue) == 0x000110, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::CallFunc_PlaySkillActionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC, K2Node_SwitchEnum_CmpSuccess) == 0x000118, "Member 'BP_Action_WireAction_Following_NPC_C_ExecuteUbergraph_BP_Action_WireAction_Following_NPC::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_Action_WireAction_Following_NPC.BP_Action_WireAction_Following_NPC_C.OnTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Action_WireAction_Following_NPC_C_OnTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_WireAction_Following_NPC_C_OnTick) == 0x000004, "Wrong alignment on BP_Action_WireAction_Following_NPC_C_OnTick");
static_assert(sizeof(BP_Action_WireAction_Following_NPC_C_OnTick) == 0x000004, "Wrong size on BP_Action_WireAction_Following_NPC_C_OnTick");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_OnTick, DeltaTime) == 0x000000, "Member 'BP_Action_WireAction_Following_NPC_C_OnTick::DeltaTime' has a wrong offset!");

// Function BP_Action_WireAction_Following_NPC.BP_Action_WireAction_Following_NPC_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_WireAction_Following_NPC_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_WireAction_Following_NPC_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_WireAction_Following_NPC_C_OnStop");
static_assert(sizeof(BP_Action_WireAction_Following_NPC_C_OnStop) == 0x000010, "Wrong size on BP_Action_WireAction_Following_NPC_C_OnStop");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_WireAction_Following_NPC_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_WireAction_Following_NPC_C_OnStop::Reason' has a wrong offset!");

// Function BP_Action_WireAction_Following_NPC.BP_Action_WireAction_Following_NPC_C.OnCurrMontageEnded
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_WireAction_Following_NPC_C_OnCurrMontageEnded final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MontageInstanceID;                                 // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_WireAction_Following_NPC_C_OnCurrMontageEnded) == 0x000008, "Wrong alignment on BP_Action_WireAction_Following_NPC_C_OnCurrMontageEnded");
static_assert(sizeof(BP_Action_WireAction_Following_NPC_C_OnCurrMontageEnded) == 0x000010, "Wrong size on BP_Action_WireAction_Following_NPC_C_OnCurrMontageEnded");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_OnCurrMontageEnded, Montage) == 0x000000, "Member 'BP_Action_WireAction_Following_NPC_C_OnCurrMontageEnded::Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_OnCurrMontageEnded, bInterrupted) == 0x000008, "Member 'BP_Action_WireAction_Following_NPC_C_OnCurrMontageEnded::bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_OnCurrMontageEnded, MontageInstanceID) == 0x00000C, "Member 'BP_Action_WireAction_Following_NPC_C_OnCurrMontageEnded::MontageInstanceID' has a wrong offset!");

// Function BP_Action_WireAction_Following_NPC.BP_Action_WireAction_Following_NPC_C.OnWireAttached
// 0x0018 (0x0018 - 0x0000)
struct BP_Action_WireAction_Following_NPC_C_OnWireAttached final
{
public:
	class ALCharacter*                            Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed_0;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Gravity_0;                                         // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FollowingEndSkillCodeName_0;                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_WireAction_Following_NPC_C_OnWireAttached) == 0x000008, "Wrong alignment on BP_Action_WireAction_Following_NPC_C_OnWireAttached");
static_assert(sizeof(BP_Action_WireAction_Following_NPC_C_OnWireAttached) == 0x000018, "Wrong size on BP_Action_WireAction_Following_NPC_C_OnWireAttached");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_OnWireAttached, Target) == 0x000000, "Member 'BP_Action_WireAction_Following_NPC_C_OnWireAttached::Target' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_OnWireAttached, Speed_0) == 0x000008, "Member 'BP_Action_WireAction_Following_NPC_C_OnWireAttached::Speed_0' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_OnWireAttached, Gravity_0) == 0x00000C, "Member 'BP_Action_WireAction_Following_NPC_C_OnWireAttached::Gravity_0' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_OnWireAttached, FollowingEndSkillCodeName_0) == 0x000010, "Member 'BP_Action_WireAction_Following_NPC_C_OnWireAttached::FollowingEndSkillCodeName_0' has a wrong offset!");

// Function BP_Action_WireAction_Following_NPC.BP_Action_WireAction_Following_NPC_C.UpdateWireFollowingMovementAngular
// 0x04F8 (0x04F8 - 0x0000)
struct BP_Action_WireAction_Following_NPC_C_UpdateWireFollowingMovementAngular final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PrevLocation;                                      // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleRadius_ReturnValue;       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_CollisionProfile_OverlapAll_ReturnValue;  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable;                              // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FHitResult>                     CallFunc_CapsuleTraceMultiByProfile_OutHits;       // 0x0070(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_CapsuleTraceMultiByProfile_ReturnValue;   // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x0090(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11E[0x2];                                      // 0x011E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AB[0x1];                                      // 0x01AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue_1; // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x01DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x01FC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_285[0x3];                                      // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize2D_ReturnValue;                      // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x02B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_DegSin_ReturnValue;                       // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x02D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegCos_ReturnValue;                       // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x02F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x0300(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x030C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFindFloorResult                       CallFunc_K2_FindFloor_FloorResult;                 // 0x0318(0x0094)(NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x03AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x03AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AF[0x1];                                      // 0x03AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x03B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x03C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x03D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x03DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x03F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0414(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0420(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x0444(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x044C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0458(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0464(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_465[0x3];                                      // 0x0465(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x0468(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_WireAction_Following_NPC_C_UpdateWireFollowingMovementAngular) == 0x000008, "Wrong alignment on BP_Action_WireAction_Following_NPC_C_UpdateWireFollowingMovementAngular");
static_assert(sizeof(BP_Action_WireAction_Following_NPC_C_UpdateWireFollowingMovementAngular) == 0x0004F8, "Wrong size on BP_Action_WireAction_Following_NPC_C_UpdateWireFollowingMovementAngular");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_UpdateWireFollowingMovementAngular, DeltaTime) == 0x000000, "Member 'BP_Action_WireAction_Following_NPC_C_UpdateWireFollowingMovementAngular::DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Action_WireAction_Following_NPC_C_UpdateWireFollowingMovementAngular, PrevLocation) == 0x000004, "Member 'BP_Action_WireAction_Following_NPC_C_UpdateWireFollowingMovementAngular::PrevLocation' has a wrong offset!");
