#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Guard_Repulse

#include "Basic.hpp"

#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_Guard_Repulse.BP_Action_Guard_Repulse_C.ExecuteUbergraph_BP_Action_Guard_Repulse
// 0x0060 (0x0060 - 0x0000)
struct BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCharacterStat_ReturnValue;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveAnimRateScaleByInstigator_ReturnValue; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLGameObjectHandle                     CallFunc_AddAnimRateScale_ReturnValue;             // 0x0058(0x0004)(NoDestructor)
};
static_assert(alignof(BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse) == 0x000008, "Wrong alignment on BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse");
static_assert(sizeof(BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse) == 0x000060, "Wrong size on BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse");
static_assert(offsetof(BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse, EntryPoint) == 0x000000, "Member 'BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse, K2Node_DynamicCast_AsLPCCharacter) == 0x000008, "Member 'BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse::K2Node_DynamicCast_AsLPCCharacter' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse, CallFunc_GetMovementComponent_ReturnValue) == 0x000018, "Member 'BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse, K2Node_DynamicCast_AsLCharacter) == 0x000020, "Member 'BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse::K2Node_DynamicCast_AsLCharacter' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse, K2Node_Event_ReasonAction) == 0x000030, "Member 'BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse, K2Node_Event_Reason) == 0x000038, "Member 'BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse, CallFunc_GetCharacterStat_ReturnValue) == 0x000044, "Member 'BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse::CallFunc_GetCharacterStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000048, "Member 'BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00004C, "Member 'BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse, CallFunc_RemoveAnimRateScaleByInstigator_ReturnValue) == 0x000050, "Member 'BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse::CallFunc_RemoveAnimRateScaleByInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse, CallFunc_Add_FloatFloat_ReturnValue) == 0x000054, "Member 'BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse, CallFunc_AddAnimRateScale_ReturnValue) == 0x000058, "Member 'BP_Action_Guard_Repulse_C_ExecuteUbergraph_BP_Action_Guard_Repulse::CallFunc_AddAnimRateScale_ReturnValue' has a wrong offset!");

// Function BP_Action_Guard_Repulse.BP_Action_Guard_Repulse_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_Guard_Repulse_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Guard_Repulse_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_Guard_Repulse_C_OnStop");
static_assert(sizeof(BP_Action_Guard_Repulse_C_OnStop) == 0x000010, "Wrong size on BP_Action_Guard_Repulse_C_OnStop");
static_assert(offsetof(BP_Action_Guard_Repulse_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_Guard_Repulse_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Repulse_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_Guard_Repulse_C_OnStop::Reason' has a wrong offset!");

}

