#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Wire_Hit

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_Wire_Hit.BP_Action_Wire_Hit_C.ExecuteUbergraph_BP_Action_Wire_Hit
// 0x00D8 (0x00D8 - 0x0000)
struct BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActionSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHitRotateTime_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLGameObjectHandle                     CallFunc_StartTransformModifier_RotateActor_ReturnValue; // 0x004C(0x0004)(NoDestructor)
	float                                         CallFunc_MsToSec_Second;                           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MsToSec_Second_1;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_2;                       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayHitAnim_ReturnValue;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALNPCCharacter*                         K2Node_DynamicCast_AsLNPCCharacter;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ENPCGradeType                                 CallFunc_GetGrade_ReturnValue;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_NormalizeAxis_ReturnValue;                // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x00C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x00D0(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit) == 0x000008, "Wrong alignment on BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit");
static_assert(sizeof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit) == 0x0000D8, "Wrong size on BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, EntryPoint) == 0x000000, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_GetHitRotateTime_ReturnValue) == 0x000010, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_GetHitRotateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, K2Node_DynamicCast_AsLCharacter) == 0x000018, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::K2Node_DynamicCast_AsLCharacter' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_RandomFloatInRange_ReturnValue) == 0x000024, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000028, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00002C, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000030, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_ComposeRotators_ReturnValue) == 0x00003C, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000048, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_StartTransformModifier_RotateActor_ReturnValue) == 0x00004C, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_StartTransformModifier_RotateActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_MsToSec_Second) == 0x000050, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_MsToSec_Second' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_FMax_ReturnValue) == 0x000054, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_MsToSec_Second_1) == 0x000058, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_MsToSec_Second_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_FMax_ReturnValue_1) == 0x00005C, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_FMax_ReturnValue_2) == 0x000060, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_FMax_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, K2Node_Event_ReasonAction) == 0x000068, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, K2Node_Event_Reason) == 0x000070, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_PlayHitAnim_ReturnValue) == 0x000078, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_PlayHitAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, K2Node_DynamicCast_AsLNPCCharacter) == 0x000080, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::K2Node_DynamicCast_AsLNPCCharacter' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_MakeRotator_ReturnValue) == 0x00008C, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_GetGrade_ReturnValue) == 0x000098, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_GetGrade_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000099, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_Add_FloatFloat_ReturnValue) == 0x00009C, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_MakeRotator_ReturnValue_1) == 0x0000A0, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_NormalizeAxis_ReturnValue) == 0x0000AC, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_NormalizeAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000B0, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_Abs_ReturnValue) == 0x0000B4, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x0000B8, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_K2_SetTimer_ReturnValue) == 0x0000C0, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000C8, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit, CallFunc_K2_SetTimer_ReturnValue_1) == 0x0000D0, "Member 'BP_Action_Wire_Hit_C_ExecuteUbergraph_BP_Action_Wire_Hit::CallFunc_K2_SetTimer_ReturnValue_1' has a wrong offset!");

// Function BP_Action_Wire_Hit.BP_Action_Wire_Hit_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_Wire_Hit_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Wire_Hit_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_Wire_Hit_C_OnStop");
static_assert(sizeof(BP_Action_Wire_Hit_C_OnStop) == 0x000010, "Wrong size on BP_Action_Wire_Hit_C_OnStop");
static_assert(offsetof(BP_Action_Wire_Hit_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_Wire_Hit_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_Wire_Hit_C_OnStop::Reason' has a wrong offset!");

// Function BP_Action_Wire_Hit.BP_Action_Wire_Hit_C.HitDurationEnded
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Action_Wire_Hit_C_HitDurationEnded final
{
public:
	bool                                          Processed;                                         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_InputCommand_SlaveArmPress_ReturnValue;   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_GetActiveSlaveArmItemBP_Branches;         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 CallFunc_GetActiveSlaveArmItemBP_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_InputCommand_SlaveArmPress_ReturnValue_1; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCodeName_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCommandPressed_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_AllowInput_SlaveArm_ReturnValue; // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_AllowInput_Guard_ReturnValue; // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_ProcessCommand_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProcessAction_ReturnValue;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_InputCommand_Guard_ReturnValue;           // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_InputCommand_Guard_ReturnValue_1;         // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_ProcessCommand_ReturnValue_1;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCommandPressed_ReturnValue_1;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ProcessAction_ReturnValue_1;              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_LName_None_ReturnValue;                   // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_CancelMove_ReturnValue;       // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLReservedCommand                      CallFunc_GetLastPreInputCommand_ReturnValue;       // 0x007C(0x0018)(NoDestructor)
	class FName                                   CallFunc_ActionState_ApplyInput_ReturnValue;       // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_ProcessCommand_ReturnValue_2;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProcessAction_ReturnValue_2;              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter;                 // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_Wire_Hit_C_HitDurationEnded) == 0x000008, "Wrong alignment on BP_Action_Wire_Hit_C_HitDurationEnded");
static_assert(sizeof(BP_Action_Wire_Hit_C_HitDurationEnded) == 0x0000C0, "Wrong size on BP_Action_Wire_Hit_C_HitDurationEnded");
static_assert(offsetof(BP_Action_Wire_Hit_C_HitDurationEnded, Processed) == 0x000000, "Member 'BP_Action_Wire_Hit_C_HitDurationEnded::Processed' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_HitDurationEnded, CallFunc_Stop_ReturnValue) == 0x000001, "Member 'BP_Action_Wire_Hit_C_HitDurationEnded::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Wire_Hit_C_HitDurationEnded, CallFunc_InputCommand_SlaveArmPress_ReturnValue) == 0x000004, "Member 'BP_Action_Wire_Hit_C_HitDurationEnded::CallFunc_InputCommand_SlaveArmPress_ReturnValue' has a wrong offset!");
