#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_WeaponBreak

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Action_WeaponBreak.BP_Action_WeaponBreak_C.ExecuteUbergraph_BP_Action_WeaponBreak
// 0x0038 (0x0038 - 0x0000)
struct BP_Action_WeaponBreak_C_ExecuteUbergraph_BP_Action_WeaponBreak final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayHitAnim_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Event_Montage;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MontageInstanceID;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue_1;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_TryLockInput_Movement_ReturnValue; // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_TryLockInput_Rotation_ReturnValue; // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_WeaponBreak_C_ExecuteUbergraph_BP_Action_WeaponBreak) == 0x000008, "Wrong alignment on BP_Action_WeaponBreak_C_ExecuteUbergraph_BP_Action_WeaponBreak");
static_assert(sizeof(BP_Action_WeaponBreak_C_ExecuteUbergraph_BP_Action_WeaponBreak) == 0x000038, "Wrong size on BP_Action_WeaponBreak_C_ExecuteUbergraph_BP_Action_WeaponBreak");
static_assert(offsetof(BP_Action_WeaponBreak_C_ExecuteUbergraph_BP_Action_WeaponBreak, EntryPoint) == 0x000000, "Member 'BP_Action_WeaponBreak_C_ExecuteUbergraph_BP_Action_WeaponBreak::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_WeaponBreak_C_ExecuteUbergraph_BP_Action_WeaponBreak, CallFunc_PlayHitAnim_ReturnValue) == 0x000004, "Member 'BP_Action_WeaponBreak_C_ExecuteUbergraph_BP_Action_WeaponBreak::CallFunc_PlayHitAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_WeaponBreak_C_ExecuteUbergraph_BP_Action_WeaponBreak, CallFunc_Stop_ReturnValue) == 0x000008, "Member 'BP_Action_WeaponBreak_C_ExecuteUbergraph_BP_Action_WeaponBreak::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_WeaponBreak_C_ExecuteUbergraph_BP_Action_WeaponBreak, CallFunc_Less_IntInt_ReturnValue) == 0x000009, "Member 'BP_Action_WeaponBreak_C_ExecuteUbergraph_BP_Action_WeaponBreak::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_WeaponBreak_C_ExecuteUbergraph_BP_Action_WeaponBreak, K2Node_Event_Montage) == 0x000010, "Member 'BP_Action_WeaponBreak_C_ExecuteUbergraph_BP_Action_WeaponBreak::K2Node_Event_Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_WeaponBreak_C_ExecuteUbergraph_BP_Action_WeaponBreak, K2Node_Event_bInterrupted) == 0x000018, "Member 'BP_Action_WeaponBreak_C_ExecuteUbergraph_BP_Action_WeaponBreak::K2Node_Event_bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_WeaponBreak_C_ExecuteUbergraph_BP_Action_WeaponBreak, K2Node_Event_MontageInstanceID) == 0x00001C, "Member 'BP_Action_WeaponBreak_C_ExecuteUbergraph_BP_Action_WeaponBreak::K2Node_Event_MontageInstanceID' has a wrong offset!");
static_assert(offsetof(BP_Action_WeaponBreak_C_ExecuteUbergraph_BP_Action_WeaponBreak, CallFunc_Stop_ReturnValue_1) == 0x000020, "Member 'BP_Action_WeaponBreak_C_ExecuteUbergraph_BP_Action_WeaponBreak::CallFunc_Stop_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_WeaponBreak_C_ExecuteUbergraph_BP_Action_WeaponBreak, CallFunc_ActionState_TryLockInput_Movement_ReturnValue) == 0x000024, "Member 'BP_Action_WeaponBreak_C_ExecuteUbergraph_BP_Action_WeaponBreak::CallFunc_ActionState_TryLockInput_Movement_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_WeaponBreak_C_ExecuteUbergraph_BP_Action_WeaponBreak, CallFunc_ActionState_TryLockInput_Rotation_ReturnValue) == 0x00002C, "Member 'BP_Action_WeaponBreak_C_ExecuteUbergraph_BP_Action_WeaponBreak::CallFunc_ActionState_TryLockInput_Rotation_ReturnValue' has a wrong offset!");

// Function BP_Action_WeaponBreak.BP_Action_WeaponBreak_C.OnCurrMontageEnded
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_WeaponBreak_C_OnCurrMontageEnded final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MontageInstanceID;                                 // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_WeaponBreak_C_OnCurrMontageEnded) == 0x000008, "Wrong alignment on BP_Action_WeaponBreak_C_OnCurrMontageEnded");
static_assert(sizeof(BP_Action_WeaponBreak_C_OnCurrMontageEnded) == 0x000010, "Wrong size on BP_Action_WeaponBreak_C_OnCurrMontageEnded");
static_assert(offsetof(BP_Action_WeaponBreak_C_OnCurrMontageEnded, Montage) == 0x000000, "Member 'BP_Action_WeaponBreak_C_OnCurrMontageEnded::Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_WeaponBreak_C_OnCurrMontageEnded, bInterrupted) == 0x000008, "Member 'BP_Action_WeaponBreak_C_OnCurrMontageEnded::bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_WeaponBreak_C_OnCurrMontageEnded, MontageInstanceID) == 0x00000C, "Member 'BP_Action_WeaponBreak_C_OnCurrMontageEnded::MontageInstanceID' has a wrong offset!");

}

