#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_UseItem_Monad

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"
#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_UseItem_Monad.BP_Action_UseItem_Monad_C.ExecuteUbergraph_BP_Action_UseItem_Monad
// 0x00B0 (0x00B0 - 0x0000)
struct BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_AllowInput_Movement_Forced_ReturnValue; // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Event_Montage;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MontageInstanceID;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActPayloadBase*                       CallFunc_GetActPayload_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActPayload_UseItem*                   K2Node_DynamicCast_AsLAct_Payload_Use_Item;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionStopReason_PayloadInvalid_ReturnValue; // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue_1;                       // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetReadyToUseItem_OutUseCount;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 CallFunc_GetReadyToUseItem_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayTargetAnimBP_Branches;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayTargetAnimBP_ReturnValue;             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Stop_ReturnValue_2;                       // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      CallFunc_GetSkillAnim_ReturnValue;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter;                   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindActionState_ReturnValue;              // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLGameObjectHandle                     CallFunc_AddActionState_AutoRemove_ReturnValue;    // 0x00AC(0x0004)(NoDestructor)
};
static_assert(alignof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad) == 0x000008, "Wrong alignment on BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad");
static_assert(sizeof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad) == 0x0000B0, "Wrong size on BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, EntryPoint) == 0x000000, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, CallFunc_ActionState_AllowInput_Movement_Forced_ReturnValue) == 0x000004, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::CallFunc_ActionState_AllowInput_Movement_Forced_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000018, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, CallFunc_Stop_ReturnValue) == 0x000020, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, K2Node_Event_Montage) == 0x000028, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::K2Node_Event_Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, K2Node_Event_bInterrupted) == 0x000030, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::K2Node_Event_bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, K2Node_Event_MontageInstanceID) == 0x000034, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::K2Node_Event_MontageInstanceID' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, K2Node_Event_ReasonAction) == 0x000038, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, K2Node_Event_Reason) == 0x000040, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, CallFunc_GetActPayload_ReturnValue) == 0x000050, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::CallFunc_GetActPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, K2Node_DynamicCast_AsLAct_Payload_Use_Item) == 0x000058, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::K2Node_DynamicCast_AsLAct_Payload_Use_Item' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000061, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, CallFunc_ActionStopReason_PayloadInvalid_ReturnValue) == 0x000064, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::CallFunc_ActionStopReason_PayloadInvalid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, CallFunc_Stop_ReturnValue_1) == 0x00006C, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::CallFunc_Stop_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, CallFunc_IsValid_ReturnValue_1) == 0x00006D, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, CallFunc_GetReadyToUseItem_OutUseCount) == 0x000070, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::CallFunc_GetReadyToUseItem_OutUseCount' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, CallFunc_GetReadyToUseItem_ReturnValue) == 0x000078, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::CallFunc_GetReadyToUseItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, CallFunc_PlayTargetAnimBP_Branches) == 0x000080, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::CallFunc_PlayTargetAnimBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, CallFunc_PlayTargetAnimBP_ReturnValue) == 0x000084, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::CallFunc_PlayTargetAnimBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue) == 0x000088, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, K2Node_SwitchEnum_CmpSuccess) == 0x000090, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, CallFunc_Stop_ReturnValue_2) == 0x000091, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::CallFunc_Stop_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, CallFunc_GetSkillAnim_ReturnValue) == 0x000098, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::CallFunc_GetSkillAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, K2Node_DynamicCast_AsLCharacter) == 0x0000A0, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::K2Node_DynamicCast_AsLCharacter' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, CallFunc_FindActionState_ReturnValue) == 0x0000A9, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::CallFunc_FindActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad, CallFunc_AddActionState_AutoRemove_ReturnValue) == 0x0000AC, "Member 'BP_Action_UseItem_Monad_C_ExecuteUbergraph_BP_Action_UseItem_Monad::CallFunc_AddActionState_AutoRemove_ReturnValue' has a wrong offset!");

// Function BP_Action_UseItem_Monad.BP_Action_UseItem_Monad_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_UseItem_Monad_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_UseItem_Monad_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_UseItem_Monad_C_OnStop");
static_assert(sizeof(BP_Action_UseItem_Monad_C_OnStop) == 0x000010, "Wrong size on BP_Action_UseItem_Monad_C_OnStop");
static_assert(offsetof(BP_Action_UseItem_Monad_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_UseItem_Monad_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_UseItem_Monad_C_OnStop::Reason' has a wrong offset!");

// Function BP_Action_UseItem_Monad.BP_Action_UseItem_Monad_C.OnCurrMontageEnded
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_UseItem_Monad_C_OnCurrMontageEnded final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MontageInstanceID;                                 // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_UseItem_Monad_C_OnCurrMontageEnded) == 0x000008, "Wrong alignment on BP_Action_UseItem_Monad_C_OnCurrMontageEnded");
static_assert(sizeof(BP_Action_UseItem_Monad_C_OnCurrMontageEnded) == 0x000010, "Wrong size on BP_Action_UseItem_Monad_C_OnCurrMontageEnded");
static_assert(offsetof(BP_Action_UseItem_Monad_C_OnCurrMontageEnded, Montage) == 0x000000, "Member 'BP_Action_UseItem_Monad_C_OnCurrMontageEnded::Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_OnCurrMontageEnded, bInterrupted) == 0x000008, "Member 'BP_Action_UseItem_Monad_C_OnCurrMontageEnded::bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_OnCurrMontageEnded, MontageInstanceID) == 0x00000C, "Member 'BP_Action_UseItem_Monad_C_OnCurrMontageEnded::MontageInstanceID' has a wrong offset!");

// Function BP_Action_UseItem_Monad.BP_Action_UseItem_Monad_C.OnPreProcessAction
// 0x0058 (0x0058 - 0x0000)
struct BP_Action_UseItem_Monad_C_OnPreProcessAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 Cached_CurrentItem_Unit;                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 Cached_CurrentItem;                                // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemConsumeInfoPtr                    CallFunc_GetConsumeInfo_ReturnValue;               // 0x0028(0x0008)(NoDestructor)
	ELItemComplexGroup                            CallFunc_GetComplexGroup_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCount_ReturnValue;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 CallFunc_GetComplexItem_Unit_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetReadyToUseItem_OutUseCount;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 CallFunc_GetReadyToUseItem_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_UseItem_Monad_C_OnPreProcessAction) == 0x000008, "Wrong alignment on BP_Action_UseItem_Monad_C_OnPreProcessAction");
static_assert(sizeof(BP_Action_UseItem_Monad_C_OnPreProcessAction) == 0x000058, "Wrong size on BP_Action_UseItem_Monad_C_OnPreProcessAction");
static_assert(offsetof(BP_Action_UseItem_Monad_C_OnPreProcessAction, ReturnValue) == 0x000000, "Member 'BP_Action_UseItem_Monad_C_OnPreProcessAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_OnPreProcessAction, Cached_CurrentItem_Unit) == 0x000008, "Member 'BP_Action_UseItem_Monad_C_OnPreProcessAction::Cached_CurrentItem_Unit' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_OnPreProcessAction, Success) == 0x000010, "Member 'BP_Action_UseItem_Monad_C_OnPreProcessAction::Success' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_OnPreProcessAction, Cached_CurrentItem) == 0x000018, "Member 'BP_Action_UseItem_Monad_C_OnPreProcessAction::Cached_CurrentItem' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_OnPreProcessAction, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'BP_Action_UseItem_Monad_C_OnPreProcessAction::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_OnPreProcessAction, CallFunc_GetConsumeInfo_ReturnValue) == 0x000028, "Member 'BP_Action_UseItem_Monad_C_OnPreProcessAction::CallFunc_GetConsumeInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_OnPreProcessAction, CallFunc_GetComplexGroup_ReturnValue) == 0x000030, "Member 'BP_Action_UseItem_Monad_C_OnPreProcessAction::CallFunc_GetComplexGroup_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_OnPreProcessAction, CallFunc_GetCount_ReturnValue) == 0x000034, "Member 'BP_Action_UseItem_Monad_C_OnPreProcessAction::CallFunc_GetCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_OnPreProcessAction, K2Node_SwitchEnum_CmpSuccess) == 0x000038, "Member 'BP_Action_UseItem_Monad_C_OnPreProcessAction::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_OnPreProcessAction, CallFunc_Greater_IntInt_ReturnValue) == 0x000039, "Member 'BP_Action_UseItem_Monad_C_OnPreProcessAction::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_OnPreProcessAction, CallFunc_IsValid_ReturnValue) == 0x00003A, "Member 'BP_Action_UseItem_Monad_C_OnPreProcessAction::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_OnPreProcessAction, CallFunc_GetComplexItem_Unit_ReturnValue) == 0x000040, "Member 'BP_Action_UseItem_Monad_C_OnPreProcessAction::CallFunc_GetComplexItem_Unit_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_OnPreProcessAction, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'BP_Action_UseItem_Monad_C_OnPreProcessAction::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_OnPreProcessAction, CallFunc_GetReadyToUseItem_OutUseCount) == 0x00004C, "Member 'BP_Action_UseItem_Monad_C_OnPreProcessAction::CallFunc_GetReadyToUseItem_OutUseCount' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_Monad_C_OnPreProcessAction, CallFunc_GetReadyToUseItem_ReturnValue) == 0x000050, "Member 'BP_Action_UseItem_Monad_C_OnPreProcessAction::CallFunc_GetReadyToUseItem_ReturnValue' has a wrong offset!");

}

