#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_TurnAround

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_TurnAround.BP_Action_TurnAround_C
// 0x0020 (0x0250 - 0x0230)
class UBP_Action_TurnAround_C final : public ULAction_SingleAnim
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         PlayLength;                                        // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TurnAroundAngle;                                   // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CoolTime;                                          // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAddCooltime;                                      // 0x0244(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlaySpeed;                                         // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Action_TurnAround(int32 EntryPoint);
	void OnStop(class ULActBase* ReasonAction, class FName Reason);
	void OnStart();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Action_TurnAround_C">();
	}
	static class UBP_Action_TurnAround_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_TurnAround_C>();
	}
};
static_assert(alignof(UBP_Action_TurnAround_C) == 0x000008, "Wrong alignment on UBP_Action_TurnAround_C");
static_assert(sizeof(UBP_Action_TurnAround_C) == 0x000250, "Wrong size on UBP_Action_TurnAround_C");
static_assert(offsetof(UBP_Action_TurnAround_C, UberGraphFrame) == 0x000230, "Member 'UBP_Action_TurnAround_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Action_TurnAround_C, PlayLength) == 0x000238, "Member 'UBP_Action_TurnAround_C::PlayLength' has a wrong offset!");
static_assert(offsetof(UBP_Action_TurnAround_C, TurnAroundAngle) == 0x00023C, "Member 'UBP_Action_TurnAround_C::TurnAroundAngle' has a wrong offset!");
static_assert(offsetof(UBP_Action_TurnAround_C, CoolTime) == 0x000240, "Member 'UBP_Action_TurnAround_C::CoolTime' has a wrong offset!");
static_assert(offsetof(UBP_Action_TurnAround_C, bAddCooltime) == 0x000244, "Member 'UBP_Action_TurnAround_C::bAddCooltime' has a wrong offset!");
static_assert(offsetof(UBP_Action_TurnAround_C, PlaySpeed) == 0x000248, "Member 'UBP_Action_TurnAround_C::PlaySpeed' has a wrong offset!");

}

