#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Guard

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_Guard.BP_Action_Guard_C.ExecuteUbergraph_BP_Action_Guard
// 0x00B0 (0x00B0 - 0x0000)
struct BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_SA_NicolaTail_Active_ReturnValue; // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindActionState_ReturnValue;              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_PlayTargetAnimBP_Branches;                // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayTargetAnimBP_ReturnValue;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_SA_NicolaTail_Active_ReturnValue_1; // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALWeapon*                               CallFunc_GetWeaponByItem_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemHandleInfoPtr                     CallFunc_GetHandleInfo_ReturnValue;                // 0x0050(0x0008)(NoDestructor)
	ELWeaponPostureType                           CallFunc_GetPostureType_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetAxisValueUpperLimit_ReturnValue;       // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_AllowInput_Movement_Forced_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLGameObjectHandle                     CallFunc_AddActionState_AutoRemove_ReturnValue;    // 0x0068(0x0004)(NoDestructor)
	class FName                                   CallFunc_ActionState_Sprint_Disable_ReturnValue;   // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLGameObjectHandle                     CallFunc_AddActionState_AutoRemove_ReturnValue_1;  // 0x0074(0x0004)(NoDestructor)
	class FName                                   CallFunc_ActionState_Stance_Guard_ReturnValue;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLGameObjectHandle                     CallFunc_AddActionState_AutoRemove_ReturnValue_2;  // 0x0080(0x0004)(NoDestructor)
	class FName                                   CallFunc_ActionState_Stance_Guard_ReturnValue_1;   // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_StoppingAction;                       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLGameObjectHandle                     CallFunc_AddActionState_AutoRemove_ReturnValue_3;  // 0x0098(0x0004)(NoDestructor)
	class FName                                   CallFunc_ULActionClass_Guard_Hit_Normal_ReturnValue; // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ULActionClass_Guard_Hit_Heavy_ReturnValue; // 0x00A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard) == 0x000008, "Wrong alignment on BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard");
static_assert(sizeof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard) == 0x0000B0, "Wrong size on BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, EntryPoint) == 0x000000, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, K2Node_Event_ReasonAction) == 0x000008, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, K2Node_Event_Reason) == 0x000010, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000018, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_ActionState_SA_NicolaTail_Active_ReturnValue) == 0x00001C, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_ActionState_SA_NicolaTail_Active_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_FindActionState_ReturnValue) == 0x000024, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_FindActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_PlayTargetAnimBP_Branches) == 0x000025, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_PlayTargetAnimBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_PlayTargetAnimBP_ReturnValue) == 0x000028, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_PlayTargetAnimBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, K2Node_SwitchEnum_CmpSuccess) == 0x00002C, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue) == 0x000030, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_Stop_ReturnValue) == 0x000038, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_ActionState_SA_NicolaTail_Active_ReturnValue_1) == 0x00003C, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_ActionState_SA_NicolaTail_Active_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_GetWeaponByItem_ReturnValue) == 0x000048, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_GetWeaponByItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_GetHandleInfo_ReturnValue) == 0x000050, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_GetHandleInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_GetPostureType_ReturnValue) == 0x000058, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_GetPostureType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000059, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_SetAxisValueUpperLimit_ReturnValue) == 0x00005A, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_SetAxisValueUpperLimit_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00005B, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00005C, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_ActionState_AllowInput_Movement_Forced_ReturnValue) == 0x000060, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_ActionState_AllowInput_Movement_Forced_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_AddActionState_AutoRemove_ReturnValue) == 0x000068, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_AddActionState_AutoRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_ActionState_Sprint_Disable_ReturnValue) == 0x00006C, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_ActionState_Sprint_Disable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_AddActionState_AutoRemove_ReturnValue_1) == 0x000074, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_AddActionState_AutoRemove_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_ActionState_Stance_Guard_ReturnValue) == 0x000078, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_ActionState_Stance_Guard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_AddActionState_AutoRemove_ReturnValue_2) == 0x000080, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_AddActionState_AutoRemove_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_ActionState_Stance_Guard_ReturnValue_1) == 0x000084, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_ActionState_Stance_Guard_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, K2Node_Event_StoppingAction) == 0x000090, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::K2Node_Event_StoppingAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_AddActionState_AutoRemove_ReturnValue_3) == 0x000098, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_AddActionState_AutoRemove_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_ULActionClass_Guard_Hit_Normal_ReturnValue) == 0x00009C, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_ULActionClass_Guard_Hit_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_ULActionClass_Guard_Hit_Heavy_ReturnValue) == 0x0000A4, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_ULActionClass_Guard_Hit_Heavy_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000AC, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x0000AD, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard, CallFunc_BooleanOR_ReturnValue) == 0x0000AE, "Member 'BP_Action_Guard_C_ExecuteUbergraph_BP_Action_Guard::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_Action_Guard.BP_Action_Guard_C.OnStopByMe
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_Guard_C_OnStopByMe final
{
public:
	class ULActBase*                              StoppingAction;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Guard_C_OnStopByMe) == 0x000008, "Wrong alignment on BP_Action_Guard_C_OnStopByMe");
static_assert(sizeof(BP_Action_Guard_C_OnStopByMe) == 0x000008, "Wrong size on BP_Action_Guard_C_OnStopByMe");
static_assert(offsetof(BP_Action_Guard_C_OnStopByMe, StoppingAction) == 0x000000, "Member 'BP_Action_Guard_C_OnStopByMe::StoppingAction' has a wrong offset!");

// Function BP_Action_Guard.BP_Action_Guard_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_Guard_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Guard_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_Guard_C_OnStop");
static_assert(sizeof(BP_Action_Guard_C_OnStop) == 0x000010, "Wrong size on BP_Action_Guard_C_OnStop");
static_assert(offsetof(BP_Action_Guard_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_Guard_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_Guard_C_OnStop::Reason' has a wrong offset!");

// Function BP_Action_Guard.BP_Action_Guard_C.OnLanded
// 0x0098 (0x0098 - 0x0000)
struct BP_Action_Guard_C_OnLanded final
{
public:
	class ACharacter*                             LandingChar;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          EventHandled;                                      // 0x0091(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_Guard_C_OnLanded) == 0x000008, "Wrong alignment on BP_Action_Guard_C_OnLanded");
static_assert(sizeof(BP_Action_Guard_C_OnLanded) == 0x000098, "Wrong size on BP_Action_Guard_C_OnLanded");
static_assert(offsetof(BP_Action_Guard_C_OnLanded, LandingChar) == 0x000000, "Member 'BP_Action_Guard_C_OnLanded::LandingChar' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_OnLanded, Hit) == 0x000008, "Member 'BP_Action_Guard_C_OnLanded::Hit' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_OnLanded, ReturnValue) == 0x000090, "Member 'BP_Action_Guard_C_OnLanded::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_OnLanded, EventHandled) == 0x000091, "Member 'BP_Action_Guard_C_OnLanded::EventHandled' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_OnLanded, CallFunc_Stop_ReturnValue) == 0x000092, "Member 'BP_Action_Guard_C_OnLanded::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_C_OnLanded, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000093, "Member 'BP_Action_Guard_C_OnLanded::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

}

