#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Falling

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_Falling.BP_Action_Falling_C.ExecuteUbergraph_BP_Action_Falling
// 0x0160 (0x0160 - 0x0000)
struct BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_NotifyApplyInput_StrongAttack_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_Event_Montage;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MontageInstanceID;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_NotifyApplyInput_LightAttack_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFallingAnimEx_OutOverrideMontageBlendIn; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetFallingAnimEx_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_Falling_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayTargetAnimExBP_Branches;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayTargetAnimExBP_ReturnValue;           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALNPCCharacter*                         K2Node_DynamicCast_AsLNPCCharacter;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTime;                            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_GetLCharacterMovementComponentBP_Branches; // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULCharacterMovementComponent*           CallFunc_GetLCharacterMovementComponentBP_ReturnValue; // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_2;                          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_ClampSize2D_ReturnValue;           // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActBase*                              K2Node_Event_StoppingAction;                       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_FallingFromDownDrag_F_ReturnValue; // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindActionState_ReturnValue;              // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_FallingFromDownDrag_B_ReturnValue; // 0x00FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindActionState_ReturnValue_1;            // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayCommomAnimBP_MontageInstanceID;       // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PlayCommomAnimBP_Montage;                 // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayCommomAnimBP_Branches;                // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayCommomAnimBP_MontageInstanceID_1;     // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_PlayCommomAnimBP_Montage_1;               // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayCommomAnimBP_Branches_1;              // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x2];                                      // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_FallingFromDownDrag_B_ReturnValue_1; // 0x012C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_FallingFromDownDrag_F_ReturnValue_1; // 0x0134(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindActionState_ReturnValue_2;            // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindActionState_ReturnValue_3;            // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x013E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x013F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter;                 // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling) == 0x000008, "Wrong alignment on BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling");
static_assert(sizeof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling) == 0x000160, "Wrong size on BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, EntryPoint) == 0x000000, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_ActionState_NotifyApplyInput_StrongAttack_ReturnValue) == 0x000008, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_ActionState_NotifyApplyInput_StrongAttack_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, K2Node_Event_Montage) == 0x000010, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::K2Node_Event_Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, K2Node_Event_bInterrupted) == 0x000018, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::K2Node_Event_bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, K2Node_Event_MontageInstanceID) == 0x00001C, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::K2Node_Event_MontageInstanceID' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_ActionState_NotifyApplyInput_LightAttack_ReturnValue) == 0x000020, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_ActionState_NotifyApplyInput_LightAttack_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_GetFallingAnimEx_OutOverrideMontageBlendIn) == 0x000028, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_GetFallingAnimEx_OutOverrideMontageBlendIn' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_GetFallingAnimEx_ReturnValue) == 0x000030, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_GetFallingAnimEx_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_ActionState_Falling_ReturnValue) == 0x000038, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_ActionState_Falling_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_PlayTargetAnimExBP_Branches) == 0x000040, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_PlayTargetAnimExBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_PlayTargetAnimExBP_ReturnValue) == 0x000044, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_PlayTargetAnimExBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, K2Node_SwitchEnum_CmpSuccess) == 0x000048, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00004C, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, K2Node_DynamicCast_AsLNPCCharacter) == 0x000058, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::K2Node_DynamicCast_AsLNPCCharacter' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, K2Node_Event_DeltaTime) == 0x000064, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000068, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_BreakVector_X) == 0x000074, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_BreakVector_Y) == 0x000078, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_BreakVector_Z) == 0x00007C, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_BreakVector_X_1) == 0x000080, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_BreakVector_Y_1) == 0x000084, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_BreakVector_Z_1) == 0x000088, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00008C, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000090, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_GetLCharacterMovementComponentBP_Branches) == 0x000091, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_GetLCharacterMovementComponentBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_GetLCharacterMovementComponentBP_ReturnValue) == 0x000098, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_GetLCharacterMovementComponentBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000A0, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_BreakVector_X_2) == 0x0000A4, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_BreakVector_Y_2) == 0x0000A8, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_BreakVector_Z_2) == 0x0000AC, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000B0, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000B4, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_MakeVector_ReturnValue) == 0x0000B8, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0000C4, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_Vector_ClampSize2D_ReturnValue) == 0x0000C8, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_Vector_ClampSize2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, K2Node_Event_ReasonAction) == 0x0000D8, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, K2Node_Event_Reason) == 0x0000E0, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, K2Node_Event_StoppingAction) == 0x0000E8, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::K2Node_Event_StoppingAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_ActionState_FallingFromDownDrag_F_ReturnValue) == 0x0000F0, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_ActionState_FallingFromDownDrag_F_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_FindActionState_ReturnValue) == 0x0000F8, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_FindActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_ActionState_FallingFromDownDrag_B_ReturnValue) == 0x0000FC, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_ActionState_FallingFromDownDrag_B_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_FindActionState_ReturnValue_1) == 0x000104, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_FindActionState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_PlayCommomAnimBP_MontageInstanceID) == 0x000108, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_PlayCommomAnimBP_MontageInstanceID' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_PlayCommomAnimBP_Montage) == 0x000110, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_PlayCommomAnimBP_Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_PlayCommomAnimBP_Branches) == 0x000118, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_PlayCommomAnimBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, K2Node_SwitchEnum_CmpSuccess_2) == 0x000119, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_PlayCommomAnimBP_MontageInstanceID_1) == 0x00011C, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_PlayCommomAnimBP_MontageInstanceID_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_PlayCommomAnimBP_Montage_1) == 0x000120, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_PlayCommomAnimBP_Montage_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_PlayCommomAnimBP_Branches_1) == 0x000128, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_PlayCommomAnimBP_Branches_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, K2Node_SwitchEnum_CmpSuccess_3) == 0x000129, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_ActionState_FallingFromDownDrag_B_ReturnValue_1) == 0x00012C, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_ActionState_FallingFromDownDrag_B_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_ActionState_FallingFromDownDrag_F_ReturnValue_1) == 0x000134, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_ActionState_FallingFromDownDrag_F_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_FindActionState_ReturnValue_2) == 0x00013C, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_FindActionState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_FindActionState_ReturnValue_3) == 0x00013D, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_FindActionState_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_IsValid_ReturnValue) == 0x00013E, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_IsValid_ReturnValue_1) == 0x00013F, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000140, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000144, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, CallFunc_FMax_ReturnValue) == 0x000148, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, K2Node_DynamicCast_AsLPCCharacter) == 0x000150, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::K2Node_DynamicCast_AsLPCCharacter' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling, K2Node_DynamicCast_bSuccess_1) == 0x000158, "Member 'BP_Action_Falling_C_ExecuteUbergraph_BP_Action_Falling::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_Action_Falling.BP_Action_Falling_C.OnStopByMe
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_Falling_C_OnStopByMe final
{
public:
	class ULActBase*                              StoppingAction;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Falling_C_OnStopByMe) == 0x000008, "Wrong alignment on BP_Action_Falling_C_OnStopByMe");
static_assert(sizeof(BP_Action_Falling_C_OnStopByMe) == 0x000008, "Wrong size on BP_Action_Falling_C_OnStopByMe");
static_assert(offsetof(BP_Action_Falling_C_OnStopByMe, StoppingAction) == 0x000000, "Member 'BP_Action_Falling_C_OnStopByMe::StoppingAction' has a wrong offset!");

// Function BP_Action_Falling.BP_Action_Falling_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_Falling_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Falling_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_Falling_C_OnStop");
static_assert(sizeof(BP_Action_Falling_C_OnStop) == 0x000010, "Wrong size on BP_Action_Falling_C_OnStop");
static_assert(offsetof(BP_Action_Falling_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_Falling_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_Falling_C_OnStop::Reason' has a wrong offset!");

// Function BP_Action_Falling.BP_Action_Falling_C.OnTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Action_Falling_C_OnTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Falling_C_OnTick) == 0x000004, "Wrong alignment on BP_Action_Falling_C_OnTick");
static_assert(sizeof(BP_Action_Falling_C_OnTick) == 0x000004, "Wrong size on BP_Action_Falling_C_OnTick");
static_assert(offsetof(BP_Action_Falling_C_OnTick, DeltaTime) == 0x000000, "Member 'BP_Action_Falling_C_OnTick::DeltaTime' has a wrong offset!");

// Function BP_Action_Falling.BP_Action_Falling_C.OnCurrMontageEnded
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_Falling_C_OnCurrMontageEnded final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MontageInstanceID;                                 // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Falling_C_OnCurrMontageEnded) == 0x000008, "Wrong alignment on BP_Action_Falling_C_OnCurrMontageEnded");
static_assert(sizeof(BP_Action_Falling_C_OnCurrMontageEnded) == 0x000010, "Wrong size on BP_Action_Falling_C_OnCurrMontageEnded");
static_assert(offsetof(BP_Action_Falling_C_OnCurrMontageEnded, Montage) == 0x000000, "Member 'BP_Action_Falling_C_OnCurrMontageEnded::Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_OnCurrMontageEnded, bInterrupted) == 0x000008, "Member 'BP_Action_Falling_C_OnCurrMontageEnded::bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_OnCurrMontageEnded, MontageInstanceID) == 0x00000C, "Member 'BP_Action_Falling_C_OnCurrMontageEnded::MontageInstanceID' has a wrong offset!");

// Function BP_Action_Falling.BP_Action_Falling_C.OnLanded
// 0x0128 (0x0128 - 0x0000)
struct BP_Action_Falling_C_OnLanded final
{
public:
	class ACharacter*                             LandingChar;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          EventHandled;                                      // 0x0091(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter;                   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_Falling_C_OnLanded) == 0x000008, "Wrong alignment on BP_Action_Falling_C_OnLanded");
static_assert(sizeof(BP_Action_Falling_C_OnLanded) == 0x000128, "Wrong size on BP_Action_Falling_C_OnLanded");
static_assert(offsetof(BP_Action_Falling_C_OnLanded, LandingChar) == 0x000000, "Member 'BP_Action_Falling_C_OnLanded::LandingChar' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_OnLanded, Hit) == 0x000008, "Member 'BP_Action_Falling_C_OnLanded::Hit' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_OnLanded, ReturnValue) == 0x000090, "Member 'BP_Action_Falling_C_OnLanded::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Falling_C_OnLanded, EventHandled) == 0x000091, "Member 'BP_Action_Falling_C_OnLanded::EventHandled' has a wrong offset!");
