#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Put_Weapon

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_Put_Weapon.BP_Action_Put_Weapon_C
// 0x0010 (0x0268 - 0x0258)
class UBP_Action_Put_Weapon_C final : public ULAction_LoopAnim
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Cached_JumpStartHeight;                            // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Cached_StartJumpFalling;                           // 0x0264(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Action_Put_Weapon(int32 EntryPoint);
	void OnStop(class ULActBase* ReasonAction, class FName Reason);
	void OnStart();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Action_Put_Weapon_C">();
	}
	static class UBP_Action_Put_Weapon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_Put_Weapon_C>();
	}
};
static_assert(alignof(UBP_Action_Put_Weapon_C) == 0x000008, "Wrong alignment on UBP_Action_Put_Weapon_C");
static_assert(sizeof(UBP_Action_Put_Weapon_C) == 0x000268, "Wrong size on UBP_Action_Put_Weapon_C");
static_assert(offsetof(UBP_Action_Put_Weapon_C, UberGraphFrame) == 0x000258, "Member 'UBP_Action_Put_Weapon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Action_Put_Weapon_C, Cached_JumpStartHeight) == 0x000260, "Member 'UBP_Action_Put_Weapon_C::Cached_JumpStartHeight' has a wrong offset!");
static_assert(offsetof(UBP_Action_Put_Weapon_C, Cached_StartJumpFalling) == 0x000264, "Member 'UBP_Action_Put_Weapon_C::Cached_StartJumpFalling' has a wrong offset!");

}

