#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_SlaveArm_SniperCannon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_SlaveArm_SniperCannon.BP_Action_SlaveArm_SniperCannon_C.ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon
// 0x02C8 (0x02C8 - 0x0000)
struct BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULLockOnSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLockOnMode_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULLockOnSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayTargetAnim_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActMgrComponent*                      K2Node_CustomEvent_ActMgrComponent;                // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_TargetActor;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Command;                        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Lever;                          // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SkipCommandPrerequisitiesCheck; // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_FindActionState_ReturnValue;              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm)
	class FName                                   CallFunc_CheckCurrectSection_CurrentSectionName;   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckCurrectSection_IsPlayingSectionInList; // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInst_ReturnValue;                  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetMontage_NextSection_ReturnValue;       // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array_1;                          // 0x00A8(0x0010)(ReferenceParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   CallFunc_CheckCurrectSection_CurrentSectionName_1; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckCurrectSection_IsPlayingSectionInList_1; // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTime;                            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_MakeArray_Array_2;                          // 0x00D8(0x0010)(ReferenceParm)
	class FName                                   CallFunc_CheckCurrectSection_CurrentSectionName_2; // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckCurrectSection_IsPlayingSectionInList_2; // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULLockOnSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALCameraManager*                        K2Node_DynamicCast_AsLCamera_Manager;              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_153[0x5];                                      // 0x0153(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ULLockOnSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLockOnMode_ReturnValue_1;               // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ULActMgrComponent* ActMgrComponent, class AActor* TargetActor, class FName Command, const struct FVector& Lever, bool SkipCommandPrerequisitiesCheck)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0198(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULLockOnSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLockOnTargetPointLocation_ReturnValue; // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLockOnMode_ReturnValue_2;               // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_PlaySkillActionBP_Branches;               // 0x01CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CF[0x1];                                      // 0x01CF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_PlaySkillActionBP_ReturnValue;            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActBase*                              K2Node_Event_StoppingAction;                       // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_PlaySkillActionBP_Branches_1;             // 0x01E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_PlaySkillActionBP_ReturnValue_1;          // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_PlaySkillActionBP_Branches_2;             // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F2[0x6];                                      // 0x01F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_PlaySkillActionBP_ReturnValue_2;          // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UABP_CH_PC_Pino_C*                      K2Node_DynamicCast_AsABP_CH_PC_Pino;               // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_CH_PC_Pino_C*                      K2Node_DynamicCast_AsABP_CH_PC_Pino_1;             // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array_3;                          // 0x0238(0x0010)(ReferenceParm)
	class FName                                   CallFunc_CheckCurrectSection_CurrentSectionName_3; // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckCurrectSection_IsPlayingSectionInList_3; // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_2;            // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UABP_CH_PC_Pino_C*                      K2Node_DynamicCast_AsABP_CH_PC_Pino_2;             // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x026C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_1;         // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_InputCommand_SlaveArmPress_ReturnValue;   // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCommandPressed_ReturnValue;             // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_GetActMgrComponentBP_Branches;            // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A2[0x6];                                      // 0x02A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActMgrComponent*                      CallFunc_GetActMgrComponentBP_ReturnValue;         // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_ProcessCommand_ReturnValue;               // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon) == 0x000008, "Wrong alignment on BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon");
static_assert(sizeof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon) == 0x0002C8, "Wrong size on BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, EntryPoint) == 0x000000, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_IsLockOnMode_ReturnValue) == 0x000010, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_IsLockOnMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_Stop_ReturnValue) == 0x000012, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000013, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000018, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_PlayTargetAnim_ReturnValue) == 0x000020, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_PlayTargetAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_CustomEvent_ActMgrComponent) == 0x000028, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_CustomEvent_ActMgrComponent' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_CustomEvent_TargetActor) == 0x000030, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_CustomEvent_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_CustomEvent_Command) == 0x000038, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_CustomEvent_Command' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_CustomEvent_Lever) == 0x000040, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_CustomEvent_Lever' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_CustomEvent_SkipCommandPrerequisitiesCheck) == 0x00004C, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_CustomEvent_SkipCommandPrerequisitiesCheck' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_SwitchName_CmpSuccess) == 0x00004D, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_FindActionState_ReturnValue) == 0x000060, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_FindActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_Event_ReasonAction) == 0x000068, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_Event_Reason) == 0x000070, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_MakeArray_Array) == 0x000078, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_CheckCurrectSection_CurrentSectionName) == 0x000088, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_CheckCurrectSection_CurrentSectionName' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_CheckCurrectSection_IsPlayingSectionInList) == 0x000090, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_CheckCurrectSection_IsPlayingSectionInList' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_GetAnimInst_ReturnValue) == 0x000098, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_GetAnimInst_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_SetMontage_NextSection_ReturnValue) == 0x0000A1, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_SetMontage_NextSection_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_MakeArray_Array_1) == 0x0000A8, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B8, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_CheckCurrectSection_CurrentSectionName_1) == 0x0000C8, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_CheckCurrectSection_CurrentSectionName_1' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_CheckCurrectSection_IsPlayingSectionInList_1) == 0x0000D0, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_CheckCurrectSection_IsPlayingSectionInList_1' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_Event_DeltaTime) == 0x0000D4, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_MakeArray_Array_2) == 0x0000D8, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_CheckCurrectSection_CurrentSectionName_2) == 0x0000E8, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_CheckCurrectSection_CurrentSectionName_2' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_CheckCurrectSection_IsPlayingSectionInList_2) == 0x0000F0, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_CheckCurrectSection_IsPlayingSectionInList_2' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000F4, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_FindLookAtRotation_ReturnValue) == 0x000100, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_Not_PreBool_ReturnValue_1) == 0x00010C, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_BreakRotator_Roll) == 0x000110, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_BreakRotator_Pitch) == 0x000114, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_BreakRotator_Yaw) == 0x000118, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_MakeRotator_ReturnValue) == 0x00011C, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_K2_SetActorRotation_ReturnValue) == 0x000128, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000130, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_Not_PreBool_ReturnValue_2) == 0x000138, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000140, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_DynamicCast_AsLCamera_Manager) == 0x000148, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_DynamicCast_AsLCamera_Manager' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_DynamicCast_bSuccess) == 0x000150, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_IsValid_ReturnValue_1) == 0x000151, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_IsValid_ReturnValue_2) == 0x000152, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000158, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_IsValid_ReturnValue_3) == 0x000160, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_IsLockOnMode_ReturnValue_1) == 0x000161, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_IsLockOnMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000164, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_IsValid_ReturnValue_4) == 0x000170, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000174, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_GetForwardVector_ReturnValue) == 0x000180, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00018C, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_CreateDelegate_OutputDelegate_2) == 0x000198, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_Add_VectorVector_ReturnValue) == 0x0001A8, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x0001B8, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_GetLockOnTargetPointLocation_ReturnValue) == 0x0001C0, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_GetLockOnTargetPointLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_IsLockOnMode_ReturnValue_2) == 0x0001CC, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_IsLockOnMode_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_IsValid_ReturnValue_5) == 0x0001CD, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_PlaySkillActionBP_Branches) == 0x0001CE, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_PlaySkillActionBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_PlaySkillActionBP_ReturnValue) == 0x0001D0, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_PlaySkillActionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_Event_StoppingAction) == 0x0001D8, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_Event_StoppingAction' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_SwitchEnum_CmpSuccess) == 0x0001E0, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_SwitchEnum_CmpSuccess_1) == 0x0001E1, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0001E2, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_PlaySkillActionBP_Branches_1) == 0x0001E3, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_PlaySkillActionBP_Branches_1' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_PlaySkillActionBP_ReturnValue_1) == 0x0001E8, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_PlaySkillActionBP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_SwitchEnum_CmpSuccess_2) == 0x0001F0, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_PlaySkillActionBP_Branches_2) == 0x0001F1, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_PlaySkillActionBP_Branches_2' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_PlaySkillActionBP_ReturnValue_2) == 0x0001F8, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_PlaySkillActionBP_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_SwitchEnum_CmpSuccess_3) == 0x000200, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_GetAnimInstance_ReturnValue) == 0x000208, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000210, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_DynamicCast_AsABP_CH_PC_Pino) == 0x000218, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_DynamicCast_AsABP_CH_PC_Pino' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_DynamicCast_bSuccess_1) == 0x000220, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_DynamicCast_AsABP_CH_PC_Pino_1) == 0x000228, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_DynamicCast_AsABP_CH_PC_Pino_1' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_DynamicCast_bSuccess_2) == 0x000230, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_MakeArray_Array_3) == 0x000238, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_CheckCurrectSection_CurrentSectionName_3) == 0x000248, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_CheckCurrectSection_CurrentSectionName_3' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_CheckCurrectSection_IsPlayingSectionInList_3) == 0x000250, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_CheckCurrectSection_IsPlayingSectionInList_3' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_GetAnimInstance_ReturnValue_2) == 0x000258, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_GetAnimInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_DynamicCast_AsABP_CH_PC_Pino_2) == 0x000260, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_DynamicCast_AsABP_CH_PC_Pino_2' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_DynamicCast_bSuccess_3) == 0x000268, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_GetSocketLocation_ReturnValue) == 0x00026C, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000278, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_FindLookAtRotation_ReturnValue_1) == 0x00027C, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_FindLookAtRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000288, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_Add_FloatFloat_ReturnValue) == 0x00028C, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_FClamp_ReturnValue) == 0x000290, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_IsValid_ReturnValue_6) == 0x000294, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_InputCommand_SlaveArmPress_ReturnValue) == 0x000298, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_InputCommand_SlaveArmPress_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_IsCommandPressed_ReturnValue) == 0x0002A0, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_IsCommandPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_GetActMgrComponentBP_Branches) == 0x0002A1, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_GetActMgrComponentBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_GetActMgrComponentBP_ReturnValue) == 0x0002A8, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_GetActMgrComponentBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_Not_PreBool_ReturnValue_3) == 0x0002B0, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_ProcessCommand_ReturnValue) == 0x0002B8, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_ProcessCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, K2Node_SwitchEnum_CmpSuccess_4) == 0x0002C0, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon, CallFunc_Not_PreBool_ReturnValue_4) == 0x0002C1, "Member 'BP_Action_SlaveArm_SniperCannon_C_ExecuteUbergraph_BP_Action_SlaveArm_SniperCannon::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");

// Function BP_Action_SlaveArm_SniperCannon.BP_Action_SlaveArm_SniperCannon_C.OnStopByMe
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_SlaveArm_SniperCannon_C_OnStopByMe final
{
public:
	class ULActBase*                              StoppingAction;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_SlaveArm_SniperCannon_C_OnStopByMe) == 0x000008, "Wrong alignment on BP_Action_SlaveArm_SniperCannon_C_OnStopByMe");
static_assert(sizeof(BP_Action_SlaveArm_SniperCannon_C_OnStopByMe) == 0x000008, "Wrong size on BP_Action_SlaveArm_SniperCannon_C_OnStopByMe");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_OnStopByMe, StoppingAction) == 0x000000, "Member 'BP_Action_SlaveArm_SniperCannon_C_OnStopByMe::StoppingAction' has a wrong offset!");

// Function BP_Action_SlaveArm_SniperCannon.BP_Action_SlaveArm_SniperCannon_C.OnTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Action_SlaveArm_SniperCannon_C_OnTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_SlaveArm_SniperCannon_C_OnTick) == 0x000004, "Wrong alignment on BP_Action_SlaveArm_SniperCannon_C_OnTick");
static_assert(sizeof(BP_Action_SlaveArm_SniperCannon_C_OnTick) == 0x000004, "Wrong size on BP_Action_SlaveArm_SniperCannon_C_OnTick");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_OnTick, DeltaTime) == 0x000000, "Member 'BP_Action_SlaveArm_SniperCannon_C_OnTick::DeltaTime' has a wrong offset!");

// Function BP_Action_SlaveArm_SniperCannon.BP_Action_SlaveArm_SniperCannon_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_SlaveArm_SniperCannon_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_SlaveArm_SniperCannon_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_SlaveArm_SniperCannon_C_OnStop");
static_assert(sizeof(BP_Action_SlaveArm_SniperCannon_C_OnStop) == 0x000010, "Wrong size on BP_Action_SlaveArm_SniperCannon_C_OnStop");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_SlaveArm_SniperCannon_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_SlaveArm_SniperCannon_C_OnStop::Reason' has a wrong offset!");

// Function BP_Action_SlaveArm_SniperCannon.BP_Action_SlaveArm_SniperCannon_C.OnCommandOccured_Event
// 0x0028 (0x0028 - 0x0000)
struct BP_Action_SlaveArm_SniperCannon_C_OnCommandOccured_Event final
{
public:
	class ULActMgrComponent*                      ActMgrComponent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Command;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Lever;                                             // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipCommandPrerequisitiesCheck;                    // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_SlaveArm_SniperCannon_C_OnCommandOccured_Event) == 0x000008, "Wrong alignment on BP_Action_SlaveArm_SniperCannon_C_OnCommandOccured_Event");
static_assert(sizeof(BP_Action_SlaveArm_SniperCannon_C_OnCommandOccured_Event) == 0x000028, "Wrong size on BP_Action_SlaveArm_SniperCannon_C_OnCommandOccured_Event");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_OnCommandOccured_Event, ActMgrComponent) == 0x000000, "Member 'BP_Action_SlaveArm_SniperCannon_C_OnCommandOccured_Event::ActMgrComponent' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_OnCommandOccured_Event, TargetActor) == 0x000008, "Member 'BP_Action_SlaveArm_SniperCannon_C_OnCommandOccured_Event::TargetActor' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_OnCommandOccured_Event, Command) == 0x000010, "Member 'BP_Action_SlaveArm_SniperCannon_C_OnCommandOccured_Event::Command' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_OnCommandOccured_Event, Lever) == 0x000018, "Member 'BP_Action_SlaveArm_SniperCannon_C_OnCommandOccured_Event::Lever' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_SniperCannon_C_OnCommandOccured_Event, SkipCommandPrerequisitiesCheck) == 0x000024, "Member 'BP_Action_SlaveArm_SniperCannon_C_OnCommandOccured_Event::SkipCommandPrerequisitiesCheck' has a wrong offset!");

// Function BP_Action_SlaveArm_SniperCannon.BP_Action_SlaveArm_SniperCannon_C.SetReinforcedVariableValue
// 0x0014 (0x0014 - 0x0000)
struct BP_Action_SlaveArm_SniperCannon_C_SetReinforcedVariableValue final
{
public:
