#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_WeaponBreak

#include "Basic.hpp"

#include "BP_Action_HitBase_classes.hpp"
#include "Engine_structs.hpp"
#include "ProjectP_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_WeaponBreak.BP_Action_WeaponBreak_C
// 0x01A8 (0x05C8 - 0x0420)
class UBP_Action_WeaponBreak_C final : public UBP_Action_HitBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Action_WeaponBreak_C;            // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FHitResult                             HitResult;                                         // 0x0428(0x0088)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FLFxSocketTracerInfo                   SocketTraceInfo;                                   // 0x04B0(0x0108)(Edit, BlueprintVisible, ContainsInstancedReference)
	class UPhysicalMaterial*                      NewVar_0;                                          // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CommonAnim_Weapon_Break;                           // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Action_WeaponBreak(int32 EntryPoint);
	void OnCurrMontageEnded(class UAnimMontage* Montage, bool bInterrupted, int32 MontageInstanceID);
	void OnStart();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Action_WeaponBreak_C">();
	}
	static class UBP_Action_WeaponBreak_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_WeaponBreak_C>();
	}
};
static_assert(alignof(UBP_Action_WeaponBreak_C) == 0x000008, "Wrong alignment on UBP_Action_WeaponBreak_C");
static_assert(sizeof(UBP_Action_WeaponBreak_C) == 0x0005C8, "Wrong size on UBP_Action_WeaponBreak_C");
static_assert(offsetof(UBP_Action_WeaponBreak_C, UberGraphFrame_BP_Action_WeaponBreak_C) == 0x000420, "Member 'UBP_Action_WeaponBreak_C::UberGraphFrame_BP_Action_WeaponBreak_C' has a wrong offset!");
static_assert(offsetof(UBP_Action_WeaponBreak_C, HitResult) == 0x000428, "Member 'UBP_Action_WeaponBreak_C::HitResult' has a wrong offset!");
static_assert(offsetof(UBP_Action_WeaponBreak_C, SocketTraceInfo) == 0x0004B0, "Member 'UBP_Action_WeaponBreak_C::SocketTraceInfo' has a wrong offset!");
static_assert(offsetof(UBP_Action_WeaponBreak_C, NewVar_0) == 0x0005B8, "Member 'UBP_Action_WeaponBreak_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UBP_Action_WeaponBreak_C, CommonAnim_Weapon_Break) == 0x0005C0, "Member 'UBP_Action_WeaponBreak_C::CommonAnim_Weapon_Break' has a wrong offset!");

}

