#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_CeilingHitFalling

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "BP_Action_HitBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_CeilingHitFalling.BP_Action_CeilingHitFalling_C
// 0x0020 (0x0440 - 0x0420)
class UBP_Action_CeilingHitFalling_C final : public UBP_Action_HitBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Action_CeilingHitFalling_C;      // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Montage_Instance_ID;                               // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Start_Montage_Instance_ID;                         // 0x042C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Hit_Anim;                                          // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CeilingTraceHeight;                                // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Action_CeilingHitFalling(int32 EntryPoint);
	void OnStart();
	void OnCurrMontageEnded(class UAnimMontage* Montage, bool bInterrupted, int32 MontageInstanceID);
	void OnCurrMontageBlendOutStarted(class UAnimMontage* Montage, bool bInterrupted, int32 MontageInstanceID);
	bool OnLanded(class ACharacter* LandingChar, const struct FHitResult& Hit);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Action_CeilingHitFalling_C">();
	}
	static class UBP_Action_CeilingHitFalling_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_CeilingHitFalling_C>();
	}
};
static_assert(alignof(UBP_Action_CeilingHitFalling_C) == 0x000008, "Wrong alignment on UBP_Action_CeilingHitFalling_C");
static_assert(sizeof(UBP_Action_CeilingHitFalling_C) == 0x000440, "Wrong size on UBP_Action_CeilingHitFalling_C");
static_assert(offsetof(UBP_Action_CeilingHitFalling_C, UberGraphFrame_BP_Action_CeilingHitFalling_C) == 0x000420, "Member 'UBP_Action_CeilingHitFalling_C::UberGraphFrame_BP_Action_CeilingHitFalling_C' has a wrong offset!");
static_assert(offsetof(UBP_Action_CeilingHitFalling_C, Montage_Instance_ID) == 0x000428, "Member 'UBP_Action_CeilingHitFalling_C::Montage_Instance_ID' has a wrong offset!");
static_assert(offsetof(UBP_Action_CeilingHitFalling_C, Start_Montage_Instance_ID) == 0x00042C, "Member 'UBP_Action_CeilingHitFalling_C::Start_Montage_Instance_ID' has a wrong offset!");
static_assert(offsetof(UBP_Action_CeilingHitFalling_C, Hit_Anim) == 0x000430, "Member 'UBP_Action_CeilingHitFalling_C::Hit_Anim' has a wrong offset!");
static_assert(offsetof(UBP_Action_CeilingHitFalling_C, CeilingTraceHeight) == 0x000438, "Member 'UBP_Action_CeilingHitFalling_C::CeilingTraceHeight' has a wrong offset!");

}

