#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_TalkerIdle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectP_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_TalkerIdle.BP_Action_TalkerIdle_C.ExecuteUbergraph_BP_Action_TalkerIdle
// 0x0020 (0x0020 - 0x0000)
struct BP_Action_TalkerIdle_C_ExecuteUbergraph_BP_Action_TalkerIdle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Event_Montage;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MontageInstanceID;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_TalkerIdle_C_ExecuteUbergraph_BP_Action_TalkerIdle) == 0x000008, "Wrong alignment on BP_Action_TalkerIdle_C_ExecuteUbergraph_BP_Action_TalkerIdle");
static_assert(sizeof(BP_Action_TalkerIdle_C_ExecuteUbergraph_BP_Action_TalkerIdle) == 0x000020, "Wrong size on BP_Action_TalkerIdle_C_ExecuteUbergraph_BP_Action_TalkerIdle");
static_assert(offsetof(BP_Action_TalkerIdle_C_ExecuteUbergraph_BP_Action_TalkerIdle, EntryPoint) == 0x000000, "Member 'BP_Action_TalkerIdle_C_ExecuteUbergraph_BP_Action_TalkerIdle::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_ExecuteUbergraph_BP_Action_TalkerIdle, K2Node_Event_Montage) == 0x000008, "Member 'BP_Action_TalkerIdle_C_ExecuteUbergraph_BP_Action_TalkerIdle::K2Node_Event_Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_ExecuteUbergraph_BP_Action_TalkerIdle, K2Node_Event_bInterrupted) == 0x000010, "Member 'BP_Action_TalkerIdle_C_ExecuteUbergraph_BP_Action_TalkerIdle::K2Node_Event_bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_ExecuteUbergraph_BP_Action_TalkerIdle, K2Node_Event_MontageInstanceID) == 0x000014, "Member 'BP_Action_TalkerIdle_C_ExecuteUbergraph_BP_Action_TalkerIdle::K2Node_Event_MontageInstanceID' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_ExecuteUbergraph_BP_Action_TalkerIdle, CallFunc_IsPlaying_ReturnValue) == 0x000018, "Member 'BP_Action_TalkerIdle_C_ExecuteUbergraph_BP_Action_TalkerIdle::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_ExecuteUbergraph_BP_Action_TalkerIdle, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000019, "Member 'BP_Action_TalkerIdle_C_ExecuteUbergraph_BP_Action_TalkerIdle::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Action_TalkerIdle.BP_Action_TalkerIdle_C.OnCurrMontageEnded
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_TalkerIdle_C_OnCurrMontageEnded final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MontageInstanceID;                                 // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_TalkerIdle_C_OnCurrMontageEnded) == 0x000008, "Wrong alignment on BP_Action_TalkerIdle_C_OnCurrMontageEnded");
static_assert(sizeof(BP_Action_TalkerIdle_C_OnCurrMontageEnded) == 0x000010, "Wrong size on BP_Action_TalkerIdle_C_OnCurrMontageEnded");
static_assert(offsetof(BP_Action_TalkerIdle_C_OnCurrMontageEnded, Montage) == 0x000000, "Member 'BP_Action_TalkerIdle_C_OnCurrMontageEnded::Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_OnCurrMontageEnded, bInterrupted) == 0x000008, "Member 'BP_Action_TalkerIdle_C_OnCurrMontageEnded::bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_OnCurrMontageEnded, MontageInstanceID) == 0x00000C, "Member 'BP_Action_TalkerIdle_C_OnCurrMontageEnded::MontageInstanceID' has a wrong offset!");

// Function BP_Action_TalkerIdle.BP_Action_TalkerIdle_C.PickTalkerIdle
// 0x0070 (0x0070 - 0x0000)
struct BP_Action_TalkerIdle_C_PickTalkerIdle final
{
public:
	class FName                                   IdleName;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   PickedResult;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALNPCCharacter*                         K2Node_DynamicCast_AsLNPCCharacter;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCodeName_ReturnValue;                  // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTalkerInfoPtr                         CallFunc_FindTalkerInfoByNameBP_ReturnValue;       // 0x0030(0x0008)(NoDestructor)
	EContentInfoExecutePin                        CallFunc_IsValidBranch_Branches;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetTalkerIdleSub_ReturnValue;             // 0x0040(0x0010)(ConstParm, ReferenceParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Random_OutItem;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetTalkerIdle_ReturnValue;                // 0x0068(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_TalkerIdle_C_PickTalkerIdle) == 0x000008, "Wrong alignment on BP_Action_TalkerIdle_C_PickTalkerIdle");
static_assert(sizeof(BP_Action_TalkerIdle_C_PickTalkerIdle) == 0x000070, "Wrong size on BP_Action_TalkerIdle_C_PickTalkerIdle");
static_assert(offsetof(BP_Action_TalkerIdle_C_PickTalkerIdle, IdleName) == 0x000000, "Member 'BP_Action_TalkerIdle_C_PickTalkerIdle::IdleName' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_PickTalkerIdle, PickedResult) == 0x000008, "Member 'BP_Action_TalkerIdle_C_PickTalkerIdle::PickedResult' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_PickTalkerIdle, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'BP_Action_TalkerIdle_C_PickTalkerIdle::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_PickTalkerIdle, K2Node_DynamicCast_AsLNPCCharacter) == 0x000018, "Member 'BP_Action_TalkerIdle_C_PickTalkerIdle::K2Node_DynamicCast_AsLNPCCharacter' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_PickTalkerIdle, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Action_TalkerIdle_C_PickTalkerIdle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_PickTalkerIdle, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'BP_Action_TalkerIdle_C_PickTalkerIdle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_PickTalkerIdle, CallFunc_IsValid_ReturnValue_1) == 0x000022, "Member 'BP_Action_TalkerIdle_C_PickTalkerIdle::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_PickTalkerIdle, CallFunc_GetCodeName_ReturnValue) == 0x000024, "Member 'BP_Action_TalkerIdle_C_PickTalkerIdle::CallFunc_GetCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_PickTalkerIdle, CallFunc_FindTalkerInfoByNameBP_ReturnValue) == 0x000030, "Member 'BP_Action_TalkerIdle_C_PickTalkerIdle::CallFunc_FindTalkerInfoByNameBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_PickTalkerIdle, CallFunc_IsValidBranch_Branches) == 0x000038, "Member 'BP_Action_TalkerIdle_C_PickTalkerIdle::CallFunc_IsValidBranch_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_PickTalkerIdle, CallFunc_GetTalkerIdleSub_ReturnValue) == 0x000040, "Member 'BP_Action_TalkerIdle_C_PickTalkerIdle::CallFunc_GetTalkerIdleSub_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_PickTalkerIdle, K2Node_SwitchEnum_CmpSuccess) == 0x000050, "Member 'BP_Action_TalkerIdle_C_PickTalkerIdle::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_PickTalkerIdle, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'BP_Action_TalkerIdle_C_PickTalkerIdle::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_PickTalkerIdle, CallFunc_Array_Random_OutItem) == 0x000058, "Member 'BP_Action_TalkerIdle_C_PickTalkerIdle::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_PickTalkerIdle, CallFunc_Array_Random_OutIndex) == 0x000060, "Member 'BP_Action_TalkerIdle_C_PickTalkerIdle::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_PickTalkerIdle, CallFunc_Greater_IntInt_ReturnValue) == 0x000064, "Member 'BP_Action_TalkerIdle_C_PickTalkerIdle::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_PickTalkerIdle, CallFunc_GetTalkerIdle_ReturnValue) == 0x000068, "Member 'BP_Action_TalkerIdle_C_PickTalkerIdle::CallFunc_GetTalkerIdle_ReturnValue' has a wrong offset!");

// Function BP_Action_TalkerIdle.BP_Action_TalkerIdle_C.PlayTalkerIdle
// 0x0040 (0x0040 - 0x0000)
struct BP_Action_TalkerIdle_C_PlayTalkerIdle final
{
public:
	class FName                                   RequestCommonAnim;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayCommomAnimBP_MontageInstanceID;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PlayCommomAnimBP_Montage;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayCommomAnimBP_Branches;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PickTalkerIdle_IdleName;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_TalkerIdle_C_PlayTalkerIdle) == 0x000008, "Wrong alignment on BP_Action_TalkerIdle_C_PlayTalkerIdle");
static_assert(sizeof(BP_Action_TalkerIdle_C_PlayTalkerIdle) == 0x000040, "Wrong size on BP_Action_TalkerIdle_C_PlayTalkerIdle");
static_assert(offsetof(BP_Action_TalkerIdle_C_PlayTalkerIdle, RequestCommonAnim) == 0x000000, "Member 'BP_Action_TalkerIdle_C_PlayTalkerIdle::RequestCommonAnim' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_PlayTalkerIdle, CallFunc_PlayCommomAnimBP_MontageInstanceID) == 0x000008, "Member 'BP_Action_TalkerIdle_C_PlayTalkerIdle::CallFunc_PlayCommomAnimBP_MontageInstanceID' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_PlayTalkerIdle, CallFunc_PlayCommomAnimBP_Montage) == 0x000010, "Member 'BP_Action_TalkerIdle_C_PlayTalkerIdle::CallFunc_PlayCommomAnimBP_Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_PlayTalkerIdle, CallFunc_PlayCommomAnimBP_Branches) == 0x000018, "Member 'BP_Action_TalkerIdle_C_PlayTalkerIdle::CallFunc_PlayCommomAnimBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_PlayTalkerIdle, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'BP_Action_TalkerIdle_C_PlayTalkerIdle::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_PlayTalkerIdle, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BP_Action_TalkerIdle_C_PlayTalkerIdle::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_PlayTalkerIdle, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'BP_Action_TalkerIdle_C_PlayTalkerIdle::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_TalkerIdle_C_PlayTalkerIdle, CallFunc_PickTalkerIdle_IdleName) == 0x000038, "Member 'BP_Action_TalkerIdle_C_PlayTalkerIdle::CallFunc_PickTalkerIdle_IdleName' has a wrong offset!");

}

