#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Groggy

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_Action_DMG_STAND_classes.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_Groggy.BP_Action_Groggy_C
// 0x0028 (0x0698 - 0x0670)
class UBP_Action_Groggy_C final : public UBP_Action_DMG_STAND_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Action_Groggy_C;                 // 0x0670(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FTimerHandle                           LoopCancelTimer;                                   // 0x0678(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   CommonAnim_Groggy;                                 // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HPGroggyEnd;                                       // 0x0688(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HPGroggyEnd_EndRate;                               // 0x068C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enable_HPGroggyEnd;                                // 0x0690(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Action_Groggy(int32 EntryPoint);
	void OnTick(float DeltaTime);
	void OnGroggyEnded();
	void ProcessHitAnim();
	void OnCurrMontageEnded(class UAnimMontage* Montage, bool bInterrupted, int32 MontageInstanceID);
	void OnStop(class ULActBase* ReasonAction, class FName Reason);
	void OnStart();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Action_Groggy_C">();
	}
	static class UBP_Action_Groggy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_Groggy_C>();
	}
};
static_assert(alignof(UBP_Action_Groggy_C) == 0x000008, "Wrong alignment on UBP_Action_Groggy_C");
static_assert(sizeof(UBP_Action_Groggy_C) == 0x000698, "Wrong size on UBP_Action_Groggy_C");
static_assert(offsetof(UBP_Action_Groggy_C, UberGraphFrame_BP_Action_Groggy_C) == 0x000670, "Member 'UBP_Action_Groggy_C::UberGraphFrame_BP_Action_Groggy_C' has a wrong offset!");
static_assert(offsetof(UBP_Action_Groggy_C, LoopCancelTimer) == 0x000678, "Member 'UBP_Action_Groggy_C::LoopCancelTimer' has a wrong offset!");
static_assert(offsetof(UBP_Action_Groggy_C, CommonAnim_Groggy) == 0x000680, "Member 'UBP_Action_Groggy_C::CommonAnim_Groggy' has a wrong offset!");
static_assert(offsetof(UBP_Action_Groggy_C, HPGroggyEnd) == 0x000688, "Member 'UBP_Action_Groggy_C::HPGroggyEnd' has a wrong offset!");
static_assert(offsetof(UBP_Action_Groggy_C, HPGroggyEnd_EndRate) == 0x00068C, "Member 'UBP_Action_Groggy_C::HPGroggyEnd_EndRate' has a wrong offset!");
static_assert(offsetof(UBP_Action_Groggy_C, Enable_HPGroggyEnd) == 0x000690, "Member 'UBP_Action_Groggy_C::Enable_HPGroggyEnd' has a wrong offset!");

}

