#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_UseGrinder_Element

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_UseGrinder_Element.BP_Action_UseGrinder_Element_C
// 0x0038 (0x0290 - 0x0258)
class UBP_Action_UseGrinder_Element_C final : public ULAction_LoopAnim
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ULItem*                                 OriginalItem;                                      // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 TargetItem;                                        // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActPayload_UseItem*                   PayloadItem;                                       // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Cached_UseMainItemInstead;                         // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Success;                                           // 0x0279(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A[0x6];                                      // 0x027A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 Cached_CurrentItem;                                // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 Cached_CurrentItem_Unit;                           // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Action_UseGrinder_Element(int32 EntryPoint);
	void OnCurrMontageEnded(class UAnimMontage* Montage, bool bInterrupted, int32 MontageInstanceID);
	void OnStop(class ULActBase* ReasonAction, class FName Reason);
	void OnStart();
	bool OnPreProcessAction();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Action_UseGrinder_Element_C">();
	}
	static class UBP_Action_UseGrinder_Element_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_UseGrinder_Element_C>();
	}
};
static_assert(alignof(UBP_Action_UseGrinder_Element_C) == 0x000008, "Wrong alignment on UBP_Action_UseGrinder_Element_C");
static_assert(sizeof(UBP_Action_UseGrinder_Element_C) == 0x000290, "Wrong size on UBP_Action_UseGrinder_Element_C");
static_assert(offsetof(UBP_Action_UseGrinder_Element_C, UberGraphFrame) == 0x000258, "Member 'UBP_Action_UseGrinder_Element_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Action_UseGrinder_Element_C, OriginalItem) == 0x000260, "Member 'UBP_Action_UseGrinder_Element_C::OriginalItem' has a wrong offset!");
static_assert(offsetof(UBP_Action_UseGrinder_Element_C, TargetItem) == 0x000268, "Member 'UBP_Action_UseGrinder_Element_C::TargetItem' has a wrong offset!");
static_assert(offsetof(UBP_Action_UseGrinder_Element_C, PayloadItem) == 0x000270, "Member 'UBP_Action_UseGrinder_Element_C::PayloadItem' has a wrong offset!");
static_assert(offsetof(UBP_Action_UseGrinder_Element_C, Cached_UseMainItemInstead) == 0x000278, "Member 'UBP_Action_UseGrinder_Element_C::Cached_UseMainItemInstead' has a wrong offset!");
static_assert(offsetof(UBP_Action_UseGrinder_Element_C, Success) == 0x000279, "Member 'UBP_Action_UseGrinder_Element_C::Success' has a wrong offset!");
static_assert(offsetof(UBP_Action_UseGrinder_Element_C, Cached_CurrentItem) == 0x000280, "Member 'UBP_Action_UseGrinder_Element_C::Cached_CurrentItem' has a wrong offset!");
static_assert(offsetof(UBP_Action_UseGrinder_Element_C, Cached_CurrentItem_Unit) == 0x000288, "Member 'UBP_Action_UseGrinder_Element_C::Cached_CurrentItem_Unit' has a wrong offset!");

}

