#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_UseItem

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_UseItem.BP_Action_UseItem_C.ExecuteUbergraph_BP_Action_UseItem
// 0x0260 (0x0260 - 0x0000)
struct BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 CallFunc_GetComplexItem_Unit_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemConsumeInfoPtr                    CallFunc_GetConsumeInfo_ReturnValue;               // 0x0018(0x0008)(NoDestructor)
	class FName                                   CallFunc_GetUseSkillCodeName_ReturnValue;          // 0x0020(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSkillInfoPtr                          CallFunc_FindSkillInfoByNameBP_ReturnValue;        // 0x0030(0x0008)(NoDestructor)
	class FString                                 CallFunc_GetAnimName_ReturnValue;                  // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ULActMgrComponent* ActMgrComponent, class AActor* TargetActor, class FName Command, const struct FVector& Lever, bool SkipCommandPrerequisitiesCheck)> K2Node_CreateDelegate_OutputDelegate;              // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_GetActiveUseItemSkillCodeNameBP_Branches; // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetActiveUseItemSkillCodeNameBP_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Event_Montage;                              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted;                         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MontageInstanceID;                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActPayloadBase*                       CallFunc_GetActPayload_ReturnValue;                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetCommonAnim_ReturnValue;                // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActPayload_UseItem*                   K2Node_DynamicCast_AsLAct_Payload_Use_Item;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimMontage>            CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x00D0(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	ELConditionalAnimBranch                       CallFunc_ConditionalAnimBranch_OutBranchResult;    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_ConditionalAnimBranch_OutInstigator;      // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class ULAnimNotifyState_CheckCommandHold* K2Node_DynamicCast_AsCheckCommandHold;             // 0x0108(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class ULAnimNotifyState_CheckCommandHold* K2Node_DynamicCast_AsCheckCommandHold_1;           // 0x0118(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemConsumeInfoPtr                    CallFunc_GetConsumeInfo_ReturnValue_1;             // 0x0128(0x0008)(NoDestructor)
	class FName                                   CallFunc_GetSlavearmAlterItemMatch_ReturnValue;    // 0x0130(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayTargetAnimBP_Branches;                // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayTargetAnimBP_ReturnValue;             // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_PlayTargetAnimBP_Branches_1;              // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_143[0x1];                                      // 0x0143(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayTargetAnimBP_ReturnValue_1;           // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInst_ReturnValue;                  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_SetMontage_ExpireAllBranchingPointWhenBlendOutStartedBP_Branches; // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetMontage_ExpireAllBranchingPointWhenBlendOutStartedBP_ReturnValue; // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x0153(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_ActionStopReason_PayloadInvalid_ReturnValue; // 0x0154(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALWeapon*                               CallFunc_GetWeaponByAttachPoint_ReturnValue;       // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue_1;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemBladeInfoPtr                      CallFunc_GetBladeInfo_ReturnValue;                 // 0x0170(0x0008)(NoDestructor)
	bool                                          CallFunc_GetAbnormalEnchantDisable_ReturnValue;    // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_PlayTargetAnimBP_Branches_2;              // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A[0x2];                                      // 0x017A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayTargetAnimBP_ReturnValue_2;           // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue; // 0x0184(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Stop_ReturnValue_2;                       // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18E[0x2];                                      // 0x018E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue_1; // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue_2; // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue_3;                       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Stop_ReturnValue_4;                       // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A2[0x2];                                      // 0x01A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x01A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue_3; // 0x01AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue_5;                       // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x01B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B6[0x2];                                      // 0x01B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetCommonAnim_ReturnValue_1;              // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetActionTime_Start_ReturnValue;          // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCommandRaisedTime_ReturnValue;         // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActBase*                              CallFunc_PlayActionClass_ReturnValue;              // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCommandPressed_ReturnValue;             // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D2[0x6];                                      // 0x01D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetReadyToUseItem_OutUseCount;            // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 CallFunc_GetReadyToUseItem_ReturnValue;            // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_AllowInput_Movement_Forced_ReturnValue; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLGameObjectHandle                     CallFunc_AddActionState_AutoRemove_ReturnValue;    // 0x01F8(0x0004)(NoDestructor)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActMgrComponent*                      K2Node_CustomEvent_ActMgrComponent;                // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_TargetActor;                    // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Command;                        // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Lever;                          // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SkipCommandPrerequisitiesCheck; // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInst_ReturnValue_1;                // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_1;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInst_ReturnValue_2;                // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_GetMontage_CurrentSectionBP_Branches;     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetMontage_CurrentSectionBP_ReturnValue;  // 0x0244(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetCurrentActiveMontage_ReturnValue;      // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_2;                    // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_6;                    // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem) == 0x000008, "Wrong alignment on BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem");
static_assert(sizeof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem) == 0x000260, "Wrong size on BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, EntryPoint) == 0x000000, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, K2Node_SwitchName_CmpSuccess) == 0x000004, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_GetComplexItem_Unit_ReturnValue) == 0x000008, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_GetComplexItem_Unit_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_IsValid_ReturnValue_1) == 0x000010, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_GetConsumeInfo_ReturnValue) == 0x000018, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_GetConsumeInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_GetUseSkillCodeName_ReturnValue) == 0x000020, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_GetUseSkillCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000028, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_FindSkillInfoByNameBP_ReturnValue) == 0x000030, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_FindSkillInfoByNameBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_GetAnimName_ReturnValue) == 0x000038, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_GetAnimName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_Replace_ReturnValue) == 0x000048, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_IsValid_ReturnValue_2) == 0x000058, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_Conv_StringToName_ReturnValue) == 0x00005C, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, K2Node_CreateDelegate_OutputDelegate) == 0x000064, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_IsValid_ReturnValue_3) == 0x000074, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_GetActiveUseItemSkillCodeNameBP_Branches) == 0x000075, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_GetActiveUseItemSkillCodeNameBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_GetActiveUseItemSkillCodeNameBP_ReturnValue) == 0x000078, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_GetActiveUseItemSkillCodeNameBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000080, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, K2Node_SwitchEnum_CmpSuccess) == 0x000081, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_Stop_ReturnValue) == 0x000082, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, K2Node_Event_Montage) == 0x000088, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::K2Node_Event_Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, K2Node_Event_bInterrupted) == 0x000090, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::K2Node_Event_bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, K2Node_Event_MontageInstanceID) == 0x000094, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::K2Node_Event_MontageInstanceID' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, K2Node_Event_ReasonAction) == 0x000098, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, K2Node_Event_Reason) == 0x0000A0, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_IsValid_ReturnValue_4) == 0x0000A8, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_GetActPayload_ReturnValue) == 0x0000B0, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_GetActPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_GetCommonAnim_ReturnValue) == 0x0000B8, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_GetCommonAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, K2Node_DynamicCast_AsLAct_Payload_Use_Item) == 0x0000C0, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::K2Node_DynamicCast_AsLAct_Payload_Use_Item' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x0000D0, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_ConditionalAnimBranch_OutBranchResult) == 0x0000F8, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_ConditionalAnimBranch_OutBranchResult' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_ConditionalAnimBranch_OutInstigator) == 0x000100, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_ConditionalAnimBranch_OutInstigator' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, K2Node_DynamicCast_AsCheckCommandHold) == 0x000108, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::K2Node_DynamicCast_AsCheckCommandHold' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, K2Node_DynamicCast_bSuccess_1) == 0x000110, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, K2Node_DynamicCast_AsCheckCommandHold_1) == 0x000118, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::K2Node_DynamicCast_AsCheckCommandHold_1' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, K2Node_DynamicCast_bSuccess_2) == 0x000120, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, K2Node_SwitchEnum_CmpSuccess_1) == 0x000121, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_IsValid_ReturnValue_5) == 0x000122, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000123, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_GetConsumeInfo_ReturnValue_1) == 0x000128, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_GetConsumeInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_GetSlavearmAlterItemMatch_ReturnValue) == 0x000130, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_GetSlavearmAlterItemMatch_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_PlayTargetAnimBP_Branches) == 0x000138, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_PlayTargetAnimBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_PlayTargetAnimBP_ReturnValue) == 0x00013C, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_PlayTargetAnimBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000140, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, K2Node_SwitchEnum_CmpSuccess_2) == 0x000141, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_PlayTargetAnimBP_Branches_1) == 0x000142, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_PlayTargetAnimBP_Branches_1' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_PlayTargetAnimBP_ReturnValue_1) == 0x000144, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_PlayTargetAnimBP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_GetAnimInst_ReturnValue) == 0x000148, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_GetAnimInst_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, K2Node_SwitchEnum_CmpSuccess_3) == 0x000150, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_SetMontage_ExpireAllBranchingPointWhenBlendOutStartedBP_Branches) == 0x000151, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_SetMontage_ExpireAllBranchingPointWhenBlendOutStartedBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_SetMontage_ExpireAllBranchingPointWhenBlendOutStartedBP_ReturnValue) == 0x000152, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_SetMontage_ExpireAllBranchingPointWhenBlendOutStartedBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, K2Node_SwitchEnum_CmpSuccess_4) == 0x000153, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_ActionStopReason_PayloadInvalid_ReturnValue) == 0x000154, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_ActionStopReason_PayloadInvalid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_GetWeaponByAttachPoint_ReturnValue) == 0x000160, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_GetWeaponByAttachPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_Stop_ReturnValue_1) == 0x000168, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_Stop_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_IsValid_ReturnValue_6) == 0x000169, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_GetBladeInfo_ReturnValue) == 0x000170, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_GetBladeInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_GetAbnormalEnchantDisable_ReturnValue) == 0x000178, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_GetAbnormalEnchantDisable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_PlayTargetAnimBP_Branches_2) == 0x000179, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_PlayTargetAnimBP_Branches_2' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_PlayTargetAnimBP_ReturnValue_2) == 0x00017C, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_PlayTargetAnimBP_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, K2Node_SwitchEnum_CmpSuccess_5) == 0x000180, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::K2Node_SwitchEnum_CmpSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue) == 0x000184, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_IsValid_ReturnValue_7) == 0x00018C, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_Stop_ReturnValue_2) == 0x00018D, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_Stop_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue_1) == 0x000190, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue_2) == 0x000198, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_Stop_ReturnValue_3) == 0x0001A0, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_Stop_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_Stop_ReturnValue_4) == 0x0001A1, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_Stop_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_MakeLiteralName_ReturnValue) == 0x0001A4, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue_3) == 0x0001AC, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_Stop_ReturnValue_5) == 0x0001B4, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_Stop_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_IsValid_ReturnValue_8) == 0x0001B5, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_GetCommonAnim_ReturnValue_1) == 0x0001B8, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_GetCommonAnim_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_GetActionTime_Start_ReturnValue) == 0x0001C0, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_GetActionTime_Start_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_GetCommandRaisedTime_ReturnValue) == 0x0001C4, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_GetCommandRaisedTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_PlayActionClass_ReturnValue) == 0x0001C8, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_PlayActionClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0001D0, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_IsCommandPressed_ReturnValue) == 0x0001D1, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_IsCommandPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0001D8, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_GetReadyToUseItem_OutUseCount) == 0x0001E0, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_GetReadyToUseItem_OutUseCount' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_GetReadyToUseItem_ReturnValue) == 0x0001E8, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_GetReadyToUseItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_ActionState_AllowInput_Movement_Forced_ReturnValue) == 0x0001F0, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_ActionState_AllowInput_Movement_Forced_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_AddActionState_AutoRemove_ReturnValue) == 0x0001F8, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_AddActionState_AutoRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, K2Node_CustomEvent_ActMgrComponent) == 0x000200, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::K2Node_CustomEvent_ActMgrComponent' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, K2Node_CustomEvent_TargetActor) == 0x000208, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::K2Node_CustomEvent_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, K2Node_CustomEvent_Command) == 0x000210, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::K2Node_CustomEvent_Command' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, K2Node_CustomEvent_Lever) == 0x000218, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::K2Node_CustomEvent_Lever' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, K2Node_CustomEvent_SkipCommandPrerequisitiesCheck) == 0x000224, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::K2Node_CustomEvent_SkipCommandPrerequisitiesCheck' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_GetAnimInst_ReturnValue_1) == 0x000228, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_GetAnimInst_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, K2Node_SwitchName_CmpSuccess_1) == 0x000230, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::K2Node_SwitchName_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_GetAnimInst_ReturnValue_2) == 0x000238, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_GetAnimInst_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_GetMontage_CurrentSectionBP_Branches) == 0x000240, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_GetMontage_CurrentSectionBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_GetMontage_CurrentSectionBP_ReturnValue) == 0x000244, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_GetMontage_CurrentSectionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, CallFunc_GetCurrentActiveMontage_ReturnValue) == 0x000250, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::CallFunc_GetCurrentActiveMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, K2Node_SwitchName_CmpSuccess_2) == 0x000258, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::K2Node_SwitchName_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem, K2Node_SwitchEnum_CmpSuccess_6) == 0x000259, "Member 'BP_Action_UseItem_C_ExecuteUbergraph_BP_Action_UseItem::K2Node_SwitchEnum_CmpSuccess_6' has a wrong offset!");

// Function BP_Action_UseItem.BP_Action_UseItem_C.OnCommandOccured_Event
// 0x0028 (0x0028 - 0x0000)
struct BP_Action_UseItem_C_OnCommandOccured_Event final
{
public:
	class ULActMgrComponent*                      ActMgrComponent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Command;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Lever;                                             // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipCommandPrerequisitiesCheck;                    // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_UseItem_C_OnCommandOccured_Event) == 0x000008, "Wrong alignment on BP_Action_UseItem_C_OnCommandOccured_Event");
static_assert(sizeof(BP_Action_UseItem_C_OnCommandOccured_Event) == 0x000028, "Wrong size on BP_Action_UseItem_C_OnCommandOccured_Event");
static_assert(offsetof(BP_Action_UseItem_C_OnCommandOccured_Event, ActMgrComponent) == 0x000000, "Member 'BP_Action_UseItem_C_OnCommandOccured_Event::ActMgrComponent' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_OnCommandOccured_Event, TargetActor) == 0x000008, "Member 'BP_Action_UseItem_C_OnCommandOccured_Event::TargetActor' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_OnCommandOccured_Event, Command) == 0x000010, "Member 'BP_Action_UseItem_C_OnCommandOccured_Event::Command' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_OnCommandOccured_Event, Lever) == 0x000018, "Member 'BP_Action_UseItem_C_OnCommandOccured_Event::Lever' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_OnCommandOccured_Event, SkipCommandPrerequisitiesCheck) == 0x000024, "Member 'BP_Action_UseItem_C_OnCommandOccured_Event::SkipCommandPrerequisitiesCheck' has a wrong offset!");

// Function BP_Action_UseItem.BP_Action_UseItem_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_UseItem_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_UseItem_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_UseItem_C_OnStop");
static_assert(sizeof(BP_Action_UseItem_C_OnStop) == 0x000010, "Wrong size on BP_Action_UseItem_C_OnStop");
static_assert(offsetof(BP_Action_UseItem_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_UseItem_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_UseItem_C_OnStop::Reason' has a wrong offset!");

// Function BP_Action_UseItem.BP_Action_UseItem_C.OnCurrMontageEnded
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_UseItem_C_OnCurrMontageEnded final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MontageInstanceID;                                 // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_UseItem_C_OnCurrMontageEnded) == 0x000008, "Wrong alignment on BP_Action_UseItem_C_OnCurrMontageEnded");
static_assert(sizeof(BP_Action_UseItem_C_OnCurrMontageEnded) == 0x000010, "Wrong size on BP_Action_UseItem_C_OnCurrMontageEnded");
static_assert(offsetof(BP_Action_UseItem_C_OnCurrMontageEnded, Montage) == 0x000000, "Member 'BP_Action_UseItem_C_OnCurrMontageEnded::Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_OnCurrMontageEnded, bInterrupted) == 0x000008, "Member 'BP_Action_UseItem_C_OnCurrMontageEnded::bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_OnCurrMontageEnded, MontageInstanceID) == 0x00000C, "Member 'BP_Action_UseItem_C_OnCurrMontageEnded::MontageInstanceID' has a wrong offset!");

// Function BP_Action_UseItem.BP_Action_UseItem_C.OnPreProcessAction
// 0x0058 (0x0058 - 0x0000)
struct BP_Action_UseItem_C_OnPreProcessAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 Cached_CurrentItem_Unit;                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 Cached_CurrentItem;                                // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemConsumeInfoPtr                    CallFunc_GetConsumeInfo_ReturnValue;               // 0x0028(0x0008)(NoDestructor)
	int32                                         CallFunc_GetCount_ReturnValue;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELItemComplexGroup                            CallFunc_GetComplexGroup_ReturnValue;              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCount_ReturnValue_1;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 CallFunc_GetComplexItem_Unit_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetReadyToUseItem_OutUseCount;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 CallFunc_GetReadyToUseItem_ReturnValue;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_UseItem_C_OnPreProcessAction) == 0x000008, "Wrong alignment on BP_Action_UseItem_C_OnPreProcessAction");
static_assert(sizeof(BP_Action_UseItem_C_OnPreProcessAction) == 0x000058, "Wrong size on BP_Action_UseItem_C_OnPreProcessAction");
static_assert(offsetof(BP_Action_UseItem_C_OnPreProcessAction, ReturnValue) == 0x000000, "Member 'BP_Action_UseItem_C_OnPreProcessAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_OnPreProcessAction, Cached_CurrentItem_Unit) == 0x000008, "Member 'BP_Action_UseItem_C_OnPreProcessAction::Cached_CurrentItem_Unit' has a wrong offset!");
static_assert(offsetof(BP_Action_UseItem_C_OnPreProcessAction, Success) == 0x000010, "Member 'BP_Action_UseItem_C_OnPreProcessAction::Success' has a wrong offset!");
