#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_FatalAttack_Victim_BeforeHit

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_FatalAttack_Victim_BeforeHit.BP_Action_FatalAttack_Victim_BeforeHit_C.ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit
// 0x00A8 (0x00A8 - 0x0000)
struct BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ULActionClass_FatalAttack_Victim_ReturnValue; // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_LName_None_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActBase*                              K2Node_Event_StoppingAction;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULAction_HitAnim*                       K2Node_DynamicCast_AsLAction_Hit_Anim;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ULActionClass_Groggy_ReturnValue;         // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_GetAnimInstBP_Branches;                   // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstBP_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_LName_None_ReturnValue_1;                 // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_GetAnimInstBP_Branches_1;                 // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstBP_ReturnValue_1;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_1;          // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93[0x1];                                       // 0x0093(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_1;                           // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit) == 0x000008, "Wrong alignment on BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit");
static_assert(sizeof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit) == 0x0000A8, "Wrong size on BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, EntryPoint) == 0x000000, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, CallFunc_ULActionClass_FatalAttack_Victim_ReturnValue) == 0x000004, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::CallFunc_ULActionClass_FatalAttack_Victim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, Temp_bool_Variable) == 0x00000C, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, CallFunc_LName_None_ReturnValue) == 0x000028, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::CallFunc_LName_None_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, K2Node_Event_StoppingAction) == 0x000030, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::K2Node_Event_StoppingAction' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, CallFunc_NotEqual_NameName_ReturnValue) == 0x000038, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, K2Node_DynamicCast_AsLAction_Hit_Anim) == 0x000040, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::K2Node_DynamicCast_AsLAction_Hit_Anim' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, CallFunc_ULActionClass_Groggy_ReturnValue) == 0x00004C, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::CallFunc_ULActionClass_Groggy_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, K2Node_Event_ReasonAction) == 0x000058, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, K2Node_Event_Reason) == 0x000060, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000068, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, CallFunc_IsValid_ReturnValue) == 0x000069, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x00006A, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, CallFunc_Stop_ReturnValue) == 0x00006B, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, CallFunc_GetAnimInstBP_Branches) == 0x00006C, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::CallFunc_GetAnimInstBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, CallFunc_GetAnimInstBP_ReturnValue) == 0x000070, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::CallFunc_GetAnimInstBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, K2Node_SwitchEnum_CmpSuccess) == 0x000078, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, CallFunc_LName_None_ReturnValue_1) == 0x00007C, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::CallFunc_LName_None_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, CallFunc_GetAnimInstBP_Branches_1) == 0x000084, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::CallFunc_GetAnimInstBP_Branches_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, CallFunc_GetAnimInstBP_ReturnValue_1) == 0x000088, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::CallFunc_GetAnimInstBP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, K2Node_SwitchEnum_CmpSuccess_1) == 0x000090, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, CallFunc_NotEqual_NameName_ReturnValue_1) == 0x000091, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::CallFunc_NotEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, Temp_bool_Variable_1) == 0x000092, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, K2Node_Select_Default) == 0x000094, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit, K2Node_Select_Default_1) == 0x00009C, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_BeforeHit::K2Node_Select_Default_1' has a wrong offset!");

// Function BP_Action_FatalAttack_Victim_BeforeHit.BP_Action_FatalAttack_Victim_BeforeHit_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_FatalAttack_Victim_BeforeHit_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_FatalAttack_Victim_BeforeHit_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_FatalAttack_Victim_BeforeHit_C_OnStop");
static_assert(sizeof(BP_Action_FatalAttack_Victim_BeforeHit_C_OnStop) == 0x000010, "Wrong size on BP_Action_FatalAttack_Victim_BeforeHit_C_OnStop");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_OnStop::Reason' has a wrong offset!");

// Function BP_Action_FatalAttack_Victim_BeforeHit.BP_Action_FatalAttack_Victim_BeforeHit_C.OnStopByMe
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_FatalAttack_Victim_BeforeHit_C_OnStopByMe final
{
public:
	class ULActBase*                              StoppingAction;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_FatalAttack_Victim_BeforeHit_C_OnStopByMe) == 0x000008, "Wrong alignment on BP_Action_FatalAttack_Victim_BeforeHit_C_OnStopByMe");
static_assert(sizeof(BP_Action_FatalAttack_Victim_BeforeHit_C_OnStopByMe) == 0x000008, "Wrong size on BP_Action_FatalAttack_Victim_BeforeHit_C_OnStopByMe");
static_assert(offsetof(BP_Action_FatalAttack_Victim_BeforeHit_C_OnStopByMe, StoppingAction) == 0x000000, "Member 'BP_Action_FatalAttack_Victim_BeforeHit_C_OnStopByMe::StoppingAction' has a wrong offset!");

}

