#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_HomeLocation

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Action_HomeLocation.BP_Action_HomeLocation_C.ExecuteUbergraph_BP_Action_HomeLocation
// 0x0028 (0x0028 - 0x0000)
struct BP_Action_HomeLocation_C_ExecuteUbergraph_BP_Action_HomeLocation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALNPCCharacter*                         K2Node_DynamicCast_AsLNPCCharacter;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_HomeLocation_C_ExecuteUbergraph_BP_Action_HomeLocation) == 0x000008, "Wrong alignment on BP_Action_HomeLocation_C_ExecuteUbergraph_BP_Action_HomeLocation");
static_assert(sizeof(BP_Action_HomeLocation_C_ExecuteUbergraph_BP_Action_HomeLocation) == 0x000028, "Wrong size on BP_Action_HomeLocation_C_ExecuteUbergraph_BP_Action_HomeLocation");
static_assert(offsetof(BP_Action_HomeLocation_C_ExecuteUbergraph_BP_Action_HomeLocation, EntryPoint) == 0x000000, "Member 'BP_Action_HomeLocation_C_ExecuteUbergraph_BP_Action_HomeLocation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_HomeLocation_C_ExecuteUbergraph_BP_Action_HomeLocation, K2Node_DynamicCast_AsLNPCCharacter) == 0x000008, "Member 'BP_Action_HomeLocation_C_ExecuteUbergraph_BP_Action_HomeLocation::K2Node_DynamicCast_AsLNPCCharacter' has a wrong offset!");
static_assert(offsetof(BP_Action_HomeLocation_C_ExecuteUbergraph_BP_Action_HomeLocation, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_Action_HomeLocation_C_ExecuteUbergraph_BP_Action_HomeLocation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_HomeLocation_C_ExecuteUbergraph_BP_Action_HomeLocation, K2Node_Event_ReasonAction) == 0x000018, "Member 'BP_Action_HomeLocation_C_ExecuteUbergraph_BP_Action_HomeLocation::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_HomeLocation_C_ExecuteUbergraph_BP_Action_HomeLocation, K2Node_Event_Reason) == 0x000020, "Member 'BP_Action_HomeLocation_C_ExecuteUbergraph_BP_Action_HomeLocation::K2Node_Event_Reason' has a wrong offset!");

// Function BP_Action_HomeLocation.BP_Action_HomeLocation_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_HomeLocation_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_HomeLocation_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_HomeLocation_C_OnStop");
static_assert(sizeof(BP_Action_HomeLocation_C_OnStop) == 0x000010, "Wrong size on BP_Action_HomeLocation_C_OnStop");
static_assert(offsetof(BP_Action_HomeLocation_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_HomeLocation_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_HomeLocation_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_HomeLocation_C_OnStop::Reason' has a wrong offset!");

}

