#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_ObjectRepulse

#include "Basic.hpp"

#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_ObjectRepulse.BP_Action_ObjectRepulse_C.ExecuteUbergraph_BP_Action_ObjectRepulse
// 0x0088 (0x0088 - 0x0000)
struct BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_TryLockInput_Movement_ReturnValue; // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_TryLockInput_Rotation_ReturnValue; // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetCurrMontageInstanceID_AnimInstance;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_GetCurrMontageInstanceID_Branches;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrMontageInstanceID_ReturnValue;     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayHitAnim_ReturnValue;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindActionState_ReturnValue;              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayHitAnim_ReturnValue_1;                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter_1;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCharacterStat_ReturnValue;             // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveAnimRateScaleByInstigator_ReturnValue; // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLGameObjectHandle                     CallFunc_AddAnimRateScale_ReturnValue;             // 0x0080(0x0004)(NoDestructor)
};
static_assert(alignof(BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse) == 0x000008, "Wrong alignment on BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse");
static_assert(sizeof(BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse) == 0x000088, "Wrong size on BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse");
static_assert(offsetof(BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse, EntryPoint) == 0x000000, "Member 'BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse, CallFunc_ActionState_TryLockInput_Movement_ReturnValue) == 0x000004, "Member 'BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse::CallFunc_ActionState_TryLockInput_Movement_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse, CallFunc_ActionState_TryLockInput_Rotation_ReturnValue) == 0x00000C, "Member 'BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse::CallFunc_ActionState_TryLockInput_Rotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse, CallFunc_GetCurrMontageInstanceID_AnimInstance) == 0x000018, "Member 'BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse::CallFunc_GetCurrMontageInstanceID_AnimInstance' has a wrong offset!");
static_assert(offsetof(BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse, CallFunc_GetCurrMontageInstanceID_Branches) == 0x000020, "Member 'BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse::CallFunc_GetCurrMontageInstanceID_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse, CallFunc_GetCurrMontageInstanceID_ReturnValue) == 0x000024, "Member 'BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse::CallFunc_GetCurrMontageInstanceID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse, CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue) == 0x000028, "Member 'BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse::CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse, K2Node_SwitchEnum_CmpSuccess) == 0x000030, "Member 'BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse, CallFunc_Stop_ReturnValue) == 0x000031, "Member 'BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse, CallFunc_PlayHitAnim_ReturnValue) == 0x000034, "Member 'BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse::CallFunc_PlayHitAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse, K2Node_DynamicCast_AsLCharacter) == 0x000038, "Member 'BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse::K2Node_DynamicCast_AsLCharacter' has a wrong offset!");
static_assert(offsetof(BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse, CallFunc_FindActionState_ReturnValue) == 0x000041, "Member 'BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse::CallFunc_FindActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse, CallFunc_PlayHitAnim_ReturnValue_1) == 0x000044, "Member 'BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse::CallFunc_PlayHitAnim_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse, K2Node_DynamicCast_AsLCharacter_1) == 0x000048, "Member 'BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse::K2Node_DynamicCast_AsLCharacter_1' has a wrong offset!");
static_assert(offsetof(BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse, K2Node_Event_ReasonAction) == 0x000058, "Member 'BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse, K2Node_Event_Reason) == 0x000060, "Member 'BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse, CallFunc_GetCharacterStat_ReturnValue) == 0x00006C, "Member 'BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse::CallFunc_GetCharacterStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000070, "Member 'BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse, CallFunc_RemoveAnimRateScaleByInstigator_ReturnValue) == 0x000074, "Member 'BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse::CallFunc_RemoveAnimRateScaleByInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000078, "Member 'BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse, CallFunc_Add_FloatFloat_ReturnValue) == 0x00007C, "Member 'BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse, CallFunc_AddAnimRateScale_ReturnValue) == 0x000080, "Member 'BP_Action_ObjectRepulse_C_ExecuteUbergraph_BP_Action_ObjectRepulse::CallFunc_AddAnimRateScale_ReturnValue' has a wrong offset!");

// Function BP_Action_ObjectRepulse.BP_Action_ObjectRepulse_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_ObjectRepulse_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_ObjectRepulse_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_ObjectRepulse_C_OnStop");
static_assert(sizeof(BP_Action_ObjectRepulse_C_OnStop) == 0x000010, "Wrong size on BP_Action_ObjectRepulse_C_OnStop");
static_assert(offsetof(BP_Action_ObjectRepulse_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_ObjectRepulse_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_ObjectRepulse_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_ObjectRepulse_C_OnStop::Reason' has a wrong offset!");

}

