#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Draw_Weapon

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"
#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_Draw_Weapon.BP_Action_Draw_Weapon_C.ExecuteUbergraph_BP_Action_Draw_Weapon
// 0x0080 (0x0080 - 0x0000)
struct BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayTargetAnim_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetCurrMontageInstanceID_AnimInstance;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_GetCurrMontageInstanceID_Branches;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrMontageInstanceID_ReturnValue;     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_Invincible_ReturnValue;       // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALWeapon*                               CallFunc_GetWeaponByAttachPoint_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemHandleInfoPtr                     CallFunc_GetHandleInfo_ReturnValue;                // 0x0050(0x0008)(NoDestructor)
	ELWeaponPostureType                           CallFunc_GetPostureType_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoChangeWeapon_ReturnValue;               // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALWeapon*                               CallFunc_GetWeaponByAttachPoint_ReturnValue_1;     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemHandleInfoPtr                     CallFunc_GetHandleInfo_ReturnValue_1;              // 0x0070(0x0008)(NoDestructor)
	ELWeaponPostureType                           CallFunc_GetPostureType_ReturnValue_1;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon) == 0x000008, "Wrong alignment on BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon");
static_assert(sizeof(BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon) == 0x000080, "Wrong size on BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon");
static_assert(offsetof(BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon, EntryPoint) == 0x000000, "Member 'BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon, K2Node_Event_ReasonAction) == 0x000008, "Member 'BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon, K2Node_Event_Reason) == 0x000010, "Member 'BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon, CallFunc_PlayTargetAnim_ReturnValue) == 0x000018, "Member 'BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon::CallFunc_PlayTargetAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon, CallFunc_GetCurrMontageInstanceID_AnimInstance) == 0x000020, "Member 'BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon::CallFunc_GetCurrMontageInstanceID_AnimInstance' has a wrong offset!");
static_assert(offsetof(BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon, CallFunc_GetCurrMontageInstanceID_Branches) == 0x000028, "Member 'BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon::CallFunc_GetCurrMontageInstanceID_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon, CallFunc_GetCurrMontageInstanceID_ReturnValue) == 0x00002C, "Member 'BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon::CallFunc_GetCurrMontageInstanceID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon, CallFunc_Stop_ReturnValue) == 0x000030, "Member 'BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon, K2Node_SwitchEnum_CmpSuccess) == 0x000031, "Member 'BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon, CallFunc_ActionState_Invincible_ReturnValue) == 0x000034, "Member 'BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon::CallFunc_ActionState_Invincible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon, CallFunc_GetWeaponByAttachPoint_ReturnValue) == 0x000040, "Member 'BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon::CallFunc_GetWeaponByAttachPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon, CallFunc_GetHandleInfo_ReturnValue) == 0x000050, "Member 'BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon::CallFunc_GetHandleInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon, CallFunc_GetPostureType_ReturnValue) == 0x000058, "Member 'BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon::CallFunc_GetPostureType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon, CallFunc_DoChangeWeapon_ReturnValue) == 0x000059, "Member 'BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon::CallFunc_DoChangeWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon, CallFunc_GetWeaponByAttachPoint_ReturnValue_1) == 0x000060, "Member 'BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon::CallFunc_GetWeaponByAttachPoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon, CallFunc_IsValid_ReturnValue_1) == 0x000068, "Member 'BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon, CallFunc_GetHandleInfo_ReturnValue_1) == 0x000070, "Member 'BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon::CallFunc_GetHandleInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon, CallFunc_GetPostureType_ReturnValue_1) == 0x000078, "Member 'BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon::CallFunc_GetPostureType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon, K2Node_SwitchEnum_CmpSuccess_1) == 0x000079, "Member 'BP_Action_Draw_Weapon_C_ExecuteUbergraph_BP_Action_Draw_Weapon::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

// Function BP_Action_Draw_Weapon.BP_Action_Draw_Weapon_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_Draw_Weapon_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Draw_Weapon_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_Draw_Weapon_C_OnStop");
static_assert(sizeof(BP_Action_Draw_Weapon_C_OnStop) == 0x000010, "Wrong size on BP_Action_Draw_Weapon_C_OnStop");
static_assert(offsetof(BP_Action_Draw_Weapon_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_Draw_Weapon_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Draw_Weapon_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_Draw_Weapon_C_OnStop::Reason' has a wrong offset!");

}

