#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_NormalDash

#include "Basic.hpp"

#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_NormalDash.BP_Action_NormalDash_C.ExecuteUbergraph_BP_Action_NormalDash
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_NormalDash_C_ExecuteUbergraph_BP_Action_NormalDash final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_Dodge_ReturnValue;            // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLGameObjectHandle                     CallFunc_AddActionState_AutoRemove_ReturnValue;    // 0x000C(0x0004)(NoDestructor)
};
static_assert(alignof(BP_Action_NormalDash_C_ExecuteUbergraph_BP_Action_NormalDash) == 0x000004, "Wrong alignment on BP_Action_NormalDash_C_ExecuteUbergraph_BP_Action_NormalDash");
static_assert(sizeof(BP_Action_NormalDash_C_ExecuteUbergraph_BP_Action_NormalDash) == 0x000010, "Wrong size on BP_Action_NormalDash_C_ExecuteUbergraph_BP_Action_NormalDash");
static_assert(offsetof(BP_Action_NormalDash_C_ExecuteUbergraph_BP_Action_NormalDash, EntryPoint) == 0x000000, "Member 'BP_Action_NormalDash_C_ExecuteUbergraph_BP_Action_NormalDash::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_NormalDash_C_ExecuteUbergraph_BP_Action_NormalDash, CallFunc_ActionState_Dodge_ReturnValue) == 0x000004, "Member 'BP_Action_NormalDash_C_ExecuteUbergraph_BP_Action_NormalDash::CallFunc_ActionState_Dodge_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_NormalDash_C_ExecuteUbergraph_BP_Action_NormalDash, CallFunc_AddActionState_AutoRemove_ReturnValue) == 0x00000C, "Member 'BP_Action_NormalDash_C_ExecuteUbergraph_BP_Action_NormalDash::CallFunc_AddActionState_AutoRemove_ReturnValue' has a wrong offset!");

}

