#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_GrabRelease

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Action_GrabRelease.BP_Action_GrabRelease_C.ExecuteUbergraph_BP_Action_GrabRelease
// 0x0090 (0x0090 - 0x0000)
struct BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_TryLockInput_Movement_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_TryLockInput_Rotation_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_LockMovement_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_ConsumeMovement_ReturnValue;  // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Event_Montage;                              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MontageInstanceID;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_LockDieAction_ReturnValue;    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayTargetAnim_ReturnValue;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_Dying_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ULActionClass_Die_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayAction_Die_ReturnValue;               // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_FindActionState_ReturnValue;              // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActPayload_GrabRelease*               K2Node_DynamicCast_AsLAct_Payload_Grab_Release;    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ULActionClass_GrabRelease_ReturnValue;    // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease) == 0x000008, "Wrong alignment on BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease");
static_assert(sizeof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease) == 0x000090, "Wrong size on BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease");
static_assert(offsetof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease, EntryPoint) == 0x000000, "Member 'BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease, CallFunc_ActionState_TryLockInput_Movement_ReturnValue) == 0x000008, "Member 'BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease::CallFunc_ActionState_TryLockInput_Movement_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease, CallFunc_ActionState_TryLockInput_Rotation_ReturnValue) == 0x000010, "Member 'BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease::CallFunc_ActionState_TryLockInput_Rotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease, CallFunc_ActionState_LockMovement_ReturnValue) == 0x000018, "Member 'BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease::CallFunc_ActionState_LockMovement_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease, K2Node_Event_ReasonAction) == 0x000020, "Member 'BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease, K2Node_Event_Reason) == 0x000028, "Member 'BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease, CallFunc_ActionState_ConsumeMovement_ReturnValue) == 0x000034, "Member 'BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease::CallFunc_ActionState_ConsumeMovement_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease, K2Node_Event_Montage) == 0x000040, "Member 'BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease::K2Node_Event_Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease, K2Node_Event_bInterrupted) == 0x000048, "Member 'BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease::K2Node_Event_bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease, K2Node_Event_MontageInstanceID) == 0x00004C, "Member 'BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease::K2Node_Event_MontageInstanceID' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease, CallFunc_ActionState_LockDieAction_ReturnValue) == 0x000050, "Member 'BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease::CallFunc_ActionState_LockDieAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease, CallFunc_PlayTargetAnim_ReturnValue) == 0x000058, "Member 'BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease::CallFunc_PlayTargetAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease, CallFunc_Stop_ReturnValue) == 0x00005C, "Member 'BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease, CallFunc_ActionState_Dying_ReturnValue) == 0x000060, "Member 'BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease::CallFunc_ActionState_Dying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease, CallFunc_ULActionClass_Die_ReturnValue) == 0x000068, "Member 'BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease::CallFunc_ULActionClass_Die_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000070, "Member 'BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease, CallFunc_IsValid_ReturnValue_2) == 0x000071, "Member 'BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease, CallFunc_IsValid_ReturnValue_3) == 0x000072, "Member 'BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease, CallFunc_PlayAction_Die_ReturnValue) == 0x000073, "Member 'BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease::CallFunc_PlayAction_Die_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease, CallFunc_FindActionState_ReturnValue) == 0x000074, "Member 'BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease::CallFunc_FindActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease, CallFunc_IsValid_ReturnValue_4) == 0x000075, "Member 'BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease, K2Node_DynamicCast_AsLAct_Payload_Grab_Release) == 0x000078, "Member 'BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease::K2Node_DynamicCast_AsLAct_Payload_Grab_Release' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease, CallFunc_ULActionClass_GrabRelease_ReturnValue) == 0x000084, "Member 'BP_Action_GrabRelease_C_ExecuteUbergraph_BP_Action_GrabRelease::CallFunc_ULActionClass_GrabRelease_ReturnValue' has a wrong offset!");

// Function BP_Action_GrabRelease.BP_Action_GrabRelease_C.OnCurrMontageEnded
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_GrabRelease_C_OnCurrMontageEnded final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MontageInstanceID;                                 // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_GrabRelease_C_OnCurrMontageEnded) == 0x000008, "Wrong alignment on BP_Action_GrabRelease_C_OnCurrMontageEnded");
static_assert(sizeof(BP_Action_GrabRelease_C_OnCurrMontageEnded) == 0x000010, "Wrong size on BP_Action_GrabRelease_C_OnCurrMontageEnded");
static_assert(offsetof(BP_Action_GrabRelease_C_OnCurrMontageEnded, Montage) == 0x000000, "Member 'BP_Action_GrabRelease_C_OnCurrMontageEnded::Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_OnCurrMontageEnded, bInterrupted) == 0x000008, "Member 'BP_Action_GrabRelease_C_OnCurrMontageEnded::bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_OnCurrMontageEnded, MontageInstanceID) == 0x00000C, "Member 'BP_Action_GrabRelease_C_OnCurrMontageEnded::MontageInstanceID' has a wrong offset!");

// Function BP_Action_GrabRelease.BP_Action_GrabRelease_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_GrabRelease_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_GrabRelease_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_GrabRelease_C_OnStop");
static_assert(sizeof(BP_Action_GrabRelease_C_OnStop) == 0x000010, "Wrong size on BP_Action_GrabRelease_C_OnStop");
static_assert(offsetof(BP_Action_GrabRelease_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_GrabRelease_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_GrabRelease_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_GrabRelease_C_OnStop::Reason' has a wrong offset!");

}

