#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_LockOnDash

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_LockOnDash.BP_Action_LockOnDash_C.ExecuteUbergraph_BP_Action_LockOnDash
// 0x0348 (0x0348 - 0x0000)
struct BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable;                              // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_NegateRotator_ReturnValue;                // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue_1;          // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Temp_struct_Variable_1;                            // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue_1; // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_2;     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue_2;          // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_NegateRotator_ReturnValue_1;              // 0x00EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Vector_Zero_ReturnValue;                  // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_2;        // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_NegateRotator_ReturnValue_2;              // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_3;     // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue_3;          // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_3;                      // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_3;                     // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_3;                       // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable_2;                            // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue_2; // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_HeadingAngle_ReturnValue;          // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RadiansToDegrees_ReturnValue;             // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ClampAxis_ReturnValue;                    // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_3;        // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_NegateRotator_ReturnValue_3;              // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveAnimRootMotionTranslationScale_ReturnValue; // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveAnimRootMotionTranslationScale_ReturnValue_1; // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetCurrMontageInstanceID_AnimInstance;    // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_GetCurrMontageInstanceID_Branches;        // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrMontageInstanceID_ReturnValue;     // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C2[0x2];                                      // 0x01C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Up_ReturnValue;                    // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_NegateVector_ReturnValue;                 // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue_3; // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue;        // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_NegateVector_ReturnValue_1;               // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Up_ReturnValue_1;                  // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue_4; // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZY_ReturnValue;                // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Vector_Up_ReturnValue_2;                  // 0x022C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0238(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromZY_ReturnValue_1;              // 0x0244(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Vector_Up_ReturnValue_3;                  // 0x0250(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_1;            // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromZX_ReturnValue;                // 0x0268(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_275[0x3];                                      // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_2;            // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue_5; // 0x0284(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELAngleRangeType_4Way                         CallFunc_SwitchAngleToType_4Way_ReturnValue;       // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_292[0x2];                                      // 0x0292(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Temp_struct_Variable_3;                            // 0x0294(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromZX_ReturnValue_1;              // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_3;            // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_StoppingAction;                       // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x02CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayCommomAnimBP_MontageInstanceID;       // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_PlayCommomAnimBP_Montage;                 // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayCommomAnimBP_Branches;                // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_1;                           // 0x02E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayCommomAnimBP_MontageInstanceID_1;     // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PlayCommomAnimBP_Montage_1;               // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayCommomAnimBP_Branches_1;              // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_302[0x2];                                      // 0x0302(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_2;                           // 0x0304(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayCommomAnimBP_MontageInstanceID_2;     // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_PlayCommomAnimBP_Montage_2;               // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayCommomAnimBP_Branches_2;              // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x3];                                      // 0x0319(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_3;                           // 0x031C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_325[0x3];                                      // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayCommomAnimBP_MontageInstanceID_3;     // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PlayCommomAnimBP_Montage_3;               // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayCommomAnimBP_Branches_3;              // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_6;                    // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33A[0x2];                                      // 0x033A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_Dodge_ReturnValue;            // 0x033C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLGameObjectHandle                     CallFunc_AddActionState_AutoRemove_ReturnValue;    // 0x0344(0x0004)(NoDestructor)
};
static_assert(alignof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash) == 0x000008, "Wrong alignment on BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash");
static_assert(sizeof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash) == 0x000348, "Wrong size on BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, EntryPoint) == 0x000000, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000008, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_NotEqual_NameName_ReturnValue) == 0x000011, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_GetCameraRotation_ReturnValue) == 0x000014, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_BreakRotator_Roll) == 0x000020, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_BreakRotator_Pitch) == 0x000024, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_BreakRotator_Yaw) == 0x000028, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, Temp_struct_Variable) == 0x00002C, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_MakeRotator_ReturnValue) == 0x000038, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x000044, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000050, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_NegateRotator_ReturnValue) == 0x00005C, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_NegateRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x000068, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_GetCameraRotation_ReturnValue_1) == 0x000074, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_GetCameraRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_BreakRotator_Roll_1) == 0x000080, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_BreakRotator_Pitch_1) == 0x000084, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_BreakRotator_Yaw_1) == 0x000088, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_MakeRotator_ReturnValue_1) == 0x00008C, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, Temp_struct_Variable_1) == 0x000098, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_GreaterGreater_VectorRotator_ReturnValue_1) == 0x0000A4, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_GreaterGreater_VectorRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_GetPlayerCameraManager_ReturnValue_2) == 0x0000B0, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_GetPlayerCameraManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_IsValid_ReturnValue_2) == 0x0000B8, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_GetCameraRotation_ReturnValue_2) == 0x0000BC, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_GetCameraRotation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_BreakRotator_Roll_2) == 0x0000C8, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_BreakRotator_Roll_2' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_BreakRotator_Pitch_2) == 0x0000CC, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_BreakRotator_Pitch_2' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_BreakRotator_Yaw_2) == 0x0000D0, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_BreakRotator_Yaw_2' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_MakeRotator_ReturnValue_2) == 0x0000D4, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x0000E0, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_NegateRotator_ReturnValue_1) == 0x0000EC, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_NegateRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_Vector_Zero_ReturnValue) == 0x0000F8, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_Vector_Zero_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_K2_GetActorRotation_ReturnValue_2) == 0x000104, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_K2_GetActorRotation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_NegateRotator_ReturnValue_2) == 0x000110, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_NegateRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, Temp_bool_Variable) == 0x00011C, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_GetPlayerCameraManager_ReturnValue_3) == 0x000120, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_GetPlayerCameraManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_IsValid_ReturnValue_3) == 0x000128, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_GetCameraRotation_ReturnValue_3) == 0x00012C, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_GetCameraRotation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_BreakRotator_Roll_3) == 0x000138, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_BreakRotator_Roll_3' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_BreakRotator_Pitch_3) == 0x00013C, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_BreakRotator_Pitch_3' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_BreakRotator_Yaw_3) == 0x000140, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_BreakRotator_Yaw_3' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, Temp_struct_Variable_2) == 0x000144, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_MakeRotator_ReturnValue_3) == 0x000150, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_MakeRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_GreaterGreater_VectorRotator_ReturnValue_2) == 0x00015C, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_GreaterGreater_VectorRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_Vector_HeadingAngle_ReturnValue) == 0x000168, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_Vector_HeadingAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_RadiansToDegrees_ReturnValue) == 0x00016C, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_RadiansToDegrees_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_ClampAxis_ReturnValue) == 0x000170, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_ClampAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_K2_GetActorRotation_ReturnValue_3) == 0x000174, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_K2_GetActorRotation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_NegateRotator_ReturnValue_3) == 0x000180, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_NegateRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, K2Node_Event_ReasonAction) == 0x000190, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, K2Node_Event_Reason) == 0x000198, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_RemoveAnimRootMotionTranslationScale_ReturnValue) == 0x0001A0, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_RemoveAnimRootMotionTranslationScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_RemoveAnimRootMotionTranslationScale_ReturnValue_1) == 0x0001A1, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_RemoveAnimRootMotionTranslationScale_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_GetCurrMontageInstanceID_AnimInstance) == 0x0001A8, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_GetCurrMontageInstanceID_AnimInstance' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_GetCurrMontageInstanceID_Branches) == 0x0001B0, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_GetCurrMontageInstanceID_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_GetCurrMontageInstanceID_ReturnValue) == 0x0001B4, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_GetCurrMontageInstanceID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue) == 0x0001B8, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, K2Node_SwitchEnum_CmpSuccess) == 0x0001C0, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_Stop_ReturnValue) == 0x0001C1, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_MakeVector_ReturnValue) == 0x0001C4, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_Vector_Up_ReturnValue) == 0x0001D0, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_Vector_Up_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, Temp_bool_Variable_1) == 0x0001DC, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_NegateVector_ReturnValue) == 0x0001E0, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_NegateVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_GreaterGreater_VectorRotator_ReturnValue_3) == 0x0001EC, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_GreaterGreater_VectorRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_NotEqual_VectorVector_ReturnValue) == 0x0001F8, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_NotEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_NegateVector_ReturnValue_1) == 0x0001FC, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_NegateVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_Vector_Up_ReturnValue_1) == 0x000208, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_Vector_Up_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_GreaterGreater_VectorRotator_ReturnValue_4) == 0x000214, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_GreaterGreater_VectorRotator_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_MakeRotFromZY_ReturnValue) == 0x000220, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_MakeRotFromZY_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_Vector_Up_ReturnValue_2) == 0x00022C, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_Vector_Up_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_ComposeRotators_ReturnValue) == 0x000238, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_MakeRotFromZY_ReturnValue_1) == 0x000244, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_MakeRotFromZY_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_Vector_Up_ReturnValue_3) == 0x000250, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_Vector_Up_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_ComposeRotators_ReturnValue_1) == 0x00025C, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_ComposeRotators_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_MakeRotFromZX_ReturnValue) == 0x000268, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_MakeRotFromZX_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, Temp_bool_Variable_2) == 0x000274, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_ComposeRotators_ReturnValue_2) == 0x000278, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_ComposeRotators_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_GreaterGreater_VectorRotator_ReturnValue_5) == 0x000284, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_GreaterGreater_VectorRotator_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, Temp_bool_Variable_3) == 0x000290, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_SwitchAngleToType_4Way_ReturnValue) == 0x000291, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_SwitchAngleToType_4Way_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, Temp_struct_Variable_3) == 0x000294, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, K2Node_SwitchEnum_CmpSuccess_1) == 0x0002A0, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_MakeRotFromZX_ReturnValue_1) == 0x0002A4, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_MakeRotFromZX_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_ComposeRotators_ReturnValue_3) == 0x0002B0, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_ComposeRotators_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, K2Node_Event_StoppingAction) == 0x0002C0, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::K2Node_Event_StoppingAction' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, K2Node_SwitchEnum_CmpSuccess_2) == 0x0002C8, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, K2Node_Select_Default) == 0x0002CC, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_PlayCommomAnimBP_MontageInstanceID) == 0x0002D4, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_PlayCommomAnimBP_MontageInstanceID' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_PlayCommomAnimBP_Montage) == 0x0002D8, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_PlayCommomAnimBP_Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_PlayCommomAnimBP_Branches) == 0x0002E0, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_PlayCommomAnimBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, K2Node_Select_Default_1) == 0x0002E4, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, K2Node_SwitchEnum_CmpSuccess_3) == 0x0002EC, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_PlayCommomAnimBP_MontageInstanceID_1) == 0x0002F0, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_PlayCommomAnimBP_MontageInstanceID_1' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_PlayCommomAnimBP_Montage_1) == 0x0002F8, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_PlayCommomAnimBP_Montage_1' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_PlayCommomAnimBP_Branches_1) == 0x000300, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_PlayCommomAnimBP_Branches_1' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, K2Node_SwitchEnum_CmpSuccess_4) == 0x000301, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, K2Node_Select_Default_2) == 0x000304, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_PlayCommomAnimBP_MontageInstanceID_2) == 0x00030C, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_PlayCommomAnimBP_MontageInstanceID_2' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_PlayCommomAnimBP_Montage_2) == 0x000310, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_PlayCommomAnimBP_Montage_2' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_PlayCommomAnimBP_Branches_2) == 0x000318, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_PlayCommomAnimBP_Branches_2' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, K2Node_Select_Default_3) == 0x00031C, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, K2Node_SwitchEnum_CmpSuccess_5) == 0x000324, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::K2Node_SwitchEnum_CmpSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_PlayCommomAnimBP_MontageInstanceID_3) == 0x000328, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_PlayCommomAnimBP_MontageInstanceID_3' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_PlayCommomAnimBP_Montage_3) == 0x000330, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_PlayCommomAnimBP_Montage_3' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_PlayCommomAnimBP_Branches_3) == 0x000338, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_PlayCommomAnimBP_Branches_3' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, K2Node_SwitchEnum_CmpSuccess_6) == 0x000339, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::K2Node_SwitchEnum_CmpSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_ActionState_Dodge_ReturnValue) == 0x00033C, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_ActionState_Dodge_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash, CallFunc_AddActionState_AutoRemove_ReturnValue) == 0x000344, "Member 'BP_Action_LockOnDash_C_ExecuteUbergraph_BP_Action_LockOnDash::CallFunc_AddActionState_AutoRemove_ReturnValue' has a wrong offset!");

// Function BP_Action_LockOnDash.BP_Action_LockOnDash_C.OnStopByMe
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_LockOnDash_C_OnStopByMe final
{
public:
	class ULActBase*                              StoppingAction;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_LockOnDash_C_OnStopByMe) == 0x000008, "Wrong alignment on BP_Action_LockOnDash_C_OnStopByMe");
static_assert(sizeof(BP_Action_LockOnDash_C_OnStopByMe) == 0x000008, "Wrong size on BP_Action_LockOnDash_C_OnStopByMe");
static_assert(offsetof(BP_Action_LockOnDash_C_OnStopByMe, StoppingAction) == 0x000000, "Member 'BP_Action_LockOnDash_C_OnStopByMe::StoppingAction' has a wrong offset!");

// Function BP_Action_LockOnDash.BP_Action_LockOnDash_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_LockOnDash_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_LockOnDash_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_LockOnDash_C_OnStop");
static_assert(sizeof(BP_Action_LockOnDash_C_OnStop) == 0x000010, "Wrong size on BP_Action_LockOnDash_C_OnStop");
static_assert(offsetof(BP_Action_LockOnDash_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_LockOnDash_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_LockOnDash_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_LockOnDash_C_OnStop::Reason' has a wrong offset!");

}

