#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Sprint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_Sprint.BP_Action_Sprint_C.ExecuteUbergraph_BP_Action_Sprint
// 0x0180 (0x0180 - 0x0000)
struct BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_Frenzy_ReturnValue;           // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ULActMgrComponent*                      K2Node_CustomEvent_ActMgrComponent;                // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_TargetActor;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Command;                        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Lever;                          // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SkipCommandPrerequisitiesCheck; // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetMainAnimFSMState_ReturnValue;          // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63[0x1];                                       // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_LockOnRotateTarget_ReturnValue; // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_ApplyInput_ReturnValue;       // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindActionState_ReturnValue;              // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_NotifyApplyInput_LightAttack_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_NotifyApplyInput_StrongAttack_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_InputCommand_StartSprint_ReturnValue;     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_InputCommand_StopSprint_ReturnValue;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_ToggleWalkMode_ReturnValue;   // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClearActionState_ReturnValue;             // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTime;                            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_GetStatComponentBP_Branches;              // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULStatComponent*                        CallFunc_GetStatComponentBP_ReturnValue;           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_GetStatComponentBP_Branches_1;            // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB[0x5];                                       // 0x00BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ULStatComponent*                        CallFunc_GetStatComponentBP_ReturnValue_1;         // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetMainAnimFSMState_ReturnValue_1;        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_GetActionFromTable_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProcessAction_ReturnValue;                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCurrentLever_ReturnValue;              // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Vector_IsNearlyZero_ReturnValue;          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActionSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStopAfterSprintTime_ReturnValue;       // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_GetLCharacterMovementComponentBP_Branches; // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULCharacterMovementComponent*           CallFunc_GetLCharacterMovementComponentBP_ReturnValue; // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x012E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12F[0x1];                                      // 0x012F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ULActMgrComponent* ActMgrComponent, class AActor* TargetActor, class FName Command, const struct FVector& Lever, bool SkipCommandPrerequisitiesCheck)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_GetCurrentLever_ReturnValue_1;            // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionStopReason_UnexpectedBehaviour_ReturnValue; // 0x014C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_ProcessCommand_ReturnValue;               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue_1;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ProcessAction_ReturnValue_1;              // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetTickable_ReturnValue;                  // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetTickable_ReturnValue_1;                // 0x0163(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetCurrentLever_ReturnValue_2;            // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Vector_IsNearlyZero_ReturnValue_1;        // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_StopSprint_ReturnValue;       // 0x0174(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint) == 0x000008, "Wrong alignment on BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint");
static_assert(sizeof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint) == 0x000180, "Wrong size on BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, EntryPoint) == 0x000000, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_ActionState_Frenzy_ReturnValue) == 0x000004, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_ActionState_Frenzy_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, K2Node_CustomEvent_ActMgrComponent) == 0x000028, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::K2Node_CustomEvent_ActMgrComponent' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, K2Node_CustomEvent_TargetActor) == 0x000030, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::K2Node_CustomEvent_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, K2Node_CustomEvent_Command) == 0x000038, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::K2Node_CustomEvent_Command' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, K2Node_CustomEvent_Lever) == 0x000040, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::K2Node_CustomEvent_Lever' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, K2Node_CustomEvent_SkipCommandPrerequisitiesCheck) == 0x00004C, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::K2Node_CustomEvent_SkipCommandPrerequisitiesCheck' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, K2Node_Event_ReasonAction) == 0x000050, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, K2Node_Event_Reason) == 0x000058, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_Stop_ReturnValue) == 0x000060, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000061, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_SetMainAnimFSMState_ReturnValue) == 0x000062, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_SetMainAnimFSMState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_ActionState_LockOnRotateTarget_ReturnValue) == 0x000064, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_ActionState_LockOnRotateTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_ActionState_ApplyInput_ReturnValue) == 0x00006C, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_ActionState_ApplyInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_FindActionState_ReturnValue) == 0x000074, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_FindActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_ActionState_NotifyApplyInput_LightAttack_ReturnValue) == 0x000078, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_ActionState_NotifyApplyInput_LightAttack_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_ActionState_NotifyApplyInput_StrongAttack_ReturnValue) == 0x000080, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_ActionState_NotifyApplyInput_StrongAttack_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_InputCommand_StartSprint_ReturnValue) == 0x000088, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_InputCommand_StartSprint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_InputCommand_StopSprint_ReturnValue) == 0x000090, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_InputCommand_StopSprint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000098, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_BooleanAND_ReturnValue) == 0x000099, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_ActionState_ToggleWalkMode_ReturnValue) == 0x00009C, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_ActionState_ToggleWalkMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_ClearActionState_ReturnValue) == 0x0000A4, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_ClearActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, K2Node_Event_DeltaTime) == 0x0000A8, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_GetStatComponentBP_Branches) == 0x0000AC, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_GetStatComponentBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_GetStatComponentBP_ReturnValue) == 0x0000B0, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_GetStatComponentBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, K2Node_SwitchEnum_CmpSuccess) == 0x0000B8, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, Temp_bool_IsClosed_Variable) == 0x0000B9, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_GetStatComponentBP_Branches_1) == 0x0000BA, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_GetStatComponentBP_Branches_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_GetStatComponentBP_ReturnValue_1) == 0x0000C0, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_GetStatComponentBP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_SetMainAnimFSMState_ReturnValue_1) == 0x0000C8, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_SetMainAnimFSMState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000C9, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_GetActionFromTable_ReturnValue) == 0x0000D0, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_GetActionFromTable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_ProcessAction_ReturnValue) == 0x0000D8, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_ProcessAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_GetCurrentLever_ReturnValue) == 0x0000DC, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_GetCurrentLever_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_Vector_IsNearlyZero_ReturnValue) == 0x0000E8, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_Vector_IsNearlyZero_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000F0, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x0000F8, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_GetStopAfterSprintTime_ReturnValue) == 0x0000FC, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_GetStopAfterSprintTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_GetLCharacterMovementComponentBP_Branches) == 0x000100, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_GetLCharacterMovementComponentBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_GetLCharacterMovementComponentBP_ReturnValue) == 0x000108, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_GetLCharacterMovementComponentBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, K2Node_CreateDelegate_OutputDelegate_1) == 0x000110, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000120, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000128, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00012C, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00012D, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, K2Node_SwitchEnum_CmpSuccess_2) == 0x00012E, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, K2Node_CreateDelegate_OutputDelegate_2) == 0x000130, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_GetCurrentLever_ReturnValue_1) == 0x000140, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_GetCurrentLever_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_ActionStopReason_UnexpectedBehaviour_ReturnValue) == 0x00014C, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_ActionStopReason_UnexpectedBehaviour_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_ProcessCommand_ReturnValue) == 0x000158, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_ProcessCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_Stop_ReturnValue_1) == 0x000160, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_Stop_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_ProcessAction_ReturnValue_1) == 0x000161, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_ProcessAction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_SetTickable_ReturnValue) == 0x000162, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_SetTickable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_SetTickable_ReturnValue_1) == 0x000163, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_SetTickable_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_GetCurrentLever_ReturnValue_2) == 0x000164, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_GetCurrentLever_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_Vector_IsNearlyZero_ReturnValue_1) == 0x000170, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_Vector_IsNearlyZero_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, CallFunc_ActionState_StopSprint_ReturnValue) == 0x000174, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::CallFunc_ActionState_StopSprint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint, Temp_bool_Has_Been_Initd_Variable) == 0x00017C, "Member 'BP_Action_Sprint_C_ExecuteUbergraph_BP_Action_Sprint::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");

// Function BP_Action_Sprint.BP_Action_Sprint_C.OnTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Action_Sprint_C_OnTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Sprint_C_OnTick) == 0x000004, "Wrong alignment on BP_Action_Sprint_C_OnTick");
static_assert(sizeof(BP_Action_Sprint_C_OnTick) == 0x000004, "Wrong size on BP_Action_Sprint_C_OnTick");
static_assert(offsetof(BP_Action_Sprint_C_OnTick, DeltaTime) == 0x000000, "Member 'BP_Action_Sprint_C_OnTick::DeltaTime' has a wrong offset!");

// Function BP_Action_Sprint.BP_Action_Sprint_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_Sprint_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Sprint_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_Sprint_C_OnStop");
static_assert(sizeof(BP_Action_Sprint_C_OnStop) == 0x000010, "Wrong size on BP_Action_Sprint_C_OnStop");
static_assert(offsetof(BP_Action_Sprint_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_Sprint_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_Sprint_C_OnStop::Reason' has a wrong offset!");

// Function BP_Action_Sprint.BP_Action_Sprint_C.OnCommandOccured
// 0x0028 (0x0028 - 0x0000)
struct BP_Action_Sprint_C_OnCommandOccured final
{
public:
	class ULActMgrComponent*                      ActMgrComponent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Command;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Lever;                                             // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipCommandPrerequisitiesCheck;                    // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_Sprint_C_OnCommandOccured) == 0x000008, "Wrong alignment on BP_Action_Sprint_C_OnCommandOccured");
static_assert(sizeof(BP_Action_Sprint_C_OnCommandOccured) == 0x000028, "Wrong size on BP_Action_Sprint_C_OnCommandOccured");
static_assert(offsetof(BP_Action_Sprint_C_OnCommandOccured, ActMgrComponent) == 0x000000, "Member 'BP_Action_Sprint_C_OnCommandOccured::ActMgrComponent' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_OnCommandOccured, TargetActor) == 0x000008, "Member 'BP_Action_Sprint_C_OnCommandOccured::TargetActor' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_C_OnCommandOccured, Command) == 0x000010, "Member 'BP_Action_Sprint_C_OnCommandOccured::Command' has a wrong offset!");
