#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_FatalAttack_Victim

#include "Basic.hpp"

#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_FatalAttack_Victim.BP_Action_FatalAttack_Victim_C.ExecuteUbergraph_BP_Action_FatalAttack_Victim
// 0x0078 (0x0078 - 0x0000)
struct BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ChangeCollisionState_ReturnValue;         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELCollisionState                              CallFunc_GetCurrCollisionState_ReturnValue;        // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_LockDieAction_ReturnValue;    // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_Dying_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindActionState_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ULActionClass_FatalAttack_Victim_End_ReturnValue; // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_LName_None_ReturnValue;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_LName_None_ReturnValue_1;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_1;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_2;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_1;                           // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim) == 0x000008, "Wrong alignment on BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim");
static_assert(sizeof(BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim) == 0x000078, "Wrong size on BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim");
static_assert(offsetof(BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim, EntryPoint) == 0x000000, "Member 'BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim, Temp_bool_Variable) == 0x000004, "Member 'BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim, K2Node_Event_ReasonAction) == 0x000008, "Member 'BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim, K2Node_Event_Reason) == 0x000010, "Member 'BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim, Temp_bool_Variable_1) == 0x000019, "Member 'BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim, K2Node_DynamicCast_AsLCharacter) == 0x000020, "Member 'BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim::K2Node_DynamicCast_AsLCharacter' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim, CallFunc_ChangeCollisionState_ReturnValue) == 0x000029, "Member 'BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim::CallFunc_ChangeCollisionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim, CallFunc_GetCurrCollisionState_ReturnValue) == 0x00002A, "Member 'BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim::CallFunc_GetCurrCollisionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim, CallFunc_ActionState_LockDieAction_ReturnValue) == 0x00002C, "Member 'BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim::CallFunc_ActionState_LockDieAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000034, "Member 'BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim, CallFunc_ActionState_Dying_ReturnValue) == 0x000038, "Member 'BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim::CallFunc_ActionState_Dying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim, CallFunc_FindActionState_ReturnValue) == 0x000040, "Member 'BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim::CallFunc_FindActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim, CallFunc_ULActionClass_FatalAttack_Victim_End_ReturnValue) == 0x000044, "Member 'BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim::CallFunc_ULActionClass_FatalAttack_Victim_End_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim, CallFunc_NotEqual_NameName_ReturnValue) == 0x00004C, "Member 'BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim, CallFunc_BooleanAND_ReturnValue) == 0x00004D, "Member 'BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim, CallFunc_LName_None_ReturnValue) == 0x000050, "Member 'BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim::CallFunc_LName_None_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim, CallFunc_LName_None_ReturnValue_1) == 0x000058, "Member 'BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim::CallFunc_LName_None_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim, CallFunc_NotEqual_NameName_ReturnValue_1) == 0x000060, "Member 'BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim::CallFunc_NotEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim, CallFunc_NotEqual_NameName_ReturnValue_2) == 0x000061, "Member 'BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim::CallFunc_NotEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim, K2Node_Select_Default) == 0x000064, "Member 'BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim, K2Node_Select_Default_1) == 0x00006C, "Member 'BP_Action_FatalAttack_Victim_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim::K2Node_Select_Default_1' has a wrong offset!");

// Function BP_Action_FatalAttack_Victim.BP_Action_FatalAttack_Victim_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_FatalAttack_Victim_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_FatalAttack_Victim_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_FatalAttack_Victim_C_OnStop");
static_assert(sizeof(BP_Action_FatalAttack_Victim_C_OnStop) == 0x000010, "Wrong size on BP_Action_FatalAttack_Victim_C_OnStop");
static_assert(offsetof(BP_Action_FatalAttack_Victim_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_FatalAttack_Victim_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_FatalAttack_Victim_C_OnStop::Reason' has a wrong offset!");

}

