#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_GuardEx_Expolsion

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_GuardEx_Expolsion.BP_Action_GuardEx_Expolsion_C.ExecuteUbergraph_BP_Action_GuardEx_Expolsion
// 0x00D8 (0x00D8 - 0x0000)
struct BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Event_Montage_1;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted_1;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MontageInstanceID_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInst_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StopMontage_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Event_Montage;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MontageInstanceID;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActMgrComponent*                      K2Node_CustomEvent_ActMgrComponent;                // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_TargetActor;                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Command;                        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Lever;                          // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SkipCommandPrerequisitiesCheck; // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_PlaySkillActionBP_Branches;               // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67[0x1];                                       // 0x0067(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_PlaySkillActionBP_ReturnValue;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindActionState_ReturnValue;              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_PlayTargetAnimBP_Branches;                // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayTargetAnimBP_ReturnValue;             // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_GuardEx_CoolTime_ReturnValue; // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindActionState_ReturnValue_1;            // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_ProcessCommand_ReturnValue;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_ApplyInput_ReturnValue;       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProcessAction_ReturnValue;                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Stop_ReturnValue_1;                       // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter;                 // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ConsumeSlaveMagazinePoint_ReturnValue;    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ULActMgrComponent* ActMgrComponent, class AActor* TargetActor, class FName Command, const struct FVector& Lever, bool SkipCommandPrerequisitiesCheck)> K2Node_CreateDelegate_OutputDelegate;              // 0x00C4(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion) == 0x000008, "Wrong alignment on BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion");
static_assert(sizeof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion) == 0x0000D8, "Wrong size on BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, EntryPoint) == 0x000000, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, K2Node_Event_Montage_1) == 0x000008, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::K2Node_Event_Montage_1' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, K2Node_Event_bInterrupted_1) == 0x000010, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::K2Node_Event_bInterrupted_1' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, K2Node_Event_MontageInstanceID_1) == 0x000014, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::K2Node_Event_MontageInstanceID_1' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, CallFunc_GetAnimInst_ReturnValue) == 0x000018, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::CallFunc_GetAnimInst_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, CallFunc_StopMontage_ReturnValue) == 0x000020, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::CallFunc_StopMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, K2Node_Event_Montage) == 0x000028, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::K2Node_Event_Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, K2Node_Event_bInterrupted) == 0x000030, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::K2Node_Event_bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, K2Node_Event_MontageInstanceID) == 0x000034, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::K2Node_Event_MontageInstanceID' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, CallFunc_Stop_ReturnValue) == 0x000038, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, K2Node_CustomEvent_ActMgrComponent) == 0x000040, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::K2Node_CustomEvent_ActMgrComponent' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, K2Node_CustomEvent_TargetActor) == 0x000048, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::K2Node_CustomEvent_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, K2Node_CustomEvent_Command) == 0x000050, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::K2Node_CustomEvent_Command' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, K2Node_CustomEvent_Lever) == 0x000058, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::K2Node_CustomEvent_Lever' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, K2Node_CustomEvent_SkipCommandPrerequisitiesCheck) == 0x000064, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::K2Node_CustomEvent_SkipCommandPrerequisitiesCheck' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, K2Node_SwitchName_CmpSuccess) == 0x000065, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, CallFunc_PlaySkillActionBP_Branches) == 0x000066, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::CallFunc_PlaySkillActionBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, CallFunc_PlaySkillActionBP_ReturnValue) == 0x000068, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::CallFunc_PlaySkillActionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, CallFunc_FindActionState_ReturnValue) == 0x000070, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::CallFunc_FindActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, K2Node_SwitchEnum_CmpSuccess) == 0x000071, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, K2Node_Event_ReasonAction) == 0x000078, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, K2Node_Event_Reason) == 0x000080, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, CallFunc_IsPlaying_ReturnValue) == 0x000088, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, CallFunc_PlayTargetAnimBP_Branches) == 0x000089, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::CallFunc_PlayTargetAnimBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, CallFunc_PlayTargetAnimBP_ReturnValue) == 0x00008C, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::CallFunc_PlayTargetAnimBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, K2Node_SwitchEnum_CmpSuccess_1) == 0x000090, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, CallFunc_BooleanAND_ReturnValue) == 0x000091, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, CallFunc_ActionState_GuardEx_CoolTime_ReturnValue) == 0x000094, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::CallFunc_ActionState_GuardEx_CoolTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, CallFunc_FindActionState_ReturnValue_1) == 0x00009C, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::CallFunc_FindActionState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, CallFunc_ProcessCommand_ReturnValue) == 0x0000A0, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::CallFunc_ProcessCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, CallFunc_ActionState_ApplyInput_ReturnValue) == 0x0000A8, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::CallFunc_ActionState_ApplyInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, CallFunc_ProcessAction_ReturnValue) == 0x0000B0, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::CallFunc_ProcessAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, CallFunc_Stop_ReturnValue_1) == 0x0000B1, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::CallFunc_Stop_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, K2Node_DynamicCast_AsLPCCharacter) == 0x0000B8, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::K2Node_DynamicCast_AsLPCCharacter' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, CallFunc_ConsumeSlaveMagazinePoint_ReturnValue) == 0x0000C1, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::CallFunc_ConsumeSlaveMagazinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion, K2Node_CreateDelegate_OutputDelegate) == 0x0000C4, "Member 'BP_Action_GuardEx_Expolsion_C_ExecuteUbergraph_BP_Action_GuardEx_Expolsion::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function BP_Action_GuardEx_Expolsion.BP_Action_GuardEx_Expolsion_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_GuardEx_Expolsion_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_GuardEx_Expolsion_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_GuardEx_Expolsion_C_OnStop");
static_assert(sizeof(BP_Action_GuardEx_Expolsion_C_OnStop) == 0x000010, "Wrong size on BP_Action_GuardEx_Expolsion_C_OnStop");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_GuardEx_Expolsion_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_GuardEx_Expolsion_C_OnStop::Reason' has a wrong offset!");

// Function BP_Action_GuardEx_Expolsion.BP_Action_GuardEx_Expolsion_C.OnCommandOccurred_Event
// 0x0028 (0x0028 - 0x0000)
struct BP_Action_GuardEx_Expolsion_C_OnCommandOccurred_Event final
{
public:
	class ULActMgrComponent*                      ActMgrComponent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Command;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Lever;                                             // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipCommandPrerequisitiesCheck;                    // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_GuardEx_Expolsion_C_OnCommandOccurred_Event) == 0x000008, "Wrong alignment on BP_Action_GuardEx_Expolsion_C_OnCommandOccurred_Event");
static_assert(sizeof(BP_Action_GuardEx_Expolsion_C_OnCommandOccurred_Event) == 0x000028, "Wrong size on BP_Action_GuardEx_Expolsion_C_OnCommandOccurred_Event");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_OnCommandOccurred_Event, ActMgrComponent) == 0x000000, "Member 'BP_Action_GuardEx_Expolsion_C_OnCommandOccurred_Event::ActMgrComponent' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_OnCommandOccurred_Event, TargetActor) == 0x000008, "Member 'BP_Action_GuardEx_Expolsion_C_OnCommandOccurred_Event::TargetActor' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_OnCommandOccurred_Event, Command) == 0x000010, "Member 'BP_Action_GuardEx_Expolsion_C_OnCommandOccurred_Event::Command' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_OnCommandOccurred_Event, Lever) == 0x000018, "Member 'BP_Action_GuardEx_Expolsion_C_OnCommandOccurred_Event::Lever' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_OnCommandOccurred_Event, SkipCommandPrerequisitiesCheck) == 0x000024, "Member 'BP_Action_GuardEx_Expolsion_C_OnCommandOccurred_Event::SkipCommandPrerequisitiesCheck' has a wrong offset!");

// Function BP_Action_GuardEx_Expolsion.BP_Action_GuardEx_Expolsion_C.OnCurrMontageEnded
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_GuardEx_Expolsion_C_OnCurrMontageEnded final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MontageInstanceID;                                 // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_GuardEx_Expolsion_C_OnCurrMontageEnded) == 0x000008, "Wrong alignment on BP_Action_GuardEx_Expolsion_C_OnCurrMontageEnded");
static_assert(sizeof(BP_Action_GuardEx_Expolsion_C_OnCurrMontageEnded) == 0x000010, "Wrong size on BP_Action_GuardEx_Expolsion_C_OnCurrMontageEnded");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_OnCurrMontageEnded, Montage) == 0x000000, "Member 'BP_Action_GuardEx_Expolsion_C_OnCurrMontageEnded::Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_OnCurrMontageEnded, bInterrupted) == 0x000008, "Member 'BP_Action_GuardEx_Expolsion_C_OnCurrMontageEnded::bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_OnCurrMontageEnded, MontageInstanceID) == 0x00000C, "Member 'BP_Action_GuardEx_Expolsion_C_OnCurrMontageEnded::MontageInstanceID' has a wrong offset!");

// Function BP_Action_GuardEx_Expolsion.BP_Action_GuardEx_Expolsion_C.OnCurrMontageBlendOutStarted
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_GuardEx_Expolsion_C_OnCurrMontageBlendOutStarted final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MontageInstanceID;                                 // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_GuardEx_Expolsion_C_OnCurrMontageBlendOutStarted) == 0x000008, "Wrong alignment on BP_Action_GuardEx_Expolsion_C_OnCurrMontageBlendOutStarted");
static_assert(sizeof(BP_Action_GuardEx_Expolsion_C_OnCurrMontageBlendOutStarted) == 0x000010, "Wrong size on BP_Action_GuardEx_Expolsion_C_OnCurrMontageBlendOutStarted");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_OnCurrMontageBlendOutStarted, Montage) == 0x000000, "Member 'BP_Action_GuardEx_Expolsion_C_OnCurrMontageBlendOutStarted::Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_OnCurrMontageBlendOutStarted, bInterrupted) == 0x000008, "Member 'BP_Action_GuardEx_Expolsion_C_OnCurrMontageBlendOutStarted::bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_OnCurrMontageBlendOutStarted, MontageInstanceID) == 0x00000C, "Member 'BP_Action_GuardEx_Expolsion_C_OnCurrMontageBlendOutStarted::MontageInstanceID' has a wrong offset!");

// Function BP_Action_GuardEx_Expolsion.BP_Action_GuardEx_Expolsion_C.SetReinforcedVariableValue
// 0x0014 (0x0014 - 0x0000)
struct BP_Action_GuardEx_Expolsion_C_SetReinforcedVariableValue final
{
public:
	class FName                                   VariableName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Value;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_GuardEx_Expolsion_C_SetReinforcedVariableValue) == 0x000004, "Wrong alignment on BP_Action_GuardEx_Expolsion_C_SetReinforcedVariableValue");
static_assert(sizeof(BP_Action_GuardEx_Expolsion_C_SetReinforcedVariableValue) == 0x000014, "Wrong size on BP_Action_GuardEx_Expolsion_C_SetReinforcedVariableValue");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_SetReinforcedVariableValue, VariableName) == 0x000000, "Member 'BP_Action_GuardEx_Expolsion_C_SetReinforcedVariableValue::VariableName' has a wrong offset!");
static_assert(offsetof(BP_Action_GuardEx_Expolsion_C_SetReinforcedVariableValue, Value) == 0x000008, "Member 'BP_Action_GuardEx_Expolsion_C_SetReinforcedVariableValue::Value' has a wrong offset!");
