#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_CeilingHitFalling

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_CeilingHitFalling.BP_Action_CeilingHitFalling_C.ExecuteUbergraph_BP_Action_CeilingHitFalling
// 0x0058 (0x0058 - 0x0000)
struct BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Event_Montage_1;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted_1;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MontageInstanceID_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_Event_Montage;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MontageInstanceID;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_GetEndCommonAnimBP_Branches;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetEndCommonAnimBP_ReturnValue;           // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayHitAnimBP_MontageInstanceID;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_PlayHitAnimBP_Montage;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayHitAnimBP_Branches;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayHitAnimBP_MontageInstanceID_1;        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_PlayHitAnimBP_Montage_1;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayHitAnimBP_Branches_1;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling) == 0x000008, "Wrong alignment on BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling");
static_assert(sizeof(BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling) == 0x000058, "Wrong size on BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling, EntryPoint) == 0x000000, "Member 'BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling, K2Node_Event_Montage_1) == 0x000008, "Member 'BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling::K2Node_Event_Montage_1' has a wrong offset!");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling, K2Node_Event_bInterrupted_1) == 0x000010, "Member 'BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling::K2Node_Event_bInterrupted_1' has a wrong offset!");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling, K2Node_Event_MontageInstanceID_1) == 0x000014, "Member 'BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling::K2Node_Event_MontageInstanceID_1' has a wrong offset!");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling, K2Node_Event_Montage) == 0x000018, "Member 'BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling::K2Node_Event_Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling, K2Node_Event_bInterrupted) == 0x000020, "Member 'BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling::K2Node_Event_bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling, K2Node_Event_MontageInstanceID) == 0x000024, "Member 'BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling::K2Node_Event_MontageInstanceID' has a wrong offset!");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling, CallFunc_GetEndCommonAnimBP_Branches) == 0x000028, "Member 'BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling::CallFunc_GetEndCommonAnimBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling, CallFunc_GetEndCommonAnimBP_ReturnValue) == 0x00002C, "Member 'BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling::CallFunc_GetEndCommonAnimBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling, CallFunc_PlayHitAnimBP_MontageInstanceID) == 0x000034, "Member 'BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling::CallFunc_PlayHitAnimBP_MontageInstanceID' has a wrong offset!");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling, CallFunc_PlayHitAnimBP_Montage) == 0x000038, "Member 'BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling::CallFunc_PlayHitAnimBP_Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling, CallFunc_PlayHitAnimBP_Branches) == 0x000040, "Member 'BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling::CallFunc_PlayHitAnimBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling, CallFunc_PlayHitAnimBP_MontageInstanceID_1) == 0x000044, "Member 'BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling::CallFunc_PlayHitAnimBP_MontageInstanceID_1' has a wrong offset!");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling, CallFunc_PlayHitAnimBP_Montage_1) == 0x000048, "Member 'BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling::CallFunc_PlayHitAnimBP_Montage_1' has a wrong offset!");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling, CallFunc_PlayHitAnimBP_Branches_1) == 0x000050, "Member 'BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling::CallFunc_PlayHitAnimBP_Branches_1' has a wrong offset!");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling, K2Node_SwitchEnum_CmpSuccess) == 0x000051, "Member 'BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling, K2Node_SwitchEnum_CmpSuccess_1) == 0x000052, "Member 'BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000053, "Member 'BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000054, "Member 'BP_Action_CeilingHitFalling_C_ExecuteUbergraph_BP_Action_CeilingHitFalling::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_Action_CeilingHitFalling.BP_Action_CeilingHitFalling_C.OnCurrMontageEnded
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_CeilingHitFalling_C_OnCurrMontageEnded final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MontageInstanceID;                                 // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_CeilingHitFalling_C_OnCurrMontageEnded) == 0x000008, "Wrong alignment on BP_Action_CeilingHitFalling_C_OnCurrMontageEnded");
static_assert(sizeof(BP_Action_CeilingHitFalling_C_OnCurrMontageEnded) == 0x000010, "Wrong size on BP_Action_CeilingHitFalling_C_OnCurrMontageEnded");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_OnCurrMontageEnded, Montage) == 0x000000, "Member 'BP_Action_CeilingHitFalling_C_OnCurrMontageEnded::Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_OnCurrMontageEnded, bInterrupted) == 0x000008, "Member 'BP_Action_CeilingHitFalling_C_OnCurrMontageEnded::bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_OnCurrMontageEnded, MontageInstanceID) == 0x00000C, "Member 'BP_Action_CeilingHitFalling_C_OnCurrMontageEnded::MontageInstanceID' has a wrong offset!");

// Function BP_Action_CeilingHitFalling.BP_Action_CeilingHitFalling_C.OnCurrMontageBlendOutStarted
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_CeilingHitFalling_C_OnCurrMontageBlendOutStarted final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MontageInstanceID;                                 // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_CeilingHitFalling_C_OnCurrMontageBlendOutStarted) == 0x000008, "Wrong alignment on BP_Action_CeilingHitFalling_C_OnCurrMontageBlendOutStarted");
static_assert(sizeof(BP_Action_CeilingHitFalling_C_OnCurrMontageBlendOutStarted) == 0x000010, "Wrong size on BP_Action_CeilingHitFalling_C_OnCurrMontageBlendOutStarted");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_OnCurrMontageBlendOutStarted, Montage) == 0x000000, "Member 'BP_Action_CeilingHitFalling_C_OnCurrMontageBlendOutStarted::Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_OnCurrMontageBlendOutStarted, bInterrupted) == 0x000008, "Member 'BP_Action_CeilingHitFalling_C_OnCurrMontageBlendOutStarted::bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_OnCurrMontageBlendOutStarted, MontageInstanceID) == 0x00000C, "Member 'BP_Action_CeilingHitFalling_C_OnCurrMontageBlendOutStarted::MontageInstanceID' has a wrong offset!");

// Function BP_Action_CeilingHitFalling.BP_Action_CeilingHitFalling_C.OnLanded
// 0x0098 (0x0098 - 0x0000)
struct BP_Action_CeilingHitFalling_C_OnLanded final
{
public:
	class ACharacter*                             LandingChar;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0008(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CancelLoopAnim_ReturnValue;               // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_CeilingHitFalling_C_OnLanded) == 0x000008, "Wrong alignment on BP_Action_CeilingHitFalling_C_OnLanded");
static_assert(sizeof(BP_Action_CeilingHitFalling_C_OnLanded) == 0x000098, "Wrong size on BP_Action_CeilingHitFalling_C_OnLanded");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_OnLanded, LandingChar) == 0x000000, "Member 'BP_Action_CeilingHitFalling_C_OnLanded::LandingChar' has a wrong offset!");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_OnLanded, Hit) == 0x000008, "Member 'BP_Action_CeilingHitFalling_C_OnLanded::Hit' has a wrong offset!");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_OnLanded, ReturnValue) == 0x000090, "Member 'BP_Action_CeilingHitFalling_C_OnLanded::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_CeilingHitFalling_C_OnLanded, CallFunc_CancelLoopAnim_ReturnValue) == 0x000091, "Member 'BP_Action_CeilingHitFalling_C_OnLanded::CallFunc_CancelLoopAnim_ReturnValue' has a wrong offset!");

}

