#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_SpawnIdle

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_SpawnIdle.BP_Action_SpawnIdle_C
// 0x0020 (0x0278 - 0x0258)
class UBP_Action_SpawnIdle_C final : public ULAction_LoopAnim
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   CommonAnimCodeName;                                // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayNextLoopAnim;                                 // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Exception_SpecialIgnoreNpcCodeName;                // 0x026C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Action_SpawnIdle(int32 EntryPoint);
	void SetRuntimeRootMotion(bool bRootMotion);
	void OnStop(class ULActBase* ReasonAction, class FName Reason);
	void OnEndSpawnIdle();
	void OnStart();
	bool OnPreProcessAction();
	class UAnimSequenceBase* GetSpawnIdleAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Action_SpawnIdle_C">();
	}
	static class UBP_Action_SpawnIdle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_SpawnIdle_C>();
	}
};
static_assert(alignof(UBP_Action_SpawnIdle_C) == 0x000008, "Wrong alignment on UBP_Action_SpawnIdle_C");
static_assert(sizeof(UBP_Action_SpawnIdle_C) == 0x000278, "Wrong size on UBP_Action_SpawnIdle_C");
static_assert(offsetof(UBP_Action_SpawnIdle_C, UberGraphFrame) == 0x000258, "Member 'UBP_Action_SpawnIdle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Action_SpawnIdle_C, CommonAnimCodeName) == 0x000260, "Member 'UBP_Action_SpawnIdle_C::CommonAnimCodeName' has a wrong offset!");
static_assert(offsetof(UBP_Action_SpawnIdle_C, bPlayNextLoopAnim) == 0x000268, "Member 'UBP_Action_SpawnIdle_C::bPlayNextLoopAnim' has a wrong offset!");
static_assert(offsetof(UBP_Action_SpawnIdle_C, Exception_SpecialIgnoreNpcCodeName) == 0x00026C, "Member 'UBP_Action_SpawnIdle_C::Exception_SpecialIgnoreNpcCodeName' has a wrong offset!");

}

