#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_SlaveArm_VisualBase

#include "Basic.hpp"

#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_SlaveArm_VisualBase.BP_Action_SlaveArm_VisualBase_C.ExecuteUbergraph_BP_Action_SlaveArm_VisualBase
// 0x0038 (0x0038 - 0x0000)
struct BP_Action_SlaveArm_VisualBase_C_ExecuteUbergraph_BP_Action_SlaveArm_VisualBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          K2Node_Event_AnimInstance;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_TargetActor;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_GetActiveSlaveArmItemBP_Branches;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 CallFunc_GetActiveSlaveArmItemBP_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCodeName_ReturnValue;                  // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_SlaveArm_VisualBase_C_ExecuteUbergraph_BP_Action_SlaveArm_VisualBase) == 0x000008, "Wrong alignment on BP_Action_SlaveArm_VisualBase_C_ExecuteUbergraph_BP_Action_SlaveArm_VisualBase");
static_assert(sizeof(BP_Action_SlaveArm_VisualBase_C_ExecuteUbergraph_BP_Action_SlaveArm_VisualBase) == 0x000038, "Wrong size on BP_Action_SlaveArm_VisualBase_C_ExecuteUbergraph_BP_Action_SlaveArm_VisualBase");
static_assert(offsetof(BP_Action_SlaveArm_VisualBase_C_ExecuteUbergraph_BP_Action_SlaveArm_VisualBase, EntryPoint) == 0x000000, "Member 'BP_Action_SlaveArm_VisualBase_C_ExecuteUbergraph_BP_Action_SlaveArm_VisualBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_VisualBase_C_ExecuteUbergraph_BP_Action_SlaveArm_VisualBase, K2Node_Event_AnimInstance) == 0x000008, "Member 'BP_Action_SlaveArm_VisualBase_C_ExecuteUbergraph_BP_Action_SlaveArm_VisualBase::K2Node_Event_AnimInstance' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_VisualBase_C_ExecuteUbergraph_BP_Action_SlaveArm_VisualBase, K2Node_CustomEvent_TargetActor) == 0x000010, "Member 'BP_Action_SlaveArm_VisualBase_C_ExecuteUbergraph_BP_Action_SlaveArm_VisualBase::K2Node_CustomEvent_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_VisualBase_C_ExecuteUbergraph_BP_Action_SlaveArm_VisualBase, CallFunc_GetActiveSlaveArmItemBP_Branches) == 0x000018, "Member 'BP_Action_SlaveArm_VisualBase_C_ExecuteUbergraph_BP_Action_SlaveArm_VisualBase::CallFunc_GetActiveSlaveArmItemBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_VisualBase_C_ExecuteUbergraph_BP_Action_SlaveArm_VisualBase, CallFunc_GetActiveSlaveArmItemBP_ReturnValue) == 0x000020, "Member 'BP_Action_SlaveArm_VisualBase_C_ExecuteUbergraph_BP_Action_SlaveArm_VisualBase::CallFunc_GetActiveSlaveArmItemBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_VisualBase_C_ExecuteUbergraph_BP_Action_SlaveArm_VisualBase, K2Node_SwitchEnum_CmpSuccess) == 0x000028, "Member 'BP_Action_SlaveArm_VisualBase_C_ExecuteUbergraph_BP_Action_SlaveArm_VisualBase::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_VisualBase_C_ExecuteUbergraph_BP_Action_SlaveArm_VisualBase, CallFunc_GetCodeName_ReturnValue) == 0x00002C, "Member 'BP_Action_SlaveArm_VisualBase_C_ExecuteUbergraph_BP_Action_SlaveArm_VisualBase::CallFunc_GetCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_VisualBase_C_ExecuteUbergraph_BP_Action_SlaveArm_VisualBase, K2Node_SwitchName_CmpSuccess) == 0x000034, "Member 'BP_Action_SlaveArm_VisualBase_C_ExecuteUbergraph_BP_Action_SlaveArm_VisualBase::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function BP_Action_SlaveArm_VisualBase.BP_Action_SlaveArm_VisualBase_C.OnAnimInstanceInitialization
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_SlaveArm_VisualBase_C_OnAnimInstanceInitialization final
{
public:
	class UAnimInstance*                          AnimInstance;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_SlaveArm_VisualBase_C_OnAnimInstanceInitialization) == 0x000008, "Wrong alignment on BP_Action_SlaveArm_VisualBase_C_OnAnimInstanceInitialization");
static_assert(sizeof(BP_Action_SlaveArm_VisualBase_C_OnAnimInstanceInitialization) == 0x000008, "Wrong size on BP_Action_SlaveArm_VisualBase_C_OnAnimInstanceInitialization");
static_assert(offsetof(BP_Action_SlaveArm_VisualBase_C_OnAnimInstanceInitialization, AnimInstance) == 0x000000, "Member 'BP_Action_SlaveArm_VisualBase_C_OnAnimInstanceInitialization::AnimInstance' has a wrong offset!");

// Function BP_Action_SlaveArm_VisualBase.BP_Action_SlaveArm_VisualBase_C.RefreshAdditiveAnimation
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_SlaveArm_VisualBase_C_RefreshAdditiveAnimation final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_SlaveArm_VisualBase_C_RefreshAdditiveAnimation) == 0x000008, "Wrong alignment on BP_Action_SlaveArm_VisualBase_C_RefreshAdditiveAnimation");
static_assert(sizeof(BP_Action_SlaveArm_VisualBase_C_RefreshAdditiveAnimation) == 0x000008, "Wrong size on BP_Action_SlaveArm_VisualBase_C_RefreshAdditiveAnimation");
static_assert(offsetof(BP_Action_SlaveArm_VisualBase_C_RefreshAdditiveAnimation, TargetActor) == 0x000000, "Member 'BP_Action_SlaveArm_VisualBase_C_RefreshAdditiveAnimation::TargetActor' has a wrong offset!");

// Function BP_Action_SlaveArm_VisualBase.BP_Action_SlaveArm_VisualBase_C.GetSlaveArmAdditiveAlpha
// 0x0028 (0x0028 - 0x0000)
struct BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAlpha final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cached_alpha;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSlaveArmAdditiveAlpha_ReturnValue;     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_GetActiveSlaveArmItemBP_Branches;         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 CallFunc_GetActiveSlaveArmItemBP_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCodeName_ReturnValue;                  // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAlpha) == 0x000008, "Wrong alignment on BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAlpha");
static_assert(sizeof(BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAlpha) == 0x000028, "Wrong size on BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAlpha");
static_assert(offsetof(BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAlpha, ReturnValue) == 0x000000, "Member 'BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAlpha::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAlpha, Cached_alpha) == 0x000004, "Member 'BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAlpha::Cached_alpha' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAlpha, CallFunc_GetSlaveArmAdditiveAlpha_ReturnValue) == 0x000008, "Member 'BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAlpha::CallFunc_GetSlaveArmAdditiveAlpha_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAlpha, CallFunc_GetActiveSlaveArmItemBP_Branches) == 0x00000C, "Member 'BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAlpha::CallFunc_GetActiveSlaveArmItemBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAlpha, CallFunc_GetActiveSlaveArmItemBP_ReturnValue) == 0x000010, "Member 'BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAlpha::CallFunc_GetActiveSlaveArmItemBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAlpha, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAlpha::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAlpha, CallFunc_GetCodeName_ReturnValue) == 0x00001C, "Member 'BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAlpha::CallFunc_GetCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAlpha, K2Node_SwitchName_CmpSuccess) == 0x000024, "Member 'BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAlpha::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function BP_Action_SlaveArm_VisualBase.BP_Action_SlaveArm_VisualBase_C.GetSlaveArmAdditiveAnim
// 0x0038 (0x0038 - 0x0000)
struct BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAnim final
{
public:
	class UAnimSequenceBase*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Cached_animSeq;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindActionState_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_GetActiveSlaveArmItemBP_Branches;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 CallFunc_GetActiveSlaveArmItemBP_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCodeName_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      CallFunc_GetSlaveArmAdditiveAnim_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAnim) == 0x000008, "Wrong alignment on BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAnim");
static_assert(sizeof(BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAnim) == 0x000038, "Wrong size on BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAnim");
static_assert(offsetof(BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAnim, ReturnValue) == 0x000000, "Member 'BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAnim::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAnim, Cached_animSeq) == 0x000008, "Member 'BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAnim::Cached_animSeq' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAnim, CallFunc_FindActionState_ReturnValue) == 0x000010, "Member 'BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAnim::CallFunc_FindActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAnim, CallFunc_GetActiveSlaveArmItemBP_Branches) == 0x000011, "Member 'BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAnim::CallFunc_GetActiveSlaveArmItemBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAnim, CallFunc_GetActiveSlaveArmItemBP_ReturnValue) == 0x000018, "Member 'BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAnim::CallFunc_GetActiveSlaveArmItemBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAnim, CallFunc_GetCodeName_ReturnValue) == 0x000020, "Member 'BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAnim::CallFunc_GetCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAnim, K2Node_SwitchName_CmpSuccess) == 0x000028, "Member 'BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAnim::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAnim, K2Node_SwitchEnum_CmpSuccess) == 0x000029, "Member 'BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAnim::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAnim, CallFunc_GetSlaveArmAdditiveAnim_ReturnValue) == 0x000030, "Member 'BP_Action_SlaveArm_VisualBase_C_GetSlaveArmAdditiveAnim::CallFunc_GetSlaveArmAdditiveAnim_ReturnValue' has a wrong offset!");

}

