#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_FatalAttack_VictimBase

#include "Basic.hpp"

#include "BP_Action_HitBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_FatalAttack_VictimBase.BP_Action_FatalAttack_VictimBase_C
// 0x0018 (0x0438 - 0x0420)
class UBP_Action_FatalAttack_VictimBase_C : public UBP_Action_HitBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Action_FatalAttack_VictimBase_C; // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   Cached_SelectedPlayAnim;                           // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Cached_SkipPlayAnim;                               // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Action_FatalAttack_VictimBase(int32 EntryPoint);
	void OnStop(class ULActBase* ReasonAction, class FName Reason);
	void OnStart();
	void OnCurrMontageEnded(class UAnimMontage* Montage, bool bInterrupted, int32 MontageInstanceID);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Action_FatalAttack_VictimBase_C">();
	}
	static class UBP_Action_FatalAttack_VictimBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_FatalAttack_VictimBase_C>();
	}
};
static_assert(alignof(UBP_Action_FatalAttack_VictimBase_C) == 0x000008, "Wrong alignment on UBP_Action_FatalAttack_VictimBase_C");
static_assert(sizeof(UBP_Action_FatalAttack_VictimBase_C) == 0x000438, "Wrong size on UBP_Action_FatalAttack_VictimBase_C");
static_assert(offsetof(UBP_Action_FatalAttack_VictimBase_C, UberGraphFrame_BP_Action_FatalAttack_VictimBase_C) == 0x000420, "Member 'UBP_Action_FatalAttack_VictimBase_C::UberGraphFrame_BP_Action_FatalAttack_VictimBase_C' has a wrong offset!");
static_assert(offsetof(UBP_Action_FatalAttack_VictimBase_C, Cached_SelectedPlayAnim) == 0x000428, "Member 'UBP_Action_FatalAttack_VictimBase_C::Cached_SelectedPlayAnim' has a wrong offset!");
static_assert(offsetof(UBP_Action_FatalAttack_VictimBase_C, Cached_SkipPlayAnim) == 0x000430, "Member 'UBP_Action_FatalAttack_VictimBase_C::Cached_SkipPlayAnim' has a wrong offset!");

}

