#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_GameStart

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_GameStart.BP_Action_GameStart_C
// 0x0028 (0x0258 - 0x0230)
class UBP_Action_GameStart_C final : public ULAction_SingleAnim
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   UndoSprintCommand;                                 // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ClothResetTimerHandle;                             // 0x0240(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      OneHand;                                           // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      TwoHand;                                           // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Action_GameStart(int32 EntryPoint);
	void OnStop(class ULActBase* ReasonAction, class FName Reason);
	void DoResetCloth();
	void OnCurrMontageEnded(class UAnimMontage* Montage, bool bInterrupted, int32 MontageInstanceID);
	void OnStart();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Action_GameStart_C">();
	}
	static class UBP_Action_GameStart_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_GameStart_C>();
	}
};
static_assert(alignof(UBP_Action_GameStart_C) == 0x000008, "Wrong alignment on UBP_Action_GameStart_C");
static_assert(sizeof(UBP_Action_GameStart_C) == 0x000258, "Wrong size on UBP_Action_GameStart_C");
static_assert(offsetof(UBP_Action_GameStart_C, UberGraphFrame) == 0x000230, "Member 'UBP_Action_GameStart_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Action_GameStart_C, UndoSprintCommand) == 0x000238, "Member 'UBP_Action_GameStart_C::UndoSprintCommand' has a wrong offset!");
static_assert(offsetof(UBP_Action_GameStart_C, ClothResetTimerHandle) == 0x000240, "Member 'UBP_Action_GameStart_C::ClothResetTimerHandle' has a wrong offset!");
static_assert(offsetof(UBP_Action_GameStart_C, OneHand) == 0x000248, "Member 'UBP_Action_GameStart_C::OneHand' has a wrong offset!");
static_assert(offsetof(UBP_Action_GameStart_C, TwoHand) == 0x000250, "Member 'UBP_Action_GameStart_C::TwoHand' has a wrong offset!");

}

