#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_SlaveArm_Fulminis

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_Action_SlaveArm_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_SlaveArm_Fulminis.BP_Action_SlaveArm_Fulminis_C
// 0x0078 (0x0308 - 0x0290)
class UBP_Action_SlaveArm_Fulminis_C final : public UBP_Action_SlaveArm_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Action_SlaveArm_Fulminis_C;      // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         CurrentChargeStep;                                 // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxChargeStep;                                     // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, float>                            ChargeStepTimeMap;                                 // 0x02A0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           FullCharge_Timer;                                  // 0x02F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Pending_Fire;                                      // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x3];                                      // 0x02F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NextSkillCodeName;                                 // 0x02FC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          KeyReleased;                                       // 0x0304(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Action_SlaveArm_Fulminis(int32 EntryPoint);
	void OnTick(float DeltaTime);
	void CheckIfSectionChanged();
	void OnCurrMontageEnded(class UAnimMontage* Montage, bool bInterrupted, int32 MontageInstanceID);
	void OnStop(class ULActBase* ReasonAction, class FName Reason);
	void Fire();
	void OnFullCharge_Step_0();
	void OnCommandOccurred_Event(class ULActMgrComponent* ActMgrComponent, class AActor* TargetActor, class FName Command, const struct FVector& Lever, bool SkipCommandPrerequisitiesCheck);
	void OnStart();
	void PlaySlaveArmMontage();
	void SetReinforcedVariableValue(class FName VariableName, class FName Value);
	void ClearReinforcedVariableValues();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Action_SlaveArm_Fulminis_C">();
	}
	static class UBP_Action_SlaveArm_Fulminis_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_SlaveArm_Fulminis_C>();
	}
};
static_assert(alignof(UBP_Action_SlaveArm_Fulminis_C) == 0x000008, "Wrong alignment on UBP_Action_SlaveArm_Fulminis_C");
static_assert(sizeof(UBP_Action_SlaveArm_Fulminis_C) == 0x000308, "Wrong size on UBP_Action_SlaveArm_Fulminis_C");
static_assert(offsetof(UBP_Action_SlaveArm_Fulminis_C, UberGraphFrame_BP_Action_SlaveArm_Fulminis_C) == 0x000290, "Member 'UBP_Action_SlaveArm_Fulminis_C::UberGraphFrame_BP_Action_SlaveArm_Fulminis_C' has a wrong offset!");
static_assert(offsetof(UBP_Action_SlaveArm_Fulminis_C, CurrentChargeStep) == 0x000298, "Member 'UBP_Action_SlaveArm_Fulminis_C::CurrentChargeStep' has a wrong offset!");
static_assert(offsetof(UBP_Action_SlaveArm_Fulminis_C, MaxChargeStep) == 0x00029C, "Member 'UBP_Action_SlaveArm_Fulminis_C::MaxChargeStep' has a wrong offset!");
static_assert(offsetof(UBP_Action_SlaveArm_Fulminis_C, ChargeStepTimeMap) == 0x0002A0, "Member 'UBP_Action_SlaveArm_Fulminis_C::ChargeStepTimeMap' has a wrong offset!");
static_assert(offsetof(UBP_Action_SlaveArm_Fulminis_C, FullCharge_Timer) == 0x0002F0, "Member 'UBP_Action_SlaveArm_Fulminis_C::FullCharge_Timer' has a wrong offset!");
static_assert(offsetof(UBP_Action_SlaveArm_Fulminis_C, Pending_Fire) == 0x0002F8, "Member 'UBP_Action_SlaveArm_Fulminis_C::Pending_Fire' has a wrong offset!");
static_assert(offsetof(UBP_Action_SlaveArm_Fulminis_C, NextSkillCodeName) == 0x0002FC, "Member 'UBP_Action_SlaveArm_Fulminis_C::NextSkillCodeName' has a wrong offset!");
static_assert(offsetof(UBP_Action_SlaveArm_Fulminis_C, KeyReleased) == 0x000304, "Member 'UBP_Action_SlaveArm_Fulminis_C::KeyReleased' has a wrong offset!");

}

