#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_FatalAttack_Victim_End

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Action_FatalAttack_Victim_End.BP_Action_FatalAttack_Victim_End_C.ExecuteUbergraph_BP_Action_FatalAttack_Victim_End
// 0x0060 (0x0060 - 0x0000)
struct BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_Immune_Tough_ReturnValue;     // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_LockDieAction_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_LName_None_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_LName_None_ReturnValue_1;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_1;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_Ignore_Invincible_OnDamagedByAbnormal_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_1;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_Ignore_Invincible_OnDamagedByAbnormal_ReturnValue_1; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End) == 0x000008, "Wrong alignment on BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End");
static_assert(sizeof(BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End) == 0x000060, "Wrong size on BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End");
static_assert(offsetof(BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End, EntryPoint) == 0x000000, "Member 'BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End, CallFunc_ActionState_Immune_Tough_ReturnValue) == 0x000004, "Member 'BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End::CallFunc_ActionState_Immune_Tough_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End, Temp_bool_Variable) == 0x00000C, "Member 'BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End, Temp_bool_Variable_1) == 0x00000D, "Member 'BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End, K2Node_Event_ReasonAction) == 0x000010, "Member 'BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End, K2Node_Event_Reason) == 0x000018, "Member 'BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End, CallFunc_ActionState_LockDieAction_ReturnValue) == 0x000020, "Member 'BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End::CallFunc_ActionState_LockDieAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End, CallFunc_LName_None_ReturnValue) == 0x000028, "Member 'BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End::CallFunc_LName_None_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End, CallFunc_LName_None_ReturnValue_1) == 0x000030, "Member 'BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End::CallFunc_LName_None_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End, CallFunc_NotEqual_NameName_ReturnValue) == 0x000038, "Member 'BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End, K2Node_Select_Default) == 0x00003C, "Member 'BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End, CallFunc_NotEqual_NameName_ReturnValue_1) == 0x000044, "Member 'BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End::CallFunc_NotEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End, CallFunc_ActionState_Ignore_Invincible_OnDamagedByAbnormal_ReturnValue) == 0x000048, "Member 'BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End::CallFunc_ActionState_Ignore_Invincible_OnDamagedByAbnormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End, K2Node_Select_Default_1) == 0x000050, "Member 'BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End, CallFunc_ActionState_Ignore_Invincible_OnDamagedByAbnormal_ReturnValue_1) == 0x000058, "Member 'BP_Action_FatalAttack_Victim_End_C_ExecuteUbergraph_BP_Action_FatalAttack_Victim_End::CallFunc_ActionState_Ignore_Invincible_OnDamagedByAbnormal_ReturnValue_1' has a wrong offset!");

// Function BP_Action_FatalAttack_Victim_End.BP_Action_FatalAttack_Victim_End_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_FatalAttack_Victim_End_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_FatalAttack_Victim_End_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_FatalAttack_Victim_End_C_OnStop");
static_assert(sizeof(BP_Action_FatalAttack_Victim_End_C_OnStop) == 0x000010, "Wrong size on BP_Action_FatalAttack_Victim_End_C_OnStop");
static_assert(offsetof(BP_Action_FatalAttack_Victim_End_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_FatalAttack_Victim_End_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_FatalAttack_Victim_End_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_FatalAttack_Victim_End_C_OnStop::Reason' has a wrong offset!");

}

