#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_GetUpDash

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_GetUpDash.BP_Action_GetUpDash_C
// 0x0080 (0x02D8 - 0x0258)
class UBP_Action_GetUpDash_C : public ULAction_LoopAnim
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FLGameObjectHandle                     RootMotionScalingHandle_Freeze;                    // 0x0260(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FLGameObjectHandle                     TfModifierHandle_SideMove;                         // 0x0264(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         Cached_LeverAngle;                                 // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Cached_Lever;                                      // 0x026C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Option_RotationTime;                               // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_StartLocation;                                // 0x027C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Cached_PrevHitMotionAnim;                          // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELHitMotionType                               Cached_Hit_Motion_Type;                            // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELHitMotionDirectionType                      Cached_Selected_Hit_Motion_Direction;              // 0x0291(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Cached_LeverZero;                                  // 0x0292(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_293[0x1];                                      // 0x0293(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   GetUpDash_F_F;                                     // 0x0294(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GetUpDash_F_L;                                     // 0x029C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GetUpDash_F_R;                                     // 0x02A4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GetUpDash_F_B;                                     // 0x02AC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GetUpDash_B_F;                                     // 0x02B4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GetUpDash_B_L;                                     // 0x02BC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GetUpDash_B_R;                                     // 0x02C4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GetUpDash_B_B;                                     // 0x02CC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Action_GetUpDash(int32 EntryPoint);
	void OnReset();
	void OnStopByMe(class ULActBase* StoppingAction);
	void OnStart();
	void OnStop(class ULActBase* ReasonAction, class FName Reason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Action_GetUpDash_C">();
	}
	static class UBP_Action_GetUpDash_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_GetUpDash_C>();
	}
};
static_assert(alignof(UBP_Action_GetUpDash_C) == 0x000008, "Wrong alignment on UBP_Action_GetUpDash_C");
static_assert(sizeof(UBP_Action_GetUpDash_C) == 0x0002D8, "Wrong size on UBP_Action_GetUpDash_C");
static_assert(offsetof(UBP_Action_GetUpDash_C, UberGraphFrame) == 0x000258, "Member 'UBP_Action_GetUpDash_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Action_GetUpDash_C, RootMotionScalingHandle_Freeze) == 0x000260, "Member 'UBP_Action_GetUpDash_C::RootMotionScalingHandle_Freeze' has a wrong offset!");
static_assert(offsetof(UBP_Action_GetUpDash_C, TfModifierHandle_SideMove) == 0x000264, "Member 'UBP_Action_GetUpDash_C::TfModifierHandle_SideMove' has a wrong offset!");
static_assert(offsetof(UBP_Action_GetUpDash_C, Cached_LeverAngle) == 0x000268, "Member 'UBP_Action_GetUpDash_C::Cached_LeverAngle' has a wrong offset!");
static_assert(offsetof(UBP_Action_GetUpDash_C, Cached_Lever) == 0x00026C, "Member 'UBP_Action_GetUpDash_C::Cached_Lever' has a wrong offset!");
static_assert(offsetof(UBP_Action_GetUpDash_C, Option_RotationTime) == 0x000278, "Member 'UBP_Action_GetUpDash_C::Option_RotationTime' has a wrong offset!");
static_assert(offsetof(UBP_Action_GetUpDash_C, Temp_StartLocation) == 0x00027C, "Member 'UBP_Action_GetUpDash_C::Temp_StartLocation' has a wrong offset!");
static_assert(offsetof(UBP_Action_GetUpDash_C, Cached_PrevHitMotionAnim) == 0x000288, "Member 'UBP_Action_GetUpDash_C::Cached_PrevHitMotionAnim' has a wrong offset!");
static_assert(offsetof(UBP_Action_GetUpDash_C, Cached_Hit_Motion_Type) == 0x000290, "Member 'UBP_Action_GetUpDash_C::Cached_Hit_Motion_Type' has a wrong offset!");
static_assert(offsetof(UBP_Action_GetUpDash_C, Cached_Selected_Hit_Motion_Direction) == 0x000291, "Member 'UBP_Action_GetUpDash_C::Cached_Selected_Hit_Motion_Direction' has a wrong offset!");
static_assert(offsetof(UBP_Action_GetUpDash_C, Cached_LeverZero) == 0x000292, "Member 'UBP_Action_GetUpDash_C::Cached_LeverZero' has a wrong offset!");
static_assert(offsetof(UBP_Action_GetUpDash_C, GetUpDash_F_F) == 0x000294, "Member 'UBP_Action_GetUpDash_C::GetUpDash_F_F' has a wrong offset!");
static_assert(offsetof(UBP_Action_GetUpDash_C, GetUpDash_F_L) == 0x00029C, "Member 'UBP_Action_GetUpDash_C::GetUpDash_F_L' has a wrong offset!");
static_assert(offsetof(UBP_Action_GetUpDash_C, GetUpDash_F_R) == 0x0002A4, "Member 'UBP_Action_GetUpDash_C::GetUpDash_F_R' has a wrong offset!");
static_assert(offsetof(UBP_Action_GetUpDash_C, GetUpDash_F_B) == 0x0002AC, "Member 'UBP_Action_GetUpDash_C::GetUpDash_F_B' has a wrong offset!");
static_assert(offsetof(UBP_Action_GetUpDash_C, GetUpDash_B_F) == 0x0002B4, "Member 'UBP_Action_GetUpDash_C::GetUpDash_B_F' has a wrong offset!");
static_assert(offsetof(UBP_Action_GetUpDash_C, GetUpDash_B_L) == 0x0002BC, "Member 'UBP_Action_GetUpDash_C::GetUpDash_B_L' has a wrong offset!");
static_assert(offsetof(UBP_Action_GetUpDash_C, GetUpDash_B_R) == 0x0002C4, "Member 'UBP_Action_GetUpDash_C::GetUpDash_B_R' has a wrong offset!");
static_assert(offsetof(UBP_Action_GetUpDash_C, GetUpDash_B_B) == 0x0002CC, "Member 'UBP_Action_GetUpDash_C::GetUpDash_B_B' has a wrong offset!");

}

