#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Sprint_Exhausted

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_Sprint_Exhausted.BP_Action_Sprint_Exhausted_C.ExecuteUbergraph_BP_Action_Sprint_Exhausted
// 0x00C8 (0x00C8 - 0x0000)
struct BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_Disable_LockOnRotation_ReturnValue; // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ULActMgrComponent* ActMgrComponent, class AActor* TargetActor, class FName Command, const struct FVector& Lever, bool SkipCommandPrerequisitiesCheck)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULCommonConstantValues*                 CallFunc_GetConstantValues_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSprintExhaustTime_ReturnValue;         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionStopReason_UnexpectedBehaviour_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_ApplyInput_ReturnValue;       // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_AllowInput_Rotation_ReturnValue; // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActMgrComponent*                      K2Node_CustomEvent_ActMgrComponent;                // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_TargetActor;                    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Command;                        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Lever;                          // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SkipCommandPrerequisitiesCheck; // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Stop_ReturnValue_1;                       // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Stop_ReturnValue_2;                       // 0x00A7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoIdleMove_ReturnValue;                   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_LockCancelMove_ReturnValue;   // 0x00AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_InputCommand_StopSprint_ReturnValue;      // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BE[0x2];                                       // 0x00BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_AllowInput_Movement_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted) == 0x000008, "Wrong alignment on BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted");
static_assert(sizeof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted) == 0x0000C8, "Wrong size on BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, EntryPoint) == 0x000000, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, CallFunc_ActionState_Disable_LockOnRotation_ReturnValue) == 0x000004, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::CallFunc_ActionState_Disable_LockOnRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, K2Node_Event_ReasonAction) == 0x000038, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, K2Node_Event_Reason) == 0x000040, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, CallFunc_GetConstantValues_ReturnValue) == 0x000048, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::CallFunc_GetConstantValues_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, CallFunc_GetSprintExhaustTime_ReturnValue) == 0x000050, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::CallFunc_GetSprintExhaustTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000054, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, CallFunc_Divide_IntInt_ReturnValue) == 0x000058, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00005C, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, CallFunc_ActionStopReason_UnexpectedBehaviour_ReturnValue) == 0x000060, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::CallFunc_ActionStopReason_UnexpectedBehaviour_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, CallFunc_Stop_ReturnValue) == 0x000068, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, CallFunc_ActionState_ApplyInput_ReturnValue) == 0x00006C, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::CallFunc_ActionState_ApplyInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, CallFunc_ActionState_AllowInput_Rotation_ReturnValue) == 0x000074, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::CallFunc_ActionState_AllowInput_Rotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, K2Node_CustomEvent_ActMgrComponent) == 0x000080, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::K2Node_CustomEvent_ActMgrComponent' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, K2Node_CustomEvent_TargetActor) == 0x000088, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::K2Node_CustomEvent_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, K2Node_CustomEvent_Command) == 0x000090, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::K2Node_CustomEvent_Command' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, K2Node_CustomEvent_Lever) == 0x000098, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::K2Node_CustomEvent_Lever' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, K2Node_CustomEvent_SkipCommandPrerequisitiesCheck) == 0x0000A4, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::K2Node_CustomEvent_SkipCommandPrerequisitiesCheck' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, CallFunc_Stop_ReturnValue_1) == 0x0000A5, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::CallFunc_Stop_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000A6, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, CallFunc_Stop_ReturnValue_2) == 0x0000A7, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::CallFunc_Stop_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, CallFunc_DoIdleMove_ReturnValue) == 0x0000A8, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::CallFunc_DoIdleMove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, CallFunc_ActionState_LockCancelMove_ReturnValue) == 0x0000AC, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::CallFunc_ActionState_LockCancelMove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, CallFunc_InputCommand_StopSprint_ReturnValue) == 0x0000B4, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::CallFunc_InputCommand_StopSprint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000BC, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, CallFunc_BooleanAND_ReturnValue) == 0x0000BD, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted, CallFunc_ActionState_AllowInput_Movement_ReturnValue) == 0x0000C0, "Member 'BP_Action_Sprint_Exhausted_C_ExecuteUbergraph_BP_Action_Sprint_Exhausted::CallFunc_ActionState_AllowInput_Movement_ReturnValue' has a wrong offset!");

// Function BP_Action_Sprint_Exhausted.BP_Action_Sprint_Exhausted_C.OnCommandOccured
// 0x0028 (0x0028 - 0x0000)
struct BP_Action_Sprint_Exhausted_C_OnCommandOccured final
{
public:
	class ULActMgrComponent*                      ActMgrComponent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Command;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Lever;                                             // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipCommandPrerequisitiesCheck;                    // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_Sprint_Exhausted_C_OnCommandOccured) == 0x000008, "Wrong alignment on BP_Action_Sprint_Exhausted_C_OnCommandOccured");
static_assert(sizeof(BP_Action_Sprint_Exhausted_C_OnCommandOccured) == 0x000028, "Wrong size on BP_Action_Sprint_Exhausted_C_OnCommandOccured");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_OnCommandOccured, ActMgrComponent) == 0x000000, "Member 'BP_Action_Sprint_Exhausted_C_OnCommandOccured::ActMgrComponent' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_OnCommandOccured, TargetActor) == 0x000008, "Member 'BP_Action_Sprint_Exhausted_C_OnCommandOccured::TargetActor' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_OnCommandOccured, Command) == 0x000010, "Member 'BP_Action_Sprint_Exhausted_C_OnCommandOccured::Command' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_OnCommandOccured, Lever) == 0x000018, "Member 'BP_Action_Sprint_Exhausted_C_OnCommandOccured::Lever' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_OnCommandOccured, SkipCommandPrerequisitiesCheck) == 0x000024, "Member 'BP_Action_Sprint_Exhausted_C_OnCommandOccured::SkipCommandPrerequisitiesCheck' has a wrong offset!");

// Function BP_Action_Sprint_Exhausted.BP_Action_Sprint_Exhausted_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_Sprint_Exhausted_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Sprint_Exhausted_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_Sprint_Exhausted_C_OnStop");
static_assert(sizeof(BP_Action_Sprint_Exhausted_C_OnStop) == 0x000010, "Wrong size on BP_Action_Sprint_Exhausted_C_OnStop");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_Sprint_Exhausted_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Sprint_Exhausted_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_Sprint_Exhausted_C_OnStop::Reason' has a wrong offset!");

}

