#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_GuardEx_Counter

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_Action_SlaveArm_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_GuardEx_Counter.BP_Action_GuardEx_Counter_C
// 0x0018 (0x02A8 - 0x0290)
class UBP_Action_GuardEx_Counter_C final : public UBP_Action_SlaveArm_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Action_GuardEx_Counter_C;        // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   FrenzySkill;                                       // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OnGuardAttack;                                     // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ParryOn;                                           // 0x02A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ExCounter;                                         // 0x02A2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Action_GuardEx_Counter(int32 EntryPoint);
	void OnCommandOccurred_Event(class ULActMgrComponent* ActMgrComponent, class AActor* TargetActor, class FName Command, const struct FVector& Lever, bool SkipCommandPrerequisitiesCheck);
	void OnCurrMontageEnded(class UAnimMontage* Montage, bool bInterrupted, int32 MontageInstanceID);
	void OnCurrMontageBlendOutStarted(class UAnimMontage* Montage, bool bInterrupted, int32 MontageInstanceID);
	void OnStop(class ULActBase* ReasonAction, class FName Reason);
	void OnStart();
	void SetReinforcedVariableValue(class FName VariableName, class FName Value);
	void ClearReinforcedVariableValues();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Action_GuardEx_Counter_C">();
	}
	static class UBP_Action_GuardEx_Counter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Action_GuardEx_Counter_C>();
	}
};
static_assert(alignof(UBP_Action_GuardEx_Counter_C) == 0x000008, "Wrong alignment on UBP_Action_GuardEx_Counter_C");
static_assert(sizeof(UBP_Action_GuardEx_Counter_C) == 0x0002A8, "Wrong size on UBP_Action_GuardEx_Counter_C");
static_assert(offsetof(UBP_Action_GuardEx_Counter_C, UberGraphFrame_BP_Action_GuardEx_Counter_C) == 0x000290, "Member 'UBP_Action_GuardEx_Counter_C::UberGraphFrame_BP_Action_GuardEx_Counter_C' has a wrong offset!");
static_assert(offsetof(UBP_Action_GuardEx_Counter_C, FrenzySkill) == 0x000298, "Member 'UBP_Action_GuardEx_Counter_C::FrenzySkill' has a wrong offset!");
static_assert(offsetof(UBP_Action_GuardEx_Counter_C, OnGuardAttack) == 0x0002A0, "Member 'UBP_Action_GuardEx_Counter_C::OnGuardAttack' has a wrong offset!");
static_assert(offsetof(UBP_Action_GuardEx_Counter_C, ParryOn) == 0x0002A1, "Member 'UBP_Action_GuardEx_Counter_C::ParryOn' has a wrong offset!");
static_assert(offsetof(UBP_Action_GuardEx_Counter_C, ExCounter) == 0x0002A2, "Member 'UBP_Action_GuardEx_Counter_C::ExCounter' has a wrong offset!");

}

