#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_JumpSkill_Victor14

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_Action_JumpSkill_Data_Victor14_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_JumpSkill_Victor14.BP_Action_JumpSkill_Victor14_C.ExecuteUbergraph_BP_Action_JumpSkill_Victor14
// 0x08B0 (0x08B0 - 0x0000)
struct BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Event_Montage_1;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted_1;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MontageInstanceID_1;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayTargetAnimByIndexBP_Branches;         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayTargetAnimByIndexBP_ReturnValue;      // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue; // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_SuperArmor_ReturnValue;       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Zero_ReturnValue;                  // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue_1;                       // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue;        // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        K2Node_MakeArray_Array_1;                          // 0x0130(0x0010)(ReferenceParm)
	EExecutePin                                   CallFunc_CheckObstacleOnPathBP_Branches;           // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_CheckObstacleOnPathBP_ReturnValue;        // 0x0144(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CE[0x2];                                      // 0x01CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0234(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBP_Action_JumpSkill_Data_Victor14     CallFunc_GetDataTableRowFromName_OutRow;           // 0x0250(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27B[0x1];                                      // 0x027B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0288(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0298(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable;                              // 0x02D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRealTimeSeconds_ReturnValue_1;         // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x02E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x02EC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x0374(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0380(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0390(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x039C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x03B0(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x03C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_7;        // 0x03D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DC[0x4];                                      // 0x03DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter;                   // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x3];                                      // 0x03E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_8;        // 0x03EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ChangeCollisionState_ReturnValue;         // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Event_Montage;                              // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupted;                         // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_409[0x3];                                      // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_MontageInstanceID;                    // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCollisionProfileName_ReturnValue;      // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleRadius_ReturnValue;       // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveAnimRootMotionTranslationScale_ReturnValue; // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_422[0x2];                                      // 0x0422(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCollisionProfileName_ReturnValue_1;    // 0x0424(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleRadius_ReturnValue_1;     // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue_1; // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_9;        // 0x0434(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_CapsuleTraceSingleByProfile_OutHit;       // 0x0440(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_CapsuleTraceSingleByProfile_ReturnValue;  // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C9[0x3];                                      // 0x04C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_2;      // 0x04CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x04D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DA[0x2];                                      // 0x04DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x04DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x04E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x04F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x04FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0508(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_514[0x4];                                      // 0x0514(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0528(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x053C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0544(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0550(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x055C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x056C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_3;      // 0x0574(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLGameObjectHandle                     CallFunc_StartTransformModifier_RotateActor_ToYaw_ReturnValue; // 0x0580(0x0004)(NoDestructor)
	uint8                                         Pad_584[0x4];                                      // 0x0584(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array_2;                          // 0x0588(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_10;       // 0x0598(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Zero_ReturnValue_1;                // 0x05A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_CapsuleTraceSingleByProfile_OutHit_1;     // 0x05B0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_CapsuleTraceSingleByProfile_ReturnValue_1; // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_639[0x3];                                      // 0x0639(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x063C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x0649(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64A[0x2];                                      // 0x064A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x064C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x0654(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x0660(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x066C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x0678(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_684[0x4];                                      // 0x0684(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x0698(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x06A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_2;            // 0x06AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x06B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x06B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x06C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_5;           // 0x06CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_6;           // 0x06D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_CapsuleTraceSingleByProfile_OutHit_2;     // 0x06E4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_CapsuleTraceSingleByProfile_ReturnValue_2; // 0x076C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76D[0x3];                                      // 0x076D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTime;                            // 0x0770(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_3;            // 0x0774(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_3;         // 0x0775(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_776[0x2];                                      // 0x0776(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_3;                    // 0x0778(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_3;                // 0x077C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_3;                // 0x0780(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_3;             // 0x078C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_3;                  // 0x0798(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_3;            // 0x07A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_3;                 // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_3;                // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_3;            // 0x07C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_3;             // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_3;                 // 0x07D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_3;            // 0x07D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_3;               // 0x07D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_3;              // 0x07DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_3;                // 0x07E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x07F4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_CustomEvent_MoveDelayTime;                  // 0x087C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0880(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0888(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_889[0x3];                                      // 0x0889(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLGameObjectHandle                     CallFunc_StartTransformModifier_MoveActor_MoveOnly_ReturnValue; // 0x088C(0x0004)(NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0890(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLGameObjectHandle                     CallFunc_AddAnimRootMotionTranslationScale_ReturnValue; // 0x0894(0x0004)(NoDestructor)
	bool                                          CallFunc_Stop_ReturnValue_2;                       // 0x0898(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_899[0x7];                                      // 0x0899(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter_1;                 // 0x08A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x08A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ChangeCollisionState_ReturnValue_1;       // 0x08A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14) == 0x000008, "Wrong alignment on BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14");
static_assert(sizeof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14) == 0x0008B0, "Wrong size on BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, EntryPoint) == 0x000000, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, Temp_float_Variable) == 0x000010, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, Temp_float_Variable_1) == 0x000018, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00001C, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_FClamp_ReturnValue) == 0x000024, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x000028, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, K2Node_MakeArray_Array) == 0x000030, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, K2Node_Event_ReasonAction) == 0x000050, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, K2Node_Event_Reason) == 0x000058, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_BreakVector_X) == 0x000060, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_BreakVector_Y) == 0x000064, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_BreakVector_Z) == 0x000068, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, K2Node_Event_Montage_1) == 0x000070, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::K2Node_Event_Montage_1' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, K2Node_Event_bInterrupted_1) == 0x000078, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::K2Node_Event_bInterrupted_1' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, K2Node_Event_MontageInstanceID_1) == 0x00007C, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::K2Node_Event_MontageInstanceID_1' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_PlayTargetAnimByIndexBP_Branches) == 0x000080, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_PlayTargetAnimByIndexBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_PlayTargetAnimByIndexBP_ReturnValue) == 0x000084, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_PlayTargetAnimByIndexBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, K2Node_SwitchEnum_CmpSuccess) == 0x000088, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue) == 0x00008C, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_Stop_ReturnValue) == 0x000094, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_ActionState_SuperArmor_ReturnValue) == 0x000098, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_ActionState_SuperArmor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_Vector_Zero_ReturnValue) == 0x0000A0, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_Vector_Zero_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_Stop_ReturnValue_1) == 0x0000AC, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_Stop_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000B0, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_NotEqual_VectorVector_ReturnValue) == 0x0000BC, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_NotEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0000C0, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0000CC, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x0000D8, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000E4, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_BreakVector_X_1) == 0x0000F0, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_BreakVector_Y_1) == 0x0000F4, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_BreakVector_Z_1) == 0x0000F8, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000FC, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_Add_FloatFloat_ReturnValue) == 0x000108, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_Add_VectorVector_ReturnValue) == 0x00010C, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_MakeVector_ReturnValue) == 0x000118, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000124, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, K2Node_MakeArray_Array_1) == 0x000130, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_CheckObstacleOnPathBP_Branches) == 0x000140, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_CheckObstacleOnPathBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_CheckObstacleOnPathBP_ReturnValue) == 0x000144, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_CheckObstacleOnPathBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_BreakHitResult_bBlockingHit) == 0x0001CC, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001CD, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_BreakHitResult_Time) == 0x0001D0, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_BreakHitResult_Distance) == 0x0001D4, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_BreakHitResult_Location) == 0x0001D8, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_BreakHitResult_ImpactPoint) == 0x0001E4, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_BreakHitResult_Normal) == 0x0001F0, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_BreakHitResult_ImpactNormal) == 0x0001FC, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_BreakHitResult_PhysMat) == 0x000208, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_BreakHitResult_HitActor) == 0x000210, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_BreakHitResult_HitComponent) == 0x000218, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_BreakHitResult_HitBoneName) == 0x000220, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_BreakHitResult_HitItem) == 0x000228, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_BreakHitResult_ElementIndex) == 0x00022C, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_BreakHitResult_FaceIndex) == 0x000230, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_BreakHitResult_TraceStart) == 0x000234, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_BreakHitResult_TraceEnd) == 0x000240, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_GetDataTableRowFromName_OutRow) == 0x000250, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000278, "Member 'BP_Action_JumpSkill_Victor14_C_ExecuteUbergraph_BP_Action_JumpSkill_Victor14::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
