#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_WireProjectile

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Action_WireProjectile.BP_Action_WireProjectile_C.ExecuteUbergraph_BP_Action_WireProjectile
// 0x0028 (0x0028 - 0x0000)
struct BP_Action_WireProjectile_C_ExecuteUbergraph_BP_Action_WireProjectile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Projectile_Wire_Base_C*             K2Node_CustomEvent_WireProjectile;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_WireProjectile_C_ExecuteUbergraph_BP_Action_WireProjectile) == 0x000008, "Wrong alignment on BP_Action_WireProjectile_C_ExecuteUbergraph_BP_Action_WireProjectile");
static_assert(sizeof(BP_Action_WireProjectile_C_ExecuteUbergraph_BP_Action_WireProjectile) == 0x000028, "Wrong size on BP_Action_WireProjectile_C_ExecuteUbergraph_BP_Action_WireProjectile");
static_assert(offsetof(BP_Action_WireProjectile_C_ExecuteUbergraph_BP_Action_WireProjectile, EntryPoint) == 0x000000, "Member 'BP_Action_WireProjectile_C_ExecuteUbergraph_BP_Action_WireProjectile::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_WireProjectile_C_ExecuteUbergraph_BP_Action_WireProjectile, K2Node_Event_ReasonAction) == 0x000008, "Member 'BP_Action_WireProjectile_C_ExecuteUbergraph_BP_Action_WireProjectile::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_WireProjectile_C_ExecuteUbergraph_BP_Action_WireProjectile, K2Node_Event_Reason) == 0x000010, "Member 'BP_Action_WireProjectile_C_ExecuteUbergraph_BP_Action_WireProjectile::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_WireProjectile_C_ExecuteUbergraph_BP_Action_WireProjectile, K2Node_CustomEvent_WireProjectile) == 0x000018, "Member 'BP_Action_WireProjectile_C_ExecuteUbergraph_BP_Action_WireProjectile::K2Node_CustomEvent_WireProjectile' has a wrong offset!");
static_assert(offsetof(BP_Action_WireProjectile_C_ExecuteUbergraph_BP_Action_WireProjectile, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_Action_WireProjectile_C_ExecuteUbergraph_BP_Action_WireProjectile::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_Action_WireProjectile.BP_Action_WireProjectile_C.OnStartProjectile
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_WireProjectile_C_OnStartProjectile final
{
public:
	class ABP_Projectile_Wire_Base_C*             WireProjectile_0;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_WireProjectile_C_OnStartProjectile) == 0x000008, "Wrong alignment on BP_Action_WireProjectile_C_OnStartProjectile");
static_assert(sizeof(BP_Action_WireProjectile_C_OnStartProjectile) == 0x000008, "Wrong size on BP_Action_WireProjectile_C_OnStartProjectile");
static_assert(offsetof(BP_Action_WireProjectile_C_OnStartProjectile, WireProjectile_0) == 0x000000, "Member 'BP_Action_WireProjectile_C_OnStartProjectile::WireProjectile_0' has a wrong offset!");

// Function BP_Action_WireProjectile.BP_Action_WireProjectile_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_WireProjectile_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_WireProjectile_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_WireProjectile_C_OnStop");
static_assert(sizeof(BP_Action_WireProjectile_C_OnStop) == 0x000010, "Wrong size on BP_Action_WireProjectile_C_OnStop");
static_assert(offsetof(BP_Action_WireProjectile_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_WireProjectile_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_WireProjectile_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_WireProjectile_C_OnStop::Reason' has a wrong offset!");

}

