#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Running_Stop

#include "Basic.hpp"

#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_Running_Stop.BP_Action_Running_Stop_C.ExecuteUbergraph_BP_Action_Running_Stop
// 0x0058 (0x0058 - 0x0000)
struct BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_Ignore_LeverSpeed_ABP_ReturnValue; // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_ApplyInput_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_AllowInput_Movement_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_AllowInput_Rotation_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PlayCommomAnimBP_MontageInstanceID;       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_PlayCommomAnimBP_Montage;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlayCommomAnimBP_Branches;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop) == 0x000008, "Wrong alignment on BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop");
static_assert(sizeof(BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop) == 0x000058, "Wrong size on BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop");
static_assert(offsetof(BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop, EntryPoint) == 0x000000, "Member 'BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop, CallFunc_ActionState_Ignore_LeverSpeed_ABP_ReturnValue) == 0x000004, "Member 'BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop::CallFunc_ActionState_Ignore_LeverSpeed_ABP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop, K2Node_Event_ReasonAction) == 0x000010, "Member 'BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop, K2Node_Event_Reason) == 0x000018, "Member 'BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop, CallFunc_ActionState_ApplyInput_ReturnValue) == 0x000020, "Member 'BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop::CallFunc_ActionState_ApplyInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop, CallFunc_ActionState_AllowInput_Movement_ReturnValue) == 0x000028, "Member 'BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop::CallFunc_ActionState_AllowInput_Movement_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop, CallFunc_ActionState_AllowInput_Rotation_ReturnValue) == 0x000030, "Member 'BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop::CallFunc_ActionState_AllowInput_Rotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop, CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue) == 0x000038, "Member 'BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop::CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop, CallFunc_PlayCommomAnimBP_MontageInstanceID) == 0x000040, "Member 'BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop::CallFunc_PlayCommomAnimBP_MontageInstanceID' has a wrong offset!");
static_assert(offsetof(BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop, CallFunc_PlayCommomAnimBP_Montage) == 0x000048, "Member 'BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop::CallFunc_PlayCommomAnimBP_Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop, CallFunc_PlayCommomAnimBP_Branches) == 0x000050, "Member 'BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop::CallFunc_PlayCommomAnimBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop, CallFunc_Stop_ReturnValue) == 0x000051, "Member 'BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop, K2Node_SwitchEnum_CmpSuccess) == 0x000052, "Member 'BP_Action_Running_Stop_C_ExecuteUbergraph_BP_Action_Running_Stop::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function BP_Action_Running_Stop.BP_Action_Running_Stop_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_Running_Stop_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Running_Stop_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_Running_Stop_C_OnStop");
static_assert(sizeof(BP_Action_Running_Stop_C_OnStop) == 0x000010, "Wrong size on BP_Action_Running_Stop_C_OnStop");
static_assert(offsetof(BP_Action_Running_Stop_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_Running_Stop_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Running_Stop_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_Running_Stop_C_OnStop::Reason' has a wrong offset!");

}

