#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Paralyzation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BP_Action_Paralyzation.BP_Action_Paralyzation_C.ExecuteUbergraph_BP_Action_Paralyzation
// 0x00B0 (0x00B0 - 0x0000)
struct BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateSkillHitReplace_ReturnValue;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CancelLoopAnim_ReturnValue;               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ALNPCCharacter*                         K2Node_DynamicCast_AsLNPCCharacter;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_Immune_Paralyzation_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLGameObjectHandle                     CallFunc_AddActionState_AutoRemove_ReturnValue;    // 0x0030(0x0004)(NoDestructor)
	class FName                                   CallFunc_ActionStopReason_UnexpectedBehaviour_ReturnValue; // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_Paralyzation_ReturnValue;     // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_GetStatComponentBP_Branches;              // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ULStatComponent*                        CallFunc_GetStatComponentBP_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RecoveryMaxStat_ReturnValue;              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RecoveryMaxStat_ReturnValue_1;            // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALNPCCharacter*                         K2Node_DynamicCast_AsLNPCCharacter_1;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CalcParalyzation_MaintainTime_ReturnValue; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetCurrMontageInstanceID_AnimInstance;    // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_GetCurrMontageInstanceID_Branches;        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrMontageInstanceID_ReturnValue;     // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Stop_ReturnValue_1;                       // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_SuperArmor_ReturnValue;       // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PlayHitAnim_ReturnValue;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation) == 0x000008, "Wrong alignment on BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation");
static_assert(sizeof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation) == 0x0000B0, "Wrong size on BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, EntryPoint) == 0x000000, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, CallFunc_UpdateSkillHitReplace_ReturnValue) == 0x000004, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::CallFunc_UpdateSkillHitReplace_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, CallFunc_CancelLoopAnim_ReturnValue) == 0x000006, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::CallFunc_CancelLoopAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, K2Node_DynamicCast_AsLNPCCharacter) == 0x000008, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::K2Node_DynamicCast_AsLNPCCharacter' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, K2Node_Event_ReasonAction) == 0x000018, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, K2Node_Event_Reason) == 0x000020, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, CallFunc_ActionState_Immune_Paralyzation_ReturnValue) == 0x000028, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::CallFunc_ActionState_Immune_Paralyzation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, CallFunc_AddActionState_AutoRemove_ReturnValue) == 0x000030, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::CallFunc_AddActionState_AutoRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, CallFunc_ActionStopReason_UnexpectedBehaviour_ReturnValue) == 0x000034, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::CallFunc_ActionStopReason_UnexpectedBehaviour_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, CallFunc_ActionState_Paralyzation_ReturnValue) == 0x00003C, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::CallFunc_ActionState_Paralyzation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, CallFunc_Stop_ReturnValue) == 0x000044, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, CallFunc_GetStatComponentBP_Branches) == 0x000045, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::CallFunc_GetStatComponentBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, CallFunc_GetStatComponentBP_ReturnValue) == 0x000048, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::CallFunc_GetStatComponentBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, CallFunc_RecoveryMaxStat_ReturnValue) == 0x000050, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::CallFunc_RecoveryMaxStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, CallFunc_RecoveryMaxStat_ReturnValue_1) == 0x000051, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::CallFunc_RecoveryMaxStat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, K2Node_SwitchEnum_CmpSuccess) == 0x000052, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, K2Node_SwitchEnum_CmpSuccess_1) == 0x000053, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, K2Node_DynamicCast_AsLNPCCharacter_1) == 0x000058, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::K2Node_DynamicCast_AsLNPCCharacter_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, CallFunc_CalcParalyzation_MaintainTime_ReturnValue) == 0x000064, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::CallFunc_CalcParalyzation_MaintainTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, CallFunc_FMax_ReturnValue) == 0x000068, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, CallFunc_GetCurrMontageInstanceID_AnimInstance) == 0x000070, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::CallFunc_GetCurrMontageInstanceID_AnimInstance' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, CallFunc_GetCurrMontageInstanceID_Branches) == 0x000078, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::CallFunc_GetCurrMontageInstanceID_Branches' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, CallFunc_GetCurrMontageInstanceID_ReturnValue) == 0x00007C, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::CallFunc_GetCurrMontageInstanceID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue) == 0x000080, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, K2Node_SwitchEnum_CmpSuccess_2) == 0x000088, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, CallFunc_Stop_ReturnValue_1) == 0x000089, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::CallFunc_Stop_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, CallFunc_NotEqual_NameName_ReturnValue) == 0x00008A, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, CallFunc_ActionState_SuperArmor_ReturnValue) == 0x00008C, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::CallFunc_ActionState_SuperArmor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, K2Node_CreateDelegate_OutputDelegate) == 0x000094, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, CallFunc_PlayHitAnim_ReturnValue) == 0x0000A4, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::CallFunc_PlayHitAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000A8, "Member 'BP_Action_Paralyzation_C_ExecuteUbergraph_BP_Action_Paralyzation::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function BP_Action_Paralyzation.BP_Action_Paralyzation_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Action_Paralyzation_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Paralyzation_C_OnStop) == 0x000008, "Wrong alignment on BP_Action_Paralyzation_C_OnStop");
static_assert(sizeof(BP_Action_Paralyzation_C_OnStop) == 0x000010, "Wrong size on BP_Action_Paralyzation_C_OnStop");
static_assert(offsetof(BP_Action_Paralyzation_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Action_Paralyzation_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Action_Paralyzation_C_OnStop, Reason) == 0x000008, "Member 'BP_Action_Paralyzation_C_OnStop::Reason' has a wrong offset!");

}

