#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_SlaveArm_PileBunker

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Action_SlaveArm_PileBunker.BP_Action_SlaveArm_PileBunker_C.ExecuteUbergraph_BP_Action_SlaveArm_PileBunker
// 0x0028 (0x0028 - 0x0000)
struct BP_Action_SlaveArm_PileBunker_C_ExecuteUbergraph_BP_Action_SlaveArm_PileBunker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInst_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_NextSection;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetCurrentActiveMontage_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Action_SlaveArm_PileBunker_C_ExecuteUbergraph_BP_Action_SlaveArm_PileBunker) == 0x000008, "Wrong alignment on BP_Action_SlaveArm_PileBunker_C_ExecuteUbergraph_BP_Action_SlaveArm_PileBunker");
static_assert(sizeof(BP_Action_SlaveArm_PileBunker_C_ExecuteUbergraph_BP_Action_SlaveArm_PileBunker) == 0x000028, "Wrong size on BP_Action_SlaveArm_PileBunker_C_ExecuteUbergraph_BP_Action_SlaveArm_PileBunker");
static_assert(offsetof(BP_Action_SlaveArm_PileBunker_C_ExecuteUbergraph_BP_Action_SlaveArm_PileBunker, EntryPoint) == 0x000000, "Member 'BP_Action_SlaveArm_PileBunker_C_ExecuteUbergraph_BP_Action_SlaveArm_PileBunker::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_PileBunker_C_ExecuteUbergraph_BP_Action_SlaveArm_PileBunker, CallFunc_GetAnimInst_ReturnValue) == 0x000008, "Member 'BP_Action_SlaveArm_PileBunker_C_ExecuteUbergraph_BP_Action_SlaveArm_PileBunker::CallFunc_GetAnimInst_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_PileBunker_C_ExecuteUbergraph_BP_Action_SlaveArm_PileBunker, K2Node_Event_NextSection) == 0x000010, "Member 'BP_Action_SlaveArm_PileBunker_C_ExecuteUbergraph_BP_Action_SlaveArm_PileBunker::K2Node_Event_NextSection' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_PileBunker_C_ExecuteUbergraph_BP_Action_SlaveArm_PileBunker, CallFunc_GetCurrentActiveMontage_ReturnValue) == 0x000018, "Member 'BP_Action_SlaveArm_PileBunker_C_ExecuteUbergraph_BP_Action_SlaveArm_PileBunker::CallFunc_GetCurrentActiveMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_PileBunker_C_ExecuteUbergraph_BP_Action_SlaveArm_PileBunker, CallFunc_Stop_ReturnValue) == 0x000020, "Member 'BP_Action_SlaveArm_PileBunker_C_ExecuteUbergraph_BP_Action_SlaveArm_PileBunker::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_SlaveArm_PileBunker_C_ExecuteUbergraph_BP_Action_SlaveArm_PileBunker, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000021, "Member 'BP_Action_SlaveArm_PileBunker_C_ExecuteUbergraph_BP_Action_SlaveArm_PileBunker::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Action_SlaveArm_PileBunker.BP_Action_SlaveArm_PileBunker_C.JumpToNextSection
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_SlaveArm_PileBunker_C_JumpToNextSection final
{
public:
	class FName                                   NextSection;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_SlaveArm_PileBunker_C_JumpToNextSection) == 0x000004, "Wrong alignment on BP_Action_SlaveArm_PileBunker_C_JumpToNextSection");
static_assert(sizeof(BP_Action_SlaveArm_PileBunker_C_JumpToNextSection) == 0x000008, "Wrong size on BP_Action_SlaveArm_PileBunker_C_JumpToNextSection");
static_assert(offsetof(BP_Action_SlaveArm_PileBunker_C_JumpToNextSection, NextSection) == 0x000000, "Member 'BP_Action_SlaveArm_PileBunker_C_JumpToNextSection::NextSection' has a wrong offset!");

}

