#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Action_Guard_Break_0

#include "Basic.hpp"

#include "BP_Action_HitBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Action_Guard_Break.BP_Action_Guard_Break_C
// 0x0030 (0x0450 - 0x0420)
class BP_Action_Guard_Break_0::UBP_Action_Guard_Break_C final : public UBP_Action_HitBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Action_Guard_Break_C;            // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimMontage*                           GuardAnim;                                         // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Guard_L;                                           // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Guard_R;                                           // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGuardRotation;                                   // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsGuardBreak;                                      // 0x0441(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_442[0x2];                                      // 0x0442(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CommonAnim_Guard_Break;                            // 0x0444(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Action_Guard_Break(int32 EntryPoint);
	void OnCurrMontageEnded(class UAnimMontage* Montage, bool bInterrupted, int32 MontageInstanceID);
	void OnStart();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BlueprintGeneratedClass BP_Action_Guard_Break.BP_Action_Guard_Break_C", true, "BP_Action_Guard_Break_C">();
	}
	static class BP_Action_Guard_Break_0::UBP_Action_Guard_Break_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<BP_Action_Guard_Break_0::UBP_Action_Guard_Break_C>();
	}
};
static_assert(alignof(BP_Action_Guard_Break_0::UBP_Action_Guard_Break_C) == 0x000008, "Wrong alignment on BP_Action_Guard_Break_0::UBP_Action_Guard_Break_C");
static_assert(sizeof(BP_Action_Guard_Break_0::UBP_Action_Guard_Break_C) == 0x000450, "Wrong size on BP_Action_Guard_Break_0::UBP_Action_Guard_Break_C");
static_assert(offsetof(BP_Action_Guard_Break_0::UBP_Action_Guard_Break_C, UberGraphFrame_BP_Action_Guard_Break_C) == 0x000420, "Member 'BP_Action_Guard_Break_0::UBP_Action_Guard_Break_C::UberGraphFrame_BP_Action_Guard_Break_C' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Break_0::UBP_Action_Guard_Break_C, GuardAnim) == 0x000428, "Member 'BP_Action_Guard_Break_0::UBP_Action_Guard_Break_C::GuardAnim' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Break_0::UBP_Action_Guard_Break_C, Guard_L) == 0x000430, "Member 'BP_Action_Guard_Break_0::UBP_Action_Guard_Break_C::Guard_L' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Break_0::UBP_Action_Guard_Break_C, Guard_R) == 0x000438, "Member 'BP_Action_Guard_Break_0::UBP_Action_Guard_Break_C::Guard_R' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Break_0::UBP_Action_Guard_Break_C, IsGuardRotation) == 0x000440, "Member 'BP_Action_Guard_Break_0::UBP_Action_Guard_Break_C::IsGuardRotation' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Break_0::UBP_Action_Guard_Break_C, IsGuardBreak) == 0x000441, "Member 'BP_Action_Guard_Break_0::UBP_Action_Guard_Break_C::IsGuardBreak' has a wrong offset!");
static_assert(offsetof(BP_Action_Guard_Break_0::UBP_Action_Guard_Break_C, CommonAnim_Guard_Break) == 0x000444, "Member 'BP_Action_Guard_Break_0::UBP_Action_Guard_Break_C::CommonAnim_Guard_Break' has a wrong offset!");

}

