#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Buttler_Melee_White

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "LNPCCharacterBP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Buttler_Melee_White.BP_Buttler_Melee_White_C
// 0x0010 (0x14D0 - 0x14C0)
class ABP_Buttler_Melee_White_C final : public ALNPCCharacterBP_C
{
public:
	uint8                                         Pad_14B5[0x3];                                     // 0x14B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Buttler_Melee_White_C;           // 0x14B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ULCharacterBlockCapsuleComponent*       LCharacterBlockCapsule_Body;                       // 0x14C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Is4WayHit_0;                                       // 0x14C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_Buttler_Melee_White(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Buttler_Melee_White_C">();
	}
	static class ABP_Buttler_Melee_White_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Buttler_Melee_White_C>();
	}
};
static_assert(alignof(ABP_Buttler_Melee_White_C) == 0x000010, "Wrong alignment on ABP_Buttler_Melee_White_C");
static_assert(sizeof(ABP_Buttler_Melee_White_C) == 0x0014D0, "Wrong size on ABP_Buttler_Melee_White_C");
static_assert(offsetof(ABP_Buttler_Melee_White_C, UberGraphFrame_BP_Buttler_Melee_White_C) == 0x0014B8, "Member 'ABP_Buttler_Melee_White_C::UberGraphFrame_BP_Buttler_Melee_White_C' has a wrong offset!");
static_assert(offsetof(ABP_Buttler_Melee_White_C, LCharacterBlockCapsule_Body) == 0x0014C0, "Member 'ABP_Buttler_Melee_White_C::LCharacterBlockCapsule_Body' has a wrong offset!");
static_assert(offsetof(ABP_Buttler_Melee_White_C, Is4WayHit_0) == 0x0014C8, "Member 'ABP_Buttler_Melee_White_C::Is4WayHit_0' has a wrong offset!");

}

