#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CounterThrust

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CounterThrust.BP_CounterThrust_C.ExecuteUbergraph_BP_CounterThrust
// 0x0038 (0x0038 - 0x0000)
struct BP_CounterThrust_C_ExecuteUbergraph_BP_CounterThrust final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter_1;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CounterThrust_C_ExecuteUbergraph_BP_CounterThrust) == 0x000008, "Wrong alignment on BP_CounterThrust_C_ExecuteUbergraph_BP_CounterThrust");
static_assert(sizeof(BP_CounterThrust_C_ExecuteUbergraph_BP_CounterThrust) == 0x000038, "Wrong size on BP_CounterThrust_C_ExecuteUbergraph_BP_CounterThrust");
static_assert(offsetof(BP_CounterThrust_C_ExecuteUbergraph_BP_CounterThrust, EntryPoint) == 0x000000, "Member 'BP_CounterThrust_C_ExecuteUbergraph_BP_CounterThrust::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CounterThrust_C_ExecuteUbergraph_BP_CounterThrust, K2Node_Event_ReasonAction) == 0x000008, "Member 'BP_CounterThrust_C_ExecuteUbergraph_BP_CounterThrust::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_CounterThrust_C_ExecuteUbergraph_BP_CounterThrust, K2Node_Event_Reason) == 0x000010, "Member 'BP_CounterThrust_C_ExecuteUbergraph_BP_CounterThrust::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_CounterThrust_C_ExecuteUbergraph_BP_CounterThrust, K2Node_DynamicCast_AsLCharacter) == 0x000018, "Member 'BP_CounterThrust_C_ExecuteUbergraph_BP_CounterThrust::K2Node_DynamicCast_AsLCharacter' has a wrong offset!");
static_assert(offsetof(BP_CounterThrust_C_ExecuteUbergraph_BP_CounterThrust, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_CounterThrust_C_ExecuteUbergraph_BP_CounterThrust::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CounterThrust_C_ExecuteUbergraph_BP_CounterThrust, K2Node_DynamicCast_AsLCharacter_1) == 0x000028, "Member 'BP_CounterThrust_C_ExecuteUbergraph_BP_CounterThrust::K2Node_DynamicCast_AsLCharacter_1' has a wrong offset!");
static_assert(offsetof(BP_CounterThrust_C_ExecuteUbergraph_BP_CounterThrust, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_CounterThrust_C_ExecuteUbergraph_BP_CounterThrust::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CounterThrust_C_ExecuteUbergraph_BP_CounterThrust, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'BP_CounterThrust_C_ExecuteUbergraph_BP_CounterThrust::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CounterThrust_C_ExecuteUbergraph_BP_CounterThrust, CallFunc_IsValid_ReturnValue_1) == 0x000032, "Member 'BP_CounterThrust_C_ExecuteUbergraph_BP_CounterThrust::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_CounterThrust.BP_CounterThrust_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_CounterThrust_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CounterThrust_C_OnStop) == 0x000008, "Wrong alignment on BP_CounterThrust_C_OnStop");
static_assert(sizeof(BP_CounterThrust_C_OnStop) == 0x000010, "Wrong size on BP_CounterThrust_C_OnStop");
static_assert(offsetof(BP_CounterThrust_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_CounterThrust_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_CounterThrust_C_OnStop, Reason) == 0x000008, "Member 'BP_CounterThrust_C_OnStop::Reason' has a wrong offset!");

}

