#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Chakram_BLD_Test_Exile

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Chakram_BLD_Test_Exile.BP_Chakram_BLD_Test_Exile_C
// 0x0018 (0x0270 - 0x0258)
class UBP_Chakram_BLD_Test_Exile_C final : public ULAction_LoopAnim
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_Projectile_Chakram_C*               SpawnedChakramProjectilePtr;                       // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CachedWeaponOnFlag;                                // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Chakram_BLD_Test_Exile(int32 EntryPoint);
	void OnChakramReturned();
	void OnStop(class ULActBase* ReasonAction, class FName Reason);
	void OnStart();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Chakram_BLD_Test_Exile_C">();
	}
	static class UBP_Chakram_BLD_Test_Exile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Chakram_BLD_Test_Exile_C>();
	}
};
static_assert(alignof(UBP_Chakram_BLD_Test_Exile_C) == 0x000008, "Wrong alignment on UBP_Chakram_BLD_Test_Exile_C");
static_assert(sizeof(UBP_Chakram_BLD_Test_Exile_C) == 0x000270, "Wrong size on UBP_Chakram_BLD_Test_Exile_C");
static_assert(offsetof(UBP_Chakram_BLD_Test_Exile_C, UberGraphFrame) == 0x000258, "Member 'UBP_Chakram_BLD_Test_Exile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Chakram_BLD_Test_Exile_C, SpawnedChakramProjectilePtr) == 0x000260, "Member 'UBP_Chakram_BLD_Test_Exile_C::SpawnedChakramProjectilePtr' has a wrong offset!");
static_assert(offsetof(UBP_Chakram_BLD_Test_Exile_C, CachedWeaponOnFlag) == 0x000268, "Member 'UBP_Chakram_BLD_Test_Exile_C::CachedWeaponOnFlag' has a wrong offset!");

}

