#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Chakram_BLD_Test_Exile

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Chakram_BLD_Test_Exile.BP_Chakram_BLD_Test_Exile_C.ExecuteUbergraph_BP_Chakram_BLD_Test_Exile
// 0x0090 (0x0090 - 0x0000)
struct BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULLockOnSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetLockOnTargetActor_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInst_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetCurrentActiveMontage_ReturnValue;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile) == 0x000008, "Wrong alignment on BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile");
static_assert(sizeof(BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile) == 0x000090, "Wrong size on BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile");
static_assert(offsetof(BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile, EntryPoint) == 0x000000, "Member 'BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile, CallFunc_GetLockOnTargetActor_ReturnValue) == 0x000010, "Member 'BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile::CallFunc_GetLockOnTargetActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00001C, "Member 'BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile, K2Node_Event_ReasonAction) == 0x000028, "Member 'BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile, K2Node_Event_Reason) == 0x000030, "Member 'BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile, CallFunc_GetAnimInst_ReturnValue) == 0x000040, "Member 'BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile::CallFunc_GetAnimInst_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile, CallFunc_IsValid_ReturnValue_2) == 0x000048, "Member 'BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile, CallFunc_GetCurrentActiveMontage_ReturnValue) == 0x000050, "Member 'BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile::CallFunc_GetCurrentActiveMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile, CallFunc_IsValid_ReturnValue_3) == 0x000058, "Member 'BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00005C, "Member 'BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile, CallFunc_FindLookAtRotation_ReturnValue) == 0x000068, "Member 'BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile, CallFunc_BreakRotator_Roll) == 0x000074, "Member 'BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile, CallFunc_BreakRotator_Pitch) == 0x000078, "Member 'BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile, CallFunc_BreakRotator_Yaw) == 0x00007C, "Member 'BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile, CallFunc_MakeRotator_ReturnValue) == 0x000080, "Member 'BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile, CallFunc_K2_SetActorRotation_ReturnValue) == 0x00008C, "Member 'BP_Chakram_BLD_Test_Exile_C_ExecuteUbergraph_BP_Chakram_BLD_Test_Exile::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");

// Function BP_Chakram_BLD_Test_Exile.BP_Chakram_BLD_Test_Exile_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Chakram_BLD_Test_Exile_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Chakram_BLD_Test_Exile_C_OnStop) == 0x000008, "Wrong alignment on BP_Chakram_BLD_Test_Exile_C_OnStop");
static_assert(sizeof(BP_Chakram_BLD_Test_Exile_C_OnStop) == 0x000010, "Wrong size on BP_Chakram_BLD_Test_Exile_C_OnStop");
static_assert(offsetof(BP_Chakram_BLD_Test_Exile_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Chakram_BLD_Test_Exile_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Chakram_BLD_Test_Exile_C_OnStop, Reason) == 0x000008, "Member 'BP_Chakram_BLD_Test_Exile_C_OnStop::Reason' has a wrong offset!");

}

