#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DoorLock_CameraBlocking

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DoorLock_CameraBlocking.BP_DoorLock_CameraBlocking_C
// 0x0018 (0x01F8 - 0x01E0)
class ABP_DoorLock_CameraBlocking_C final : public AActor
{
public:
	class UBoxComponent*                          Box;                                               // 0x01E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x01E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x01F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DoorLock_CameraBlocking_C">();
	}
	static class ABP_DoorLock_CameraBlocking_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DoorLock_CameraBlocking_C>();
	}
};
static_assert(alignof(ABP_DoorLock_CameraBlocking_C) == 0x000008, "Wrong alignment on ABP_DoorLock_CameraBlocking_C");
static_assert(sizeof(ABP_DoorLock_CameraBlocking_C) == 0x0001F8, "Wrong size on ABP_DoorLock_CameraBlocking_C");
static_assert(offsetof(ABP_DoorLock_CameraBlocking_C, Box) == 0x0001E0, "Member 'ABP_DoorLock_CameraBlocking_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_DoorLock_CameraBlocking_C, Arrow) == 0x0001E8, "Member 'ABP_DoorLock_CameraBlocking_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_DoorLock_CameraBlocking_C, DefaultSceneRoot) == 0x0001F0, "Member 'ABP_DoorLock_CameraBlocking_C::DefaultSceneRoot' has a wrong offset!");

}

