#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ENV_BP_BlackRabbitSymbol_01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ENV_BP_BlackRabbitSymbol_01.BP_ENV_BP_BlackRabbitSymbol_01_C
// 0x0018 (0x01F8 - 0x01E0)
class ABP_ENV_BP_BlackRabbitSymbol_01_C final : public AActor
{
public:
	class UNiagaraComponent*                      NS_F_Env_Fire_01;                                  // 0x01E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SM_BlackRabbit_Symbol_B;                           // 0x01E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x01F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ENV_BP_BlackRabbitSymbol_01_C">();
	}
	static class ABP_ENV_BP_BlackRabbitSymbol_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ENV_BP_BlackRabbitSymbol_01_C>();
	}
};
static_assert(alignof(ABP_ENV_BP_BlackRabbitSymbol_01_C) == 0x000008, "Wrong alignment on ABP_ENV_BP_BlackRabbitSymbol_01_C");
static_assert(sizeof(ABP_ENV_BP_BlackRabbitSymbol_01_C) == 0x0001F8, "Wrong size on ABP_ENV_BP_BlackRabbitSymbol_01_C");
static_assert(offsetof(ABP_ENV_BP_BlackRabbitSymbol_01_C, NS_F_Env_Fire_01) == 0x0001E0, "Member 'ABP_ENV_BP_BlackRabbitSymbol_01_C::NS_F_Env_Fire_01' has a wrong offset!");
static_assert(offsetof(ABP_ENV_BP_BlackRabbitSymbol_01_C, SM_BlackRabbit_Symbol_B) == 0x0001E8, "Member 'ABP_ENV_BP_BlackRabbitSymbol_01_C::SM_BlackRabbit_Symbol_B' has a wrong offset!");
static_assert(offsetof(ABP_ENV_BP_BlackRabbitSymbol_01_C, DefaultSceneRoot) == 0x0001F0, "Member 'ABP_ENV_BP_BlackRabbitSymbol_01_C::DefaultSceneRoot' has a wrong offset!");

}

