#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EasyFog

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EasyFog.BP_EasyFog_C
// 0x0088 (0x0268 - 0x01E0)
class ABP_EasyFog_C final : public AActor
{
public:
	class UStaticMeshComponent*                   FogCard;                                           // 0x01E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x01E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Pathtracer_Toggle;                                 // 0x01F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               Base_Color_Map;                                    // 0x01F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Opacity_Map;                                       // 0x0200(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               Normal_Map;                                        // 0x0208(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Fog_Material_Instance;                             // 0x0210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Base_Color_Tint;                                   // 0x0218(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         Base_Color_Contrast;                               // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         Base_Color_Intensity;                              // 0x022C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         Emissive_Intensity;                                // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         Normal_Map_Intensity;                              // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         Fog_Density;                                       // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Geometry_Fading_Distance;                          // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         Camera_Fading_Distance;                            // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         No;                                                // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         Wind_Speed_Y;                                      // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         Wind_Speed_X;                                      // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         Wind_Noise_Tiling;                                 // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         Wind_Noise_Contrast;                               // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         View_Angle_Fade;                                   // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          Cast_Shadow_;                                      // 0x025C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Pathtracer_Material;                               // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EasyFog_C">();
	}
	static class ABP_EasyFog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EasyFog_C>();
	}
};
static_assert(alignof(ABP_EasyFog_C) == 0x000008, "Wrong alignment on ABP_EasyFog_C");
static_assert(sizeof(ABP_EasyFog_C) == 0x000268, "Wrong size on ABP_EasyFog_C");
static_assert(offsetof(ABP_EasyFog_C, FogCard) == 0x0001E0, "Member 'ABP_EasyFog_C::FogCard' has a wrong offset!");
static_assert(offsetof(ABP_EasyFog_C, DefaultSceneRoot) == 0x0001E8, "Member 'ABP_EasyFog_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_EasyFog_C, Pathtracer_Toggle) == 0x0001F0, "Member 'ABP_EasyFog_C::Pathtracer_Toggle' has a wrong offset!");
static_assert(offsetof(ABP_EasyFog_C, Base_Color_Map) == 0x0001F8, "Member 'ABP_EasyFog_C::Base_Color_Map' has a wrong offset!");
static_assert(offsetof(ABP_EasyFog_C, Opacity_Map) == 0x000200, "Member 'ABP_EasyFog_C::Opacity_Map' has a wrong offset!");
static_assert(offsetof(ABP_EasyFog_C, Normal_Map) == 0x000208, "Member 'ABP_EasyFog_C::Normal_Map' has a wrong offset!");
static_assert(offsetof(ABP_EasyFog_C, Fog_Material_Instance) == 0x000210, "Member 'ABP_EasyFog_C::Fog_Material_Instance' has a wrong offset!");
static_assert(offsetof(ABP_EasyFog_C, Base_Color_Tint) == 0x000218, "Member 'ABP_EasyFog_C::Base_Color_Tint' has a wrong offset!");
static_assert(offsetof(ABP_EasyFog_C, Base_Color_Contrast) == 0x000228, "Member 'ABP_EasyFog_C::Base_Color_Contrast' has a wrong offset!");
static_assert(offsetof(ABP_EasyFog_C, Base_Color_Intensity) == 0x00022C, "Member 'ABP_EasyFog_C::Base_Color_Intensity' has a wrong offset!");
static_assert(offsetof(ABP_EasyFog_C, Emissive_Intensity) == 0x000230, "Member 'ABP_EasyFog_C::Emissive_Intensity' has a wrong offset!");
static_assert(offsetof(ABP_EasyFog_C, Normal_Map_Intensity) == 0x000234, "Member 'ABP_EasyFog_C::Normal_Map_Intensity' has a wrong offset!");
static_assert(offsetof(ABP_EasyFog_C, Fog_Density) == 0x000238, "Member 'ABP_EasyFog_C::Fog_Density' has a wrong offset!");
static_assert(offsetof(ABP_EasyFog_C, Geometry_Fading_Distance) == 0x00023C, "Member 'ABP_EasyFog_C::Geometry_Fading_Distance' has a wrong offset!");
static_assert(offsetof(ABP_EasyFog_C, Camera_Fading_Distance) == 0x000240, "Member 'ABP_EasyFog_C::Camera_Fading_Distance' has a wrong offset!");
static_assert(offsetof(ABP_EasyFog_C, No) == 0x000244, "Member 'ABP_EasyFog_C::No' has a wrong offset!");
static_assert(offsetof(ABP_EasyFog_C, Wind_Speed_Y) == 0x000248, "Member 'ABP_EasyFog_C::Wind_Speed_Y' has a wrong offset!");
static_assert(offsetof(ABP_EasyFog_C, Wind_Speed_X) == 0x00024C, "Member 'ABP_EasyFog_C::Wind_Speed_X' has a wrong offset!");
static_assert(offsetof(ABP_EasyFog_C, Wind_Noise_Tiling) == 0x000250, "Member 'ABP_EasyFog_C::Wind_Noise_Tiling' has a wrong offset!");
static_assert(offsetof(ABP_EasyFog_C, Wind_Noise_Contrast) == 0x000254, "Member 'ABP_EasyFog_C::Wind_Noise_Contrast' has a wrong offset!");
static_assert(offsetof(ABP_EasyFog_C, View_Angle_Fade) == 0x000258, "Member 'ABP_EasyFog_C::View_Angle_Fade' has a wrong offset!");
static_assert(offsetof(ABP_EasyFog_C, Cast_Shadow_) == 0x00025C, "Member 'ABP_EasyFog_C::Cast_Shadow_' has a wrong offset!");
static_assert(offsetof(ABP_EasyFog_C, Pathtracer_Material) == 0x000260, "Member 'ABP_EasyFog_C::Pathtracer_Material' has a wrong offset!");

}

