#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnvSoundComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EnvSoundComponent.BP_EnvSoundComponent_C
// 0x0020 (0x00D0 - 0x00B0)
class UBP_EnvSoundComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        RainHitSound_1;                                    // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        RainHitSound_2;                                    // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELPhysicalSurfaceType                         CachedRainHitSurface;                              // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAudioComp_1_Active;                              // 0x00C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CachedPCHit;                                       // 0x00CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_EnvSoundComponent(int32 EntryPoint);
	void RemoveRainHitSound();
	void AttachRainHitSound(ELPhysicalSurfaceType InPhysicalSurface, const struct FVector& InWorldLocation, float InRainIntesity, bool InIsPCHit);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EnvSoundComponent_C">();
	}
	static class UBP_EnvSoundComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_EnvSoundComponent_C>();
	}
};
static_assert(alignof(UBP_EnvSoundComponent_C) == 0x000008, "Wrong alignment on UBP_EnvSoundComponent_C");
static_assert(sizeof(UBP_EnvSoundComponent_C) == 0x0000D0, "Wrong size on UBP_EnvSoundComponent_C");
static_assert(offsetof(UBP_EnvSoundComponent_C, UberGraphFrame) == 0x0000B0, "Member 'UBP_EnvSoundComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_EnvSoundComponent_C, RainHitSound_1) == 0x0000B8, "Member 'UBP_EnvSoundComponent_C::RainHitSound_1' has a wrong offset!");
static_assert(offsetof(UBP_EnvSoundComponent_C, RainHitSound_2) == 0x0000C0, "Member 'UBP_EnvSoundComponent_C::RainHitSound_2' has a wrong offset!");
static_assert(offsetof(UBP_EnvSoundComponent_C, CachedRainHitSurface) == 0x0000C8, "Member 'UBP_EnvSoundComponent_C::CachedRainHitSurface' has a wrong offset!");
static_assert(offsetof(UBP_EnvSoundComponent_C, IsAudioComp_1_Active) == 0x0000C9, "Member 'UBP_EnvSoundComponent_C::IsAudioComp_1_Active' has a wrong offset!");
static_assert(offsetof(UBP_EnvSoundComponent_C, CachedPCHit) == 0x0000CA, "Member 'UBP_EnvSoundComponent_C::CachedPCHit' has a wrong offset!");

}

