#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnvSoundComponent

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_EnvSoundComponent.BP_EnvSoundComponent_C.ExecuteUbergraph_BP_EnvSoundComponent
// 0x0128 (0x0128 - 0x0000)
struct BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        K2Node_Select_Default;                             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        K2Node_Select_Default_1;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        K2Node_Select_Default_2;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELPhysicalSurfaceType                         K2Node_CustomEvent_InPhysicalSurface;              // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_InWorldLocation;                // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_InRainIntesity;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InIsPCHit;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_3;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_AttachFollowingEnvSound_ReturnValue;      // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        K2Node_Select_Default_4;                           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        K2Node_Select_Default_5;                           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        K2Node_Select_Default_6;                           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x009C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent) == 0x000008, "Wrong alignment on BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent");
static_assert(sizeof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent) == 0x000128, "Wrong size on BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, EntryPoint) == 0x000000, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, Temp_name_Variable) == 0x000004, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, Temp_bool_Variable) == 0x00000C, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, Temp_bool_Variable_1) == 0x00000D, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, Temp_bool_Variable_2) == 0x00000E, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, K2Node_Select_Default) == 0x000010, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, K2Node_Select_Default_1) == 0x000018, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, Temp_bool_Variable_3) == 0x000022, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, K2Node_Select_Default_2) == 0x000028, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, CallFunc_IsValid_ReturnValue_2) == 0x000030, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, CallFunc_Not_PreBool_ReturnValue) == 0x000031, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, K2Node_CustomEvent_InPhysicalSurface) == 0x000032, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::K2Node_CustomEvent_InPhysicalSurface' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, K2Node_CustomEvent_InWorldLocation) == 0x000034, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::K2Node_CustomEvent_InWorldLocation' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, K2Node_CustomEvent_InRainIntesity) == 0x000040, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::K2Node_CustomEvent_InRainIntesity' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, K2Node_CustomEvent_InIsPCHit) == 0x000044, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::K2Node_CustomEvent_InIsPCHit' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000045, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, CallFunc_GetOwner_ReturnValue) == 0x000048, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, Temp_name_Variable_1) == 0x000050, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000058, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, K2Node_Select_Default_3) == 0x000060, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, Temp_bool_Variable_4) == 0x000068, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, CallFunc_AttachFollowingEnvSound_ReturnValue) == 0x000070, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::CallFunc_AttachFollowingEnvSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, K2Node_Select_Default_4) == 0x000078, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, CallFunc_IsValid_ReturnValue_3) == 0x000080, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000081, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, Temp_bool_Variable_5) == 0x000082, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, CallFunc_BooleanAND_ReturnValue) == 0x000083, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, Temp_bool_Variable_6) == 0x000084, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, K2Node_Select_Default_5) == 0x000088, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, K2Node_Select_Default_6) == 0x000090, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, CallFunc_IsValid_ReturnValue_4) == 0x000098, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, CallFunc_IsValid_ReturnValue_5) == 0x000099, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x00009C, "Member 'BP_EnvSoundComponent_C_ExecuteUbergraph_BP_EnvSoundComponent::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

// Function BP_EnvSoundComponent.BP_EnvSoundComponent_C.AttachRainHitSound
// 0x0018 (0x0018 - 0x0000)
struct BP_EnvSoundComponent_C_AttachRainHitSound final
{
public:
	ELPhysicalSurfaceType                         InPhysicalSurface;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                InWorldLocation;                                   // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InRainIntesity;                                    // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InIsPCHit;                                         // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnvSoundComponent_C_AttachRainHitSound) == 0x000004, "Wrong alignment on BP_EnvSoundComponent_C_AttachRainHitSound");
static_assert(sizeof(BP_EnvSoundComponent_C_AttachRainHitSound) == 0x000018, "Wrong size on BP_EnvSoundComponent_C_AttachRainHitSound");
static_assert(offsetof(BP_EnvSoundComponent_C_AttachRainHitSound, InPhysicalSurface) == 0x000000, "Member 'BP_EnvSoundComponent_C_AttachRainHitSound::InPhysicalSurface' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_AttachRainHitSound, InWorldLocation) == 0x000004, "Member 'BP_EnvSoundComponent_C_AttachRainHitSound::InWorldLocation' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_AttachRainHitSound, InRainIntesity) == 0x000010, "Member 'BP_EnvSoundComponent_C_AttachRainHitSound::InRainIntesity' has a wrong offset!");
static_assert(offsetof(BP_EnvSoundComponent_C_AttachRainHitSound, InIsPCHit) == 0x000014, "Member 'BP_EnvSoundComponent_C_AttachRainHitSound::InIsPCHit' has a wrong offset!");

}

