#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ErogoWall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectP_structs.hpp"
#include "ProjectP_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ErogoWall.BP_ErogoWall_C
// 0x0108 (0x0368 - 0x0260)
class ABP_ErogoWall_C final : public ALFogGateObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Block_Targeting;                                   // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Block_BossTargeting;                               // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio_Idle;                                        // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio_Freeze;                                      // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Trigger_WallResume03;                              // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Trigger_WallResume02;                              // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Trigger_WallResume01;                              // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULPropNavigationComponent*              LPropNavigation;                                   // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Door01;                                            // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Trigger_WallStop;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      OpenEffect;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Door02;                                            // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DoorMesh;                                          // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio_Open;                                        // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio_Disappear;                                   // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio_Close;                                       // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Sound;                                             // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         LineTh______0_B9868DDF4322B893837D2781B9F3E878;    // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            LineTh__Direction_B9868DDF4322B893837D2781B9F3E878; // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     LineTH;                                            // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ErgoWall_Activate______0_3477900A48B101D54787A090186E7959; // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ErgoWall_Activate__Direction_3477900A48B101D54787A090186E7959; // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30D[0x3];                                      // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ErgoWall_Activate;                                 // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ErgoWall_Disolve______0_6C6DFD4848D86B1102C454BE373C4444; // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ErgoWall_Disolve__Direction_6C6DFD4848D86B1102C454BE373C4444; // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ErgoWall_Disolve;                                  // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ErgoWallStop______0_05E919374F5E530E42DB13B7D8527C53; // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ErgoWallStop__Direction_05E919374F5E530E42DB13B7D8527C53; // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ErgoWallStop;                                      // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ErgoWall_Size;                                     // 0x0338(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Check_ErgoWall_Stop;                               // 0x0344(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	ELFogGateState                                Gate_State;                                        // 0x0345(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_346[0x2];                                      // 0x0346(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlockWatchingTime;                                 // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OpenToCloseTime;                                   // 0x034C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OpeningDelay;                                      // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Offset;                                            // 0x0354(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Scale_ErgoCircle;                                  // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ErogoWall(int32 EntryPoint);
	void BndEvt__BP_ErogoWall_Block_Targeting_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ErgoWallActivateBlock();
	void ErgoWallResume();
	void BndEvt__BP_ErogoWall_Trigger_WallResume03_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_ErogoWall_Trigger_WallResume02_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_ErogoWall_Trigger_WallResume01_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ErgoWallDisappear();
	void ErgoWallActivate();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ErgoWallOpenClose(bool ErgoWallState);
	void OnInteractionEnd();
	void OnInteractionStart();
	void SetFogGateState(ELFogGateState StateData);
	void BndEvt__BP_ErogoWall_Trigger_WallStop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ReceiveBeginPlay();
	void LineTh__UpdateFunc();
	void LineTh__FinishedFunc();
	void ErgoWall_Activate__UpdateFunc();
	void ErgoWall_Activate__FinishedFunc();
	void ErgoWall_Disolve__UpdateFunc();
	void ErgoWall_Disolve__FinishedFunc();
	void ErgoWallStop__UpdateFunc();
	void ErgoWallStop__FinishedFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ErogoWall_C">();
	}
	static class ABP_ErogoWall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ErogoWall_C>();
	}
};
static_assert(alignof(ABP_ErogoWall_C) == 0x000008, "Wrong alignment on ABP_ErogoWall_C");
static_assert(sizeof(ABP_ErogoWall_C) == 0x000368, "Wrong size on ABP_ErogoWall_C");
static_assert(offsetof(ABP_ErogoWall_C, UberGraphFrame) == 0x000260, "Member 'ABP_ErogoWall_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, Block_Targeting) == 0x000268, "Member 'ABP_ErogoWall_C::Block_Targeting' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, Block_BossTargeting) == 0x000270, "Member 'ABP_ErogoWall_C::Block_BossTargeting' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, Audio_Idle) == 0x000278, "Member 'ABP_ErogoWall_C::Audio_Idle' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, Audio_Freeze) == 0x000280, "Member 'ABP_ErogoWall_C::Audio_Freeze' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, Trigger_WallResume03) == 0x000288, "Member 'ABP_ErogoWall_C::Trigger_WallResume03' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, Trigger_WallResume02) == 0x000290, "Member 'ABP_ErogoWall_C::Trigger_WallResume02' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, Trigger_WallResume01) == 0x000298, "Member 'ABP_ErogoWall_C::Trigger_WallResume01' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, LPropNavigation) == 0x0002A0, "Member 'ABP_ErogoWall_C::LPropNavigation' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, Door01) == 0x0002A8, "Member 'ABP_ErogoWall_C::Door01' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, Trigger_WallStop) == 0x0002B0, "Member 'ABP_ErogoWall_C::Trigger_WallStop' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, OpenEffect) == 0x0002B8, "Member 'ABP_ErogoWall_C::OpenEffect' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, Door02) == 0x0002C0, "Member 'ABP_ErogoWall_C::Door02' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, DoorMesh) == 0x0002C8, "Member 'ABP_ErogoWall_C::DoorMesh' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, Audio_Open) == 0x0002D0, "Member 'ABP_ErogoWall_C::Audio_Open' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, Audio_Disappear) == 0x0002D8, "Member 'ABP_ErogoWall_C::Audio_Disappear' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, Audio_Close) == 0x0002E0, "Member 'ABP_ErogoWall_C::Audio_Close' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, Sound) == 0x0002E8, "Member 'ABP_ErogoWall_C::Sound' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, DefaultSceneRoot) == 0x0002F0, "Member 'ABP_ErogoWall_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, LineTh______0_B9868DDF4322B893837D2781B9F3E878) == 0x0002F8, "Member 'ABP_ErogoWall_C::LineTh______0_B9868DDF4322B893837D2781B9F3E878' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, LineTh__Direction_B9868DDF4322B893837D2781B9F3E878) == 0x0002FC, "Member 'ABP_ErogoWall_C::LineTh__Direction_B9868DDF4322B893837D2781B9F3E878' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, LineTH) == 0x000300, "Member 'ABP_ErogoWall_C::LineTH' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, ErgoWall_Activate______0_3477900A48B101D54787A090186E7959) == 0x000308, "Member 'ABP_ErogoWall_C::ErgoWall_Activate______0_3477900A48B101D54787A090186E7959' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, ErgoWall_Activate__Direction_3477900A48B101D54787A090186E7959) == 0x00030C, "Member 'ABP_ErogoWall_C::ErgoWall_Activate__Direction_3477900A48B101D54787A090186E7959' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, ErgoWall_Activate) == 0x000310, "Member 'ABP_ErogoWall_C::ErgoWall_Activate' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, ErgoWall_Disolve______0_6C6DFD4848D86B1102C454BE373C4444) == 0x000318, "Member 'ABP_ErogoWall_C::ErgoWall_Disolve______0_6C6DFD4848D86B1102C454BE373C4444' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, ErgoWall_Disolve__Direction_6C6DFD4848D86B1102C454BE373C4444) == 0x00031C, "Member 'ABP_ErogoWall_C::ErgoWall_Disolve__Direction_6C6DFD4848D86B1102C454BE373C4444' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, ErgoWall_Disolve) == 0x000320, "Member 'ABP_ErogoWall_C::ErgoWall_Disolve' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, ErgoWallStop______0_05E919374F5E530E42DB13B7D8527C53) == 0x000328, "Member 'ABP_ErogoWall_C::ErgoWallStop______0_05E919374F5E530E42DB13B7D8527C53' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, ErgoWallStop__Direction_05E919374F5E530E42DB13B7D8527C53) == 0x00032C, "Member 'ABP_ErogoWall_C::ErgoWallStop__Direction_05E919374F5E530E42DB13B7D8527C53' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, ErgoWallStop) == 0x000330, "Member 'ABP_ErogoWall_C::ErgoWallStop' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, ErgoWall_Size) == 0x000338, "Member 'ABP_ErogoWall_C::ErgoWall_Size' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, Check_ErgoWall_Stop) == 0x000344, "Member 'ABP_ErogoWall_C::Check_ErgoWall_Stop' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, Gate_State) == 0x000345, "Member 'ABP_ErogoWall_C::Gate_State' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, BlockWatchingTime) == 0x000348, "Member 'ABP_ErogoWall_C::BlockWatchingTime' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, OpenToCloseTime) == 0x00034C, "Member 'ABP_ErogoWall_C::OpenToCloseTime' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, OpeningDelay) == 0x000350, "Member 'ABP_ErogoWall_C::OpeningDelay' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, Offset) == 0x000354, "Member 'ABP_ErogoWall_C::Offset' has a wrong offset!");
static_assert(offsetof(ABP_ErogoWall_C, Scale_ErgoCircle) == 0x000364, "Member 'ABP_ErogoWall_C::Scale_ErgoCircle' has a wrong offset!");

}

