#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Ergo_Trail

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Ergo_Trail.BP_Ergo_Trail_C.ExecuteUbergraph_BP_Ergo_Trail
// 0x00A0 (0x00A0 - 0x0000)
struct BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_TargetActor;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLDropErgoData                         K2Node_CustomEvent_InData;                         // 0x0020(0x0030)()
	class UActorComponent*                        K2Node_ComponentBoundEvent_Component;              // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULObjectManagementSystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_FindSocketOwnerComponent_ReturnValue;     // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         K2Node_DynamicCast_AsMesh_Component;               // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemDropSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail) == 0x000008, "Wrong alignment on BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail");
static_assert(sizeof(BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail) == 0x0000A0, "Wrong size on BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail");
static_assert(offsetof(BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail, EntryPoint) == 0x000000, "Member 'BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail, K2Node_CustomEvent_TargetActor) == 0x000010, "Member 'BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail::K2Node_CustomEvent_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail, K2Node_CustomEvent_InData) == 0x000020, "Member 'BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail::K2Node_CustomEvent_InData' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail, K2Node_ComponentBoundEvent_Component) == 0x000050, "Member 'BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail::K2Node_ComponentBoundEvent_Component' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000058, "Member 'BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail, CallFunc_FindSocketOwnerComponent_ReturnValue) == 0x000060, "Member 'BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail::CallFunc_FindSocketOwnerComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail, K2Node_DynamicCast_AsMesh_Component) == 0x000070, "Member 'BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail::K2Node_DynamicCast_AsMesh_Component' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00007C, "Member 'BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000088, "Member 'BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail, CallFunc_Vector_Distance_ReturnValue) == 0x000090, "Member 'BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail, CallFunc_MapRangeClamped_ReturnValue) == 0x000094, "Member 'BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail, CallFunc_FClamp_ReturnValue) == 0x000098, "Member 'BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00009C, "Member 'BP_Ergo_Trail_C_ExecuteUbergraph_BP_Ergo_Trail::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_Ergo_Trail.BP_Ergo_Trail_C.BndEvt__BP_Ergo_Trail_ErgoTrail_K2Node_ComponentBoundEvent_0_ActorComponentDeactivateSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Ergo_Trail_C_BndEvt__BP_Ergo_Trail_ErgoTrail_K2Node_ComponentBoundEvent_0_ActorComponentDeactivateSignature__DelegateSignature final
{
public:
	class UActorComponent*                        Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Ergo_Trail_C_BndEvt__BP_Ergo_Trail_ErgoTrail_K2Node_ComponentBoundEvent_0_ActorComponentDeactivateSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Ergo_Trail_C_BndEvt__BP_Ergo_Trail_ErgoTrail_K2Node_ComponentBoundEvent_0_ActorComponentDeactivateSignature__DelegateSignature");
static_assert(sizeof(BP_Ergo_Trail_C_BndEvt__BP_Ergo_Trail_ErgoTrail_K2Node_ComponentBoundEvent_0_ActorComponentDeactivateSignature__DelegateSignature) == 0x000008, "Wrong size on BP_Ergo_Trail_C_BndEvt__BP_Ergo_Trail_ErgoTrail_K2Node_ComponentBoundEvent_0_ActorComponentDeactivateSignature__DelegateSignature");
static_assert(offsetof(BP_Ergo_Trail_C_BndEvt__BP_Ergo_Trail_ErgoTrail_K2Node_ComponentBoundEvent_0_ActorComponentDeactivateSignature__DelegateSignature, Component) == 0x000000, "Member 'BP_Ergo_Trail_C_BndEvt__BP_Ergo_Trail_ErgoTrail_K2Node_ComponentBoundEvent_0_ActorComponentDeactivateSignature__DelegateSignature::Component' has a wrong offset!");

// Function BP_Ergo_Trail.BP_Ergo_Trail_C.SetErgoData
// 0x0030 (0x0030 - 0x0000)
struct BP_Ergo_Trail_C_SetErgoData final
{
public:
	struct FLDropErgoData                         InData;                                            // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(BP_Ergo_Trail_C_SetErgoData) == 0x000008, "Wrong alignment on BP_Ergo_Trail_C_SetErgoData");
static_assert(sizeof(BP_Ergo_Trail_C_SetErgoData) == 0x000030, "Wrong size on BP_Ergo_Trail_C_SetErgoData");
static_assert(offsetof(BP_Ergo_Trail_C_SetErgoData, InData) == 0x000000, "Member 'BP_Ergo_Trail_C_SetErgoData::InData' has a wrong offset!");

// Function BP_Ergo_Trail.BP_Ergo_Trail_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Ergo_Trail_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Ergo_Trail_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Ergo_Trail_C_ReceiveTick");
static_assert(sizeof(BP_Ergo_Trail_C_ReceiveTick) == 0x000004, "Wrong size on BP_Ergo_Trail_C_ReceiveTick");
static_assert(offsetof(BP_Ergo_Trail_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Ergo_Trail_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Ergo_Trail.BP_Ergo_Trail_C.FollowTarget
// 0x0008 (0x0008 - 0x0000)
struct BP_Ergo_Trail_C_FollowTarget final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Ergo_Trail_C_FollowTarget) == 0x000008, "Wrong alignment on BP_Ergo_Trail_C_FollowTarget");
static_assert(sizeof(BP_Ergo_Trail_C_FollowTarget) == 0x000008, "Wrong size on BP_Ergo_Trail_C_FollowTarget");
static_assert(offsetof(BP_Ergo_Trail_C_FollowTarget, TargetActor) == 0x000000, "Member 'BP_Ergo_Trail_C_FollowTarget::TargetActor' has a wrong offset!");

// Function BP_Ergo_Trail.BP_Ergo_Trail_C.TickFollowTarget
// 0x0234 (0x0234 - 0x0000)
struct BP_Ergo_Trail_C_TickFollowTarget final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MoveLocationDest;                                  // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MoveLocationTick;                                  // 0x0010(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SocketLocation;                                    // 0x001C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0040(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VInterpTo_ReturnValue;                    // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult_1;     // 0x00EC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue_1;        // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue_1;            // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_7;        // 0x0224(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Ergo_Trail_C_TickFollowTarget) == 0x000004, "Wrong alignment on BP_Ergo_Trail_C_TickFollowTarget");
static_assert(sizeof(BP_Ergo_Trail_C_TickFollowTarget) == 0x000234, "Wrong size on BP_Ergo_Trail_C_TickFollowTarget");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, DeltaTime) == 0x000000, "Member 'BP_Ergo_Trail_C_TickFollowTarget::DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, MoveLocationDest) == 0x000004, "Member 'BP_Ergo_Trail_C_TickFollowTarget::MoveLocationDest' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, MoveLocationTick) == 0x000010, "Member 'BP_Ergo_Trail_C_TickFollowTarget::MoveLocationTick' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, SocketLocation) == 0x00001C, "Member 'BP_Ergo_Trail_C_TickFollowTarget::SocketLocation' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000034, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000040, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0000C8, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0000CC, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_Vector_Distance_ReturnValue) == 0x0000D8, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_IsValid_ReturnValue) == 0x0000DC, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_VInterpTo_ReturnValue) == 0x0000E0, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_VInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_K2_SetActorLocation_SweepHitResult_1) == 0x0000EC, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_K2_SetActorLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_K2_SetActorLocation_ReturnValue_1) == 0x000174, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_K2_SetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_GetSocketLocation_ReturnValue) == 0x000178, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000184, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_Vector_Distance_ReturnValue_1) == 0x000190, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000194, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x000198, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001A4, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_Normal_ReturnValue) == 0x0001B0, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0001BC, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001C0, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_K2_GetActorLocation_ReturnValue_5) == 0x0001CC, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_K2_GetActorLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_FindLookAtRotation_ReturnValue) == 0x0001D8, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0001E4, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_RInterpTo_ReturnValue) == 0x0001F0, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0001FC, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_K2_GetActorLocation_ReturnValue_6) == 0x000200, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_K2_GetActorLocation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x00020C, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_Add_FloatFloat_ReturnValue) == 0x000210, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_Add_VectorVector_ReturnValue) == 0x000214, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_IsValid_ReturnValue_1) == 0x000220, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_K2_GetActorLocation_ReturnValue_7) == 0x000224, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_K2_GetActorLocation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Ergo_Trail_C_TickFollowTarget, CallFunc_Less_FloatFloat_ReturnValue) == 0x000230, "Member 'BP_Ergo_Trail_C_TickFollowTarget::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

}

