#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ENV_BP_LightFlicker_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ENV_BP_LightFlicker_01.BP_ENV_BP_LightFlicker_01_C
// 0x0030 (0x0210 - 0x01E0)
class ABP_ENV_BP_LightFlicker_01_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   LV_Krat_Common_Light05_SM_LHI;                     // 0x01E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x01F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x01F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         FlickerTime;                                       // 0x0200(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Low_Intensity;                                     // 0x0204(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Hi_Intensity;                                      // 0x0208(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ENV_BP_LightFlicker_01(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ENV_BP_LightFlicker_01_C">();
	}
	static class ABP_ENV_BP_LightFlicker_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ENV_BP_LightFlicker_01_C>();
	}
};
static_assert(alignof(ABP_ENV_BP_LightFlicker_01_C) == 0x000008, "Wrong alignment on ABP_ENV_BP_LightFlicker_01_C");
static_assert(sizeof(ABP_ENV_BP_LightFlicker_01_C) == 0x000210, "Wrong size on ABP_ENV_BP_LightFlicker_01_C");
static_assert(offsetof(ABP_ENV_BP_LightFlicker_01_C, UberGraphFrame) == 0x0001E0, "Member 'ABP_ENV_BP_LightFlicker_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ENV_BP_LightFlicker_01_C, LV_Krat_Common_Light05_SM_LHI) == 0x0001E8, "Member 'ABP_ENV_BP_LightFlicker_01_C::LV_Krat_Common_Light05_SM_LHI' has a wrong offset!");
static_assert(offsetof(ABP_ENV_BP_LightFlicker_01_C, PointLight) == 0x0001F0, "Member 'ABP_ENV_BP_LightFlicker_01_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABP_ENV_BP_LightFlicker_01_C, DefaultSceneRoot) == 0x0001F8, "Member 'ABP_ENV_BP_LightFlicker_01_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ENV_BP_LightFlicker_01_C, FlickerTime) == 0x000200, "Member 'ABP_ENV_BP_LightFlicker_01_C::FlickerTime' has a wrong offset!");
static_assert(offsetof(ABP_ENV_BP_LightFlicker_01_C, Low_Intensity) == 0x000204, "Member 'ABP_ENV_BP_LightFlicker_01_C::Low_Intensity' has a wrong offset!");
static_assert(offsetof(ABP_ENV_BP_LightFlicker_01_C, Hi_Intensity) == 0x000208, "Member 'ABP_ENV_BP_LightFlicker_01_C::Hi_Intensity' has a wrong offset!");

}

