#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnvMain

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BP_EnvMain.BP_EnvMain_C.ApplyLightningSettings
// 0x0040 (0x0040 - 0x0000)
struct BP_EnvMain_C_ApplyLightningSettings final
{
public:
	float                                         Interval;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentTime;                                       // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLinearColor>                   K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnvMain_C_ApplyLightningSettings) == 0x000008, "Wrong alignment on BP_EnvMain_C_ApplyLightningSettings");
static_assert(sizeof(BP_EnvMain_C_ApplyLightningSettings) == 0x000040, "Wrong size on BP_EnvMain_C_ApplyLightningSettings");
static_assert(offsetof(BP_EnvMain_C_ApplyLightningSettings, Interval) == 0x000000, "Member 'BP_EnvMain_C_ApplyLightningSettings::Interval' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyLightningSettings, CurrentTime) == 0x000004, "Member 'BP_EnvMain_C_ApplyLightningSettings::CurrentTime' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyLightningSettings, CallFunc_FMax_ReturnValue) == 0x000008, "Member 'BP_EnvMain_C_ApplyLightningSettings::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyLightningSettings, CallFunc_RandomFloatInRange_ReturnValue) == 0x00000C, "Member 'BP_EnvMain_C_ApplyLightningSettings::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyLightningSettings, CallFunc_Add_FloatFloat_ReturnValue) == 0x000010, "Member 'BP_EnvMain_C_ApplyLightningSettings::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyLightningSettings, CallFunc_Less_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_EnvMain_C_ApplyLightningSettings::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyLightningSettings, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000018, "Member 'BP_EnvMain_C_ApplyLightningSettings::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyLightningSettings, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x00001C, "Member 'BP_EnvMain_C_ApplyLightningSettings::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyLightningSettings, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000020, "Member 'BP_EnvMain_C_ApplyLightningSettings::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyLightningSettings, K2Node_MakeArray_Array) == 0x000028, "Member 'BP_EnvMain_C_ApplyLightningSettings::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyLightningSettings, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000038, "Member 'BP_EnvMain_C_ApplyLightningSettings::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function BP_EnvMain.BP_EnvMain_C.ApplyWeatherSettings
// 0x0308 (0x0308 - 0x0000)
struct BP_EnvMain_C_ApplyWeatherSettings final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_wildcard_Variable;                            // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_wildcard_Variable_1;                          // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         CallFunc_FindWeatherFx_OutNiagara;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_FindWeatherFx_OutOffset;                  // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, float>                      CallFunc_FindWeatherFx_OutDefaultScalarVariables;  // 0x0040(0x0050)()
	TMap<class FName, struct FColor>              CallFunc_FindWeatherFx_OutDefautlColorVariables;   // 0x0090(0x0050)()
	bool                                          CallFunc_FindWeatherFx_ReturnValue;                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x00E8(0x0010)(ReferenceParm)
	TArray<class FName>                           CallFunc_Map_Keys_Keys_1;                          // 0x00F8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0110(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             CallFunc_FindWeatherSound_OutSound;                // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, float>                      CallFunc_FindWeatherSound_OutDefaultScalarVariables; // 0x01A8(0x0050)()
	TMap<class FName, struct FColor>              CallFunc_FindWeatherSound_OutDefautlColorVariables; // 0x01F8(0x0050)()
	bool                                          CallFunc_FindWeatherSound_ReturnValue;             // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys_2;                          // 0x0250(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0264(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Map_Find_Value;                           // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A[0x2];                                      // 0x027A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x028C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_Map_Find_Value_1;                         // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x029C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCController*                         K2Node_DynamicCast_AsLPCController;                // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELAudioListenerPositionType                   CallFunc_GetAudioListenerPositionType_ReturnValue; // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D2[0x2];                                      // 0x02D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E5[0x3];                                      // 0x02E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_2;                         // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Map_Find_Value_2;                         // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x02FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FE[0x2];                                      // 0x02FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvMain_C_ApplyWeatherSettings) == 0x000008, "Wrong alignment on BP_EnvMain_C_ApplyWeatherSettings");
static_assert(sizeof(BP_EnvMain_C_ApplyWeatherSettings) == 0x000308, "Wrong size on BP_EnvMain_C_ApplyWeatherSettings");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_EnvMain_C_ApplyWeatherSettings::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_EnvMain_C_ApplyWeatherSettings::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, Temp_wildcard_Variable) == 0x00000C, "Member 'BP_EnvMain_C_ApplyWeatherSettings::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, Temp_wildcard_Variable_1) == 0x000014, "Member 'BP_EnvMain_C_ApplyWeatherSettings::Temp_wildcard_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_MakeLiteralName_ReturnValue) == 0x00001C, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_FindWeatherFx_OutNiagara) == 0x000028, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_FindWeatherFx_OutNiagara' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_FindWeatherFx_OutOffset) == 0x000030, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_FindWeatherFx_OutOffset' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_FindWeatherFx_OutDefaultScalarVariables) == 0x000040, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_FindWeatherFx_OutDefaultScalarVariables' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_FindWeatherFx_OutDefautlColorVariables) == 0x000090, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_FindWeatherFx_OutDefautlColorVariables' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_FindWeatherFx_ReturnValue) == 0x0000E0, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_FindWeatherFx_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Map_Keys_Keys) == 0x0000E8, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Map_Keys_Keys_1) == 0x0000F8, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Map_Keys_Keys_1' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Array_Length_ReturnValue) == 0x000108, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Array_Length_ReturnValue_1) == 0x00010C, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000110, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_IsValid_ReturnValue) == 0x000198, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_FindWeatherSound_OutSound) == 0x0001A0, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_FindWeatherSound_OutSound' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_FindWeatherSound_OutDefaultScalarVariables) == 0x0001A8, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_FindWeatherSound_OutDefaultScalarVariables' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_FindWeatherSound_OutDefautlColorVariables) == 0x0001F8, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_FindWeatherSound_OutDefautlColorVariables' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_FindWeatherSound_ReturnValue) == 0x000248, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_FindWeatherSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Map_Keys_Keys_2) == 0x000250, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Map_Keys_Keys_2' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_IsValid_ReturnValue_1) == 0x000260, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Array_Get_Item) == 0x000264, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Map_Find_Value) == 0x00026C, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Map_Find_ReturnValue) == 0x000270, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Array_Length_ReturnValue_2) == 0x000274, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Less_IntInt_ReturnValue) == 0x000278, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_NotEqual_NameName_ReturnValue) == 0x000279, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, Temp_int_Loop_Counter_Variable_1) == 0x00027C, "Member 'BP_EnvMain_C_ApplyWeatherSettings::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Less_IntInt_ReturnValue_1) == 0x000280, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Add_IntInt_ReturnValue_1) == 0x000284, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, Temp_int_Array_Index_Variable_1) == 0x000288, "Member 'BP_EnvMain_C_ApplyWeatherSettings::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Array_Get_Item_1) == 0x00028C, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Map_Find_Value_1) == 0x000294, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Map_Find_ReturnValue_1) == 0x000298, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x00029C, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, Temp_int_Loop_Counter_Variable_2) == 0x0002AC, "Member 'BP_EnvMain_C_ApplyWeatherSettings::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Less_IntInt_ReturnValue_2) == 0x0002B0, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Add_IntInt_ReturnValue_2) == 0x0002B4, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_GetPlayerController_ReturnValue) == 0x0002B8, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, K2Node_DynamicCast_AsLPCController) == 0x0002C0, "Member 'BP_EnvMain_C_ApplyWeatherSettings::K2Node_DynamicCast_AsLPCController' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, K2Node_DynamicCast_bSuccess) == 0x0002C8, "Member 'BP_EnvMain_C_ApplyWeatherSettings::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0002CC, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_GetAudioListenerPositionType_ReturnValue) == 0x0002D0, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_GetAudioListenerPositionType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0002D1, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0002D4, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x0002D8, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0002DC, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Lerp_ReturnValue) == 0x0002E0, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0002E4, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Lerp_ReturnValue_1) == 0x0002E8, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, Temp_int_Array_Index_Variable_2) == 0x0002EC, "Member 'BP_EnvMain_C_ApplyWeatherSettings::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Array_Get_Item_2) == 0x0002F0, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Map_Find_Value_2) == 0x0002F8, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Map_Find_ReturnValue_2) == 0x0002FC, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x0002FD, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_ApplyWeatherSettings, CallFunc_MakeVector2D_ReturnValue) == 0x000300, "Member 'BP_EnvMain_C_ApplyWeatherSettings::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function BP_EnvMain.BP_EnvMain_C.UpdateSecondaryMoonArrow
// 0x0114 (0x0114 - 0x0000)
struct BP_EnvMain_C_UpdateSecondaryMoonArrow final
{
public:
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddLocalOffset_SweepHitResult;         // 0x0004(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x008C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_EnvMain_C_UpdateSecondaryMoonArrow) == 0x000004, "Wrong alignment on BP_EnvMain_C_UpdateSecondaryMoonArrow");
static_assert(sizeof(BP_EnvMain_C_UpdateSecondaryMoonArrow) == 0x000114, "Wrong size on BP_EnvMain_C_UpdateSecondaryMoonArrow");
static_assert(offsetof(BP_EnvMain_C_UpdateSecondaryMoonArrow, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x000000, "Member 'BP_EnvMain_C_UpdateSecondaryMoonArrow::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_UpdateSecondaryMoonArrow, CallFunc_K2_AddLocalOffset_SweepHitResult) == 0x000004, "Member 'BP_EnvMain_C_UpdateSecondaryMoonArrow::CallFunc_K2_AddLocalOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_UpdateSecondaryMoonArrow, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x00008C, "Member 'BP_EnvMain_C_UpdateSecondaryMoonArrow::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

// Function BP_EnvMain.BP_EnvMain_C.__>__
// 0x0010 (0x0010 - 0x0000)
struct BP_EnvMain_C_______0 final
{
public:
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvMain_C______) == 0x000004, "Wrong alignment on BP_EnvMain_C______");
static_assert(sizeof(BP_EnvMain_C______) == 0x000010, "Wrong size on BP_EnvMain_C______");
static_assert(offsetof(BP_EnvMain_C______, CallFunc_Add_IntInt_ReturnValue) == 0x000000, "Member 'BP_EnvMain_C______::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C______, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BP_EnvMain_C______::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C______, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'BP_EnvMain_C______::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C______, CallFunc_Min_ReturnValue) == 0x00000C, "Member 'BP_EnvMain_C______::CallFunc_Min_ReturnValue' has a wrong offset!");

// Function BP_EnvMain.BP_EnvMain_C._ _<__
// 0x0008 (0x0008 - 0x0000)
struct BP_EnvMain_C_______ final
{
public:
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvMain_C_______) == 0x000004, "Wrong alignment on BP_EnvMain_C_______");
static_assert(sizeof(BP_EnvMain_C_______) == 0x000008, "Wrong size on BP_EnvMain_C_______");
static_assert(offsetof(BP_EnvMain_C_______, CallFunc_Subtract_IntInt_ReturnValue) == 0x000000, "Member 'BP_EnvMain_C_______::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_______, CallFunc_Max_ReturnValue) == 0x000004, "Member 'BP_EnvMain_C_______::CallFunc_Max_ReturnValue' has a wrong offset!");

// Function BP_EnvMain.BP_EnvMain_C.Set Sun and Moon Rotation
// 0x001C (0x001C - 0x0000)
struct BP_EnvMain_C_Set_Sun_and_Moon_Rotation final
{
public:
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvMain_C_Set_Sun_and_Moon_Rotation) == 0x000004, "Wrong alignment on BP_EnvMain_C_Set_Sun_and_Moon_Rotation");
static_assert(sizeof(BP_EnvMain_C_Set_Sun_and_Moon_Rotation) == 0x00001C, "Wrong size on BP_EnvMain_C_Set_Sun_and_Moon_Rotation");
static_assert(offsetof(BP_EnvMain_C_Set_Sun_and_Moon_Rotation, CallFunc_GetForwardVector_ReturnValue) == 0x000000, "Member 'BP_EnvMain_C_Set_Sun_and_Moon_Rotation::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_Set_Sun_and_Moon_Rotation, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x00000C, "Member 'BP_EnvMain_C_Set_Sun_and_Moon_Rotation::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");

// Function BP_EnvMain.BP_EnvMain_C.SpawnCustomLightningBP
// 0x0014 (0x0014 - 0x0000)
struct BP_EnvMain_C_SpawnCustomLightningBP final
{
public:
	float                                         Delay;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dir;                                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Intensity;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Distance;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Height;                                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvMain_C_SpawnCustomLightningBP) == 0x000004, "Wrong alignment on BP_EnvMain_C_SpawnCustomLightningBP");
static_assert(sizeof(BP_EnvMain_C_SpawnCustomLightningBP) == 0x000014, "Wrong size on BP_EnvMain_C_SpawnCustomLightningBP");
static_assert(offsetof(BP_EnvMain_C_SpawnCustomLightningBP, Delay) == 0x000000, "Member 'BP_EnvMain_C_SpawnCustomLightningBP::Delay' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_SpawnCustomLightningBP, Dir) == 0x000004, "Member 'BP_EnvMain_C_SpawnCustomLightningBP::Dir' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_SpawnCustomLightningBP, Intensity) == 0x000008, "Member 'BP_EnvMain_C_SpawnCustomLightningBP::Intensity' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_SpawnCustomLightningBP, Distance) == 0x00000C, "Member 'BP_EnvMain_C_SpawnCustomLightningBP::Distance' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_SpawnCustomLightningBP, Height) == 0x000010, "Member 'BP_EnvMain_C_SpawnCustomLightningBP::Height' has a wrong offset!");

// Function BP_EnvMain.BP_EnvMain_C.Flash Lightning
// 0x0010 (0x0010 - 0x0000)
struct BP_EnvMain_C_Flash_Lightning final
{
public:
	float                                         Angle;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Custom_Lightning_Location_0;                       // 0x0004(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvMain_C_Flash_Lightning) == 0x000004, "Wrong alignment on BP_EnvMain_C_Flash_Lightning");
static_assert(sizeof(BP_EnvMain_C_Flash_Lightning) == 0x000010, "Wrong size on BP_EnvMain_C_Flash_Lightning");
static_assert(offsetof(BP_EnvMain_C_Flash_Lightning, Angle) == 0x000000, "Member 'BP_EnvMain_C_Flash_Lightning::Angle' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_Flash_Lightning, Custom_Lightning_Location_0) == 0x000004, "Member 'BP_EnvMain_C_Flash_Lightning::Custom_Lightning_Location_0' has a wrong offset!");

// Function BP_EnvMain.BP_EnvMain_C.SetActiveEnvironment
// 0x0001 (0x0001 - 0x0000)
struct BP_EnvMain_C_SetActiveEnvironment final
{
public:
	bool                                          IsValid;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_EnvMain_C_SetActiveEnvironment) == 0x000001, "Wrong alignment on BP_EnvMain_C_SetActiveEnvironment");
static_assert(sizeof(BP_EnvMain_C_SetActiveEnvironment) == 0x000001, "Wrong size on BP_EnvMain_C_SetActiveEnvironment");
static_assert(offsetof(BP_EnvMain_C_SetActiveEnvironment, IsValid) == 0x000000, "Member 'BP_EnvMain_C_SetActiveEnvironment::IsValid' has a wrong offset!");

// Function BP_EnvMain.BP_EnvMain_C.SpawnCustomLightning
// 0x0014 (0x0014 - 0x0000)
struct BP_EnvMain_C_SpawnCustomLightning final
{
public:
	float                                         Delay;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Direction_0;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Intensity;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Distance;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Height;                                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_EnvMain_C_SpawnCustomLightning) == 0x000004, "Wrong alignment on BP_EnvMain_C_SpawnCustomLightning");
static_assert(sizeof(BP_EnvMain_C_SpawnCustomLightning) == 0x000014, "Wrong size on BP_EnvMain_C_SpawnCustomLightning");
static_assert(offsetof(BP_EnvMain_C_SpawnCustomLightning, Delay) == 0x000000, "Member 'BP_EnvMain_C_SpawnCustomLightning::Delay' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_SpawnCustomLightning, Direction_0) == 0x000004, "Member 'BP_EnvMain_C_SpawnCustomLightning::Direction_0' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_SpawnCustomLightning, Intensity) == 0x000008, "Member 'BP_EnvMain_C_SpawnCustomLightning::Intensity' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_SpawnCustomLightning, Distance) == 0x00000C, "Member 'BP_EnvMain_C_SpawnCustomLightning::Distance' has a wrong offset!");
static_assert(offsetof(BP_EnvMain_C_SpawnCustomLightning, Height) == 0x000010, "Member 'BP_EnvMain_C_SpawnCustomLightning::Height' has a wrong offset!");

// Function BP_EnvMain.BP_EnvMain_C.ExecuteUbergraph_BP_EnvMain
// 0x0550 (0x0550 - 0x0000)
struct BP_EnvMain_C_ExecuteUbergraph_BP_EnvMain final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PerlinNoise1D_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetEditorCameraPosition_OutCameraPostion; // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEditorCameraPosition_ReturnValue;      // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Delay;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Dir;                            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Intensity;                      // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Distance;                       // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Height;                         // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x009C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_2;                       // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_2;       // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_3;       // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_7;        // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_8;        // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue;    // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_9;        // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0154(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorLinearColor_ReturnValue; // 0x0164(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_Conv_LinearColorToColor_ReturnValue;      // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0178(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_202[0x2];                                      // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_4;       // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_5;       // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_223[0x1];                                      // 0x0223(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0224(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0238(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x02C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Angle;                          // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Custom_Lightning_Location;      // 0x02DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsValid)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x02E8(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_GetEditorCameraPosition_OutCameraPostion_1; // 0x02F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEditorCameraPosition_ReturnValue_1;    // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_305[0x3];                                      // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x0308(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
