#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Endure

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Endure.BP_Endure_C.ExecuteUbergraph_BP_Endure
// 0x0018 (0x0018 - 0x0000)
struct BP_Endure_C_ExecuteUbergraph_BP_Endure final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Endure_C_ExecuteUbergraph_BP_Endure) == 0x000008, "Wrong alignment on BP_Endure_C_ExecuteUbergraph_BP_Endure");
static_assert(sizeof(BP_Endure_C_ExecuteUbergraph_BP_Endure) == 0x000018, "Wrong size on BP_Endure_C_ExecuteUbergraph_BP_Endure");
static_assert(offsetof(BP_Endure_C_ExecuteUbergraph_BP_Endure, EntryPoint) == 0x000000, "Member 'BP_Endure_C_ExecuteUbergraph_BP_Endure::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Endure_C_ExecuteUbergraph_BP_Endure, K2Node_Event_ReasonAction) == 0x000008, "Member 'BP_Endure_C_ExecuteUbergraph_BP_Endure::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Endure_C_ExecuteUbergraph_BP_Endure, K2Node_Event_Reason) == 0x000010, "Member 'BP_Endure_C_ExecuteUbergraph_BP_Endure::K2Node_Event_Reason' has a wrong offset!");

// Function BP_Endure.BP_Endure_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Endure_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Endure_C_OnStop) == 0x000008, "Wrong alignment on BP_Endure_C_OnStop");
static_assert(sizeof(BP_Endure_C_OnStop) == 0x000010, "Wrong size on BP_Endure_C_OnStop");
static_assert(offsetof(BP_Endure_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Endure_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Endure_C_OnStop, Reason) == 0x000008, "Member 'BP_Endure_C_OnStop::Reason' has a wrong offset!");

}

