#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Factory_SignBoard_01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Factory_SignBoard_01.BP_Factory_SignBoard_01_C
// 0x0080 (0x0260 - 0x01E0)
class ABP_Factory_SignBoard_01_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URotatingMovementComponent*             RotatingMovement4;                                 // 0x01E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URotatingMovementComponent*             RotatingMovement3;                                 // 0x01F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URotatingMovementComponent*             RotatingMovement2;                                 // 0x01F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LV_Krat_FactoryProp_SignBoard01D_SM_OF1;           // 0x0200(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LV_Krat_FactoryProp_SignBoard01C_SM_OF;            // 0x0208(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LV_Krat_FactoryProp_SignBoard01E_SM_OF;            // 0x0210(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LV_Krat_FactoryProp_SignBoard01D_SM_OF;            // 0x0218(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URotatingMovementComponent*             RotatingMovement1;                                 // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LV_Krat_FactoryProp_SignBoard01B_SM_OF;            // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LV_Krat_FactoryProp_SignBoard01A_SM_OF;            // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Center_Speed;                                      // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Right_Up_Speed;                                    // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Left_Up_Speed;                                     // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Left_Down_Speed;                                   // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Right_Down_Speed;                                  // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Factory_SignBoard_01(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Factory_SignBoard_01_C">();
	}
	static class ABP_Factory_SignBoard_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Factory_SignBoard_01_C>();
	}
};
static_assert(alignof(ABP_Factory_SignBoard_01_C) == 0x000008, "Wrong alignment on ABP_Factory_SignBoard_01_C");
static_assert(sizeof(ABP_Factory_SignBoard_01_C) == 0x000260, "Wrong size on ABP_Factory_SignBoard_01_C");
static_assert(offsetof(ABP_Factory_SignBoard_01_C, UberGraphFrame) == 0x0001E0, "Member 'ABP_Factory_SignBoard_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Factory_SignBoard_01_C, RotatingMovement4) == 0x0001E8, "Member 'ABP_Factory_SignBoard_01_C::RotatingMovement4' has a wrong offset!");
static_assert(offsetof(ABP_Factory_SignBoard_01_C, RotatingMovement3) == 0x0001F0, "Member 'ABP_Factory_SignBoard_01_C::RotatingMovement3' has a wrong offset!");
static_assert(offsetof(ABP_Factory_SignBoard_01_C, RotatingMovement2) == 0x0001F8, "Member 'ABP_Factory_SignBoard_01_C::RotatingMovement2' has a wrong offset!");
static_assert(offsetof(ABP_Factory_SignBoard_01_C, LV_Krat_FactoryProp_SignBoard01D_SM_OF1) == 0x000200, "Member 'ABP_Factory_SignBoard_01_C::LV_Krat_FactoryProp_SignBoard01D_SM_OF1' has a wrong offset!");
static_assert(offsetof(ABP_Factory_SignBoard_01_C, LV_Krat_FactoryProp_SignBoard01C_SM_OF) == 0x000208, "Member 'ABP_Factory_SignBoard_01_C::LV_Krat_FactoryProp_SignBoard01C_SM_OF' has a wrong offset!");
static_assert(offsetof(ABP_Factory_SignBoard_01_C, LV_Krat_FactoryProp_SignBoard01E_SM_OF) == 0x000210, "Member 'ABP_Factory_SignBoard_01_C::LV_Krat_FactoryProp_SignBoard01E_SM_OF' has a wrong offset!");
static_assert(offsetof(ABP_Factory_SignBoard_01_C, LV_Krat_FactoryProp_SignBoard01D_SM_OF) == 0x000218, "Member 'ABP_Factory_SignBoard_01_C::LV_Krat_FactoryProp_SignBoard01D_SM_OF' has a wrong offset!");
static_assert(offsetof(ABP_Factory_SignBoard_01_C, RotatingMovement1) == 0x000220, "Member 'ABP_Factory_SignBoard_01_C::RotatingMovement1' has a wrong offset!");
static_assert(offsetof(ABP_Factory_SignBoard_01_C, RotatingMovement) == 0x000228, "Member 'ABP_Factory_SignBoard_01_C::RotatingMovement' has a wrong offset!");
static_assert(offsetof(ABP_Factory_SignBoard_01_C, LV_Krat_FactoryProp_SignBoard01B_SM_OF) == 0x000230, "Member 'ABP_Factory_SignBoard_01_C::LV_Krat_FactoryProp_SignBoard01B_SM_OF' has a wrong offset!");
static_assert(offsetof(ABP_Factory_SignBoard_01_C, LV_Krat_FactoryProp_SignBoard01A_SM_OF) == 0x000238, "Member 'ABP_Factory_SignBoard_01_C::LV_Krat_FactoryProp_SignBoard01A_SM_OF' has a wrong offset!");
static_assert(offsetof(ABP_Factory_SignBoard_01_C, DefaultSceneRoot) == 0x000240, "Member 'ABP_Factory_SignBoard_01_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Factory_SignBoard_01_C, Center_Speed) == 0x000248, "Member 'ABP_Factory_SignBoard_01_C::Center_Speed' has a wrong offset!");
static_assert(offsetof(ABP_Factory_SignBoard_01_C, Right_Up_Speed) == 0x00024C, "Member 'ABP_Factory_SignBoard_01_C::Right_Up_Speed' has a wrong offset!");
static_assert(offsetof(ABP_Factory_SignBoard_01_C, Left_Up_Speed) == 0x000250, "Member 'ABP_Factory_SignBoard_01_C::Left_Up_Speed' has a wrong offset!");
static_assert(offsetof(ABP_Factory_SignBoard_01_C, Left_Down_Speed) == 0x000254, "Member 'ABP_Factory_SignBoard_01_C::Left_Down_Speed' has a wrong offset!");
static_assert(offsetof(ABP_Factory_SignBoard_01_C, Right_Down_Speed) == 0x000258, "Member 'ABP_Factory_SignBoard_01_C::Right_Down_Speed' has a wrong offset!");

}

