#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Factory_SignBoard_01

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Factory_SignBoard_01.BP_Factory_SignBoard_01_C.ExecuteUbergraph_BP_Factory_SignBoard_01
// 0x0040 (0x0040 - 0x0000)
struct BP_Factory_SignBoard_01_C_ExecuteUbergraph_BP_Factory_SignBoard_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_4;                // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Factory_SignBoard_01_C_ExecuteUbergraph_BP_Factory_SignBoard_01) == 0x000004, "Wrong alignment on BP_Factory_SignBoard_01_C_ExecuteUbergraph_BP_Factory_SignBoard_01");
static_assert(sizeof(BP_Factory_SignBoard_01_C_ExecuteUbergraph_BP_Factory_SignBoard_01) == 0x000040, "Wrong size on BP_Factory_SignBoard_01_C_ExecuteUbergraph_BP_Factory_SignBoard_01");
static_assert(offsetof(BP_Factory_SignBoard_01_C_ExecuteUbergraph_BP_Factory_SignBoard_01, EntryPoint) == 0x000000, "Member 'BP_Factory_SignBoard_01_C_ExecuteUbergraph_BP_Factory_SignBoard_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Factory_SignBoard_01_C_ExecuteUbergraph_BP_Factory_SignBoard_01, CallFunc_MakeRotator_ReturnValue) == 0x000004, "Member 'BP_Factory_SignBoard_01_C_ExecuteUbergraph_BP_Factory_SignBoard_01::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Factory_SignBoard_01_C_ExecuteUbergraph_BP_Factory_SignBoard_01, CallFunc_MakeRotator_ReturnValue_1) == 0x000010, "Member 'BP_Factory_SignBoard_01_C_ExecuteUbergraph_BP_Factory_SignBoard_01::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Factory_SignBoard_01_C_ExecuteUbergraph_BP_Factory_SignBoard_01, CallFunc_MakeRotator_ReturnValue_2) == 0x00001C, "Member 'BP_Factory_SignBoard_01_C_ExecuteUbergraph_BP_Factory_SignBoard_01::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Factory_SignBoard_01_C_ExecuteUbergraph_BP_Factory_SignBoard_01, CallFunc_MakeRotator_ReturnValue_3) == 0x000028, "Member 'BP_Factory_SignBoard_01_C_ExecuteUbergraph_BP_Factory_SignBoard_01::CallFunc_MakeRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Factory_SignBoard_01_C_ExecuteUbergraph_BP_Factory_SignBoard_01, CallFunc_MakeRotator_ReturnValue_4) == 0x000034, "Member 'BP_Factory_SignBoard_01_C_ExecuteUbergraph_BP_Factory_SignBoard_01::CallFunc_MakeRotator_ReturnValue_4' has a wrong offset!");

}

