#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FootstepPreset

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FootstepPreset.BP_FootstepPreset_C
// 0x0028 (0x0050 - 0x0028)
class UBP_FootstepPreset_C : public UObject
{
public:
	class UParticleSystem*                        Effect;                                            // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              Sound;                                             // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VolumeMultiplier;                                  // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PitchMultiplier;                                   // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Attached;                                          // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundAttenuation*                      Attenuation;                                       // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Spawn(class USceneComponent* Mesh, const struct FBS_FootstepAttachement& Attachement, float Intensity, class UParticleSystemComponent** SpawnedEmitter, class UAudioComponent** SpawnedAudio);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FootstepPreset_C">();
	}
	static class UBP_FootstepPreset_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FootstepPreset_C>();
	}
};
static_assert(alignof(UBP_FootstepPreset_C) == 0x000008, "Wrong alignment on UBP_FootstepPreset_C");
static_assert(sizeof(UBP_FootstepPreset_C) == 0x000050, "Wrong size on UBP_FootstepPreset_C");
static_assert(offsetof(UBP_FootstepPreset_C, Effect) == 0x000028, "Member 'UBP_FootstepPreset_C::Effect' has a wrong offset!");
static_assert(offsetof(UBP_FootstepPreset_C, Sound) == 0x000030, "Member 'UBP_FootstepPreset_C::Sound' has a wrong offset!");
static_assert(offsetof(UBP_FootstepPreset_C, VolumeMultiplier) == 0x000038, "Member 'UBP_FootstepPreset_C::VolumeMultiplier' has a wrong offset!");
static_assert(offsetof(UBP_FootstepPreset_C, PitchMultiplier) == 0x00003C, "Member 'UBP_FootstepPreset_C::PitchMultiplier' has a wrong offset!");
static_assert(offsetof(UBP_FootstepPreset_C, Attached) == 0x000040, "Member 'UBP_FootstepPreset_C::Attached' has a wrong offset!");
static_assert(offsetof(UBP_FootstepPreset_C, Attenuation) == 0x000048, "Member 'UBP_FootstepPreset_C::Attenuation' has a wrong offset!");

}

