#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FirepickAxe_BLD

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BP_FirepickAxe_BLD.BP_FirepickAxe_BLD_C.ExecuteUbergraph_BP_FirepickAxe_BLD
// 0x01F8 (0x01F8 - 0x0000)
struct BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlaySkillActionBP_Branches;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_PlaySkillActionBP_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActMgrComponent*                      K2Node_CustomEvent_ActMgrComponent;                // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_TargetActor;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Command;                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Lever;                          // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SkipCommandPrerequisitiesCheck; // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInst_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_GetMontage_CurrentSectionBP_Branches;     // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetMontage_CurrentSectionBP_ReturnValue;  // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ULActMgrComponent* ActMgrComponent, class AActor* TargetActor, class FName Command, const struct FVector& Lever, bool SkipCommandPrerequisitiesCheck)> K2Node_CreateDelegate_OutputDelegate;              // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_1;                    // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTime;                            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInst_ReturnValue_1;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCommandPressed_ReturnValue;             // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_GetMontage_CurrentSectionBP_Branches_1;   // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetMontage_CurrentSectionBP_ReturnValue_1; // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_2;                    // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_PlaySkillActionBP_Branches_1;             // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9F[0x1];                                       // 0x009F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_PlaySkillActionBP_ReturnValue_1;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_PlaySkillActionBP_Branches_2;             // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_PlaySkillActionBP_ReturnValue_2;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter;                 // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALWeapon*                               CallFunc_GetWeaponByAttachPoint_ReturnValue;       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlaySkillActionBP_Branches_3;             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_PlaySkillActionBP_ReturnValue_3;          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_1;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALWeapon*                               CallFunc_GetWeaponByAttachPoint_ReturnValue_1;     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimSequenceBase*>              K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ReferenceParm)
	TArray<class UAnimSequenceBase*>              K2Node_MakeArray_Array_1;                          // 0x0118(0x0010)(ReferenceParm)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_2;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_GetLCharacterMovementComponentBP_Branches; // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULCharacterMovementComponent*           CallFunc_GetLCharacterMovementComponentBP_ReturnValue; // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter;                   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_6;                    // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TraceForLandingOnFloor_ResultLocation;    // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TraceForLandingOnFloor_ReturnValue;       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_3;               // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_GetLCharacterMovementComponentBP_Branches_1; // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17A[0x6];                                      // 0x017A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULCharacterMovementComponent*           CallFunc_GetLCharacterMovementComponentBP_ReturnValue_1; // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInst_ReturnValue_2;                // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_7;                    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_GetMontage_CurrentSectionBP_Branches_2;   // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x2];                                      // 0x0192(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetMontage_CurrentSectionBP_ReturnValue_2; // 0x0194(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_4;               // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_3;                    // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALWeapon*                               CallFunc_GetWeaponByAttachPoint_ReturnValue_2;     // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_8;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_PlaySkillActionBP_Branches_4;             // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_PlaySkillActionBP_ReturnValue_4;          // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_9;                    // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_PlaySkillActionBP_Branches_5;             // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x6];                                      // 0x01CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_PlaySkillActionBP_ReturnValue_5;          // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_10;                   // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_5;               // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALWeapon*                               CallFunc_GetWeaponByAttachPoint_ReturnValue_3;     // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD) == 0x000008, "Wrong alignment on BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD");
static_assert(sizeof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD) == 0x0001F8, "Wrong size on BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, EntryPoint) == 0x000000, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_PlaySkillActionBP_Branches) == 0x000004, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_PlaySkillActionBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_PlaySkillActionBP_ReturnValue) == 0x000008, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_PlaySkillActionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_Event_ReasonAction) == 0x000018, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_Event_Reason) == 0x000020, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_CustomEvent_ActMgrComponent) == 0x000030, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_CustomEvent_ActMgrComponent' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_CustomEvent_TargetActor) == 0x000038, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_CustomEvent_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_CustomEvent_Command) == 0x000040, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_CustomEvent_Command' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_CustomEvent_Lever) == 0x000048, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_CustomEvent_Lever' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_CustomEvent_SkipCommandPrerequisitiesCheck) == 0x000054, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_CustomEvent_SkipCommandPrerequisitiesCheck' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_GetAnimInst_ReturnValue) == 0x000058, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_GetAnimInst_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_SwitchName_CmpSuccess) == 0x000060, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_GetMontage_CurrentSectionBP_Branches) == 0x000061, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_GetMontage_CurrentSectionBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_GetMontage_CurrentSectionBP_ReturnValue) == 0x000064, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_GetMontage_CurrentSectionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_CreateDelegate_OutputDelegate) == 0x00006C, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_SwitchName_CmpSuccess_1) == 0x00007C, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_SwitchName_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_SwitchEnum_CmpSuccess_1) == 0x00007D, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_Event_DeltaTime) == 0x000080, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_GetAnimInst_ReturnValue_1) == 0x000088, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_GetAnimInst_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_IsCommandPressed_ReturnValue) == 0x000090, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_IsCommandPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_GetMontage_CurrentSectionBP_Branches_1) == 0x000091, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_GetMontage_CurrentSectionBP_Branches_1' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_GetMontage_CurrentSectionBP_ReturnValue_1) == 0x000094, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_GetMontage_CurrentSectionBP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_SwitchName_CmpSuccess_2) == 0x00009C, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_SwitchName_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_SwitchEnum_CmpSuccess_2) == 0x00009D, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_PlaySkillActionBP_Branches_1) == 0x00009E, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_PlaySkillActionBP_Branches_1' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_PlaySkillActionBP_ReturnValue_1) == 0x0000A0, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_PlaySkillActionBP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_SwitchEnum_CmpSuccess_3) == 0x0000A8, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_PlaySkillActionBP_Branches_2) == 0x0000A9, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_PlaySkillActionBP_Branches_2' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_PlaySkillActionBP_ReturnValue_2) == 0x0000B0, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_PlaySkillActionBP_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_SwitchEnum_CmpSuccess_4) == 0x0000B8, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_DynamicCast_AsLPCCharacter) == 0x0000C0, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_DynamicCast_AsLPCCharacter' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_GetWeaponByAttachPoint_ReturnValue) == 0x0000D0, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_GetWeaponByAttachPoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_PlaySkillActionBP_Branches_3) == 0x0000D8, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_PlaySkillActionBP_Branches_3' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_PlaySkillActionBP_ReturnValue_3) == 0x0000E0, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_PlaySkillActionBP_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_SwitchEnum_CmpSuccess_5) == 0x0000E8, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_SwitchEnum_CmpSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_DynamicCast_AsLPCCharacter_1) == 0x0000F0, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_DynamicCast_AsLPCCharacter_1' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_DynamicCast_bSuccess_1) == 0x0000F8, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_GetWeaponByAttachPoint_ReturnValue_1) == 0x000100, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_GetWeaponByAttachPoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_MakeArray_Array) == 0x000108, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_MakeArray_Array_1) == 0x000118, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_DynamicCast_AsLPCCharacter_2) == 0x000128, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_DynamicCast_AsLPCCharacter_2' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_DynamicCast_bSuccess_2) == 0x000130, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_GetLCharacterMovementComponentBP_Branches) == 0x000131, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_GetLCharacterMovementComponentBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_GetLCharacterMovementComponentBP_ReturnValue) == 0x000138, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_GetLCharacterMovementComponentBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_DynamicCast_AsLCharacter) == 0x000140, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_DynamicCast_AsLCharacter' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_DynamicCast_bSuccess_3) == 0x000148, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_SwitchEnum_CmpSuccess_6) == 0x000149, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_SwitchEnum_CmpSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00014C, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_Add_FloatFloat_ReturnValue) == 0x000158, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_TraceForLandingOnFloor_ResultLocation) == 0x00015C, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_TraceForLandingOnFloor_ResultLocation' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_TraceForLandingOnFloor_ReturnValue) == 0x000168, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_TraceForLandingOnFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_DynamicCast_AsLPCCharacter_3) == 0x000170, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_DynamicCast_AsLPCCharacter_3' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_DynamicCast_bSuccess_4) == 0x000178, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_GetLCharacterMovementComponentBP_Branches_1) == 0x000179, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_GetLCharacterMovementComponentBP_Branches_1' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_GetLCharacterMovementComponentBP_ReturnValue_1) == 0x000180, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_GetLCharacterMovementComponentBP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_GetAnimInst_ReturnValue_2) == 0x000188, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_GetAnimInst_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_SwitchEnum_CmpSuccess_7) == 0x000190, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_SwitchEnum_CmpSuccess_7' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_GetMontage_CurrentSectionBP_Branches_2) == 0x000191, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_GetMontage_CurrentSectionBP_Branches_2' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_GetMontage_CurrentSectionBP_ReturnValue_2) == 0x000194, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_GetMontage_CurrentSectionBP_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_DynamicCast_AsLPCCharacter_4) == 0x0001A0, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_DynamicCast_AsLPCCharacter_4' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_DynamicCast_bSuccess_5) == 0x0001A8, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_SwitchName_CmpSuccess_3) == 0x0001A9, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_SwitchName_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_GetWeaponByAttachPoint_ReturnValue_2) == 0x0001B0, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_GetWeaponByAttachPoint_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_SwitchEnum_CmpSuccess_8) == 0x0001B8, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_SwitchEnum_CmpSuccess_8' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_PlaySkillActionBP_Branches_4) == 0x0001B9, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_PlaySkillActionBP_Branches_4' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_PlaySkillActionBP_ReturnValue_4) == 0x0001C0, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_PlaySkillActionBP_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_SwitchEnum_CmpSuccess_9) == 0x0001C8, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_SwitchEnum_CmpSuccess_9' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_PlaySkillActionBP_Branches_5) == 0x0001C9, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_PlaySkillActionBP_Branches_5' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_PlaySkillActionBP_ReturnValue_5) == 0x0001D0, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_PlaySkillActionBP_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_SwitchEnum_CmpSuccess_10) == 0x0001D8, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_SwitchEnum_CmpSuccess_10' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_DynamicCast_AsLPCCharacter_5) == 0x0001E0, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_DynamicCast_AsLPCCharacter_5' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, K2Node_DynamicCast_bSuccess_6) == 0x0001E8, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD, CallFunc_GetWeaponByAttachPoint_ReturnValue_3) == 0x0001F0, "Member 'BP_FirepickAxe_BLD_C_ExecuteUbergraph_BP_FirepickAxe_BLD::CallFunc_GetWeaponByAttachPoint_ReturnValue_3' has a wrong offset!");

// Function BP_FirepickAxe_BLD.BP_FirepickAxe_BLD_C.OnTick
// 0x0004 (0x0004 - 0x0000)
struct BP_FirepickAxe_BLD_C_OnTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FirepickAxe_BLD_C_OnTick) == 0x000004, "Wrong alignment on BP_FirepickAxe_BLD_C_OnTick");
static_assert(sizeof(BP_FirepickAxe_BLD_C_OnTick) == 0x000004, "Wrong size on BP_FirepickAxe_BLD_C_OnTick");
static_assert(offsetof(BP_FirepickAxe_BLD_C_OnTick, DeltaTime) == 0x000000, "Member 'BP_FirepickAxe_BLD_C_OnTick::DeltaTime' has a wrong offset!");

// Function BP_FirepickAxe_BLD.BP_FirepickAxe_BLD_C.OnCommandOccurred_Event
// 0x0028 (0x0028 - 0x0000)
struct BP_FirepickAxe_BLD_C_OnCommandOccurred_Event final
{
public:
	class ULActMgrComponent*                      ActMgrComponent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Command;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Lever;                                             // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipCommandPrerequisitiesCheck;                    // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FirepickAxe_BLD_C_OnCommandOccurred_Event) == 0x000008, "Wrong alignment on BP_FirepickAxe_BLD_C_OnCommandOccurred_Event");
static_assert(sizeof(BP_FirepickAxe_BLD_C_OnCommandOccurred_Event) == 0x000028, "Wrong size on BP_FirepickAxe_BLD_C_OnCommandOccurred_Event");
static_assert(offsetof(BP_FirepickAxe_BLD_C_OnCommandOccurred_Event, ActMgrComponent) == 0x000000, "Member 'BP_FirepickAxe_BLD_C_OnCommandOccurred_Event::ActMgrComponent' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_OnCommandOccurred_Event, TargetActor) == 0x000008, "Member 'BP_FirepickAxe_BLD_C_OnCommandOccurred_Event::TargetActor' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_OnCommandOccurred_Event, Command) == 0x000010, "Member 'BP_FirepickAxe_BLD_C_OnCommandOccurred_Event::Command' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_OnCommandOccurred_Event, Lever) == 0x000018, "Member 'BP_FirepickAxe_BLD_C_OnCommandOccurred_Event::Lever' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_OnCommandOccurred_Event, SkipCommandPrerequisitiesCheck) == 0x000024, "Member 'BP_FirepickAxe_BLD_C_OnCommandOccurred_Event::SkipCommandPrerequisitiesCheck' has a wrong offset!");

// Function BP_FirepickAxe_BLD.BP_FirepickAxe_BLD_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_FirepickAxe_BLD_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FirepickAxe_BLD_C_OnStop) == 0x000008, "Wrong alignment on BP_FirepickAxe_BLD_C_OnStop");
static_assert(sizeof(BP_FirepickAxe_BLD_C_OnStop) == 0x000010, "Wrong size on BP_FirepickAxe_BLD_C_OnStop");
static_assert(offsetof(BP_FirepickAxe_BLD_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_FirepickAxe_BLD_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_FirepickAxe_BLD_C_OnStop, Reason) == 0x000008, "Member 'BP_FirepickAxe_BLD_C_OnStop::Reason' has a wrong offset!");

}

