#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GravityUp

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_GravityUp.BP_GravityUp_C.ExecuteUbergraph_BP_GravityUp
// 0x0090 (0x0090 - 0x0000)
struct BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_GetLCharacterMovementComponentBP_Branches; // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULCharacterMovementComponent*           CallFunc_GetLCharacterMovementComponentBP_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_1;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_GetLCharacterMovementComponentBP_Branches_1; // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULCharacterMovementComponent*           CallFunc_GetLCharacterMovementComponentBP_ReturnValue_1; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TraceForLandingOnFloor_ResultLocation;    // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TraceForLandingOnFloor_ReturnValue;       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp) == 0x000008, "Wrong alignment on BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp");
static_assert(sizeof(BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp) == 0x000090, "Wrong size on BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp");
static_assert(offsetof(BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp, EntryPoint) == 0x000000, "Member 'BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp, K2Node_DynamicCast_AsLPCCharacter) == 0x000008, "Member 'BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp::K2Node_DynamicCast_AsLPCCharacter' has a wrong offset!");
static_assert(offsetof(BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp, CallFunc_GetLCharacterMovementComponentBP_Branches) == 0x000011, "Member 'BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp::CallFunc_GetLCharacterMovementComponentBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp, CallFunc_GetLCharacterMovementComponentBP_ReturnValue) == 0x000018, "Member 'BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp::CallFunc_GetLCharacterMovementComponentBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp, K2Node_Event_ReasonAction) == 0x000028, "Member 'BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp, K2Node_Event_Reason) == 0x000030, "Member 'BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp, K2Node_Event_DeltaTime) == 0x000038, "Member 'BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp, K2Node_DynamicCast_AsLPCCharacter_1) == 0x000040, "Member 'BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp::K2Node_DynamicCast_AsLPCCharacter_1' has a wrong offset!");
static_assert(offsetof(BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp, K2Node_DynamicCast_AsLCharacter) == 0x000050, "Member 'BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp::K2Node_DynamicCast_AsLCharacter' has a wrong offset!");
static_assert(offsetof(BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp, K2Node_DynamicCast_bSuccess_2) == 0x000058, "Member 'BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp, CallFunc_GetLCharacterMovementComponentBP_Branches_1) == 0x000059, "Member 'BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp::CallFunc_GetLCharacterMovementComponentBP_Branches_1' has a wrong offset!");
static_assert(offsetof(BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp, CallFunc_GetLCharacterMovementComponentBP_ReturnValue_1) == 0x000060, "Member 'BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp::CallFunc_GetLCharacterMovementComponentBP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000068, "Member 'BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp, K2Node_SwitchEnum_CmpSuccess_1) == 0x000074, "Member 'BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp, CallFunc_Add_FloatFloat_ReturnValue) == 0x000078, "Member 'BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp, CallFunc_TraceForLandingOnFloor_ResultLocation) == 0x00007C, "Member 'BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp::CallFunc_TraceForLandingOnFloor_ResultLocation' has a wrong offset!");
static_assert(offsetof(BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp, CallFunc_TraceForLandingOnFloor_ReturnValue) == 0x000088, "Member 'BP_GravityUp_C_ExecuteUbergraph_BP_GravityUp::CallFunc_TraceForLandingOnFloor_ReturnValue' has a wrong offset!");

// Function BP_GravityUp.BP_GravityUp_C.OnTick
// 0x0004 (0x0004 - 0x0000)
struct BP_GravityUp_C_OnTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GravityUp_C_OnTick) == 0x000004, "Wrong alignment on BP_GravityUp_C_OnTick");
static_assert(sizeof(BP_GravityUp_C_OnTick) == 0x000004, "Wrong size on BP_GravityUp_C_OnTick");
static_assert(offsetof(BP_GravityUp_C_OnTick, DeltaTime) == 0x000000, "Member 'BP_GravityUp_C_OnTick::DeltaTime' has a wrong offset!");

// Function BP_GravityUp.BP_GravityUp_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_GravityUp_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_GravityUp_C_OnStop) == 0x000008, "Wrong alignment on BP_GravityUp_C_OnStop");
static_assert(sizeof(BP_GravityUp_C_OnStop) == 0x000010, "Wrong size on BP_GravityUp_C_OnStop");
static_assert(offsetof(BP_GravityUp_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_GravityUp_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_GravityUp_C_OnStop, Reason) == 0x000008, "Member 'BP_GravityUp_C_OnStop::Reason' has a wrong offset!");

}

