#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HitProcContext

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_HitProcContext.BP_HitProcContext_C.OnPrepareBP
// 0x0001 (0x0001 - 0x0000)
struct BP_HitProcContext_C_OnPrepareBP final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HitProcContext_C_OnPrepareBP) == 0x000001, "Wrong alignment on BP_HitProcContext_C_OnPrepareBP");
static_assert(sizeof(BP_HitProcContext_C_OnPrepareBP) == 0x000001, "Wrong size on BP_HitProcContext_C_OnPrepareBP");
static_assert(offsetof(BP_HitProcContext_C_OnPrepareBP, ReturnValue) == 0x000000, "Member 'BP_HitProcContext_C_OnPrepareBP::ReturnValue' has a wrong offset!");

// Function BP_HitProcContext.BP_HitProcContext_C.ExecuteUbergraph_BP_HitProcContext
// 0x0004 (0x0004 - 0x0000)
struct BP_HitProcContext_C_ExecuteUbergraph_BP_HitProcContext final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HitProcContext_C_ExecuteUbergraph_BP_HitProcContext) == 0x000004, "Wrong alignment on BP_HitProcContext_C_ExecuteUbergraph_BP_HitProcContext");
static_assert(sizeof(BP_HitProcContext_C_ExecuteUbergraph_BP_HitProcContext) == 0x000004, "Wrong size on BP_HitProcContext_C_ExecuteUbergraph_BP_HitProcContext");
static_assert(offsetof(BP_HitProcContext_C_ExecuteUbergraph_BP_HitProcContext, EntryPoint) == 0x000000, "Member 'BP_HitProcContext_C_ExecuteUbergraph_BP_HitProcContext::EntryPoint' has a wrong offset!");

}

