#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HitProcContext

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HitProcContext.BP_HitProcContext_C
// 0x0040 (0x0BA0 - 0x0B60)
class UBP_HitProcContext_C final : public ULHitProcContext
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   Processed_CameraShakeCodeName;                     // 0x0B68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Processed_PlayRisingAttackerFreeze;                // 0x0B70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Processed_Victim_PlayPhysicsHit;                   // 0x0B71(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Processed_Attacker_ObjectRepulseTriggered;         // 0x0B72(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B73[0x5];                                      // 0x0B73(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              Processed_LastSocketTracerFxPlayTime;              // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Test_ToughDamage;                                  // 0x0B80(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B84[0x4];                                      // 0x0B84(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              Processed_LastSocketTracerSFxPlayTime;             // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Processed_Attacker_WeaponBreakTriggered;           // 0x0B90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B91[0x3];                                      // 0x0B91(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Cached_DeferredGroggyPoint;                        // 0x0B94(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Test_Processed_Attacker_NPCHitRepulseTriggered;    // 0x0B98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ToughBreak;                                        // 0x0B99(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	bool OnPrepareBP();
	void OnResetBP();
	void ExecuteUbergraph_BP_HitProcContext(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HitProcContext_C">();
	}
	static class UBP_HitProcContext_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_HitProcContext_C>();
	}
};
static_assert(alignof(UBP_HitProcContext_C) == 0x000010, "Wrong alignment on UBP_HitProcContext_C");
static_assert(sizeof(UBP_HitProcContext_C) == 0x000BA0, "Wrong size on UBP_HitProcContext_C");
static_assert(offsetof(UBP_HitProcContext_C, UberGraphFrame) == 0x000B60, "Member 'UBP_HitProcContext_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_HitProcContext_C, Processed_CameraShakeCodeName) == 0x000B68, "Member 'UBP_HitProcContext_C::Processed_CameraShakeCodeName' has a wrong offset!");
static_assert(offsetof(UBP_HitProcContext_C, Processed_PlayRisingAttackerFreeze) == 0x000B70, "Member 'UBP_HitProcContext_C::Processed_PlayRisingAttackerFreeze' has a wrong offset!");
static_assert(offsetof(UBP_HitProcContext_C, Processed_Victim_PlayPhysicsHit) == 0x000B71, "Member 'UBP_HitProcContext_C::Processed_Victim_PlayPhysicsHit' has a wrong offset!");
static_assert(offsetof(UBP_HitProcContext_C, Processed_Attacker_ObjectRepulseTriggered) == 0x000B72, "Member 'UBP_HitProcContext_C::Processed_Attacker_ObjectRepulseTriggered' has a wrong offset!");
static_assert(offsetof(UBP_HitProcContext_C, Processed_LastSocketTracerFxPlayTime) == 0x000B78, "Member 'UBP_HitProcContext_C::Processed_LastSocketTracerFxPlayTime' has a wrong offset!");
static_assert(offsetof(UBP_HitProcContext_C, Test_ToughDamage) == 0x000B80, "Member 'UBP_HitProcContext_C::Test_ToughDamage' has a wrong offset!");
static_assert(offsetof(UBP_HitProcContext_C, Processed_LastSocketTracerSFxPlayTime) == 0x000B88, "Member 'UBP_HitProcContext_C::Processed_LastSocketTracerSFxPlayTime' has a wrong offset!");
static_assert(offsetof(UBP_HitProcContext_C, Processed_Attacker_WeaponBreakTriggered) == 0x000B90, "Member 'UBP_HitProcContext_C::Processed_Attacker_WeaponBreakTriggered' has a wrong offset!");
static_assert(offsetof(UBP_HitProcContext_C, Cached_DeferredGroggyPoint) == 0x000B94, "Member 'UBP_HitProcContext_C::Cached_DeferredGroggyPoint' has a wrong offset!");
static_assert(offsetof(UBP_HitProcContext_C, Test_Processed_Attacker_NPCHitRepulseTriggered) == 0x000B98, "Member 'UBP_HitProcContext_C::Test_Processed_Attacker_NPCHitRepulseTriggered' has a wrong offset!");
static_assert(offsetof(UBP_HitProcContext_C, ToughBreak) == 0x000B99, "Member 'UBP_HitProcContext_C::ToughBreak' has a wrong offset!");

}

