#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Horseman_NoWheel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Horseman_NoWheel.BP_Horseman_NoWheel_C.ExecuteUbergraph_BP_Horseman_NoWheel
// 0x0004 (0x0004 - 0x0000)
struct BP_Horseman_NoWheel_C_ExecuteUbergraph_BP_Horseman_NoWheel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Horseman_NoWheel_C_ExecuteUbergraph_BP_Horseman_NoWheel) == 0x000004, "Wrong alignment on BP_Horseman_NoWheel_C_ExecuteUbergraph_BP_Horseman_NoWheel");
static_assert(sizeof(BP_Horseman_NoWheel_C_ExecuteUbergraph_BP_Horseman_NoWheel) == 0x000004, "Wrong size on BP_Horseman_NoWheel_C_ExecuteUbergraph_BP_Horseman_NoWheel");
static_assert(offsetof(BP_Horseman_NoWheel_C_ExecuteUbergraph_BP_Horseman_NoWheel, EntryPoint) == 0x000000, "Member 'BP_Horseman_NoWheel_C_ExecuteUbergraph_BP_Horseman_NoWheel::EntryPoint' has a wrong offset!");

// Function BP_Horseman_NoWheel.BP_Horseman_NoWheel_C.OnCanHitOccurDecoMesh
// 0x0168 (0x0168 - 0x0000)
struct BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh final
{
public:
	class AActor*                                 Attacker;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Victim;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitResult;                                         // 0x0010(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x0098(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B[0x1];                                       // 0x009B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULEquipmentComponent*                   CallFunc_GetEquipmentComponentBP_ReturnValue;      // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasDecoMeshResponseCollision_ReturnValue; // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh) == 0x000008, "Wrong alignment on BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh");
static_assert(sizeof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh) == 0x000168, "Wrong size on BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, Attacker) == 0x000000, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::Attacker' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, Victim) == 0x000008, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::Victim' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, HitResult) == 0x000010, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::HitResult' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, ReturnValue) == 0x000098, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, CallFunc_BreakHitResult_bBlockingHit) == 0x000099, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, CallFunc_BreakHitResult_bInitialOverlap) == 0x00009A, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, CallFunc_BreakHitResult_Time) == 0x00009C, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, CallFunc_BreakHitResult_Distance) == 0x0000A0, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, CallFunc_BreakHitResult_Location) == 0x0000A4, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, CallFunc_BreakHitResult_ImpactPoint) == 0x0000B0, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, CallFunc_BreakHitResult_Normal) == 0x0000BC, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, CallFunc_BreakHitResult_ImpactNormal) == 0x0000C8, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, CallFunc_BreakHitResult_PhysMat) == 0x0000D8, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, CallFunc_BreakHitResult_HitActor) == 0x0000E0, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, CallFunc_BreakHitResult_HitComponent) == 0x0000E8, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, CallFunc_BreakHitResult_HitBoneName) == 0x0000F0, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, CallFunc_BreakHitResult_HitItem) == 0x0000F8, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, CallFunc_BreakHitResult_ElementIndex) == 0x0000FC, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, CallFunc_BreakHitResult_FaceIndex) == 0x000100, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, CallFunc_BreakHitResult_TraceStart) == 0x000104, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, CallFunc_BreakHitResult_TraceEnd) == 0x000110, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00011C, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, CallFunc_GetEquipmentComponentBP_ReturnValue) == 0x000128, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::CallFunc_GetEquipmentComponentBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000130, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, CallFunc_IsValid_ReturnValue) == 0x00013C, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000140, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, CallFunc_HasDecoMeshResponseCollision_ReturnValue) == 0x00014C, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::CallFunc_HasDecoMeshResponseCollision_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, CallFunc_GetActorForwardVector_ReturnValue) == 0x000150, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, CallFunc_Dot_VectorVector_ReturnValue) == 0x00015C, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, CallFunc_Less_FloatFloat_ReturnValue) == 0x000160, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh, CallFunc_BooleanAND_ReturnValue) == 0x000161, "Member 'BP_Horseman_NoWheel_C_OnCanHitOccurDecoMesh::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

