#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Humanity

#include "Basic.hpp"

#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BP_Humanity.BP_Humanity_C.ExecuteUbergraph_BP_Humanity
// 0x0040 (0x0040 - 0x0000)
struct BP_Humanity_C_ExecuteUbergraph_BP_Humanity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLAttachedEffectSet                    CallFunc_PlayFxCommon_Attach_ReturnValue;          // 0x0004(0x001C)(NoDestructor, ContainsInstancedReference)
	struct FLAttachedEffectSet                    CallFunc_PlayFxCommon_Attach_ReturnValue_1;        // 0x0020(0x001C)(NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Humanity_C_ExecuteUbergraph_BP_Humanity) == 0x000004, "Wrong alignment on BP_Humanity_C_ExecuteUbergraph_BP_Humanity");
static_assert(sizeof(BP_Humanity_C_ExecuteUbergraph_BP_Humanity) == 0x000040, "Wrong size on BP_Humanity_C_ExecuteUbergraph_BP_Humanity");
static_assert(offsetof(BP_Humanity_C_ExecuteUbergraph_BP_Humanity, EntryPoint) == 0x000000, "Member 'BP_Humanity_C_ExecuteUbergraph_BP_Humanity::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Humanity_C_ExecuteUbergraph_BP_Humanity, CallFunc_PlayFxCommon_Attach_ReturnValue) == 0x000004, "Member 'BP_Humanity_C_ExecuteUbergraph_BP_Humanity::CallFunc_PlayFxCommon_Attach_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Humanity_C_ExecuteUbergraph_BP_Humanity, CallFunc_PlayFxCommon_Attach_ReturnValue_1) == 0x000020, "Member 'BP_Humanity_C_ExecuteUbergraph_BP_Humanity::CallFunc_PlayFxCommon_Attach_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Humanity_C_ExecuteUbergraph_BP_Humanity, K2Node_SwitchName_CmpSuccess) == 0x00003C, "Member 'BP_Humanity_C_ExecuteUbergraph_BP_Humanity::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

}

