#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Hold_ChainScythe

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Hold_ChainScythe.BP_Hold_ChainScythe_C
// 0x0010 (0x0280 - 0x0270)
class UBP_Hold_ChainScythe_C final : public ULAction_MultiAnim
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          SwingStarted;                                      // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Swing_End_Type;                                    // 0x0279(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Hold_ChainScythe(int32 EntryPoint);
	void StaminaExhausted();
	void OnTick(float DeltaTime);
	void OnCommandOccurred_Event(class ULActMgrComponent* ActMgrComponent, class AActor* TargetActor, class FName Command, const struct FVector& Lever, bool SkipCommandPrerequisitiesCheck);
	void OnStop(class ULActBase* ReasonAction, class FName Reason);
	void OnStart();
	int32 OnSelectNextAnim(class UAnimMontage* Montage, bool bInterrupted, int32 CurrentAnimIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Hold_ChainScythe_C">();
	}
	static class UBP_Hold_ChainScythe_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Hold_ChainScythe_C>();
	}
};
static_assert(alignof(UBP_Hold_ChainScythe_C) == 0x000008, "Wrong alignment on UBP_Hold_ChainScythe_C");
static_assert(sizeof(UBP_Hold_ChainScythe_C) == 0x000280, "Wrong size on UBP_Hold_ChainScythe_C");
static_assert(offsetof(UBP_Hold_ChainScythe_C, UberGraphFrame) == 0x000270, "Member 'UBP_Hold_ChainScythe_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_Hold_ChainScythe_C, SwingStarted) == 0x000278, "Member 'UBP_Hold_ChainScythe_C::SwingStarted' has a wrong offset!");
static_assert(offsetof(UBP_Hold_ChainScythe_C, Swing_End_Type) == 0x000279, "Member 'UBP_Hold_ChainScythe_C::Swing_End_Type' has a wrong offset!");

}

