#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ItemSpot_Chest

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ItemSpot_Chest.BP_ItemSpot_Chest_C.ExecuteUbergraph_BP_ItemSpot_Chest
// 0x0130 (0x0130 - 0x0000)
struct BP_ItemSpot_Chest_C_ExecuteUbergraph_BP_ItemSpot_Chest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddLocalOffset_SweepHitResult;         // 0x001C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddLocalOffset_SweepHitResult_1;       // 0x00A4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_ItemSpot_Chest_C_ExecuteUbergraph_BP_ItemSpot_Chest) == 0x000008, "Wrong alignment on BP_ItemSpot_Chest_C_ExecuteUbergraph_BP_ItemSpot_Chest");
static_assert(sizeof(BP_ItemSpot_Chest_C_ExecuteUbergraph_BP_ItemSpot_Chest) == 0x000130, "Wrong size on BP_ItemSpot_Chest_C_ExecuteUbergraph_BP_ItemSpot_Chest");
static_assert(offsetof(BP_ItemSpot_Chest_C_ExecuteUbergraph_BP_ItemSpot_Chest, EntryPoint) == 0x000000, "Member 'BP_ItemSpot_Chest_C_ExecuteUbergraph_BP_ItemSpot_Chest::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ItemSpot_Chest_C_ExecuteUbergraph_BP_ItemSpot_Chest, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000004, "Member 'BP_ItemSpot_Chest_C_ExecuteUbergraph_BP_ItemSpot_Chest::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemSpot_Chest_C_ExecuteUbergraph_BP_ItemSpot_Chest, CallFunc_Conv_NameToString_ReturnValue) == 0x000008, "Member 'BP_ItemSpot_Chest_C_ExecuteUbergraph_BP_ItemSpot_Chest::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemSpot_Chest_C_ExecuteUbergraph_BP_ItemSpot_Chest, CallFunc_Contains_ReturnValue) == 0x000018, "Member 'BP_ItemSpot_Chest_C_ExecuteUbergraph_BP_ItemSpot_Chest::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ItemSpot_Chest_C_ExecuteUbergraph_BP_ItemSpot_Chest, CallFunc_K2_AddLocalOffset_SweepHitResult) == 0x00001C, "Member 'BP_ItemSpot_Chest_C_ExecuteUbergraph_BP_ItemSpot_Chest::CallFunc_K2_AddLocalOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ItemSpot_Chest_C_ExecuteUbergraph_BP_ItemSpot_Chest, CallFunc_K2_AddLocalOffset_SweepHitResult_1) == 0x0000A4, "Member 'BP_ItemSpot_Chest_C_ExecuteUbergraph_BP_ItemSpot_Chest::CallFunc_K2_AddLocalOffset_SweepHitResult_1' has a wrong offset!");

}

