#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InfinityFootstepComponent

#include "Basic.hpp"

#include "BS_FootstepTemplate_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "BE_FootstepModifier_structs.hpp"
#include "Engine_structs.hpp"
#include "BS_FootstepLoop_structs.hpp"
#include "BS_FootstepAttachement_structs.hpp"


namespace SDK::Params
{

// Function BP_InfinityFootstepComponent.BP_InfinityFootstepComponent_C.ExecuteUbergraph_BP_InfinityFootstepComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_InfinityFootstepComponent_C_ExecuteUbergraph_BP_InfinityFootstepComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InfinityFootstepComponent_C_ExecuteUbergraph_BP_InfinityFootstepComponent) == 0x000004, "Wrong alignment on BP_InfinityFootstepComponent_C_ExecuteUbergraph_BP_InfinityFootstepComponent");
static_assert(sizeof(BP_InfinityFootstepComponent_C_ExecuteUbergraph_BP_InfinityFootstepComponent) == 0x000008, "Wrong size on BP_InfinityFootstepComponent_C_ExecuteUbergraph_BP_InfinityFootstepComponent");
static_assert(offsetof(BP_InfinityFootstepComponent_C_ExecuteUbergraph_BP_InfinityFootstepComponent, EntryPoint) == 0x000000, "Member 'BP_InfinityFootstepComponent_C_ExecuteUbergraph_BP_InfinityFootstepComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_ExecuteUbergraph_BP_InfinityFootstepComponent, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_InfinityFootstepComponent_C_ExecuteUbergraph_BP_InfinityFootstepComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function BP_InfinityFootstepComponent.BP_InfinityFootstepComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_InfinityFootstepComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InfinityFootstepComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_InfinityFootstepComponent_C_ReceiveTick");
static_assert(sizeof(BP_InfinityFootstepComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_InfinityFootstepComponent_C_ReceiveTick");
static_assert(offsetof(BP_InfinityFootstepComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_InfinityFootstepComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_InfinityFootstepComponent.BP_InfinityFootstepComponent_C.Play
// 0x00D0 (0x00D0 - 0x0000)
struct BP_InfinityFootstepComponent_C_Play final
{
public:
	struct FBS_FootstepAttachement                Attachement;                                       // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Intensity;                                         // 0x0050(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_FootstepPreset_C*                   LFootstepInstance;                                 // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_FootstepPreset_C*                   CallFunc_FindFootstepPreset_Preset;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_Spawn_SpawnedEmitter;                     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_Spawn_SpawnedAudio;                       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UParticleSystemComponent> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0090(0x0028)(InstancedReference, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InfinityFootstepComponent_C_Play) == 0x000010, "Wrong alignment on BP_InfinityFootstepComponent_C_Play");
static_assert(sizeof(BP_InfinityFootstepComponent_C_Play) == 0x0000D0, "Wrong size on BP_InfinityFootstepComponent_C_Play");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Play, Attachement) == 0x000000, "Member 'BP_InfinityFootstepComponent_C_Play::Attachement' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Play, Intensity) == 0x000050, "Member 'BP_InfinityFootstepComponent_C_Play::Intensity' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Play, Mesh) == 0x000058, "Member 'BP_InfinityFootstepComponent_C_Play::Mesh' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Play, LFootstepInstance) == 0x000060, "Member 'BP_InfinityFootstepComponent_C_Play::LFootstepInstance' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Play, CallFunc_IsActive_ReturnValue) == 0x000068, "Member 'BP_InfinityFootstepComponent_C_Play::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Play, CallFunc_FindFootstepPreset_Preset) == 0x000070, "Member 'BP_InfinityFootstepComponent_C_Play::CallFunc_FindFootstepPreset_Preset' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Play, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000078, "Member 'BP_InfinityFootstepComponent_C_Play::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Play, CallFunc_IsValid_ReturnValue) == 0x000079, "Member 'BP_InfinityFootstepComponent_C_Play::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Play, CallFunc_Spawn_SpawnedEmitter) == 0x000080, "Member 'BP_InfinityFootstepComponent_C_Play::CallFunc_Spawn_SpawnedEmitter' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Play, CallFunc_Spawn_SpawnedAudio) == 0x000088, "Member 'BP_InfinityFootstepComponent_C_Play::CallFunc_Spawn_SpawnedAudio' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Play, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000090, "Member 'BP_InfinityFootstepComponent_C_Play::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Play, CallFunc_IsValid_ReturnValue_1) == 0x0000B8, "Member 'BP_InfinityFootstepComponent_C_Play::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Play, CallFunc_Array_Add_ReturnValue) == 0x0000BC, "Member 'BP_InfinityFootstepComponent_C_Play::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Play, CallFunc_Greater_IntInt_ReturnValue) == 0x0000C0, "Member 'BP_InfinityFootstepComponent_C_Play::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function BP_InfinityFootstepComponent.BP_InfinityFootstepComponent_C.Loop
// 0x0100 (0x0100 - 0x0000)
struct BP_InfinityFootstepComponent_C_Loop final
{
public:
	struct FBS_FootstepAttachement                Attachement;                                       // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0050(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VelocityMin;                                       // 0x0058(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBS_FootstepLoop                       K2Node_MakeStruct_BS_FootstepLoop;                 // 0x0060(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InfinityFootstepComponent_C_Loop) == 0x000010, "Wrong alignment on BP_InfinityFootstepComponent_C_Loop");
static_assert(sizeof(BP_InfinityFootstepComponent_C_Loop) == 0x000100, "Wrong size on BP_InfinityFootstepComponent_C_Loop");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Loop, Attachement) == 0x000000, "Member 'BP_InfinityFootstepComponent_C_Loop::Attachement' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Loop, Mesh) == 0x000050, "Member 'BP_InfinityFootstepComponent_C_Loop::Mesh' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Loop, VelocityMin) == 0x000058, "Member 'BP_InfinityFootstepComponent_C_Loop::VelocityMin' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Loop, K2Node_MakeStruct_BS_FootstepLoop) == 0x000060, "Member 'BP_InfinityFootstepComponent_C_Loop::K2Node_MakeStruct_BS_FootstepLoop' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Loop, CallFunc_Array_Add_ReturnValue) == 0x0000F0, "Member 'BP_InfinityFootstepComponent_C_Loop::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_InfinityFootstepComponent.BP_InfinityFootstepComponent_C.FindFootstepPreset
// 0x0220 (0x0220 - 0x0000)
struct BP_InfinityFootstepComponent_C_FindFootstepPreset final
{
public:
	class UPrimitiveComponent*                    Mesh;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBS_FootstepAttachement                Attachement;                                       // 0x0010(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_FootstepPreset_C*                   Preset;                                            // 0x0060(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              SurfaceType;                                       // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                SocketLocation;                                    // 0x006C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_FootstepPreset_C*                   LFootstepInstance;                                 // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MapFootstep_Index;                        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_FootstepPreset_C*                   CallFunc_Map_Find_Value;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ConstParm, ReferenceParm)
	class ABP_FootstepVolume_C*                   CallFunc_GetOverrideVolume_Volume;                 // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array_1;                          // 0x00F0(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x0100(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19A[0x2];                                      // 0x019A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InfinityFootstepComponent_C_FindFootstepPreset) == 0x000010, "Wrong alignment on BP_InfinityFootstepComponent_C_FindFootstepPreset");
static_assert(sizeof(BP_InfinityFootstepComponent_C_FindFootstepPreset) == 0x000220, "Wrong size on BP_InfinityFootstepComponent_C_FindFootstepPreset");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, Mesh) == 0x000000, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::Mesh' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, Attachement) == 0x000010, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::Attachement' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, Preset) == 0x000060, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::Preset' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, SurfaceType) == 0x000068, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::SurfaceType' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, SocketLocation) == 0x00006C, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::SocketLocation' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, LFootstepInstance) == 0x000078, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::LFootstepInstance' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_MapFootstep_Index) == 0x000080, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_MapFootstep_Index' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_Map_Find_Value) == 0x000088, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_Map_Find_ReturnValue) == 0x000090, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_GetOwner_ReturnValue) == 0x000098, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, K2Node_MakeArray_Array) == 0x0000A0, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_GetOverrideVolume_Volume) == 0x0000B0, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_GetOverrideVolume_Volume' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_IsActive_ReturnValue) == 0x0000B9, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_MakeVector_ReturnValue) == 0x0000BC, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_Add_VectorVector_ReturnValue) == 0x0000C8, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_MakeVector_ReturnValue_1) == 0x0000D4, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000E0, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, K2Node_MakeArray_Array_1) == 0x0000F0, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_SphereTraceSingleForObjects_OutHit) == 0x000100, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_SphereTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_SphereTraceSingleForObjects_ReturnValue) == 0x000188, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_SphereTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_GetSocketLocation_ReturnValue) == 0x00018C, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_BreakHitResult_bBlockingHit) == 0x000198, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_BreakHitResult_bInitialOverlap) == 0x000199, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_BreakHitResult_Time) == 0x00019C, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_BreakHitResult_Distance) == 0x0001A0, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_BreakHitResult_Location) == 0x0001A4, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_BreakHitResult_ImpactPoint) == 0x0001B0, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_BreakHitResult_Normal) == 0x0001BC, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_BreakHitResult_ImpactNormal) == 0x0001C8, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_BreakHitResult_PhysMat) == 0x0001D8, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_BreakHitResult_HitActor) == 0x0001E0, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_BreakHitResult_HitComponent) == 0x0001E8, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_BreakHitResult_HitBoneName) == 0x0001F0, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_BreakHitResult_HitItem) == 0x0001F8, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_BreakHitResult_ElementIndex) == 0x0001FC, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_BreakHitResult_FaceIndex) == 0x000200, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_BreakHitResult_TraceStart) == 0x000204, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_BreakHitResult_TraceEnd) == 0x000210, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_FindFootstepPreset, CallFunc_IsValid_ReturnValue_1) == 0x00021C, "Member 'BP_InfinityFootstepComponent_C_FindFootstepPreset::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_InfinityFootstepComponent.BP_InfinityFootstepComponent_C.Initialize
// 0x00D0 (0x00D0 - 0x0000)
struct BP_InfinityFootstepComponent_C_Initialize final
{
public:
	TArray<class UActorComponent*>                OwnerAttachComponents;                             // 0x0000(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EBE_FootstepModifier>                  CallFunc_Map_Keys_Keys;                            // 0x0018(0x0010)(ReferenceParm)
	EBE_FootstepModifier                          CallFunc_Array_Get_Item;                           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBS_FootstepTemplate                   CallFunc_Map_Find_Value;                           // 0x0030(0x0050)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EPhysicalSurface>                      CallFunc_Map_Keys_Keys_1;                          // 0x0088(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPhysicalSurface                              CallFunc_Array_Get_Item_1;                         // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MapFootstep_Index;                        // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Map_Find_Value_1;                         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_FootstepPreset_C*                   CallFunc_SpawnObject_ReturnValue;                  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InfinityFootstepComponent_C_Initialize) == 0x000008, "Wrong alignment on BP_InfinityFootstepComponent_C_Initialize");
static_assert(sizeof(BP_InfinityFootstepComponent_C_Initialize) == 0x0000D0, "Wrong size on BP_InfinityFootstepComponent_C_Initialize");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Initialize, OwnerAttachComponents) == 0x000000, "Member 'BP_InfinityFootstepComponent_C_Initialize::OwnerAttachComponents' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Initialize, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_InfinityFootstepComponent_C_Initialize::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Initialize, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_InfinityFootstepComponent_C_Initialize::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Initialize, CallFunc_Map_Keys_Keys) == 0x000018, "Member 'BP_InfinityFootstepComponent_C_Initialize::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Initialize, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_InfinityFootstepComponent_C_Initialize::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Initialize, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'BP_InfinityFootstepComponent_C_Initialize::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Initialize, CallFunc_Map_Find_Value) == 0x000030, "Member 'BP_InfinityFootstepComponent_C_Initialize::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Initialize, CallFunc_Map_Find_ReturnValue) == 0x000080, "Member 'BP_InfinityFootstepComponent_C_Initialize::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Initialize, CallFunc_Less_IntInt_ReturnValue) == 0x000081, "Member 'BP_InfinityFootstepComponent_C_Initialize::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Initialize, CallFunc_Map_Keys_Keys_1) == 0x000088, "Member 'BP_InfinityFootstepComponent_C_Initialize::CallFunc_Map_Keys_Keys_1' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Initialize, CallFunc_Add_IntInt_ReturnValue) == 0x000098, "Member 'BP_InfinityFootstepComponent_C_Initialize::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Initialize, CallFunc_Array_Length_ReturnValue_1) == 0x00009C, "Member 'BP_InfinityFootstepComponent_C_Initialize::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Initialize, Temp_int_Loop_Counter_Variable_1) == 0x0000A0, "Member 'BP_InfinityFootstepComponent_C_Initialize::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Initialize, Temp_int_Array_Index_Variable_1) == 0x0000A4, "Member 'BP_InfinityFootstepComponent_C_Initialize::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Initialize, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000A8, "Member 'BP_InfinityFootstepComponent_C_Initialize::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Initialize, CallFunc_Array_Get_Item_1) == 0x0000A9, "Member 'BP_InfinityFootstepComponent_C_Initialize::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Initialize, CallFunc_MapFootstep_Index) == 0x0000AC, "Member 'BP_InfinityFootstepComponent_C_Initialize::CallFunc_MapFootstep_Index' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Initialize, CallFunc_Map_Find_Value_1) == 0x0000B0, "Member 'BP_InfinityFootstepComponent_C_Initialize::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Initialize, CallFunc_Map_Find_ReturnValue_1) == 0x0000B8, "Member 'BP_InfinityFootstepComponent_C_Initialize::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Initialize, CallFunc_SpawnObject_ReturnValue) == 0x0000C0, "Member 'BP_InfinityFootstepComponent_C_Initialize::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_Initialize, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000C8, "Member 'BP_InfinityFootstepComponent_C_Initialize::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_InfinityFootstepComponent.BP_InfinityFootstepComponent_C.SetOverrideVolume
// 0x0040 (0x0040 - 0x0000)
struct BP_InfinityFootstepComponent_C_SetOverrideVolume final
{
public:
	class ABP_FootstepVolume_C*                   Volume;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Active;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InsertPosition;                                    // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FootstepVolume_C*                   CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InfinityFootstepComponent_C_SetOverrideVolume) == 0x000008, "Wrong alignment on BP_InfinityFootstepComponent_C_SetOverrideVolume");
static_assert(sizeof(BP_InfinityFootstepComponent_C_SetOverrideVolume) == 0x000040, "Wrong size on BP_InfinityFootstepComponent_C_SetOverrideVolume");
static_assert(offsetof(BP_InfinityFootstepComponent_C_SetOverrideVolume, Volume) == 0x000000, "Member 'BP_InfinityFootstepComponent_C_SetOverrideVolume::Volume' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_SetOverrideVolume, Active) == 0x000008, "Member 'BP_InfinityFootstepComponent_C_SetOverrideVolume::Active' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_SetOverrideVolume, InsertPosition) == 0x00000C, "Member 'BP_InfinityFootstepComponent_C_SetOverrideVolume::InsertPosition' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_SetOverrideVolume, Temp_bool_True_if_break_was_hit_Variable) == 0x000010, "Member 'BP_InfinityFootstepComponent_C_SetOverrideVolume::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_SetOverrideVolume, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BP_InfinityFootstepComponent_C_SetOverrideVolume::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_SetOverrideVolume, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'BP_InfinityFootstepComponent_C_SetOverrideVolume::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_SetOverrideVolume, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_InfinityFootstepComponent_C_SetOverrideVolume::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_SetOverrideVolume, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_InfinityFootstepComponent_C_SetOverrideVolume::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_SetOverrideVolume, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_InfinityFootstepComponent_C_SetOverrideVolume::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_SetOverrideVolume, CallFunc_Array_Find_ReturnValue) == 0x000028, "Member 'BP_InfinityFootstepComponent_C_SetOverrideVolume::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_SetOverrideVolume, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00002C, "Member 'BP_InfinityFootstepComponent_C_SetOverrideVolume::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_SetOverrideVolume, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_InfinityFootstepComponent_C_SetOverrideVolume::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_SetOverrideVolume, CallFunc_Array_Length_ReturnValue_1) == 0x000038, "Member 'BP_InfinityFootstepComponent_C_SetOverrideVolume::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_SetOverrideVolume, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'BP_InfinityFootstepComponent_C_SetOverrideVolume::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_SetOverrideVolume, CallFunc_BooleanAND_ReturnValue) == 0x00003D, "Member 'BP_InfinityFootstepComponent_C_SetOverrideVolume::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_SetOverrideVolume, CallFunc_Less_IntInt_ReturnValue_1) == 0x00003E, "Member 'BP_InfinityFootstepComponent_C_SetOverrideVolume::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_SetOverrideVolume, CallFunc_Array_RemoveItem_ReturnValue) == 0x00003F, "Member 'BP_InfinityFootstepComponent_C_SetOverrideVolume::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

// Function BP_InfinityFootstepComponent.BP_InfinityFootstepComponent_C.GetOverrideVolume
// 0x0048 (0x0048 - 0x0000)
struct BP_InfinityFootstepComponent_C_GetOverrideVolume final
{
public:
	class ABP_FootstepVolume_C*                   Volume;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_FootstepVolume_C*                   Temp;                                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_FootstepVolume_C*                   CurrentVolume;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActive_IsActive;                        // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FootstepVolume_C*                   CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InfinityFootstepComponent_C_GetOverrideVolume) == 0x000008, "Wrong alignment on BP_InfinityFootstepComponent_C_GetOverrideVolume");
static_assert(sizeof(BP_InfinityFootstepComponent_C_GetOverrideVolume) == 0x000048, "Wrong size on BP_InfinityFootstepComponent_C_GetOverrideVolume");
static_assert(offsetof(BP_InfinityFootstepComponent_C_GetOverrideVolume, Volume) == 0x000000, "Member 'BP_InfinityFootstepComponent_C_GetOverrideVolume::Volume' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_GetOverrideVolume, Temp) == 0x000008, "Member 'BP_InfinityFootstepComponent_C_GetOverrideVolume::Temp' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_GetOverrideVolume, CurrentVolume) == 0x000010, "Member 'BP_InfinityFootstepComponent_C_GetOverrideVolume::CurrentVolume' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_GetOverrideVolume, Temp_bool_Variable) == 0x000018, "Member 'BP_InfinityFootstepComponent_C_GetOverrideVolume::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_GetOverrideVolume, Temp_int_Variable) == 0x00001C, "Member 'BP_InfinityFootstepComponent_C_GetOverrideVolume::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_GetOverrideVolume, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_InfinityFootstepComponent_C_GetOverrideVolume::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_GetOverrideVolume, CallFunc_Not_PreBool_ReturnValue) == 0x000024, "Member 'BP_InfinityFootstepComponent_C_GetOverrideVolume::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_GetOverrideVolume, CallFunc_IsActive_IsActive) == 0x000025, "Member 'BP_InfinityFootstepComponent_C_GetOverrideVolume::CallFunc_IsActive_IsActive' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_GetOverrideVolume, CallFunc_Array_LastIndex_ReturnValue) == 0x000028, "Member 'BP_InfinityFootstepComponent_C_GetOverrideVolume::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_GetOverrideVolume, CallFunc_Subtract_IntInt_ReturnValue) == 0x00002C, "Member 'BP_InfinityFootstepComponent_C_GetOverrideVolume::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_GetOverrideVolume, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000030, "Member 'BP_InfinityFootstepComponent_C_GetOverrideVolume::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_GetOverrideVolume, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_InfinityFootstepComponent_C_GetOverrideVolume::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_GetOverrideVolume, CallFunc_BooleanAND_ReturnValue) == 0x000040, "Member 'BP_InfinityFootstepComponent_C_GetOverrideVolume::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_InfinityFootstepComponent.BP_InfinityFootstepComponent_C.SetCustomDilation
// 0x0068 (0x0068 - 0x0000)
struct BP_InfinityFootstepComponent_C_SetCustomDilation final
{
public:
	float                                         Dilation_0;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UParticleSystemComponent> CallFunc_Array_Get_Item;                           // 0x0018(0x0028)(InstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               K2Node_DynamicCast_AsParticle_System_Component;    // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBeingDestroyed_ReturnValue;             // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InfinityFootstepComponent_C_SetCustomDilation) == 0x000008, "Wrong alignment on BP_InfinityFootstepComponent_C_SetCustomDilation");
static_assert(sizeof(BP_InfinityFootstepComponent_C_SetCustomDilation) == 0x000068, "Wrong size on BP_InfinityFootstepComponent_C_SetCustomDilation");
static_assert(offsetof(BP_InfinityFootstepComponent_C_SetCustomDilation, Dilation_0) == 0x000000, "Member 'BP_InfinityFootstepComponent_C_SetCustomDilation::Dilation_0' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_SetCustomDilation, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_InfinityFootstepComponent_C_SetCustomDilation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_SetCustomDilation, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_InfinityFootstepComponent_C_SetCustomDilation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_SetCustomDilation, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'BP_InfinityFootstepComponent_C_SetCustomDilation::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_SetCustomDilation, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000010, "Member 'BP_InfinityFootstepComponent_C_SetCustomDilation::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_SetCustomDilation, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'BP_InfinityFootstepComponent_C_SetCustomDilation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_SetCustomDilation, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_InfinityFootstepComponent_C_SetCustomDilation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_InfinityFootstepComponent_C_SetCustomDilation, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000040, "Member 'BP_InfinityFootstepComponent_C_SetCustomDilation::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
