#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InfinityFootstepComponent

#include "Basic.hpp"

#include "BS_FootstepLoop_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "BE_FootstepModifier_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "BS_FootstepTemplate_structs.hpp"
#include "BE_FootstepAttachement_structs.hpp"
#include "BS_FootstepAttachement_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InfinityFootstepComponent.BP_InfinityFootstepComponent_C
// 0x01A0 (0x0250 - 0x00B0)
class UBP_InfinityFootstepComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<EBE_FootstepModifier, struct FBS_FootstepTemplate> Templates;                                         // 0x00B8(0x0050)(Edit, BlueprintVisible)
	TMap<EBE_FootstepAttachement, struct FBS_FootstepAttachement> Attachements;                                      // 0x0108(0x0050)(Edit, BlueprintVisible)
	TMap<EBE_FootstepAttachement, struct FBS_FootstepAttachement> AttachementLoops;                                  // 0x0158(0x0050)(Edit, BlueprintVisible)
	float                                         TraceDepth;                                        // 0x01A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxEmitters;                                       // 0x01AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FootSize;                                          // 0x01B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, class UBP_FootstepPreset_C*>      Instances;                                         // 0x01B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Dilation;                                          // 0x0208(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_FootstepVolume_C*>           OverrideVolumes;                                   // 0x0210(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class UParticleSystemComponent>> Emitters;                                          // 0x0220(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FBS_FootstepLoop>               ActiveLoops;                                       // 0x0230(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FName                                   AttachementComponentTag;                           // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinVelovity;                                       // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhysicalSurface                              DefaultSurfaceType;                                // 0x024C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_InfinityFootstepComponent(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void Play(const struct FBS_FootstepAttachement& Attachement, float Intensity, class USkeletalMeshComponent* Mesh);
	void Loop(const struct FBS_FootstepAttachement& Attachement, class USkeletalMeshComponent* Mesh, float VelocityMin);
	void FindFootstepPreset(class UPrimitiveComponent* Mesh, const struct FBS_FootstepAttachement& Attachement, class UBP_FootstepPreset_C** Preset);
	void Initialize();
	void SetOverrideVolume(class ABP_FootstepVolume_C* Volume, bool Active);
	void GetOverrideVolume(class ABP_FootstepVolume_C** Volume);
	void SetCustomDilation(float Dilation_0);
	void UpdateEmitters();
	void UpdateLoops();
	void ActivateLoops(class USkeletalMeshComponent* Mesh);
	void RemoveLoopEffects(struct FBS_FootstepLoop& Attachemtn);
	void MapFootstep(EPhysicalSurface Surface, EBE_FootstepModifier Modififer, int32* Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InfinityFootstepComponent_C">();
	}
	static class UBP_InfinityFootstepComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_InfinityFootstepComponent_C>();
	}
};
static_assert(alignof(UBP_InfinityFootstepComponent_C) == 0x000008, "Wrong alignment on UBP_InfinityFootstepComponent_C");
static_assert(sizeof(UBP_InfinityFootstepComponent_C) == 0x000250, "Wrong size on UBP_InfinityFootstepComponent_C");
static_assert(offsetof(UBP_InfinityFootstepComponent_C, UberGraphFrame) == 0x0000B0, "Member 'UBP_InfinityFootstepComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_InfinityFootstepComponent_C, Templates) == 0x0000B8, "Member 'UBP_InfinityFootstepComponent_C::Templates' has a wrong offset!");
static_assert(offsetof(UBP_InfinityFootstepComponent_C, Attachements) == 0x000108, "Member 'UBP_InfinityFootstepComponent_C::Attachements' has a wrong offset!");
static_assert(offsetof(UBP_InfinityFootstepComponent_C, AttachementLoops) == 0x000158, "Member 'UBP_InfinityFootstepComponent_C::AttachementLoops' has a wrong offset!");
static_assert(offsetof(UBP_InfinityFootstepComponent_C, TraceDepth) == 0x0001A8, "Member 'UBP_InfinityFootstepComponent_C::TraceDepth' has a wrong offset!");
static_assert(offsetof(UBP_InfinityFootstepComponent_C, MaxEmitters) == 0x0001AC, "Member 'UBP_InfinityFootstepComponent_C::MaxEmitters' has a wrong offset!");
static_assert(offsetof(UBP_InfinityFootstepComponent_C, FootSize) == 0x0001B0, "Member 'UBP_InfinityFootstepComponent_C::FootSize' has a wrong offset!");
static_assert(offsetof(UBP_InfinityFootstepComponent_C, Instances) == 0x0001B8, "Member 'UBP_InfinityFootstepComponent_C::Instances' has a wrong offset!");
static_assert(offsetof(UBP_InfinityFootstepComponent_C, Dilation) == 0x000208, "Member 'UBP_InfinityFootstepComponent_C::Dilation' has a wrong offset!");
static_assert(offsetof(UBP_InfinityFootstepComponent_C, OverrideVolumes) == 0x000210, "Member 'UBP_InfinityFootstepComponent_C::OverrideVolumes' has a wrong offset!");
static_assert(offsetof(UBP_InfinityFootstepComponent_C, Emitters) == 0x000220, "Member 'UBP_InfinityFootstepComponent_C::Emitters' has a wrong offset!");
static_assert(offsetof(UBP_InfinityFootstepComponent_C, ActiveLoops) == 0x000230, "Member 'UBP_InfinityFootstepComponent_C::ActiveLoops' has a wrong offset!");
static_assert(offsetof(UBP_InfinityFootstepComponent_C, AttachementComponentTag) == 0x000240, "Member 'UBP_InfinityFootstepComponent_C::AttachementComponentTag' has a wrong offset!");
static_assert(offsetof(UBP_InfinityFootstepComponent_C, MinVelovity) == 0x000248, "Member 'UBP_InfinityFootstepComponent_C::MinVelovity' has a wrong offset!");
static_assert(offsetof(UBP_InfinityFootstepComponent_C, DefaultSurfaceType) == 0x00024C, "Member 'UBP_InfinityFootstepComponent_C::DefaultSurfaceType' has a wrong offset!");

}

