#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InfinityDisplacementComponent

#include "Basic.hpp"

#include "BS_DisplacementSocketShape_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InfinityDisplacementComponent.BP_InfinityDisplacementComponent_C
// 0x0048 (0x00F8 - 0x00B0)
class UBP_InfinityDisplacementComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPDS_DisplacementShapes_C*              DisplacementShapesDataAsset;                       // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBS_DisplacementSocketShape>    DisplacementShapesCustomList;                      // 0x00C0(0x0010)(Edit, BlueprintVisible)
	struct FVector2D                              TraceLengthMinMax;                                 // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FTransform>                     PreviousTransforms;                                // 0x00D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FBS_DisplacementSocketShape>    CombinedShapes;                                    // 0x00E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_InfinityDisplacementComponent(int32 EntryPoint);
	void ReceiveBeginPlay();
	void AttachDisplacementShapeData(class USceneComponent* Parent, TArray<struct FBS_DisplacementShape>& Stack);
	void SetDisplacementShapesDataAsset(class UPDS_DisplacementShapes_C* ShapesDataAsset);
	void InitPreviousTransforms();
	void SetCombinedShapes(TArray<struct FBS_DisplacementSocketShape>& CombinedShapes_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InfinityDisplacementComponent_C">();
	}
	static class UBP_InfinityDisplacementComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_InfinityDisplacementComponent_C>();
	}
};
static_assert(alignof(UBP_InfinityDisplacementComponent_C) == 0x000008, "Wrong alignment on UBP_InfinityDisplacementComponent_C");
static_assert(sizeof(UBP_InfinityDisplacementComponent_C) == 0x0000F8, "Wrong size on UBP_InfinityDisplacementComponent_C");
static_assert(offsetof(UBP_InfinityDisplacementComponent_C, UberGraphFrame) == 0x0000B0, "Member 'UBP_InfinityDisplacementComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_InfinityDisplacementComponent_C, DisplacementShapesDataAsset) == 0x0000B8, "Member 'UBP_InfinityDisplacementComponent_C::DisplacementShapesDataAsset' has a wrong offset!");
static_assert(offsetof(UBP_InfinityDisplacementComponent_C, DisplacementShapesCustomList) == 0x0000C0, "Member 'UBP_InfinityDisplacementComponent_C::DisplacementShapesCustomList' has a wrong offset!");
static_assert(offsetof(UBP_InfinityDisplacementComponent_C, TraceLengthMinMax) == 0x0000D0, "Member 'UBP_InfinityDisplacementComponent_C::TraceLengthMinMax' has a wrong offset!");
static_assert(offsetof(UBP_InfinityDisplacementComponent_C, PreviousTransforms) == 0x0000D8, "Member 'UBP_InfinityDisplacementComponent_C::PreviousTransforms' has a wrong offset!");
static_assert(offsetof(UBP_InfinityDisplacementComponent_C, CombinedShapes) == 0x0000E8, "Member 'UBP_InfinityDisplacementComponent_C::CombinedShapes' has a wrong offset!");

}

