#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LNPCCharacterBP_NoneMove_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "LNPCCharacterBP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LNPCCharacterBP_NoneMove_Base.BP_LNPCCharacterBP_NoneMove_Base_C
// 0x0010 (0x14D0 - 0x14C0)
class ABP_LNPCCharacterBP_NoneMove_Base_C final : public ALNPCCharacterBP_C
{
public:
	uint8                                         Pad_14B5[0x3];                                     // 0x14B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_LNPCCharacterBP_NoneMove_Base_C; // 0x14B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Is4WayHit_0;                                       // 0x14C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          FixedNPC_NoneMove;                                 // 0x14C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          FixedNPC_NoneRotation;                             // 0x14C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_LNPCCharacterBP_NoneMove_Base(int32 EntryPoint);
	void ReceivePostBeginPlay();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LNPCCharacterBP_NoneMove_Base_C">();
	}
	static class ABP_LNPCCharacterBP_NoneMove_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LNPCCharacterBP_NoneMove_Base_C>();
	}
};
static_assert(alignof(ABP_LNPCCharacterBP_NoneMove_Base_C) == 0x000010, "Wrong alignment on ABP_LNPCCharacterBP_NoneMove_Base_C");
static_assert(sizeof(ABP_LNPCCharacterBP_NoneMove_Base_C) == 0x0014D0, "Wrong size on ABP_LNPCCharacterBP_NoneMove_Base_C");
static_assert(offsetof(ABP_LNPCCharacterBP_NoneMove_Base_C, UberGraphFrame_BP_LNPCCharacterBP_NoneMove_Base_C) == 0x0014B8, "Member 'ABP_LNPCCharacterBP_NoneMove_Base_C::UberGraphFrame_BP_LNPCCharacterBP_NoneMove_Base_C' has a wrong offset!");
static_assert(offsetof(ABP_LNPCCharacterBP_NoneMove_Base_C, Is4WayHit_0) == 0x0014C0, "Member 'ABP_LNPCCharacterBP_NoneMove_Base_C::Is4WayHit_0' has a wrong offset!");
static_assert(offsetof(ABP_LNPCCharacterBP_NoneMove_Base_C, FixedNPC_NoneMove) == 0x0014C1, "Member 'ABP_LNPCCharacterBP_NoneMove_Base_C::FixedNPC_NoneMove' has a wrong offset!");
static_assert(offsetof(ABP_LNPCCharacterBP_NoneMove_Base_C, FixedNPC_NoneRotation) == 0x0014C2, "Member 'ABP_LNPCCharacterBP_NoneMove_Base_C::FixedNPC_NoneRotation' has a wrong offset!");

}

