#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NPC_Geppetto_nst

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "LNPCCharacterBP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_NPC_Geppetto_nst.BP_NPC_Geppetto_nst_C
// 0x0010 (0x14D0 - 0x14C0)
class ABP_NPC_Geppetto_nst_C final : public ALNPCCharacterBP_C
{
public:
	uint8                                         Pad_14B5[0x3];                                     // 0x14B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_NPC_Geppetto_nst_C;              // 0x14B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ULLevelSkeletalMeshComponent*           Facial;                                            // 0x14C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Is4WayHit_0;                                       // 0x14C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_NPC_Geppetto_nst(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_NPC_Geppetto_nst_C">();
	}
	static class ABP_NPC_Geppetto_nst_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_NPC_Geppetto_nst_C>();
	}
};
static_assert(alignof(ABP_NPC_Geppetto_nst_C) == 0x000010, "Wrong alignment on ABP_NPC_Geppetto_nst_C");
static_assert(sizeof(ABP_NPC_Geppetto_nst_C) == 0x0014D0, "Wrong size on ABP_NPC_Geppetto_nst_C");
static_assert(offsetof(ABP_NPC_Geppetto_nst_C, UberGraphFrame_BP_NPC_Geppetto_nst_C) == 0x0014B8, "Member 'ABP_NPC_Geppetto_nst_C::UberGraphFrame_BP_NPC_Geppetto_nst_C' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Geppetto_nst_C, Facial) == 0x0014C0, "Member 'ABP_NPC_Geppetto_nst_C::Facial' has a wrong offset!");
static_assert(offsetof(ABP_NPC_Geppetto_nst_C, Is4WayHit_0) == 0x0014C8, "Member 'ABP_NPC_Geppetto_nst_C::Is4WayHit_0' has a wrong offset!");

}

