#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ObjectGuide

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ObjectGuide.BP_ObjectGuide_C
// 0x0028 (0x0290 - 0x0268)
class ABP_ObjectGuide_C final : public ALGuideObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_Point;                                          // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         _____0_NS_Point_Scale_B36061DD4EBDEE4D8DF7428DC1C907D8; // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            _____0__Direction_B36061DD4EBDEE4D8DF7428DC1C907D8; // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_285[0x3];                                      // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ___x_0;                                            // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ObjectGuide(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void OnInteractionStart();
	void ___x_0__UpdateFunc();
	void ___x_0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ObjectGuide_C">();
	}
	static class ABP_ObjectGuide_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ObjectGuide_C>();
	}
};
static_assert(alignof(ABP_ObjectGuide_C) == 0x000008, "Wrong alignment on ABP_ObjectGuide_C");
static_assert(sizeof(ABP_ObjectGuide_C) == 0x000290, "Wrong size on ABP_ObjectGuide_C");
static_assert(offsetof(ABP_ObjectGuide_C, UberGraphFrame) == 0x000268, "Member 'ABP_ObjectGuide_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ObjectGuide_C, NS_Point) == 0x000270, "Member 'ABP_ObjectGuide_C::NS_Point' has a wrong offset!");
static_assert(offsetof(ABP_ObjectGuide_C, Root) == 0x000278, "Member 'ABP_ObjectGuide_C::Root' has a wrong offset!");
static_assert(offsetof(ABP_ObjectGuide_C, _____0_NS_Point_Scale_B36061DD4EBDEE4D8DF7428DC1C907D8) == 0x000280, "Member 'ABP_ObjectGuide_C::_____0_NS_Point_Scale_B36061DD4EBDEE4D8DF7428DC1C907D8' has a wrong offset!");
static_assert(offsetof(ABP_ObjectGuide_C, _____0__Direction_B36061DD4EBDEE4D8DF7428DC1C907D8) == 0x000284, "Member 'ABP_ObjectGuide_C::_____0__Direction_B36061DD4EBDEE4D8DF7428DC1C907D8' has a wrong offset!");
static_assert(offsetof(ABP_ObjectGuide_C, ___x_0) == 0x000288, "Member 'ABP_ObjectGuide_C::___x_0' has a wrong offset!");

}

