#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_Design_SniperCannon_Fire

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_Projectile_Design_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Projectile_Design_SniperCannon_Fire.BP_Projectile_Design_SniperCannon_Fire_C
// 0x0018 (0x0340 - 0x0328)
class ABP_Projectile_Design_SniperCannon_Fire_C final : public ABP_Projectile_Design_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Projectile_Design_SniperCannon_Fire_C; // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      FX_Trail;                                          // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bHitDynamicDamageVolume;                           // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Projectile_Design_SniperCannon_Fire(int32 EntryPoint);
	void OnDisappear(ELProjectileDestroyReason Reason, const struct FHitResult& HitResult);
	void OnExplode(ELProjectileDestroyReason Reason, const struct FHitResult& HitResult);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Projectile_Design_SniperCannon_Fire_C">();
	}
	static class ABP_Projectile_Design_SniperCannon_Fire_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Projectile_Design_SniperCannon_Fire_C>();
	}
};
static_assert(alignof(ABP_Projectile_Design_SniperCannon_Fire_C) == 0x000008, "Wrong alignment on ABP_Projectile_Design_SniperCannon_Fire_C");
static_assert(sizeof(ABP_Projectile_Design_SniperCannon_Fire_C) == 0x000340, "Wrong size on ABP_Projectile_Design_SniperCannon_Fire_C");
static_assert(offsetof(ABP_Projectile_Design_SniperCannon_Fire_C, UberGraphFrame_BP_Projectile_Design_SniperCannon_Fire_C) == 0x000328, "Member 'ABP_Projectile_Design_SniperCannon_Fire_C::UberGraphFrame_BP_Projectile_Design_SniperCannon_Fire_C' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_Design_SniperCannon_Fire_C, FX_Trail) == 0x000330, "Member 'ABP_Projectile_Design_SniperCannon_Fire_C::FX_Trail' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_Design_SniperCannon_Fire_C, bHitDynamicDamageVolume) == 0x000338, "Member 'ABP_Projectile_Design_SniperCannon_Fire_C::bHitDynamicDamageVolume' has a wrong offset!");

}

