#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_Design_ATAA3_Rifle

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Projectile_Design_ATAA3_Rifle.BP_Projectile_Design_ATAA3_Rifle_C.CheckUseSubstituteSkillHit
// 0x0170 (0x0170 - 0x0000)
struct BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit final
{
public:
	struct FLProjectileHitInfo                    ProjectileHitInfo;                                 // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FHitResult                             HitResult;                                         // 0x0090(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FName                                   ReturnValue;                                       // 0x0118(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_CheckUseSubstituteSkillHit_ReturnValue;   // 0x0124(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x012C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0134(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13E[0x2];                                      // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ALNPCCharacter*                         K2Node_DynamicCast_AsLNPCCharacter;                // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActMgrComponent*                      CallFunc_GetActMgrComponent_ReturnValue;           // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActBase*                              CallFunc_GetLastPlayingAction_ReturnValue;         // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0164(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit) == 0x000010, "Wrong alignment on BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit");
static_assert(sizeof(BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit) == 0x000170, "Wrong size on BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit");
static_assert(offsetof(BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit, ProjectileHitInfo) == 0x000000, "Member 'BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit::ProjectileHitInfo' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit, HitResult) == 0x000090, "Member 'BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit::HitResult' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit, ReturnValue) == 0x000118, "Member 'BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit, Temp_bool_Variable) == 0x000120, "Member 'BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit, CallFunc_CheckUseSubstituteSkillHit_ReturnValue) == 0x000124, "Member 'BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit::CallFunc_CheckUseSubstituteSkillHit_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit, Temp_name_Variable) == 0x00012C, "Member 'BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit, Temp_name_Variable_1) == 0x000134, "Member 'BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit, CallFunc_IsValid_ReturnValue) == 0x00013C, "Member 'BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit, CallFunc_IsValid_ReturnValue_1) == 0x00013D, "Member 'BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit, K2Node_DynamicCast_AsLNPCCharacter) == 0x000140, "Member 'BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit::K2Node_DynamicCast_AsLNPCCharacter' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit, K2Node_DynamicCast_bSuccess) == 0x000148, "Member 'BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit, CallFunc_GetActMgrComponent_ReturnValue) == 0x000150, "Member 'BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit::CallFunc_GetActMgrComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit, CallFunc_GetLastPlayingAction_ReturnValue) == 0x000158, "Member 'BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit::CallFunc_GetLastPlayingAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit, CallFunc_IsValid_ReturnValue_2) == 0x000160, "Member 'BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000161, "Member 'BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit, K2Node_Select_Default) == 0x000164, "Member 'BP_Projectile_Design_ATAA3_Rifle_C_CheckUseSubstituteSkillHit::K2Node_Select_Default' has a wrong offset!");

}

