#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_FlameThrower

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Projectile_FlameThrower.BP_Projectile_FlameThrower_C
// 0x0130 (0x0500 - 0x03D0)
class ABP_Projectile_FlameThrower_C final : public ALProjectile_NonTypical
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FLProjectileHitInfo                    Hit_Info;                                          // 0x03E0(0x0090)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FHitResult                             Hit_Result;                                        // 0x0470(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)

public:
	void ExecuteUbergraph_BP_Projectile_FlameThrower(int32 EntryPoint);
	void GenerateHit_V2(const struct FLProjectileHitInfo_V2& HitInfo, const struct FVector& Location);
	void GenerateHit(const struct FLProjectileHitInfo& HitInfo, const struct FVector& Location);
	void ProcessHit(const struct FLProjectileHitInfo& HitInfo, const struct FHitResult& HitResult);
	void Start();
	void Stop();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Projectile_FlameThrower_C">();
	}
	static class ABP_Projectile_FlameThrower_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Projectile_FlameThrower_C>();
	}
};
static_assert(alignof(ABP_Projectile_FlameThrower_C) == 0x000010, "Wrong alignment on ABP_Projectile_FlameThrower_C");
static_assert(sizeof(ABP_Projectile_FlameThrower_C) == 0x000500, "Wrong size on ABP_Projectile_FlameThrower_C");
static_assert(offsetof(ABP_Projectile_FlameThrower_C, UberGraphFrame) == 0x0003D0, "Member 'ABP_Projectile_FlameThrower_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_FlameThrower_C, DefaultSceneRoot) == 0x0003D8, "Member 'ABP_Projectile_FlameThrower_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_FlameThrower_C, Hit_Info) == 0x0003E0, "Member 'ABP_Projectile_FlameThrower_C::Hit_Info' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_FlameThrower_C, Hit_Result) == 0x000470, "Member 'ABP_Projectile_FlameThrower_C::Hit_Result' has a wrong offset!");

}

