#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_Fixed_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Projectile_Fixed_Base.BP_Projectile_Fixed_Base_C.ExecuteUbergraph_BP_Projectile_Fixed_Base
// 0x0020 (0x0020 - 0x0000)
struct BP_Projectile_Fixed_Base_C_ExecuteUbergraph_BP_Projectile_Fixed_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Projectile_Design_Base_C*           K2Node_DynamicCast_AsBP_Projectile_Design_Base;    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Projectile_Fixed_Base_C_ExecuteUbergraph_BP_Projectile_Fixed_Base) == 0x000008, "Wrong alignment on BP_Projectile_Fixed_Base_C_ExecuteUbergraph_BP_Projectile_Fixed_Base");
static_assert(sizeof(BP_Projectile_Fixed_Base_C_ExecuteUbergraph_BP_Projectile_Fixed_Base) == 0x000020, "Wrong size on BP_Projectile_Fixed_Base_C_ExecuteUbergraph_BP_Projectile_Fixed_Base");
static_assert(offsetof(BP_Projectile_Fixed_Base_C_ExecuteUbergraph_BP_Projectile_Fixed_Base, EntryPoint) == 0x000000, "Member 'BP_Projectile_Fixed_Base_C_ExecuteUbergraph_BP_Projectile_Fixed_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Fixed_Base_C_ExecuteUbergraph_BP_Projectile_Fixed_Base, K2Node_DynamicCast_AsBP_Projectile_Design_Base) == 0x000008, "Member 'BP_Projectile_Fixed_Base_C_ExecuteUbergraph_BP_Projectile_Fixed_Base::K2Node_DynamicCast_AsBP_Projectile_Design_Base' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Fixed_Base_C_ExecuteUbergraph_BP_Projectile_Fixed_Base, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_Projectile_Fixed_Base_C_ExecuteUbergraph_BP_Projectile_Fixed_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Fixed_Base_C_ExecuteUbergraph_BP_Projectile_Fixed_Base, CallFunc_K2_SetTimer_ReturnValue) == 0x000018, "Member 'BP_Projectile_Fixed_Base_C_ExecuteUbergraph_BP_Projectile_Fixed_Base::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function BP_Projectile_Fixed_Base.BP_Projectile_Fixed_Base_C.FinishProjectile
// 0x0018 (0x0018 - 0x0000)
struct BP_Projectile_Fixed_Base_C_FinishProjectile final
{
public:
	class ULObjectPoolSystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ReturnToRecyclingBin_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_CollisionProfile_NoCollision_ReturnValue; // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Projectile_Fixed_Base_C_FinishProjectile) == 0x000008, "Wrong alignment on BP_Projectile_Fixed_Base_C_FinishProjectile");
static_assert(sizeof(BP_Projectile_Fixed_Base_C_FinishProjectile) == 0x000018, "Wrong size on BP_Projectile_Fixed_Base_C_FinishProjectile");
static_assert(offsetof(BP_Projectile_Fixed_Base_C_FinishProjectile, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'BP_Projectile_Fixed_Base_C_FinishProjectile::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Fixed_Base_C_FinishProjectile, CallFunc_ReturnToRecyclingBin_ReturnValue) == 0x000008, "Member 'BP_Projectile_Fixed_Base_C_FinishProjectile::CallFunc_ReturnToRecyclingBin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Fixed_Base_C_FinishProjectile, CallFunc_CollisionProfile_NoCollision_ReturnValue) == 0x00000C, "Member 'BP_Projectile_Fixed_Base_C_FinishProjectile::CallFunc_CollisionProfile_NoCollision_ReturnValue' has a wrong offset!");

}

