#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_Design_PileBunker_Attach_Ground

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectP_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Projectile_Design_PileBunker_Attach_Ground.BP_Projectile_Design_PileBunker_Attach_Ground_C.ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_GetActiveSlaveArmItemBP_Branches;         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 CallFunc_GetActiveSlaveArmItemBP_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULSlaveArmItem*                         K2Node_DynamicCast_AsLSlave_Arm_Item;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELProjectileDestroyReason                     K2Node_Event_Reason;                               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_HitResult;                            // 0x002C(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_PlayCameraShake_ReturnValue;              // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULDecalComponent*                       CallFunc_SpawnMaterialVaryingDecalAtLocation_ReturnValue; // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground) == 0x000008, "Wrong alignment on BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground");
static_assert(sizeof(BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground) == 0x0000C0, "Wrong size on BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground");
static_assert(offsetof(BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground, EntryPoint) == 0x000000, "Member 'BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground, CallFunc_GetActiveSlaveArmItemBP_Branches) == 0x000005, "Member 'BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground::CallFunc_GetActiveSlaveArmItemBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground, CallFunc_GetActiveSlaveArmItemBP_ReturnValue) == 0x000008, "Member 'BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground::CallFunc_GetActiveSlaveArmItemBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground, K2Node_DynamicCast_AsLSlave_Arm_Item) == 0x000010, "Member 'BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground::K2Node_DynamicCast_AsLSlave_Arm_Item' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00001C, "Member 'BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground, K2Node_Event_Reason) == 0x000028, "Member 'BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground, K2Node_Event_HitResult) == 0x00002C, "Member 'BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground::K2Node_Event_HitResult' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground, CallFunc_PlayCameraShake_ReturnValue) == 0x0000B4, "Member 'BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground::CallFunc_PlayCameraShake_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground, CallFunc_SpawnMaterialVaryingDecalAtLocation_ReturnValue) == 0x0000B8, "Member 'BP_Projectile_Design_PileBunker_Attach_Ground_C_ExecuteUbergraph_BP_Projectile_Design_PileBunker_Attach_Ground::CallFunc_SpawnMaterialVaryingDecalAtLocation_ReturnValue' has a wrong offset!");

// Function BP_Projectile_Design_PileBunker_Attach_Ground.BP_Projectile_Design_PileBunker_Attach_Ground_C.OnExplode
// 0x008C (0x008C - 0x0000)
struct BP_Projectile_Design_PileBunker_Attach_Ground_C_OnExplode final
{
public:
	ELProjectileDestroyReason                     Reason;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             HitResult;                                         // 0x0004(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Projectile_Design_PileBunker_Attach_Ground_C_OnExplode) == 0x000004, "Wrong alignment on BP_Projectile_Design_PileBunker_Attach_Ground_C_OnExplode");
static_assert(sizeof(BP_Projectile_Design_PileBunker_Attach_Ground_C_OnExplode) == 0x00008C, "Wrong size on BP_Projectile_Design_PileBunker_Attach_Ground_C_OnExplode");
static_assert(offsetof(BP_Projectile_Design_PileBunker_Attach_Ground_C_OnExplode, Reason) == 0x000000, "Member 'BP_Projectile_Design_PileBunker_Attach_Ground_C_OnExplode::Reason' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_PileBunker_Attach_Ground_C_OnExplode, HitResult) == 0x000004, "Member 'BP_Projectile_Design_PileBunker_Attach_Ground_C_OnExplode::HitResult' has a wrong offset!");

}

