#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_Wire_Base

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Projectile_Wire_Base.BP_Projectile_Wire_Base_C
// 0x0020 (0x03F0 - 0x03D0)
class ABP_Projectile_Wire_Base_C final : public ALProjectile_NonTypical
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ULProjectileMovementComponent*          LProjectileMovement;                               // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Collision;                                         // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Projectile_Wire_Base(int32 EntryPoint);
	void BndEvt__BP_Projectile_Wire_Base_Collision_K2Node_ComponentBoundEvent_1_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void BndEvt__BP_Projectile_Wire_Base_Collision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void InitializeFromProjectileDesign();
	void ReceiveDestroyed();
	void Stop();
	void OnStopWireAction();
	void ReceiveBeginPlay();
	void GetWireCable(class UCableComponent** NewParam);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Projectile_Wire_Base_C">();
	}
	static class ABP_Projectile_Wire_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Projectile_Wire_Base_C>();
	}
};
static_assert(alignof(ABP_Projectile_Wire_Base_C) == 0x000010, "Wrong alignment on ABP_Projectile_Wire_Base_C");
static_assert(sizeof(ABP_Projectile_Wire_Base_C) == 0x0003F0, "Wrong size on ABP_Projectile_Wire_Base_C");
static_assert(offsetof(ABP_Projectile_Wire_Base_C, UberGraphFrame) == 0x0003D0, "Member 'ABP_Projectile_Wire_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_Wire_Base_C, LProjectileMovement) == 0x0003D8, "Member 'ABP_Projectile_Wire_Base_C::LProjectileMovement' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_Wire_Base_C, Collision) == 0x0003E0, "Member 'ABP_Projectile_Wire_Base_C::Collision' has a wrong offset!");

}

