#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_FlameThrower

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Projectile_FlameThrower.BP_Projectile_FlameThrower_C.ExecuteUbergraph_BP_Projectile_FlameThrower
// 0x0330 (0x0330 - 0x0000)
struct BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActMgrComponent*                      CallFunc_GetActMgrComponent_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetConsumeSlaveMagazinePoint_ReturnValue; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActMgrComponent*                      CallFunc_GetActMgrComponent_ReturnValue_1;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ConsumeSlaveMagazinePoint_ReturnValue;    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_GetLastPlayingAction_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Action_SlaveArm_FlameThrower_C*     K2Node_DynamicCast_AsBP_Action_Slave_Arm_Flame_Thrower; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0xF];                                       // 0x0041(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLProjectileHitInfo                    K2Node_Event_HitInfo_1;                            // 0x0050(0x0090)(ConstParm, NoDestructor)
	struct FVector                                K2Node_Event_Location_1;                           // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAction_SkillFailed_ReturnValue;       // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EF[0x1];                                       // 0x00EF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter;                   // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLProjectileHitInfo                    K2Node_Event_HitInfo_2;                            // 0x0180(0x0090)(ConstParm, NoDestructor)
	struct FHitResult                             K2Node_Event_HitResult;                            // 0x0210(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ULActMgrComponent*                      CallFunc_GetActMgrComponent_ReturnValue_2;         // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLGameObjectHandle                     CallFunc_AddActionState_AutoRemove_ReturnValue;    // 0x02A0(0x0004)(NoDestructor)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLProjectileHitInfo_V2                 K2Node_Event_HitInfo;                              // 0x02A8(0x0030)(ConstParm)
	struct FVector                                K2Node_Event_Location;                             // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_1;               // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetConsumeSlaveMagazinePoint_ReturnValue_1; // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActMgrComponent*                      CallFunc_GetActMgrComponent_ReturnValue_3;         // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ConsumeSlaveMagazinePoint_ReturnValue_1;  // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_GetLastPlayingAction_ReturnValue_1;       // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Action_SlaveArm_FlameThrower_C*     K2Node_DynamicCast_AsBP_Action_Slave_Arm_Flame_Thrower_1; // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULObjectPoolSystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ReturnToRecyclingBin_ReturnValue;         // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower) == 0x000010, "Wrong alignment on BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower");
static_assert(sizeof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower) == 0x000330, "Wrong size on BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, EntryPoint) == 0x000000, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_GetActMgrComponent_ReturnValue) == 0x000008, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_GetActMgrComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, K2Node_DynamicCast_AsLPCCharacter) == 0x000010, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::K2Node_DynamicCast_AsLPCCharacter' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_GetConsumeSlaveMagazinePoint_ReturnValue) == 0x00001C, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_GetConsumeSlaveMagazinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_GetActMgrComponent_ReturnValue_1) == 0x000020, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_GetActMgrComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_ConsumeSlaveMagazinePoint_ReturnValue) == 0x000028, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_ConsumeSlaveMagazinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_GetLastPlayingAction_ReturnValue) == 0x000030, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_GetLastPlayingAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, K2Node_DynamicCast_AsBP_Action_Slave_Arm_Flame_Thrower) == 0x000038, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::K2Node_DynamicCast_AsBP_Action_Slave_Arm_Flame_Thrower' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, K2Node_Event_HitInfo_1) == 0x000050, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::K2Node_Event_HitInfo_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, K2Node_Event_Location_1) == 0x0000E0, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::K2Node_Event_Location_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_PlayAction_SkillFailed_ReturnValue) == 0x0000EC, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_PlayAction_SkillFailed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_BreakHitResult_bBlockingHit) == 0x0000ED, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000EE, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_BreakHitResult_Time) == 0x0000F0, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_BreakHitResult_Distance) == 0x0000F4, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_BreakHitResult_Location) == 0x0000F8, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_BreakHitResult_ImpactPoint) == 0x000104, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_BreakHitResult_Normal) == 0x000110, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_BreakHitResult_ImpactNormal) == 0x00011C, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_BreakHitResult_PhysMat) == 0x000128, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_BreakHitResult_HitActor) == 0x000130, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_BreakHitResult_HitComponent) == 0x000138, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_BreakHitResult_HitBoneName) == 0x000140, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_BreakHitResult_HitItem) == 0x000148, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_BreakHitResult_ElementIndex) == 0x00014C, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_BreakHitResult_FaceIndex) == 0x000150, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_BreakHitResult_TraceStart) == 0x000154, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_BreakHitResult_TraceEnd) == 0x000160, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, K2Node_DynamicCast_AsLCharacter) == 0x000170, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::K2Node_DynamicCast_AsLCharacter' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, K2Node_DynamicCast_bSuccess_2) == 0x000178, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, K2Node_Event_HitInfo_2) == 0x000180, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::K2Node_Event_HitInfo_2' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, K2Node_Event_HitResult) == 0x000210, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::K2Node_Event_HitResult' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_GetActMgrComponent_ReturnValue_2) == 0x000298, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_GetActMgrComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_AddActionState_AutoRemove_ReturnValue) == 0x0002A0, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_AddActionState_AutoRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, K2Node_Event_HitInfo) == 0x0002A8, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, K2Node_Event_Location) == 0x0002D8, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::K2Node_Event_Location' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, K2Node_DynamicCast_AsLPCCharacter_1) == 0x0002E8, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::K2Node_DynamicCast_AsLPCCharacter_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, K2Node_DynamicCast_bSuccess_3) == 0x0002F0, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_GetConsumeSlaveMagazinePoint_ReturnValue_1) == 0x0002F4, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_GetConsumeSlaveMagazinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_GetActMgrComponent_ReturnValue_3) == 0x0002F8, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_GetActMgrComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_ConsumeSlaveMagazinePoint_ReturnValue_1) == 0x000300, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_ConsumeSlaveMagazinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_GetLastPlayingAction_ReturnValue_1) == 0x000308, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_GetLastPlayingAction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, K2Node_DynamicCast_AsBP_Action_Slave_Arm_Flame_Thrower_1) == 0x000310, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::K2Node_DynamicCast_AsBP_Action_Slave_Arm_Flame_Thrower_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, K2Node_DynamicCast_bSuccess_4) == 0x000318, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000320, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower, CallFunc_ReturnToRecyclingBin_ReturnValue) == 0x000328, "Member 'BP_Projectile_FlameThrower_C_ExecuteUbergraph_BP_Projectile_FlameThrower::CallFunc_ReturnToRecyclingBin_ReturnValue' has a wrong offset!");

// Function BP_Projectile_FlameThrower.BP_Projectile_FlameThrower_C.GenerateHit_V2
// 0x0040 (0x0040 - 0x0000)
struct BP_Projectile_FlameThrower_C_GenerateHit_V2 final
{
public:
	struct FLProjectileHitInfo_V2                 HitInfo;                                           // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Location;                                          // 0x0030(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Projectile_FlameThrower_C_GenerateHit_V2) == 0x000008, "Wrong alignment on BP_Projectile_FlameThrower_C_GenerateHit_V2");
static_assert(sizeof(BP_Projectile_FlameThrower_C_GenerateHit_V2) == 0x000040, "Wrong size on BP_Projectile_FlameThrower_C_GenerateHit_V2");
static_assert(offsetof(BP_Projectile_FlameThrower_C_GenerateHit_V2, HitInfo) == 0x000000, "Member 'BP_Projectile_FlameThrower_C_GenerateHit_V2::HitInfo' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_GenerateHit_V2, Location) == 0x000030, "Member 'BP_Projectile_FlameThrower_C_GenerateHit_V2::Location' has a wrong offset!");

// Function BP_Projectile_FlameThrower.BP_Projectile_FlameThrower_C.GenerateHit
// 0x00A0 (0x00A0 - 0x0000)
struct BP_Projectile_FlameThrower_C_GenerateHit final
{
public:
	struct FLProjectileHitInfo                    HitInfo;                                           // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FVector                                Location;                                          // 0x0090(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Projectile_FlameThrower_C_GenerateHit) == 0x000010, "Wrong alignment on BP_Projectile_FlameThrower_C_GenerateHit");
static_assert(sizeof(BP_Projectile_FlameThrower_C_GenerateHit) == 0x0000A0, "Wrong size on BP_Projectile_FlameThrower_C_GenerateHit");
static_assert(offsetof(BP_Projectile_FlameThrower_C_GenerateHit, HitInfo) == 0x000000, "Member 'BP_Projectile_FlameThrower_C_GenerateHit::HitInfo' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_GenerateHit, Location) == 0x000090, "Member 'BP_Projectile_FlameThrower_C_GenerateHit::Location' has a wrong offset!");

// Function BP_Projectile_FlameThrower.BP_Projectile_FlameThrower_C.ProcessHit
// 0x0120 (0x0120 - 0x0000)
struct BP_Projectile_FlameThrower_C_ProcessHit final
{
public:
	struct FLProjectileHitInfo                    HitInfo;                                           // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FHitResult                             HitResult;                                         // 0x0090(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Projectile_FlameThrower_C_ProcessHit) == 0x000010, "Wrong alignment on BP_Projectile_FlameThrower_C_ProcessHit");
static_assert(sizeof(BP_Projectile_FlameThrower_C_ProcessHit) == 0x000120, "Wrong size on BP_Projectile_FlameThrower_C_ProcessHit");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ProcessHit, HitInfo) == 0x000000, "Member 'BP_Projectile_FlameThrower_C_ProcessHit::HitInfo' has a wrong offset!");
static_assert(offsetof(BP_Projectile_FlameThrower_C_ProcessHit, HitResult) == 0x000090, "Member 'BP_Projectile_FlameThrower_C_ProcessHit::HitResult' has a wrong offset!");

}

