#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_Design_FlameThrower_Lv3

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Projectile_Design_FlameThrower_Lv3.BP_Projectile_Design_FlameThrower_Lv3_C.ExecuteUbergraph_BP_Projectile_Design_FlameThrower_Lv3
// 0x0020 (0x0020 - 0x0000)
struct BP_Projectile_Design_FlameThrower_Lv3_C_ExecuteUbergraph_BP_Projectile_Design_FlameThrower_Lv3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_GetLastPlayingAction_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Action_SlaveArm_FlameThrower_C*     K2Node_DynamicCast_AsBP_Action_Slave_Arm_Flame_Thrower; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Projectile_Design_FlameThrower_Lv3_C_ExecuteUbergraph_BP_Projectile_Design_FlameThrower_Lv3) == 0x000008, "Wrong alignment on BP_Projectile_Design_FlameThrower_Lv3_C_ExecuteUbergraph_BP_Projectile_Design_FlameThrower_Lv3");
static_assert(sizeof(BP_Projectile_Design_FlameThrower_Lv3_C_ExecuteUbergraph_BP_Projectile_Design_FlameThrower_Lv3) == 0x000020, "Wrong size on BP_Projectile_Design_FlameThrower_Lv3_C_ExecuteUbergraph_BP_Projectile_Design_FlameThrower_Lv3");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_ExecuteUbergraph_BP_Projectile_Design_FlameThrower_Lv3, EntryPoint) == 0x000000, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_ExecuteUbergraph_BP_Projectile_Design_FlameThrower_Lv3::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_ExecuteUbergraph_BP_Projectile_Design_FlameThrower_Lv3, CallFunc_GetLastPlayingAction_ReturnValue) == 0x000008, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_ExecuteUbergraph_BP_Projectile_Design_FlameThrower_Lv3::CallFunc_GetLastPlayingAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_ExecuteUbergraph_BP_Projectile_Design_FlameThrower_Lv3, K2Node_DynamicCast_AsBP_Action_Slave_Arm_Flame_Thrower) == 0x000010, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_ExecuteUbergraph_BP_Projectile_Design_FlameThrower_Lv3::K2Node_DynamicCast_AsBP_Action_Slave_Arm_Flame_Thrower' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_ExecuteUbergraph_BP_Projectile_Design_FlameThrower_Lv3, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_ExecuteUbergraph_BP_Projectile_Design_FlameThrower_Lv3::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_ExecuteUbergraph_BP_Projectile_Design_FlameThrower_Lv3, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000019, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_ExecuteUbergraph_BP_Projectile_Design_FlameThrower_Lv3::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_Projectile_Design_FlameThrower_Lv3.BP_Projectile_Design_FlameThrower_Lv3_C.CheckUseSubstituteSkillHit
// 0x0230 (0x0230 - 0x0000)
struct BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit final
{
public:
	struct FLProjectileHitInfo                    ProjectileHitInfo;                                 // 0x0000(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FHitResult                             HitResult;                                         // 0x0090(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class FName                                   ReturnValue;                                       // 0x0118(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   OutSkillHitName;                                   // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x2];                                      // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_GetActMgrComponentBP_Branches;            // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AE[0x2];                                      // 0x01AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActMgrComponent*                      CallFunc_GetActMgrComponentBP_ReturnValue;         // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindActionState_ReturnValue;              // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter;                   // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_CheckUseSubstituteSkillHit_ReturnValue;   // 0x01CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActMgrComponent*                      CallFunc_GetActMgrComponent_ReturnValue;           // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_GetLastPlayingAction_ReturnValue;         // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Action_SlaveArm_FlameThrower_C*     K2Node_DynamicCast_AsBP_Action_Slave_Arm_Flame_Thrower; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_GetLastPlayingAction_ReturnValue_1;       // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Action_SlaveArm_FlameThrower_C*     K2Node_DynamicCast_AsBP_Action_Slave_Arm_Flame_Thrower_1; // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x021C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindActionState_ReturnValue_1;            // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0225(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit) == 0x000010, "Wrong alignment on BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit");
static_assert(sizeof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit) == 0x000230, "Wrong size on BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, ProjectileHitInfo) == 0x000000, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::ProjectileHitInfo' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, HitResult) == 0x000090, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::HitResult' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, ReturnValue) == 0x000118, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, OutSkillHitName) == 0x000120, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::OutSkillHitName' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_BreakHitResult_bBlockingHit) == 0x000128, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_BreakHitResult_bInitialOverlap) == 0x000129, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_BreakHitResult_Time) == 0x00012C, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_BreakHitResult_Distance) == 0x000130, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_BreakHitResult_Location) == 0x000134, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_BreakHitResult_ImpactPoint) == 0x000140, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_BreakHitResult_Normal) == 0x00014C, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_BreakHitResult_ImpactNormal) == 0x000158, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_BreakHitResult_PhysMat) == 0x000168, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_BreakHitResult_HitActor) == 0x000170, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_BreakHitResult_HitComponent) == 0x000178, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_BreakHitResult_HitBoneName) == 0x000180, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_BreakHitResult_HitItem) == 0x000188, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_BreakHitResult_ElementIndex) == 0x00018C, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_BreakHitResult_FaceIndex) == 0x000190, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_BreakHitResult_TraceStart) == 0x000194, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_BreakHitResult_TraceEnd) == 0x0001A0, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_IsValid_ReturnValue) == 0x0001AC, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_GetActMgrComponentBP_Branches) == 0x0001AD, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_GetActMgrComponentBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_GetActMgrComponentBP_ReturnValue) == 0x0001B0, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_GetActMgrComponentBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_FindActionState_ReturnValue) == 0x0001B8, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_FindActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, K2Node_SwitchEnum_CmpSuccess) == 0x0001B9, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, K2Node_DynamicCast_AsLCharacter) == 0x0001C0, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::K2Node_DynamicCast_AsLCharacter' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, K2Node_DynamicCast_bSuccess) == 0x0001C8, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_CheckUseSubstituteSkillHit_ReturnValue) == 0x0001CC, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_CheckUseSubstituteSkillHit_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_GetActMgrComponent_ReturnValue) == 0x0001D8, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_GetActMgrComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, Temp_bool_Variable) == 0x0001E0, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_IsValid_ReturnValue_1) == 0x0001E1, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_IsValid_ReturnValue_2) == 0x0001E2, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_IsValid_ReturnValue_3) == 0x0001E3, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_GetLastPlayingAction_ReturnValue) == 0x0001E8, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_GetLastPlayingAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, K2Node_DynamicCast_AsBP_Action_Slave_Arm_Flame_Thrower) == 0x0001F0, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::K2Node_DynamicCast_AsBP_Action_Slave_Arm_Flame_Thrower' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, K2Node_DynamicCast_bSuccess_1) == 0x0001F8, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_IsValid_ReturnValue_4) == 0x0001F9, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_GetLastPlayingAction_ReturnValue_1) == 0x000200, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_GetLastPlayingAction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, Temp_bool_Variable_1) == 0x000208, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, K2Node_DynamicCast_AsBP_Action_Slave_Arm_Flame_Thrower_1) == 0x000210, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::K2Node_DynamicCast_AsBP_Action_Slave_Arm_Flame_Thrower_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, K2Node_DynamicCast_bSuccess_2) == 0x000218, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_MakeLiteralName_ReturnValue) == 0x00021C, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_FindActionState_ReturnValue_1) == 0x000224, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_FindActionState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit, CallFunc_BooleanAND_ReturnValue) == 0x000225, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_CheckUseSubstituteSkillHit::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_Projectile_Design_FlameThrower_Lv3.BP_Projectile_Design_FlameThrower_Lv3_C.RefineHitTarget
// 0x02D8 (0x02D8 - 0x0000)
struct BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget final
{
public:
	TArray<struct FHitResult>                     InHitResults;                                      // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<struct FHitResult>                     ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, ContainsInstancedReference)
	TArray<struct FHitResult>                     RefinedHitResults;                                 // 0x0020(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x0038(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_146[0x2];                                      // 0x0146(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x01AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x01B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALCarcassBodyObject*                    K2Node_DynamicCast_AsLCarcass_Body_Object;         // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_AdjustHitLocationForCarcassObject_OutLocation; // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x01E4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0270(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0288(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0294(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_1;      // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget) == 0x000008, "Wrong alignment on BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget");
static_assert(sizeof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget) == 0x0002D8, "Wrong size on BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, InHitResults) == 0x000000, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::InHitResults' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, ReturnValue) == 0x000010, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, RefinedHitResults) == 0x000020, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::RefinedHitResults' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, Temp_int_Array_Index_Variable) == 0x000030, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_bBlockingHit) == 0x0000C0, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000C1, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_Time) == 0x0000C4, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_Distance) == 0x0000C8, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_Location) == 0x0000CC, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_ImpactPoint) == 0x0000D8, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_Normal) == 0x0000E4, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_ImpactNormal) == 0x0000F0, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_PhysMat) == 0x000100, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_HitActor) == 0x000108, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_HitComponent) == 0x000110, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_HitBoneName) == 0x000118, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_HitItem) == 0x000120, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_ElementIndex) == 0x000124, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_FaceIndex) == 0x000128, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_TraceStart) == 0x00012C, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_TraceEnd) == 0x000138, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000144, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000145, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_Time_1) == 0x000148, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_Distance_1) == 0x00014C, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_Location_1) == 0x000150, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_ImpactPoint_1) == 0x00015C, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_Normal_1) == 0x000168, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000174, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_PhysMat_1) == 0x000180, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_HitActor_1) == 0x000188, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_HitComponent_1) == 0x000190, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_HitBoneName_1) == 0x000198, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_HitItem_1) == 0x0001A0, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_ElementIndex_1) == 0x0001A4, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_FaceIndex_1) == 0x0001A8, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_TraceStart_1) == 0x0001AC, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_BreakHitResult_TraceEnd_1) == 0x0001B8, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, Temp_int_Loop_Counter_Variable) == 0x0001C4, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, K2Node_DynamicCast_AsLCarcass_Body_Object) == 0x0001C8, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::K2Node_DynamicCast_AsLCarcass_Body_Object' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, K2Node_DynamicCast_bSuccess) == 0x0001D0, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_AdjustHitLocationForCarcassObject_OutLocation) == 0x0001D4, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_AdjustHitLocationForCarcassObject_OutLocation' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_Less_IntInt_ReturnValue) == 0x0001E0, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_MakeHitResult_ReturnValue) == 0x0001E4, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_Add_IntInt_ReturnValue) == 0x00026C, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_GetActorForwardVector_ReturnValue) == 0x000270, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00027C, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000288, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_Add_VectorVector_ReturnValue) == 0x000294, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_Array_Add_ReturnValue) == 0x0002A0, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0002A4, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_Normal_ReturnValue) == 0x0002B0, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_Array_Add_ReturnValue_1) == 0x0002BC, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_GetActorForwardVector_ReturnValue_1) == 0x0002C0, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_GetActorForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_Dot_VectorVector_ReturnValue) == 0x0002CC, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0002D0, "Member 'BP_Projectile_Design_FlameThrower_Lv3_C_RefineHitTarget::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_Projectile_Design_FlameThrower_Lv3.BP_Projectile_Design_FlameThrower_Lv3_C.AdjustHitLocationForCarcassObject
// 0x03D0 (0x03D0 - 0x0000)
struct BP_Projectile_Design_FlameThrower_Lv3_C_AdjustHitLocationForCarcassObject final
{
public:
	class ALCarcassBodyObject*                    InCarcassBodyObject;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             InHitResult;                                       // 0x0008(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                OutLocation;                                       // 0x0090(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11E[0x2];                                      // 0x011E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
