#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_PileBunker

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Projectile_PileBunker.BP_Projectile_PileBunker_C.ExecuteUbergraph_BP_Projectile_PileBunker
// 0x0248 (0x0248 - 0x0000)
struct BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array_1;                          // 0x0048(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_BoxOverlapActors_OutActors;               // 0x0068(0x0010)(ReferenceParm)
	bool                                          CallFunc_BoxOverlapActors_ReturnValue;             // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter;                 // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALNPCCharacterBP_C*                     K2Node_DynamicCast_AsLNPCCharacter_BP;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULProjectileSystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLOverlapResult                        CallFunc_Array_Get_Item_1;                         // 0x0100(0x0018)(NoDestructor, ContainsInstancedReference)
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter;                   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleHalfHeight_ReturnValue;   // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_MakeHitResult_ReturnValue;                // 0x015C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E6[0x2];                                      // 0x01E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLOverlapResult                        CallFunc_Array_Get_Item_2;                         // 0x01F4(0x0018)(NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_212[0x2];                                      // 0x0212(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   CallFunc_GetCollisionProfileName_ReturnValue;      // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLOverlapResult>                CallFunc_SphereOverlapMultiByProfile_OutOverlaps;  // 0x0230(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereOverlapMultiByProfile_ReturnValue;  // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242[0x2];                                      // 0x0242(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker) == 0x000008, "Wrong alignment on BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker");
static_assert(sizeof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker) == 0x000248, "Wrong size on BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, EntryPoint) == 0x000000, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, Temp_int_Loop_Counter_Variable_1) == 0x000010, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, Temp_int_Loop_Counter_Variable_2) == 0x000014, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_Add_IntInt_ReturnValue_2) == 0x00001C, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, Temp_int_Array_Index_Variable_1) == 0x000020, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, K2Node_Event_DeltaTime) == 0x000024, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, K2Node_MakeArray_Array) == 0x000028, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, K2Node_MakeArray_Array_1) == 0x000048, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_MakeVector_ReturnValue) == 0x000058, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_BoxOverlapActors_OutActors) == 0x000068, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_BoxOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_BoxOverlapActors_ReturnValue) == 0x000078, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_BoxOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_Array_Get_Item) == 0x000080, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, K2Node_DynamicCast_AsLPCCharacter) == 0x000090, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::K2Node_DynamicCast_AsLPCCharacter' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_Less_IntInt_ReturnValue) == 0x000099, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_Array_AddUnique_ReturnValue) == 0x00009C, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, K2Node_DynamicCast_AsLNPCCharacter_BP) == 0x0000A0, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::K2Node_DynamicCast_AsLNPCCharacter_BP' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x0000AC, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_Array_Length_ReturnValue_1) == 0x0000B8, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_BreakVector_X) == 0x0000BC, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_BreakVector_Y) == 0x0000C0, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_BreakVector_Z) == 0x0000C4, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C8, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_GetSocketLocation_ReturnValue) == 0x0000CC, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_BreakVector_X_1) == 0x0000D8, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_BreakVector_Y_1) == 0x0000DC, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_BreakVector_Z_1) == 0x0000E0, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000E4, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_BooleanOR_ReturnValue) == 0x0000E8, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0000EC, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, Temp_int_Array_Index_Variable_2) == 0x0000F0, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000F8, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_Array_Get_Item_1) == 0x000100, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, K2Node_DynamicCast_AsLCharacter) == 0x000118, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::K2Node_DynamicCast_AsLCharacter' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, K2Node_DynamicCast_bSuccess_2) == 0x000120, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000124, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_GetScaledCapsuleHalfHeight_ReturnValue) == 0x000130, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_GetScaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000134, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_MakeVector_ReturnValue_1) == 0x000140, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, Temp_bool_True_if_break_was_hit_Variable) == 0x00014C, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000150, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_MakeHitResult_ReturnValue) == 0x00015C, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_MakeHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_Not_PreBool_ReturnValue) == 0x0001E4, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_BooleanAND_ReturnValue) == 0x0001E5, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0001E8, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_Array_Get_Item_2) == 0x0001F4, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_Array_Length_ReturnValue_2) == 0x00020C, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_Array_RemoveItem_ReturnValue) == 0x000210, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_Less_IntInt_ReturnValue_2) == 0x000211, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_Array_Find_ReturnValue) == 0x000214, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_Less_IntInt_ReturnValue_3) == 0x000218, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00021C, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_GetCollisionProfileName_ReturnValue) == 0x000228, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_GetCollisionProfileName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_SphereOverlapMultiByProfile_OutOverlaps) == 0x000230, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_SphereOverlapMultiByProfile_OutOverlaps' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_SphereOverlapMultiByProfile_ReturnValue) == 0x000240, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_SphereOverlapMultiByProfile_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000241, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker, CallFunc_Array_AddUnique_ReturnValue_1) == 0x000244, "Member 'BP_Projectile_PileBunker_C_ExecuteUbergraph_BP_Projectile_PileBunker::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");

// Function BP_Projectile_PileBunker.BP_Projectile_PileBunker_C.UpdateOverlapEvents
// 0x0004 (0x0004 - 0x0000)
struct BP_Projectile_PileBunker_C_UpdateOverlapEvents final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Projectile_PileBunker_C_UpdateOverlapEvents) == 0x000004, "Wrong alignment on BP_Projectile_PileBunker_C_UpdateOverlapEvents");
static_assert(sizeof(BP_Projectile_PileBunker_C_UpdateOverlapEvents) == 0x000004, "Wrong size on BP_Projectile_PileBunker_C_UpdateOverlapEvents");
static_assert(offsetof(BP_Projectile_PileBunker_C_UpdateOverlapEvents, DeltaTime) == 0x000000, "Member 'BP_Projectile_PileBunker_C_UpdateOverlapEvents::DeltaTime' has a wrong offset!");

}

