#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PhysicsImpactSound

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_PhysicsImpactSound.BP_PhysicsImpactSound_C.ExecuteUbergraph_BP_PhysicsImpactSound
// 0x01E0 (0x01E0 - 0x0000)
struct BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue_1;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SelfActor, class AActor* OtherActor, const struct FVector& NormalImpulse, struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_SelfActor;                      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_NormalImpulse;                  // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x006C(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F6[0x2];                                       // 0x00F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AE[0x2];                                      // 0x01AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x01B4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x01C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item_1;                         // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound) == 0x000008, "Wrong alignment on BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound");
static_assert(sizeof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound) == 0x0001E0, "Wrong size on BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, EntryPoint) == 0x000000, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000020, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_K2_IsValidTimerHandle_ReturnValue_1) == 0x000030, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_K2_IsValidTimerHandle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_Not_PreBool_ReturnValue) == 0x000031, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, Temp_int_Array_Index_Variable_1) == 0x00003C, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, K2Node_CustomEvent_SelfActor) == 0x000050, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::K2Node_CustomEvent_SelfActor' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, K2Node_CustomEvent_OtherActor) == 0x000058, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, K2Node_CustomEvent_NormalImpulse) == 0x000060, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::K2Node_CustomEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, K2Node_CustomEvent_Hit) == 0x00006C, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::K2Node_CustomEvent_Hit' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_BreakHitResult_bBlockingHit) == 0x0000F4, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000F5, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_BreakHitResult_Time) == 0x0000F8, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_BreakHitResult_Distance) == 0x0000FC, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_BreakHitResult_Location) == 0x000100, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_BreakHitResult_ImpactPoint) == 0x00010C, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_BreakHitResult_Normal) == 0x000118, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_BreakHitResult_ImpactNormal) == 0x000124, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_BreakHitResult_PhysMat) == 0x000130, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_BreakHitResult_HitActor) == 0x000138, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_BreakHitResult_HitComponent) == 0x000140, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_BreakHitResult_HitBoneName) == 0x000148, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_BreakHitResult_HitItem) == 0x000150, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_BreakHitResult_ElementIndex) == 0x000154, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_BreakHitResult_FaceIndex) == 0x000158, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_BreakHitResult_TraceStart) == 0x00015C, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_BreakHitResult_TraceEnd) == 0x000168, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000174, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_VSize_ReturnValue) == 0x000178, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_BooleanAND_ReturnValue) == 0x00017C, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000180, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_FMin_ReturnValue) == 0x000184, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000188, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000190, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_BooleanAND_ReturnValue_1) == 0x000198, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, Temp_int_Loop_Counter_Variable_1) == 0x00019C, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_Array_Get_Item) == 0x0001A0, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_Array_Length_ReturnValue) == 0x0001A8, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_IsValid_ReturnValue_1) == 0x0001AC, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_Less_IntInt_ReturnValue) == 0x0001AD, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001B0, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001B4, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0001C8, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_Array_Get_Item_1) == 0x0001D0, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_Array_Length_ReturnValue_1) == 0x0001D8, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001DC, "Member 'BP_PhysicsImpactSound_C_ExecuteUbergraph_BP_PhysicsImpactSound::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_PhysicsImpactSound.BP_PhysicsImpactSound_C.HitEvent
// 0x00A8 (0x00A8 - 0x0000)
struct BP_PhysicsImpactSound_C_HitEvent final
{
public:
	class AActor*                                 SelfActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0010(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x001C(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_PhysicsImpactSound_C_HitEvent) == 0x000008, "Wrong alignment on BP_PhysicsImpactSound_C_HitEvent");
static_assert(sizeof(BP_PhysicsImpactSound_C_HitEvent) == 0x0000A8, "Wrong size on BP_PhysicsImpactSound_C_HitEvent");
static_assert(offsetof(BP_PhysicsImpactSound_C_HitEvent, SelfActor) == 0x000000, "Member 'BP_PhysicsImpactSound_C_HitEvent::SelfActor' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_HitEvent, OtherActor) == 0x000008, "Member 'BP_PhysicsImpactSound_C_HitEvent::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_HitEvent, NormalImpulse) == 0x000010, "Member 'BP_PhysicsImpactSound_C_HitEvent::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_HitEvent, Hit) == 0x00001C, "Member 'BP_PhysicsImpactSound_C_HitEvent::Hit' has a wrong offset!");

// Function BP_PhysicsImpactSound.BP_PhysicsImpactSound_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PhysicsImpactSound_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PhysicsImpactSound_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PhysicsImpactSound_C_ReceiveTick");
static_assert(sizeof(BP_PhysicsImpactSound_C_ReceiveTick) == 0x000004, "Wrong size on BP_PhysicsImpactSound_C_ReceiveTick");
static_assert(offsetof(BP_PhysicsImpactSound_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PhysicsImpactSound_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_PhysicsImpactSound.BP_PhysicsImpactSound_C.CollectComponent
// 0x0100 (0x0100 - 0x0000)
struct BP_PhysicsImpactSound_C_CollectComponent final
{
public:
	TArray<class USceneComponent*>                ComponentList;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UClass*                                 ComponentClass;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 InActor;                                           // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FindMinBoundsIndex;                                // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TempMinBounds;                                     // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin;                // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent;             // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item_1;                         // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_Origin_1;              // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent_1;           // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius_1;        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item_2;                         // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetComponentBounds_Origin_2;              // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetComponentBounds_BoxExtent_2;           // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetComponentBounds_SphereRadius_2;        // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PhysicsImpactSound_C_CollectComponent) == 0x000008, "Wrong alignment on BP_PhysicsImpactSound_C_CollectComponent");
static_assert(sizeof(BP_PhysicsImpactSound_C_CollectComponent) == 0x000100, "Wrong size on BP_PhysicsImpactSound_C_CollectComponent");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, ComponentList) == 0x000000, "Member 'BP_PhysicsImpactSound_C_CollectComponent::ComponentList' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, ComponentClass) == 0x000010, "Member 'BP_PhysicsImpactSound_C_CollectComponent::ComponentClass' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, InActor) == 0x000018, "Member 'BP_PhysicsImpactSound_C_CollectComponent::InActor' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, FindMinBoundsIndex) == 0x000020, "Member 'BP_PhysicsImpactSound_C_CollectComponent::FindMinBoundsIndex' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, TempMinBounds) == 0x000024, "Member 'BP_PhysicsImpactSound_C_CollectComponent::TempMinBounds' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000030, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_Array_Length_ReturnValue_1) == 0x000044, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_Array_Length_ReturnValue_2) == 0x000048, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'BP_PhysicsImpactSound_C_CollectComponent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, Temp_int_Loop_Counter_Variable) == 0x000050, "Member 'BP_PhysicsImpactSound_C_CollectComponent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_Array_Add_ReturnValue) == 0x000064, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_GetComponentBounds_Origin) == 0x000068, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_GetComponentBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_GetComponentBounds_BoxExtent) == 0x000074, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_GetComponentBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_GetComponentBounds_SphereRadius) == 0x000080, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_GetComponentBounds_SphereRadius' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_Array_Add_ReturnValue_1) == 0x000084, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_Add_IntInt_ReturnValue) == 0x000088, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, Temp_int_Loop_Counter_Variable_1) == 0x00008C, "Member 'BP_PhysicsImpactSound_C_CollectComponent::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_Less_IntInt_ReturnValue_1) == 0x000090, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_Add_IntInt_ReturnValue_1) == 0x000094, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000098, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_Array_Get_Item_1) == 0x0000A0, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_GetComponentBounds_Origin_1) == 0x0000A8, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_GetComponentBounds_Origin_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_GetComponentBounds_BoxExtent_1) == 0x0000B4, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_GetComponentBounds_BoxExtent_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_GetComponentBounds_SphereRadius_1) == 0x0000C0, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_GetComponentBounds_SphereRadius_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000C4, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, Temp_int_Array_Index_Variable_1) == 0x0000C8, "Member 'BP_PhysicsImpactSound_C_CollectComponent::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_Array_Get_Item_2) == 0x0000D0, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D8, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_GetComponentBounds_Origin_2) == 0x0000DC, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_GetComponentBounds_Origin_2' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_GetComponentBounds_BoxExtent_2) == 0x0000E8, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_GetComponentBounds_BoxExtent_2' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_GetComponentBounds_SphereRadius_2) == 0x0000F4, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_GetComponentBounds_SphereRadius_2' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x0000F8, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_CollectComponent, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000F9, "Member 'BP_PhysicsImpactSound_C_CollectComponent::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function BP_PhysicsImpactSound.BP_PhysicsImpactSound_C.AddActor
// 0x0010 (0x0010 - 0x0000)
struct BP_PhysicsImpactSound_C_AddActor final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PhysicsImpactSound_C_AddActor) == 0x000008, "Wrong alignment on BP_PhysicsImpactSound_C_AddActor");
static_assert(sizeof(BP_PhysicsImpactSound_C_AddActor) == 0x000010, "Wrong size on BP_PhysicsImpactSound_C_AddActor");
static_assert(offsetof(BP_PhysicsImpactSound_C_AddActor, InActor) == 0x000000, "Member 'BP_PhysicsImpactSound_C_AddActor::InActor' has a wrong offset!");
static_assert(offsetof(BP_PhysicsImpactSound_C_AddActor, CallFunc_Array_AddUnique_ReturnValue) == 0x000008, "Member 'BP_PhysicsImpactSound_C_AddActor::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

}

