#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_Design_PuppetKing_Granade_Attatch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Projectile_Design_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Projectile_Design_PuppetKing_Granade_Attatch.BP_Projectile_Design_PuppetKing_Granade_Attatch_C
// 0x0018 (0x0340 - 0x0328)
class ABP_Projectile_Design_PuppetKing_Granade_Attatch_C final : public ABP_Projectile_Design_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Projectile_Design_PuppetKing_Granade_Attatch_C; // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Hit;                                               // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FX_Spark;                                          // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Projectile_Design_PuppetKing_Granade_Attatch(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Projectile_Design_PuppetKing_Granade_Attatch_C">();
	}
	static class ABP_Projectile_Design_PuppetKing_Granade_Attatch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Projectile_Design_PuppetKing_Granade_Attatch_C>();
	}
};
static_assert(alignof(ABP_Projectile_Design_PuppetKing_Granade_Attatch_C) == 0x000008, "Wrong alignment on ABP_Projectile_Design_PuppetKing_Granade_Attatch_C");
static_assert(sizeof(ABP_Projectile_Design_PuppetKing_Granade_Attatch_C) == 0x000340, "Wrong size on ABP_Projectile_Design_PuppetKing_Granade_Attatch_C");
static_assert(offsetof(ABP_Projectile_Design_PuppetKing_Granade_Attatch_C, UberGraphFrame_BP_Projectile_Design_PuppetKing_Granade_Attatch_C) == 0x000328, "Member 'ABP_Projectile_Design_PuppetKing_Granade_Attatch_C::UberGraphFrame_BP_Projectile_Design_PuppetKing_Granade_Attatch_C' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_Design_PuppetKing_Granade_Attatch_C, Hit) == 0x000330, "Member 'ABP_Projectile_Design_PuppetKing_Granade_Attatch_C::Hit' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_Design_PuppetKing_Granade_Attatch_C, FX_Spark) == 0x000338, "Member 'ABP_Projectile_Design_PuppetKing_Granade_Attatch_C::FX_Spark' has a wrong offset!");

}

