#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PropItemDrop

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PropItemDrop.BP_PropItemDrop_C
// 0x0038 (0x0298 - 0x0260)
class ABP_PropItemDrop_C final : public ALLevelObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_Ergopiece_End;                                  // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Ergopiece_Start;                                // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Ergopiece_Loop;                                 // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Target_State;                                      // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NS_Ergopiece_Start_Time;                           // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PropItemDrop(int32 EntryPoint);
	void OnChangeState(int32 TargetState);
	void OnInteractionEnd();
	void OnInteractionStart();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PropItemDrop_C">();
	}
	static class ABP_PropItemDrop_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PropItemDrop_C>();
	}
};
static_assert(alignof(ABP_PropItemDrop_C) == 0x000008, "Wrong alignment on ABP_PropItemDrop_C");
static_assert(sizeof(ABP_PropItemDrop_C) == 0x000298, "Wrong size on ABP_PropItemDrop_C");
static_assert(offsetof(ABP_PropItemDrop_C, UberGraphFrame) == 0x000260, "Member 'ABP_PropItemDrop_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PropItemDrop_C, NS_Ergopiece_End) == 0x000268, "Member 'ABP_PropItemDrop_C::NS_Ergopiece_End' has a wrong offset!");
static_assert(offsetof(ABP_PropItemDrop_C, NS_Ergopiece_Start) == 0x000270, "Member 'ABP_PropItemDrop_C::NS_Ergopiece_Start' has a wrong offset!");
static_assert(offsetof(ABP_PropItemDrop_C, NS_Ergopiece_Loop) == 0x000278, "Member 'ABP_PropItemDrop_C::NS_Ergopiece_Loop' has a wrong offset!");
static_assert(offsetof(ABP_PropItemDrop_C, Scene) == 0x000280, "Member 'ABP_PropItemDrop_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_PropItemDrop_C, Box) == 0x000288, "Member 'ABP_PropItemDrop_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_PropItemDrop_C, Target_State) == 0x000290, "Member 'ABP_PropItemDrop_C::Target_State' has a wrong offset!");
static_assert(offsetof(ABP_PropItemDrop_C, NS_Ergopiece_Start_Time) == 0x000294, "Member 'ABP_PropItemDrop_C::NS_Ergopiece_Start_Time' has a wrong offset!");

}

