#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_Design_Chakram_Test

#include "Basic.hpp"

#include "BP_Projectile_Design_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Projectile_Design_Chakram_Test.BP_Projectile_Design_Chakram_Test_C
// 0x0020 (0x0348 - 0x0328)
class ABP_Projectile_Design_Chakram_Test_C final : public ABP_Projectile_Design_Base_C
{
public:
	class UNiagaraComponent*                      NS_PC_FableArts_03_LGS;                            // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Speed_Fire;                                        // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration_Speed_Fire;                               // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration_Speed_Zero;                               // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration_Stay;                                     // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Speed_Return;                                      // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class FName CheckUseSubstituteSkillHit(const struct FLProjectileHitInfo& ProjectileHitInfo, const struct FHitResult& HitResult);
	void Start_Periodic_Hit();
	void StopPeriodicHit();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Projectile_Design_Chakram_Test_C">();
	}
	static class ABP_Projectile_Design_Chakram_Test_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Projectile_Design_Chakram_Test_C>();
	}
};
static_assert(alignof(ABP_Projectile_Design_Chakram_Test_C) == 0x000008, "Wrong alignment on ABP_Projectile_Design_Chakram_Test_C");
static_assert(sizeof(ABP_Projectile_Design_Chakram_Test_C) == 0x000348, "Wrong size on ABP_Projectile_Design_Chakram_Test_C");
static_assert(offsetof(ABP_Projectile_Design_Chakram_Test_C, NS_PC_FableArts_03_LGS) == 0x000328, "Member 'ABP_Projectile_Design_Chakram_Test_C::NS_PC_FableArts_03_LGS' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_Design_Chakram_Test_C, Speed_Fire) == 0x000330, "Member 'ABP_Projectile_Design_Chakram_Test_C::Speed_Fire' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_Design_Chakram_Test_C, Duration_Speed_Fire) == 0x000334, "Member 'ABP_Projectile_Design_Chakram_Test_C::Duration_Speed_Fire' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_Design_Chakram_Test_C, Duration_Speed_Zero) == 0x000338, "Member 'ABP_Projectile_Design_Chakram_Test_C::Duration_Speed_Zero' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_Design_Chakram_Test_C, Duration_Stay) == 0x00033C, "Member 'ABP_Projectile_Design_Chakram_Test_C::Duration_Stay' has a wrong offset!");
static_assert(offsetof(ABP_Projectile_Design_Chakram_Test_C, Speed_Return) == 0x000340, "Member 'ABP_Projectile_Design_Chakram_Test_C::Speed_Return' has a wrong offset!");

}

