#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PropItemDrop_gain

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PropItemDrop_gain.BP_PropItemDrop_Gain_C
// 0x0020 (0x0280 - 0x0260)
class ABP_PropItemDrop_Gain_C final : public ALLevelObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      NS_Get_Effect;                                     // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PropItemDrop_Gain(int32 EntryPoint);
	void OnInteractionEnd();
	void OnInteractionStart();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PropItemDrop_Gain_C">();
	}
	static class ABP_PropItemDrop_Gain_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PropItemDrop_Gain_C>();
	}
};
static_assert(alignof(ABP_PropItemDrop_Gain_C) == 0x000008, "Wrong alignment on ABP_PropItemDrop_Gain_C");
static_assert(sizeof(ABP_PropItemDrop_Gain_C) == 0x000280, "Wrong size on ABP_PropItemDrop_Gain_C");
static_assert(offsetof(ABP_PropItemDrop_Gain_C, UberGraphFrame) == 0x000260, "Member 'ABP_PropItemDrop_Gain_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PropItemDrop_Gain_C, NS_Get_Effect) == 0x000268, "Member 'ABP_PropItemDrop_Gain_C::NS_Get_Effect' has a wrong offset!");
static_assert(offsetof(ABP_PropItemDrop_Gain_C, Scene) == 0x000270, "Member 'ABP_PropItemDrop_Gain_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_PropItemDrop_Gain_C, Box) == 0x000278, "Member 'ABP_PropItemDrop_Gain_C::Box' has a wrong offset!");

}

