#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuickStep

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BP_QuickStep.BP_QuickStep_C.ExecuteUbergraph_BP_QuickStep
// 0x0120 (0x0120 - 0x0000)
struct BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable;                              // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetLastUpdateRotation_ReturnValue;        // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Zero_ReturnValue;                  // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_NegateRotator_ReturnValue;                // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_NegateRotator_ReturnValue_1;              // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_1;            // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveAnimRootMotionTranslationScale_ReturnValue; // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RemoveAnimRootMotionTranslationScale_ReturnValue_1; // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetCurrMontageInstanceID_AnimInstance;    // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_GetCurrMontageInstanceID_Branches;        // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrMontageInstanceID_ReturnValue;     // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue; // 0x00EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Vector_HeadingAngle_ReturnValue;          // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RadiansToDegrees_ReturnValue;             // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Zero_ReturnValue_1;                // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ClampAxis_ReturnValue;                    // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_VectorVector_ReturnValue;        // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayTargetAnim_ReturnValue;               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      CallFunc_GetSkillAnim_ReturnValue;                 // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep) == 0x000008, "Wrong alignment on BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep");
static_assert(sizeof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep) == 0x000120, "Wrong size on BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, EntryPoint) == 0x000000, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, Temp_struct_Variable) == 0x000004, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_GetLastUpdateRotation_ReturnValue) == 0x000010, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_GetLastUpdateRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_EqualEqual_VectorVector_ReturnValue) == 0x00001C, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_EqualEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_MakeRotFromX_ReturnValue) == 0x000020, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000030, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_Vector_Zero_ReturnValue) == 0x000038, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_Vector_Zero_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_IsValid_ReturnValue) == 0x000044, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_GetCameraRotation_ReturnValue) == 0x000048, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_BreakRotator_Roll) == 0x000054, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_BreakRotator_Pitch) == 0x000058, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_BreakRotator_Yaw) == 0x00005C, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_MakeRotator_ReturnValue) == 0x000060, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x00006C, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000078, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_NegateRotator_ReturnValue) == 0x000084, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_NegateRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_ComposeRotators_ReturnValue) == 0x000090, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x00009C, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_NegateRotator_ReturnValue_1) == 0x0000A8, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_NegateRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_ComposeRotators_ReturnValue_1) == 0x0000B4, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_ComposeRotators_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, K2Node_Event_ReasonAction) == 0x0000C0, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, K2Node_Event_Reason) == 0x0000C8, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_RemoveAnimRootMotionTranslationScale_ReturnValue) == 0x0000D0, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_RemoveAnimRootMotionTranslationScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_RemoveAnimRootMotionTranslationScale_ReturnValue_1) == 0x0000D1, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_RemoveAnimRootMotionTranslationScale_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_GetCurrMontageInstanceID_AnimInstance) == 0x0000D8, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_GetCurrMontageInstanceID_AnimInstance' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_GetCurrMontageInstanceID_Branches) == 0x0000E0, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_GetCurrMontageInstanceID_Branches' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_GetCurrMontageInstanceID_ReturnValue) == 0x0000E4, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_GetCurrMontageInstanceID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, K2Node_SwitchEnum_CmpSuccess) == 0x0000E8, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue) == 0x0000EC, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_ActionStopReason_PlayAnimFailed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_Stop_ReturnValue) == 0x0000F4, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_Vector_HeadingAngle_ReturnValue) == 0x0000F8, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_Vector_HeadingAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_RadiansToDegrees_ReturnValue) == 0x0000FC, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_RadiansToDegrees_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_Vector_Zero_ReturnValue_1) == 0x000100, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_Vector_Zero_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_ClampAxis_ReturnValue) == 0x00010C, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_ClampAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_NotEqual_VectorVector_ReturnValue) == 0x000110, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_NotEqual_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_PlayTargetAnim_ReturnValue) == 0x000114, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_PlayTargetAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep, CallFunc_GetSkillAnim_ReturnValue) == 0x000118, "Member 'BP_QuickStep_C_ExecuteUbergraph_BP_QuickStep::CallFunc_GetSkillAnim_ReturnValue' has a wrong offset!");

// Function BP_QuickStep.BP_QuickStep_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_QuickStep_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QuickStep_C_OnStop) == 0x000008, "Wrong alignment on BP_QuickStep_C_OnStop");
static_assert(sizeof(BP_QuickStep_C_OnStop) == 0x000010, "Wrong size on BP_QuickStep_C_OnStop");
static_assert(offsetof(BP_QuickStep_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_QuickStep_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_QuickStep_C_OnStop, Reason) == 0x000008, "Member 'BP_QuickStep_C_OnStop::Reason' has a wrong offset!");

}

