#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RainBlockingVolume

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_RainBlockingVolume.BP_RainBlockingVolume_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct BP_RainBlockingVolume_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_2;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RainBlockingVolume_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_RainBlockingVolume_C_UserConstructionScript");
static_assert(sizeof(BP_RainBlockingVolume_C_UserConstructionScript) == 0x000030, "Wrong size on BP_RainBlockingVolume_C_UserConstructionScript");
static_assert(offsetof(BP_RainBlockingVolume_C_UserConstructionScript, CallFunc_GetActorScale3D_ReturnValue) == 0x000000, "Member 'BP_RainBlockingVolume_C_UserConstructionScript::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RainBlockingVolume_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x00000C, "Member 'BP_RainBlockingVolume_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_RainBlockingVolume_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000010, "Member 'BP_RainBlockingVolume_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_RainBlockingVolume_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000014, "Member 'BP_RainBlockingVolume_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_RainBlockingVolume_C_UserConstructionScript, CallFunc_FMax_ReturnValue) == 0x000018, "Member 'BP_RainBlockingVolume_C_UserConstructionScript::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RainBlockingVolume_C_UserConstructionScript, CallFunc_FMax_ReturnValue_1) == 0x00001C, "Member 'BP_RainBlockingVolume_C_UserConstructionScript::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RainBlockingVolume_C_UserConstructionScript, CallFunc_FMax_ReturnValue_2) == 0x000020, "Member 'BP_RainBlockingVolume_C_UserConstructionScript::CallFunc_FMax_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_RainBlockingVolume_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000024, "Member 'BP_RainBlockingVolume_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

}

