#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Scene_OldTown_BearTrap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Scene_OldTown_BearTrap.BP_Scene_OldTown_BearTrap_C.ExecuteUbergraph_BP_Scene_OldTown_BearTrap
// 0x0280 (0x0280 - 0x0000)
struct BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep_1;           // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult_1;          // 0x0028(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_ExecuteContentCommand_ReturnValue;        // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter;                 // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetSocketBoneName_ReturnValue;            // 0x00C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADDV_CH05_BearTrap_Scene_C*             CallFunc_FinishSpawningActor_ReturnValue;          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0140(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x01E8(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_1;               // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A[0x2];                                      // 0x027A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_TargetState;                          // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap) == 0x000010, "Wrong alignment on BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap");
static_assert(sizeof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap) == 0x000280, "Wrong size on BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, EntryPoint) == 0x000000, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, Temp_bool_Has_Been_Initd_Variable) == 0x000006, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000008, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000010, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000018, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000020, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, K2Node_ComponentBoundEvent_bFromSweep_1) == 0x000024, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::K2Node_ComponentBoundEvent_bFromSweep_1' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, K2Node_ComponentBoundEvent_SweepResult_1) == 0x000028, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::K2Node_ComponentBoundEvent_SweepResult_1' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, CallFunc_ExecuteContentCommand_ReturnValue) == 0x0000B0, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::CallFunc_ExecuteContentCommand_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, K2Node_DynamicCast_AsLPCCharacter) == 0x0000B8, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::K2Node_DynamicCast_AsLPCCharacter' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, CallFunc_IsValid_ReturnValue) == 0x0000C1, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, CallFunc_GetSocketBoneName_ReturnValue) == 0x0000C4, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::CallFunc_GetSocketBoneName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x0000D0, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, CallFunc_GetSocketLocation_ReturnValue) == 0x000100, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000110, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, CallFunc_BreakVector_X) == 0x000118, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, CallFunc_BreakVector_Y) == 0x00011C, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, CallFunc_BreakVector_Z) == 0x000120, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, CallFunc_FinishSpawningActor_ReturnValue) == 0x000128, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000130, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, CallFunc_MakeVector_ReturnValue) == 0x000134, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000140, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0001C8, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, K2Node_ComponentBoundEvent_OtherActor) == 0x0001D0, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, K2Node_ComponentBoundEvent_OtherComp) == 0x0001D8, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0001E0, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, K2Node_ComponentBoundEvent_bFromSweep) == 0x0001E4, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, K2Node_ComponentBoundEvent_SweepResult) == 0x0001E8, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, K2Node_DynamicCast_AsLPCCharacter_1) == 0x000270, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::K2Node_DynamicCast_AsLPCCharacter_1' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, K2Node_DynamicCast_bSuccess_1) == 0x000278, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, CallFunc_IsValid_ReturnValue_1) == 0x000279, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap, K2Node_Event_TargetState) == 0x00027C, "Member 'BP_Scene_OldTown_BearTrap_C_ExecuteUbergraph_BP_Scene_OldTown_BearTrap::K2Node_Event_TargetState' has a wrong offset!");

// Function BP_Scene_OldTown_BearTrap.BP_Scene_OldTown_BearTrap_C.OnChangeState
// 0x0004 (0x0004 - 0x0000)
struct BP_Scene_OldTown_BearTrap_C_OnChangeState final
{
public:
	int32                                         TargetState;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Scene_OldTown_BearTrap_C_OnChangeState) == 0x000004, "Wrong alignment on BP_Scene_OldTown_BearTrap_C_OnChangeState");
static_assert(sizeof(BP_Scene_OldTown_BearTrap_C_OnChangeState) == 0x000004, "Wrong size on BP_Scene_OldTown_BearTrap_C_OnChangeState");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_OnChangeState, TargetState) == 0x000000, "Member 'BP_Scene_OldTown_BearTrap_C_OnChangeState::TargetState' has a wrong offset!");

// Function BP_Scene_OldTown_BearTrap.BP_Scene_OldTown_BearTrap_C.BndEvt__BP_Scene_OldTown_BearTrap_Trigger_Dissolve_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Trigger_Dissolve_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Trigger_Dissolve_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Trigger_Dissolve_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Trigger_Dissolve_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Trigger_Dissolve_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Trigger_Dissolve_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Trigger_Dissolve_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Trigger_Dissolve_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Trigger_Dissolve_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Trigger_Dissolve_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Trigger_Dissolve_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Trigger_Dissolve_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Trigger_Dissolve_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Trigger_Dissolve_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Trigger_Dissolve_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Trigger_Dissolve_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Trigger_Dissolve_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_Scene_OldTown_BearTrap.BP_Scene_OldTown_BearTrap_C.BndEvt__BP_Scene_OldTown_BearTrap_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_Scene_OldTown_BearTrap_C_BndEvt__BP_Scene_OldTown_BearTrap_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

}

