#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Stalker_Exile

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"
#include "LNPCCharacterBP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Stalker_Exile.BP_Stalker_Exile_C
// 0x0050 (0x1510 - 0x14C0)
class ABP_Stalker_Exile_C final : public ALNPCCharacterBP_C
{
public:
	uint8                                         Pad_14B5[0x3];                                     // 0x14B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Stalker_Exile_C;                 // 0x14B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ULManagedNiagaraComponent*              NS_Exile_Body_03_LGS;                              // 0x14C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x14C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Delta_Time;                                        // 0x14D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timer_Time;                                        // 0x14D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Provoke_Timer_Handle;                              // 0x14D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Random_Provoke_CoolTime;                           // 0x14E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14E4[0x4];                                     // 0x14E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALNPCControllerBP_C*                    LNPCController;                                    // 0x14E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         Provoke_Min_Cooltime;                              // 0x14F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Provoke_Max_Cooltime;                              // 0x14F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bProvoking;                                        // 0x14F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14F9[0x7];                                     // 0x14F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           NewVar_0;                                          // 0x1500(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Stalker_Exile(int32 EntryPoint);
	void DeadCharacterBP();
	void Clear_AITargetList();
	void SetCombatStateBP(bool bCombatState);
	void OnSleepStateChanged(bool bSleepState);
	void OnRespawnBP();
	void OnPostDead();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Stalker_Exile_C">();
	}
	static class ABP_Stalker_Exile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Stalker_Exile_C>();
	}
};
static_assert(alignof(ABP_Stalker_Exile_C) == 0x000010, "Wrong alignment on ABP_Stalker_Exile_C");
static_assert(sizeof(ABP_Stalker_Exile_C) == 0x001510, "Wrong size on ABP_Stalker_Exile_C");
static_assert(offsetof(ABP_Stalker_Exile_C, UberGraphFrame_BP_Stalker_Exile_C) == 0x0014B8, "Member 'ABP_Stalker_Exile_C::UberGraphFrame_BP_Stalker_Exile_C' has a wrong offset!");
static_assert(offsetof(ABP_Stalker_Exile_C, NS_Exile_Body_03_LGS) == 0x0014C0, "Member 'ABP_Stalker_Exile_C::NS_Exile_Body_03_LGS' has a wrong offset!");
static_assert(offsetof(ABP_Stalker_Exile_C, Audio) == 0x0014C8, "Member 'ABP_Stalker_Exile_C::Audio' has a wrong offset!");
static_assert(offsetof(ABP_Stalker_Exile_C, Delta_Time) == 0x0014D0, "Member 'ABP_Stalker_Exile_C::Delta_Time' has a wrong offset!");
static_assert(offsetof(ABP_Stalker_Exile_C, Timer_Time) == 0x0014D4, "Member 'ABP_Stalker_Exile_C::Timer_Time' has a wrong offset!");
static_assert(offsetof(ABP_Stalker_Exile_C, Provoke_Timer_Handle) == 0x0014D8, "Member 'ABP_Stalker_Exile_C::Provoke_Timer_Handle' has a wrong offset!");
static_assert(offsetof(ABP_Stalker_Exile_C, Random_Provoke_CoolTime) == 0x0014E0, "Member 'ABP_Stalker_Exile_C::Random_Provoke_CoolTime' has a wrong offset!");
static_assert(offsetof(ABP_Stalker_Exile_C, LNPCController) == 0x0014E8, "Member 'ABP_Stalker_Exile_C::LNPCController' has a wrong offset!");
static_assert(offsetof(ABP_Stalker_Exile_C, Provoke_Min_Cooltime) == 0x0014F0, "Member 'ABP_Stalker_Exile_C::Provoke_Min_Cooltime' has a wrong offset!");
static_assert(offsetof(ABP_Stalker_Exile_C, Provoke_Max_Cooltime) == 0x0014F4, "Member 'ABP_Stalker_Exile_C::Provoke_Max_Cooltime' has a wrong offset!");
static_assert(offsetof(ABP_Stalker_Exile_C, bProvoking) == 0x0014F8, "Member 'ABP_Stalker_Exile_C::bProvoking' has a wrong offset!");
static_assert(offsetof(ABP_Stalker_Exile_C, NewVar_0) == 0x001500, "Member 'ABP_Stalker_Exile_C::NewVar_0' has a wrong offset!");

}

