#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Trap_Arrow_01

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Trap_Arrow_01.BP_Trap_Arrow_01_C
// 0x00F8 (0x0358 - 0x0260)
class ABP_Trap_Arrow_01_C final : public ALLevelObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ULLevelPreloadBoxComponent*             LLevelPreloadBox;                                  // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh3;                                     // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box3;                                              // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Switch04;                                          // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh2;                                     // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box2;                                              // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Switch03;                                          // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow6;                                            // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow5;                                            // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow4;                                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh4;                                       // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh6;                                       // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh5;                                       // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Muzzle02;                                          // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box1;                                              // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh1;                                     // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Switch02;                                          // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Switch01;                                          // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow3;                                            // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow2;                                            // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow1;                                            // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Muzzle01;                                          // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Projectile_Codename;                               // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Trap_Arrow_01(int32 EntryPoint);
	void BndEvt__BP_Trap_Arrow_01_Box3_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_Trap_Arrow_01_Box2_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__BP_Trap_Arrow_Box1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ShotArrowRepeat();
	void BndEvt__BP_Trap_Arrow_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ShotArrow();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Trap_Arrow_01_C">();
	}
	static class ABP_Trap_Arrow_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Trap_Arrow_01_C>();
	}
};
static_assert(alignof(ABP_Trap_Arrow_01_C) == 0x000008, "Wrong alignment on ABP_Trap_Arrow_01_C");
static_assert(sizeof(ABP_Trap_Arrow_01_C) == 0x000358, "Wrong size on ABP_Trap_Arrow_01_C");
static_assert(offsetof(ABP_Trap_Arrow_01_C, UberGraphFrame) == 0x000260, "Member 'ABP_Trap_Arrow_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, LLevelPreloadBox) == 0x000268, "Member 'ABP_Trap_Arrow_01_C::LLevelPreloadBox' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, SkeletalMesh3) == 0x000270, "Member 'ABP_Trap_Arrow_01_C::SkeletalMesh3' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, Box3) == 0x000278, "Member 'ABP_Trap_Arrow_01_C::Box3' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, Switch04) == 0x000280, "Member 'ABP_Trap_Arrow_01_C::Switch04' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, SkeletalMesh2) == 0x000288, "Member 'ABP_Trap_Arrow_01_C::SkeletalMesh2' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, Box2) == 0x000290, "Member 'ABP_Trap_Arrow_01_C::Box2' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, Switch03) == 0x000298, "Member 'ABP_Trap_Arrow_01_C::Switch03' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, Arrow6) == 0x0002A0, "Member 'ABP_Trap_Arrow_01_C::Arrow6' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, Arrow5) == 0x0002A8, "Member 'ABP_Trap_Arrow_01_C::Arrow5' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, Arrow4) == 0x0002B0, "Member 'ABP_Trap_Arrow_01_C::Arrow4' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, StaticMesh4) == 0x0002B8, "Member 'ABP_Trap_Arrow_01_C::StaticMesh4' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, StaticMesh6) == 0x0002C0, "Member 'ABP_Trap_Arrow_01_C::StaticMesh6' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, StaticMesh5) == 0x0002C8, "Member 'ABP_Trap_Arrow_01_C::StaticMesh5' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, Muzzle02) == 0x0002D0, "Member 'ABP_Trap_Arrow_01_C::Muzzle02' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, Box1) == 0x0002D8, "Member 'ABP_Trap_Arrow_01_C::Box1' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, SkeletalMesh1) == 0x0002E0, "Member 'ABP_Trap_Arrow_01_C::SkeletalMesh1' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, Switch02) == 0x0002E8, "Member 'ABP_Trap_Arrow_01_C::Switch02' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, SkeletalMesh) == 0x0002F0, "Member 'ABP_Trap_Arrow_01_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, Box) == 0x0002F8, "Member 'ABP_Trap_Arrow_01_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, Switch01) == 0x000300, "Member 'ABP_Trap_Arrow_01_C::Switch01' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, Arrow3) == 0x000308, "Member 'ABP_Trap_Arrow_01_C::Arrow3' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, Arrow2) == 0x000310, "Member 'ABP_Trap_Arrow_01_C::Arrow2' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, Arrow1) == 0x000318, "Member 'ABP_Trap_Arrow_01_C::Arrow1' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, StaticMesh) == 0x000320, "Member 'ABP_Trap_Arrow_01_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, StaticMesh2) == 0x000328, "Member 'ABP_Trap_Arrow_01_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, StaticMesh1) == 0x000330, "Member 'ABP_Trap_Arrow_01_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, Muzzle01) == 0x000338, "Member 'ABP_Trap_Arrow_01_C::Muzzle01' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, Arrow) == 0x000340, "Member 'ABP_Trap_Arrow_01_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, DefaultSceneRoot) == 0x000348, "Member 'ABP_Trap_Arrow_01_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_01_C, Projectile_Codename) == 0x000350, "Member 'ABP_Trap_Arrow_01_C::Projectile_Codename' has a wrong offset!");

}

