#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Trap_Arrow_02

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Trap_Arrow_02.BP_Trap_Arrow_02_C
// 0x0080 (0x02E0 - 0x0260)
class ABP_Trap_Arrow_02_C final : public ALLevelObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ULLevelPreloadBoxComponent*             LLevelPreloadBox;                                  // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Switch01;                                          // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow3;                                            // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow2;                                            // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow1;                                            // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Muzzle01;                                          // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Projectile_Codename;                               // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Check_Butterfly;                                   // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Trap_Arrow_02(int32 EntryPoint);
	void ShotArrowRepeat();
	void BndEvt__BP_Trap_Arrow_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ShotArrow();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Trap_Arrow_02_C">();
	}
	static class ABP_Trap_Arrow_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Trap_Arrow_02_C>();
	}
};
static_assert(alignof(ABP_Trap_Arrow_02_C) == 0x000008, "Wrong alignment on ABP_Trap_Arrow_02_C");
static_assert(sizeof(ABP_Trap_Arrow_02_C) == 0x0002E0, "Wrong size on ABP_Trap_Arrow_02_C");
static_assert(offsetof(ABP_Trap_Arrow_02_C, UberGraphFrame) == 0x000260, "Member 'ABP_Trap_Arrow_02_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_02_C, LLevelPreloadBox) == 0x000268, "Member 'ABP_Trap_Arrow_02_C::LLevelPreloadBox' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_02_C, SkeletalMesh) == 0x000270, "Member 'ABP_Trap_Arrow_02_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_02_C, Box) == 0x000278, "Member 'ABP_Trap_Arrow_02_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_02_C, Switch01) == 0x000280, "Member 'ABP_Trap_Arrow_02_C::Switch01' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_02_C, Arrow3) == 0x000288, "Member 'ABP_Trap_Arrow_02_C::Arrow3' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_02_C, Arrow2) == 0x000290, "Member 'ABP_Trap_Arrow_02_C::Arrow2' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_02_C, Arrow1) == 0x000298, "Member 'ABP_Trap_Arrow_02_C::Arrow1' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_02_C, StaticMesh) == 0x0002A0, "Member 'ABP_Trap_Arrow_02_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_02_C, StaticMesh2) == 0x0002A8, "Member 'ABP_Trap_Arrow_02_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_02_C, StaticMesh1) == 0x0002B0, "Member 'ABP_Trap_Arrow_02_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_02_C, Muzzle01) == 0x0002B8, "Member 'ABP_Trap_Arrow_02_C::Muzzle01' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_02_C, Arrow) == 0x0002C0, "Member 'ABP_Trap_Arrow_02_C::Arrow' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_02_C, DefaultSceneRoot) == 0x0002C8, "Member 'ABP_Trap_Arrow_02_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_02_C, Projectile_Codename) == 0x0002D0, "Member 'ABP_Trap_Arrow_02_C::Projectile_Codename' has a wrong offset!");
static_assert(offsetof(ABP_Trap_Arrow_02_C, Check_Butterfly) == 0x0002D8, "Member 'ABP_Trap_Arrow_02_C::Check_Butterfly' has a wrong offset!");

}

