#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Test_Element

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Test_Element.BP_Test_Element_C.ExecuteUbergraph_BP_Test_Element
// 0x0120 (0x0120 - 0x0000)
struct BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PlayTargetAnim_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_LockMovement_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCount_ReturnValue;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_LockRotation_ReturnValue;     // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0xC];                                       // 0x0044(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0050(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULObjectManagementSystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALNPCCharacter*                         CallFunc_SpawnNPC_ReturnValue;                     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerInventory*                      CallFunc_GetPlayerInventory_ReturnValue;           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ConsumeItem_ReturnValue;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element) == 0x000010, "Wrong alignment on BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element");
static_assert(sizeof(BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element) == 0x000120, "Wrong size on BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element");
static_assert(offsetof(BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element, EntryPoint) == 0x000000, "Member 'BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element, CallFunc_Stop_ReturnValue) == 0x000004, "Member 'BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element, CallFunc_PlayTargetAnim_ReturnValue) == 0x000008, "Member 'BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element::CallFunc_PlayTargetAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element, CallFunc_ActionState_LockMovement_ReturnValue) == 0x000018, "Member 'BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element::CallFunc_ActionState_LockMovement_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element, CallFunc_GetCount_ReturnValue) == 0x000020, "Member 'BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element::CallFunc_GetCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element, CallFunc_ActionState_LockRotation_ReturnValue) == 0x000024, "Member 'BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element::CallFunc_ActionState_LockRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000030, "Member 'BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element, CallFunc_GetActorForwardVector_ReturnValue) == 0x000038, "Member 'BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element, CallFunc_GetTransform_ReturnValue) == 0x000050, "Member 'BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000080, "Member 'BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element, CallFunc_BreakTransform_Location) == 0x00008C, "Member 'BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element, CallFunc_BreakTransform_Rotation) == 0x000098, "Member 'BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element, CallFunc_BreakTransform_Scale) == 0x0000A4, "Member 'BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B0, "Member 'BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x0000C0, "Member 'BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element, CallFunc_MakeTransform_ReturnValue) == 0x0000D0, "Member 'BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000100, "Member 'BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element, CallFunc_SpawnNPC_ReturnValue) == 0x000108, "Member 'BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element::CallFunc_SpawnNPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element, CallFunc_GetPlayerInventory_ReturnValue) == 0x000110, "Member 'BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element::CallFunc_GetPlayerInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element, CallFunc_ConsumeItem_ReturnValue) == 0x000118, "Member 'BP_Test_Element_C_ExecuteUbergraph_BP_Test_Element::CallFunc_ConsumeItem_ReturnValue' has a wrong offset!");

}

