#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Weapon_Base

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Weapon_Base.BP_Weapon_Base_C
// 0x0050 (0x03D8 - 0x0388)
class ABP_Weapon_Base_C : public ALWeapon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ULWeaponFXVaryingComponent*             LWeaponFXVarying;                                  // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bAutoMakeCollisionHandle;                          // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bAutoMakeCollisionBlade;                           // 0x0399(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bVisibleAllMeshesInEditor;                         // 0x039A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39B[0x5];                                      // 0x039B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ALWeapon*                               HandleTemplate;                                    // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AppliedMaterialCodename;                           // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULMaterialVarying*                      StartMaterialVarying;                              // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      TrailElementFX;                                    // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              OwnedDurationParticles;                            // 0x03C0(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	bool                                          bSnapMeshAttachment;                               // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Weapon_Base(int32 EntryPoint);
	void OnUpdateBreakBlade();
	void StartHideDerbisBlade();
	void OnWeaponChanged(class ALWeapon* From, class ALWeapon* To);
	void PlayDurabilityConsumeFX();
	void RemoveElement(class FName ElementName);
	void ApplyElement(class FName ElementName);
	void StopTrailElementFX();
	void PlayTrailElementFX();
	void OnDropWeapon();
	void OnWeaponOnOff(bool bOnOff);
	void RemoveMaterialVarying(class FName MaterialFxCodename);
	void ApplyMaterialVarying(class FName MaterialFxCodename);
	void OnWeaponHitDamage();
	void OnWeaponRespawn();
	void OnApplyRunningAbnormal(bool IsApply, class FName AbnormalCodeName);
	void JoinHandleAndBladeMeshComponents();
	void Build_Auto_Collision();
	void Post_Build();
	void BuildWeapon();
	void OnBreakBlade(const struct FVector& BreakPointLocation, const struct FVector& ImpulseDirection);
	void UserConstructionScript();
	void Duplicate_Handle();
	void Join_Handle_And__Blade_Mesh_Component();
	void OnImpl_Make_Weapon();
	void OnImpl_Break_Blade();
	void OnImpl_Drop_Weapon();
	void OnImpl_Weapon_Hit_Damage();
	void OnImpl_Apply_Running_Abnormal(bool IsApply, class FName Abnormal_Code_Name);
	void PutOnAbnormal(const class FName InAbnormalCodeName);
	void IsAppliedGroupAbnormal(const class FName GroupCodename, bool* Result);
	void TakeOffbyGroupAbnormal(const class FName GroupCodename);
	void OnImpl_Weapon_OnOff(bool bOn);
	void PutOn_TakeOff_EquipAbnormal(bool bPutOn);
	class ALWeapon* CreateHandleTemplateActor();
	void MoveWeaponActorOnPenetrait();
	void OnImpl_Weapon_Changed(class ALWeapon* From, class ALWeapon* To);
	void TakeOffAbnormal(class FName InAbnormalCodeName, bool Immediately);
	void SetWeaponFableArtsSkill(class FName OverrideBladeSkillCodeName, class FName OverrideHandleSkillCodeName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Weapon_Base_C">();
	}
	static class ABP_Weapon_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Weapon_Base_C>();
	}
};
static_assert(alignof(ABP_Weapon_Base_C) == 0x000008, "Wrong alignment on ABP_Weapon_Base_C");
static_assert(sizeof(ABP_Weapon_Base_C) == 0x0003D8, "Wrong size on ABP_Weapon_Base_C");
static_assert(offsetof(ABP_Weapon_Base_C, UberGraphFrame) == 0x000388, "Member 'ABP_Weapon_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_Base_C, LWeaponFXVarying) == 0x000390, "Member 'ABP_Weapon_Base_C::LWeaponFXVarying' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_Base_C, bAutoMakeCollisionHandle) == 0x000398, "Member 'ABP_Weapon_Base_C::bAutoMakeCollisionHandle' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_Base_C, bAutoMakeCollisionBlade) == 0x000399, "Member 'ABP_Weapon_Base_C::bAutoMakeCollisionBlade' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_Base_C, bVisibleAllMeshesInEditor) == 0x00039A, "Member 'ABP_Weapon_Base_C::bVisibleAllMeshesInEditor' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_Base_C, HandleTemplate) == 0x0003A0, "Member 'ABP_Weapon_Base_C::HandleTemplate' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_Base_C, AppliedMaterialCodename) == 0x0003A8, "Member 'ABP_Weapon_Base_C::AppliedMaterialCodename' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_Base_C, StartMaterialVarying) == 0x0003B0, "Member 'ABP_Weapon_Base_C::StartMaterialVarying' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_Base_C, TrailElementFX) == 0x0003B8, "Member 'ABP_Weapon_Base_C::TrailElementFX' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_Base_C, OwnedDurationParticles) == 0x0003C0, "Member 'ABP_Weapon_Base_C::OwnedDurationParticles' has a wrong offset!");
static_assert(offsetof(ABP_Weapon_Base_C, bSnapMeshAttachment) == 0x0003D0, "Member 'ABP_Weapon_Base_C::bSnapMeshAttachment' has a wrong offset!");

}

