#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Wire_GrappleGun_NPC

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_Wire_GrappleGun_Base_classes.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Wire_GrappleGun_NPC.BP_Wire_GrappleGun_NPC_C
// 0x0040 (0x0310 - 0x02D0)
class ABP_Wire_GrappleGun_NPC_C final : public ABP_Wire_GrappleGun_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Wire_GrappleGun_NPC_C;           // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   TargetSocketName;                                  // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Pulling_Montage;                                   // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Fail_Montage;                                      // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FollowingWhenAttached;                             // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   FollowingSkillCodeName;                            // 0x02F4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FollowingEndSkillCodeName;                         // 0x02FC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FollowingSpeed;                                    // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FollowingGravity;                                  // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Wire_GrappleGun_NPC(int32 EntryPoint);
	void Pulling();
	void Following();
	void FollowingAction();
	void Attached();
	void PullingAction();
	void FailAction();
	void Initialize();
	void PlayFollowingAction(class ALCharacter* MoveActor_0, class ALCharacter* DestActor);
	void SetWireDirection();
	void Update_Overlaps();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Wire_GrappleGun_NPC_C">();
	}
	static class ABP_Wire_GrappleGun_NPC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Wire_GrappleGun_NPC_C>();
	}
};
static_assert(alignof(ABP_Wire_GrappleGun_NPC_C) == 0x000008, "Wrong alignment on ABP_Wire_GrappleGun_NPC_C");
static_assert(sizeof(ABP_Wire_GrappleGun_NPC_C) == 0x000310, "Wrong size on ABP_Wire_GrappleGun_NPC_C");
static_assert(offsetof(ABP_Wire_GrappleGun_NPC_C, UberGraphFrame_BP_Wire_GrappleGun_NPC_C) == 0x0002D0, "Member 'ABP_Wire_GrappleGun_NPC_C::UberGraphFrame_BP_Wire_GrappleGun_NPC_C' has a wrong offset!");
static_assert(offsetof(ABP_Wire_GrappleGun_NPC_C, TargetSocketName) == 0x0002D8, "Member 'ABP_Wire_GrappleGun_NPC_C::TargetSocketName' has a wrong offset!");
static_assert(offsetof(ABP_Wire_GrappleGun_NPC_C, Pulling_Montage) == 0x0002E0, "Member 'ABP_Wire_GrappleGun_NPC_C::Pulling_Montage' has a wrong offset!");
static_assert(offsetof(ABP_Wire_GrappleGun_NPC_C, Fail_Montage) == 0x0002E8, "Member 'ABP_Wire_GrappleGun_NPC_C::Fail_Montage' has a wrong offset!");
static_assert(offsetof(ABP_Wire_GrappleGun_NPC_C, FollowingWhenAttached) == 0x0002F0, "Member 'ABP_Wire_GrappleGun_NPC_C::FollowingWhenAttached' has a wrong offset!");
static_assert(offsetof(ABP_Wire_GrappleGun_NPC_C, FollowingSkillCodeName) == 0x0002F4, "Member 'ABP_Wire_GrappleGun_NPC_C::FollowingSkillCodeName' has a wrong offset!");
static_assert(offsetof(ABP_Wire_GrappleGun_NPC_C, FollowingEndSkillCodeName) == 0x0002FC, "Member 'ABP_Wire_GrappleGun_NPC_C::FollowingEndSkillCodeName' has a wrong offset!");
static_assert(offsetof(ABP_Wire_GrappleGun_NPC_C, FollowingSpeed) == 0x000304, "Member 'ABP_Wire_GrappleGun_NPC_C::FollowingSpeed' has a wrong offset!");
static_assert(offsetof(ABP_Wire_GrappleGun_NPC_C, FollowingGravity) == 0x000308, "Member 'ABP_Wire_GrappleGun_NPC_C::FollowingGravity' has a wrong offset!");

}

