#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Weapon_NPC_Charkram

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"
#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BP_Weapon_NPC_Charkram.BP_Weapon_NPC_Charkram_C.ExecuteUbergraph_BP_Weapon_NPC_Charkram
// 0x00D0 (0x00D0 - 0x0000)
struct BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bOnOff;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_Weapon_Charkram_BLD_C*             K2Node_DynamicCast_AsABP_Weapon_Charkram_BLD;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_BreakPointLocation;                   // 0x0024(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_ImpulseDirection;                     // 0x0030(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALNPCCharacter*                         K2Node_DynamicCast_AsLNPCCharacter;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAppliedAbnormal_ReturnValue;            // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetWeaponOwner_ReturnValue;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALNPCCharacterBP_C*                     K2Node_DynamicCast_AsLNPCCharacter_BP;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELWeaponPartType                              K2Node_Event_PartType;                             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_InAnimState;                          // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_GetActMgrComponentBP_Branches;            // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActMgrComponent*                      CallFunc_GetActMgrComponentBP_ReturnValue;         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_GetLastPlayingAction_ReturnValue;         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Chakram_BLD_Test_C*                 K2Node_DynamicCast_AsBP_Chakram_BLD_Test;          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UABP_Weapon_Charkram_BLD_C*             K2Node_DynamicCast_AsABP_Weapon_Charkram_BLD_1;    // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram) == 0x000008, "Wrong alignment on BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram");
static_assert(sizeof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram) == 0x0000D0, "Wrong size on BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, EntryPoint) == 0x000000, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, K2Node_Event_bOnOff) == 0x000010, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::K2Node_Event_bOnOff' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, K2Node_DynamicCast_AsABP_Weapon_Charkram_BLD) == 0x000018, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::K2Node_DynamicCast_AsABP_Weapon_Charkram_BLD' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, K2Node_Event_BreakPointLocation) == 0x000024, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::K2Node_Event_BreakPointLocation' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, K2Node_Event_ImpulseDirection) == 0x000030, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::K2Node_Event_ImpulseDirection' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, CallFunc_MakeLiteralName_ReturnValue) == 0x000048, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, K2Node_DynamicCast_AsLNPCCharacter) == 0x000050, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::K2Node_DynamicCast_AsLNPCCharacter' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, CallFunc_IsAppliedAbnormal_ReturnValue) == 0x00005A, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::CallFunc_IsAppliedAbnormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, CallFunc_GetWeaponOwner_ReturnValue) == 0x000060, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::CallFunc_GetWeaponOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, K2Node_DynamicCast_AsLNPCCharacter_BP) == 0x000068, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::K2Node_DynamicCast_AsLNPCCharacter_BP' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, CallFunc_GetOwner_ReturnValue_1) == 0x000078, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, K2Node_Event_PartType) == 0x000080, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::K2Node_Event_PartType' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, K2Node_Event_InAnimState) == 0x000084, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::K2Node_Event_InAnimState' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, CallFunc_GetActMgrComponentBP_Branches) == 0x00008C, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::CallFunc_GetActMgrComponentBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, CallFunc_GetActMgrComponentBP_ReturnValue) == 0x000090, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::CallFunc_GetActMgrComponentBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000098, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, CallFunc_GetLastPlayingAction_ReturnValue) == 0x0000A0, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::CallFunc_GetLastPlayingAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, K2Node_DynamicCast_AsBP_Chakram_BLD_Test) == 0x0000A8, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::K2Node_DynamicCast_AsBP_Chakram_BLD_Test' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, K2Node_DynamicCast_bSuccess_3) == 0x0000B0, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, K2Node_SwitchEnum_CmpSuccess) == 0x0000B1, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, CallFunc_GetAnimInstance_ReturnValue_1) == 0x0000B8, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, K2Node_DynamicCast_AsABP_Weapon_Charkram_BLD_1) == 0x0000C0, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::K2Node_DynamicCast_AsABP_Weapon_Charkram_BLD_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram, K2Node_DynamicCast_bSuccess_4) == 0x0000C8, "Member 'BP_Weapon_NPC_Charkram_C_ExecuteUbergraph_BP_Weapon_NPC_Charkram::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");

// Function BP_Weapon_NPC_Charkram.BP_Weapon_NPC_Charkram_C.ChangeAnimStateInner
// 0x000C (0x000C - 0x0000)
struct BP_Weapon_NPC_Charkram_C_ChangeAnimStateInner final
{
public:
	ELWeaponPartType                              PartType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InAnimState;                                       // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_NPC_Charkram_C_ChangeAnimStateInner) == 0x000004, "Wrong alignment on BP_Weapon_NPC_Charkram_C_ChangeAnimStateInner");
static_assert(sizeof(BP_Weapon_NPC_Charkram_C_ChangeAnimStateInner) == 0x00000C, "Wrong size on BP_Weapon_NPC_Charkram_C_ChangeAnimStateInner");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ChangeAnimStateInner, PartType) == 0x000000, "Member 'BP_Weapon_NPC_Charkram_C_ChangeAnimStateInner::PartType' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_ChangeAnimStateInner, InAnimState) == 0x000004, "Member 'BP_Weapon_NPC_Charkram_C_ChangeAnimStateInner::InAnimState' has a wrong offset!");

// Function BP_Weapon_NPC_Charkram.BP_Weapon_NPC_Charkram_C.OnBreakBlade
// 0x0018 (0x0018 - 0x0000)
struct BP_Weapon_NPC_Charkram_C_OnBreakBlade final
{
public:
	struct FVector                                BreakPointLocation;                                // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpulseDirection;                                  // 0x000C(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_NPC_Charkram_C_OnBreakBlade) == 0x000004, "Wrong alignment on BP_Weapon_NPC_Charkram_C_OnBreakBlade");
static_assert(sizeof(BP_Weapon_NPC_Charkram_C_OnBreakBlade) == 0x000018, "Wrong size on BP_Weapon_NPC_Charkram_C_OnBreakBlade");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_OnBreakBlade, BreakPointLocation) == 0x000000, "Member 'BP_Weapon_NPC_Charkram_C_OnBreakBlade::BreakPointLocation' has a wrong offset!");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_OnBreakBlade, ImpulseDirection) == 0x00000C, "Member 'BP_Weapon_NPC_Charkram_C_OnBreakBlade::ImpulseDirection' has a wrong offset!");

// Function BP_Weapon_NPC_Charkram.BP_Weapon_NPC_Charkram_C.OnWeaponOnOff
// 0x0001 (0x0001 - 0x0000)
struct BP_Weapon_NPC_Charkram_C_OnWeaponOnOff final
{
public:
	bool                                          bOnOff;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Weapon_NPC_Charkram_C_OnWeaponOnOff) == 0x000001, "Wrong alignment on BP_Weapon_NPC_Charkram_C_OnWeaponOnOff");
static_assert(sizeof(BP_Weapon_NPC_Charkram_C_OnWeaponOnOff) == 0x000001, "Wrong size on BP_Weapon_NPC_Charkram_C_OnWeaponOnOff");
static_assert(offsetof(BP_Weapon_NPC_Charkram_C_OnWeaponOnOff, bOnOff) == 0x000000, "Member 'BP_Weapon_NPC_Charkram_C_OnWeaponOnOff::bOnOff' has a wrong offset!");

}

