#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Weapon_Base

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Weapon_Base.BP_Weapon_Base_C.ExecuteUbergraph_BP_Weapon_Base
// 0x03C0 (0x03C0 - 0x0000)
struct BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULFXSystem*                             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesSocketExist_ReturnValue;              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesSocketExist_ReturnValue_1;            // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0xC];                                       // 0x0084(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_1;         // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue;     // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_8;                              // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_9;                              // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNewBreakBlade_ReturnValue;              // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNewBreakBlade_ReturnValue_1;            // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNewBreakBlade_ReturnValue_2;            // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_10;                             // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10F[0x1];                                      // 0x010F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue_1;   // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_11;                             // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_12;                             // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_RandomPointInBoundingBox_ReturnValue_2;   // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_13;                             // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Get_Item_1;                         // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_14;                             // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Get_Item_2;                         // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x018D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_15;                             // 0x018E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_16;                             // 0x018F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default_1;                           // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNewBreakBlade_ReturnValue_3;            // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNewBreakBlade_ReturnValue_4;            // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default_2;                           // 0x0193(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default_3;                           // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNewBreakBlade_ReturnValue_5;            // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_17;                             // 0x0196(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_197[0x1];                                      // 0x0197(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_BreakPointLocation;                   // 0x0198(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_ImpulseDirection;                     // 0x01A4(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x01BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x01C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x01D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x01E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayCameraShake_ReturnValue;              // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue_2;                     // 0x01F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetWeaponOwner_ReturnValue;               // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActMgrComponent*                      CallFunc_GetActMgrComponent_ReturnValue;           // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActBase*                              CallFunc_GetActionFromTable_ReturnValue;           // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProcessAction_ReturnValue;                // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsApply;                              // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_222[0x2];                                      // 0x0222(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_AbnormalCodeName;                     // 0x0224(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWeaponOn_ReturnValue;                   // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_MaterialFxCodename_1;                 // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_MaterialFxCodename;                   // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bOnOff;                               // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0245(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_246[0x2];                                      // 0x0246(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRemoveAbnormalStateAfterBroken_ReturnValue; // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWeaponOn_ReturnValue_1;                 // 0x024D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x024E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24F[0x1];                                      // 0x024F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 K2Node_MakeArray_Array;                            // 0x0250(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	bool                                          Temp_bool_Variable_18;                             // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_ElementName_1;                        // 0x0264(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_ElementName;                          // 0x026C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0275(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0276(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_277[0x1];                                      // 0x0277(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         CallFunc_GetWeaponTrailElementFX_ReturnValue;      // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_19;                             // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default_4;                           // 0x0283(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0284(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMass_ReturnValue;                      // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x02BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMass_ReturnValue_1;                    // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x02D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBrokenBladeOnBuild_ReturnValue;        // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 CallFunc_GetWeaponMeshComponentsBySelectionType_OutComponents; // 0x02E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class ALWeapon*                               K2Node_Event_From;                                 // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALWeapon*                               K2Node_Event_To;                                   // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_20;                             // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetWeaponOwner_ReturnValue_1;             // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default_5;                           // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_312[0x6];                                      // 0x0312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALNPCCharacter*                         K2Node_DynamicCast_AsLNPCCharacter;                // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ExecuteWorldEvent_ReturnValue;            // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasBroken_ReturnValue;                    // 0x0322(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasBroken_ReturnValue_1;                  // 0x0323(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         K2Node_Select_Default_6;                           // 0x0328(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasBroken_ReturnValue_2;                  // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasBroken_ReturnValue_3;                  // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_332[0x6];                                      // 0x0332(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         K2Node_Select_Default_7;                           // 0x0338(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNewBreakBlade_ReturnValue_6;            // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        K2Node_Select_Default_8;                           // 0x0348(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0350(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x0360(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x036A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36B[0x5];                                      // 0x036B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetActiveMeshComponent_ReturnValue;       // 0x0370(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_3;    // 0x0378(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_385[0x3];                                      // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_5;           // 0x0388(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetActiveMeshComponent_ReturnValue_1;     // 0x0398(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMass_ReturnValue_2;                    // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A5[0x3];                                      // 0x03A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x03AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base) == 0x000010, "Wrong alignment on BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base");
static_assert(sizeof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base) == 0x0003C0, "Wrong size on BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, EntryPoint) == 0x000000, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, Temp_bool_Variable) == 0x000004, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, Temp_bool_Variable_1) == 0x000005, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, Temp_bool_Variable_2) == 0x000006, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, Temp_bool_Variable_3) == 0x000014, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, Temp_bool_Variable_4) == 0x000020, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, Temp_bool_Variable_5) == 0x000021, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_DoesSocketExist_ReturnValue) == 0x000029, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_DoesSocketExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_DoesSocketExist_ReturnValue_1) == 0x00002A, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_DoesSocketExist_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_BooleanAND_ReturnValue) == 0x00002B, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_GetSocketTransform_ReturnValue) == 0x000030, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_BreakTransform_Location) == 0x000060, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_BreakTransform_Rotation) == 0x00006C, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_BreakTransform_Scale) == 0x000078, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_GetSocketTransform_ReturnValue_1) == 0x000090, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_GetSocketTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, Temp_bool_Variable_6) == 0x0000C0, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_BreakTransform_Location_1) == 0x0000C4, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_BreakTransform_Rotation_1) == 0x0000D0, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_BreakTransform_Scale_1) == 0x0000DC, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_RandomPointInBoundingBox_ReturnValue) == 0x0000E8, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_RandomPointInBoundingBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000F4, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_RandomFloatInRange_ReturnValue) == 0x000100, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_VSize_ReturnValue) == 0x000104, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, Temp_bool_Variable_7) == 0x000108, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, Temp_bool_Variable_8) == 0x000109, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, Temp_bool_Variable_9) == 0x00010A, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_IsNewBreakBlade_ReturnValue) == 0x00010B, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_IsNewBreakBlade_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_IsNewBreakBlade_ReturnValue_1) == 0x00010C, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_IsNewBreakBlade_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_IsNewBreakBlade_ReturnValue_2) == 0x00010D, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_IsNewBreakBlade_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, Temp_bool_Variable_10) == 0x00010E, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::Temp_bool_Variable_10' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_RandomPointInBoundingBox_ReturnValue_1) == 0x000110, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_RandomPointInBoundingBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00011C, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, Temp_int_Loop_Counter_Variable_1) == 0x000120, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, Temp_bool_Variable_11) == 0x000124, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::Temp_bool_Variable_11' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_Add_IntInt_ReturnValue_1) == 0x000128, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, Temp_bool_Variable_12) == 0x00012C, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::Temp_bool_Variable_12' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_RandomPointInBoundingBox_ReturnValue_2) == 0x000130, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_RandomPointInBoundingBox_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x00013C, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, K2Node_Select_Default) == 0x000140, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, Temp_int_Array_Index_Variable_2) == 0x000144, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, Temp_bool_Variable_13) == 0x000148, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::Temp_bool_Variable_13' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_Array_Get_Item) == 0x000150, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_IsValid_ReturnValue_1) == 0x000158, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_Array_Length_ReturnValue) == 0x00015C, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_Less_IntInt_ReturnValue) == 0x000160, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_Array_Get_Item_1) == 0x000168, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_IsValid_ReturnValue_2) == 0x000170, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_Array_Length_ReturnValue_1) == 0x000174, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, Temp_bool_Variable_14) == 0x000178, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::Temp_bool_Variable_14' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_Array_Get_Item_2) == 0x000180, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_Array_Length_ReturnValue_2) == 0x000188, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_IsValid_ReturnValue_3) == 0x00018C, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_Less_IntInt_ReturnValue_1) == 0x00018D, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, Temp_bool_Variable_15) == 0x00018E, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::Temp_bool_Variable_15' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, Temp_bool_Variable_16) == 0x00018F, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::Temp_bool_Variable_16' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, K2Node_Select_Default_1) == 0x000190, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_IsNewBreakBlade_ReturnValue_3) == 0x000191, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_IsNewBreakBlade_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_IsNewBreakBlade_ReturnValue_4) == 0x000192, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_IsNewBreakBlade_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, K2Node_Select_Default_2) == 0x000193, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, K2Node_Select_Default_3) == 0x000194, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_IsNewBreakBlade_ReturnValue_5) == 0x000195, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_IsNewBreakBlade_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, Temp_bool_Variable_17) == 0x000196, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::Temp_bool_Variable_17' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, K2Node_Event_BreakPointLocation) == 0x000198, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::K2Node_Event_BreakPointLocation' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, K2Node_Event_ImpulseDirection) == 0x0001A4, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::K2Node_Event_ImpulseDirection' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_Add_VectorVector_ReturnValue) == 0x0001B0, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0001BC, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_Normal_ReturnValue) == 0x0001C8, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_Normal_ReturnValue_1) == 0x0001D4, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0001E0, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_PlayCameraShake_ReturnValue) == 0x0001EC, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_PlayCameraShake_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_Normal_ReturnValue_2) == 0x0001F0, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_Normal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000200, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_GetWeaponOwner_ReturnValue) == 0x000208, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_GetWeaponOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_GetActMgrComponent_ReturnValue) == 0x000210, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_GetActMgrComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_GetActionFromTable_ReturnValue) == 0x000218, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_GetActionFromTable_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_ProcessAction_ReturnValue) == 0x000220, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_ProcessAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, K2Node_Event_IsApply) == 0x000221, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::K2Node_Event_IsApply' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, K2Node_Event_AbnormalCodeName) == 0x000224, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::K2Node_Event_AbnormalCodeName' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_IsWeaponOn_ReturnValue) == 0x00022C, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_IsWeaponOn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, K2Node_Event_MaterialFxCodename_1) == 0x000230, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::K2Node_Event_MaterialFxCodename_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, K2Node_Event_MaterialFxCodename) == 0x000238, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::K2Node_Event_MaterialFxCodename' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, Temp_int_Loop_Counter_Variable_2) == 0x000240, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, K2Node_Event_bOnOff) == 0x000244, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::K2Node_Event_bOnOff' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_Less_IntInt_ReturnValue_2) == 0x000245, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_Add_IntInt_ReturnValue_2) == 0x000248, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_IsRemoveAbnormalStateAfterBroken_ReturnValue) == 0x00024C, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_IsRemoveAbnormalStateAfterBroken_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_IsWeaponOn_ReturnValue_1) == 0x00024D, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_IsWeaponOn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_IsValid_ReturnValue_4) == 0x00024E, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, K2Node_MakeArray_Array) == 0x000250, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, Temp_bool_Variable_18) == 0x000260, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::Temp_bool_Variable_18' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, K2Node_Event_ElementName_1) == 0x000264, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::K2Node_Event_ElementName_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, K2Node_Event_ElementName) == 0x00026C, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::K2Node_Event_ElementName' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000274, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000275, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_NotEqual_NameName_ReturnValue) == 0x000276, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_GetWeaponTrailElementFX_ReturnValue) == 0x000278, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_GetWeaponTrailElementFX_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_IsValid_ReturnValue_5) == 0x000280, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_IsValid_ReturnValue_6) == 0x000281, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, Temp_bool_Variable_19) == 0x000282, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::Temp_bool_Variable_19' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, K2Node_Select_Default_4) == 0x000283, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000284, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_Add_VectorVector_ReturnValue_3) == 0x000290, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_GetMass_ReturnValue) == 0x00029C, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_GetMass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0002A0, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0002A4, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0002B0, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_Add_VectorVector_ReturnValue_4) == 0x0002BC, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_Add_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_GetMass_ReturnValue_1) == 0x0002C8, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_GetMass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0002CC, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0002D0, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base, CallFunc_GetBrokenBladeOnBuild_ReturnValue) == 0x0002DC, "Member 'BP_Weapon_Base_C_ExecuteUbergraph_BP_Weapon_Base::CallFunc_GetBrokenBladeOnBuild_ReturnValue' has a wrong offset!");
