#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Whirlwind_Loop

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BP_Whirlwind_Loop.BP_Whirlwind_Loop_C.ExecuteUbergraph_BP_Whirlwind_Loop
// 0x00B0 (0x00B0 - 0x0000)
struct BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_PlaySkillActionBP_Branches;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_PlaySkillActionBP_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActMgrComponent*                      K2Node_CustomEvent_ActMgrComponent;                // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_TargetActor;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Command;                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Lever;                          // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SkipCommandPrerequisitiesCheck; // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInst_ReturnValue;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCommandPressed_ReturnValue;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EExecutePin                                   CallFunc_GetMontage_CurrentSectionBP_Branches;     // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetMontage_CurrentSectionBP_ReturnValue;  // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_1;                    // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ULActMgrComponent* ActMgrComponent, class AActor* TargetActor, class FName Command, const struct FVector& Lever, bool SkipCommandPrerequisitiesCheck)> K2Node_CreateDelegate_OutputDelegate;              // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	EExecutePin                                   CallFunc_PlaySkillActionBP_Branches_1;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_PlaySkillActionBP_ReturnValue_1;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentFrenzyUnitCount_ReturnValue;    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop) == 0x000008, "Wrong alignment on BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop");
static_assert(sizeof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop) == 0x0000B0, "Wrong size on BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, EntryPoint) == 0x000000, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, CallFunc_PlaySkillActionBP_Branches) == 0x000004, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::CallFunc_PlaySkillActionBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, CallFunc_PlaySkillActionBP_ReturnValue) == 0x000008, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::CallFunc_PlaySkillActionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, K2Node_Event_ReasonAction) == 0x000020, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, K2Node_Event_Reason) == 0x000028, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, K2Node_CustomEvent_ActMgrComponent) == 0x000030, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::K2Node_CustomEvent_ActMgrComponent' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, K2Node_CustomEvent_TargetActor) == 0x000038, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::K2Node_CustomEvent_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, K2Node_CustomEvent_Command) == 0x000040, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::K2Node_CustomEvent_Command' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, K2Node_CustomEvent_Lever) == 0x000048, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::K2Node_CustomEvent_Lever' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, K2Node_CustomEvent_SkipCommandPrerequisitiesCheck) == 0x000054, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::K2Node_CustomEvent_SkipCommandPrerequisitiesCheck' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, K2Node_SwitchName_CmpSuccess) == 0x000055, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, Temp_int_Variable) == 0x000058, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, K2Node_Event_DeltaTime) == 0x00005C, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, CallFunc_GetAnimInst_ReturnValue) == 0x000060, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::CallFunc_GetAnimInst_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, CallFunc_IsCommandPressed_ReturnValue) == 0x000068, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::CallFunc_IsCommandPressed_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, CallFunc_GetMontage_CurrentSectionBP_Branches) == 0x000069, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::CallFunc_GetMontage_CurrentSectionBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, CallFunc_GetMontage_CurrentSectionBP_ReturnValue) == 0x00006C, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::CallFunc_GetMontage_CurrentSectionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, K2Node_SwitchName_CmpSuccess_1) == 0x000074, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::K2Node_SwitchName_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, K2Node_SwitchEnum_CmpSuccess_1) == 0x000075, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, K2Node_CreateDelegate_OutputDelegate) == 0x000078, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, CallFunc_PlaySkillActionBP_Branches_1) == 0x000088, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::CallFunc_PlaySkillActionBP_Branches_1' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, CallFunc_PlaySkillActionBP_ReturnValue_1) == 0x000090, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::CallFunc_PlaySkillActionBP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, K2Node_DynamicCast_AsLPCCharacter) == 0x000098, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::K2Node_DynamicCast_AsLPCCharacter' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, K2Node_SwitchEnum_CmpSuccess_2) == 0x0000A1, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, CallFunc_GetCurrentFrenzyUnitCount_ReturnValue) == 0x0000A4, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::CallFunc_GetCurrentFrenzyUnitCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000A8, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000A9, "Member 'BP_Whirlwind_Loop_C_ExecuteUbergraph_BP_Whirlwind_Loop::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Whirlwind_Loop.BP_Whirlwind_Loop_C.OnTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Whirlwind_Loop_C_OnTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Whirlwind_Loop_C_OnTick) == 0x000004, "Wrong alignment on BP_Whirlwind_Loop_C_OnTick");
static_assert(sizeof(BP_Whirlwind_Loop_C_OnTick) == 0x000004, "Wrong size on BP_Whirlwind_Loop_C_OnTick");
static_assert(offsetof(BP_Whirlwind_Loop_C_OnTick, DeltaTime) == 0x000000, "Member 'BP_Whirlwind_Loop_C_OnTick::DeltaTime' has a wrong offset!");

// Function BP_Whirlwind_Loop.BP_Whirlwind_Loop_C.OnCommandOccurred_Event
// 0x0028 (0x0028 - 0x0000)
struct BP_Whirlwind_Loop_C_OnCommandOccurred_Event final
{
public:
	class ULActMgrComponent*                      ActMgrComponent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Command;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Lever;                                             // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipCommandPrerequisitiesCheck;                    // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Whirlwind_Loop_C_OnCommandOccurred_Event) == 0x000008, "Wrong alignment on BP_Whirlwind_Loop_C_OnCommandOccurred_Event");
static_assert(sizeof(BP_Whirlwind_Loop_C_OnCommandOccurred_Event) == 0x000028, "Wrong size on BP_Whirlwind_Loop_C_OnCommandOccurred_Event");
static_assert(offsetof(BP_Whirlwind_Loop_C_OnCommandOccurred_Event, ActMgrComponent) == 0x000000, "Member 'BP_Whirlwind_Loop_C_OnCommandOccurred_Event::ActMgrComponent' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_OnCommandOccurred_Event, TargetActor) == 0x000008, "Member 'BP_Whirlwind_Loop_C_OnCommandOccurred_Event::TargetActor' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_OnCommandOccurred_Event, Command) == 0x000010, "Member 'BP_Whirlwind_Loop_C_OnCommandOccurred_Event::Command' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_OnCommandOccurred_Event, Lever) == 0x000018, "Member 'BP_Whirlwind_Loop_C_OnCommandOccurred_Event::Lever' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_OnCommandOccurred_Event, SkipCommandPrerequisitiesCheck) == 0x000024, "Member 'BP_Whirlwind_Loop_C_OnCommandOccurred_Event::SkipCommandPrerequisitiesCheck' has a wrong offset!");

// Function BP_Whirlwind_Loop.BP_Whirlwind_Loop_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct BP_Whirlwind_Loop_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Whirlwind_Loop_C_OnStop) == 0x000008, "Wrong alignment on BP_Whirlwind_Loop_C_OnStop");
static_assert(sizeof(BP_Whirlwind_Loop_C_OnStop) == 0x000010, "Wrong size on BP_Whirlwind_Loop_C_OnStop");
static_assert(offsetof(BP_Whirlwind_Loop_C_OnStop, ReasonAction) == 0x000000, "Member 'BP_Whirlwind_Loop_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_OnStop, Reason) == 0x000008, "Member 'BP_Whirlwind_Loop_C_OnStop::Reason' has a wrong offset!");

// Function BP_Whirlwind_Loop.BP_Whirlwind_Loop_C.OnSelectNextAnim
// 0x0018 (0x0018 - 0x0000)
struct BP_Whirlwind_Loop_C_OnSelectNextAnim final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentAnimIndex;                                  // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Whirlwind_Loop_C_OnSelectNextAnim) == 0x000008, "Wrong alignment on BP_Whirlwind_Loop_C_OnSelectNextAnim");
static_assert(sizeof(BP_Whirlwind_Loop_C_OnSelectNextAnim) == 0x000018, "Wrong size on BP_Whirlwind_Loop_C_OnSelectNextAnim");
static_assert(offsetof(BP_Whirlwind_Loop_C_OnSelectNextAnim, Montage) == 0x000000, "Member 'BP_Whirlwind_Loop_C_OnSelectNextAnim::Montage' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_OnSelectNextAnim, bInterrupted) == 0x000008, "Member 'BP_Whirlwind_Loop_C_OnSelectNextAnim::bInterrupted' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_OnSelectNextAnim, CurrentAnimIndex) == 0x00000C, "Member 'BP_Whirlwind_Loop_C_OnSelectNextAnim::CurrentAnimIndex' has a wrong offset!");
static_assert(offsetof(BP_Whirlwind_Loop_C_OnSelectNextAnim, ReturnValue) == 0x000010, "Member 'BP_Whirlwind_Loop_C_OnSelectNextAnim::ReturnValue' has a wrong offset!");

}

