#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Wire_GrappleGun_NPC

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ProjectP_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK::Params
{

// Function BP_Wire_GrappleGun_NPC.BP_Wire_GrappleGun_NPC_C.ExecuteUbergraph_BP_Wire_GrappleGun_NPC
// 0x0330 (0x0330 - 0x0000)
struct BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_Invincible_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckHostileType_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_SuperArmor_ReturnValue;       // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_GrappleGun_Reflect_ReturnValue; // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELActionCategory                              CallFunc_GetCurrentActionCategory_ReturnValue;     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_GetLastPlayingAction_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Action_WireAction_NPC_C*            K2Node_DynamicCast_AsBP_Action_Wire_Action_NPC;    // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActMgrComponent*                      CallFunc_GetActMgrComponent_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindActionStateAny_ReturnValue;           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActBase*                              CallFunc_GetLastPlayingAction_ReturnValue_1;       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Action_WireAction_NPC_C*            K2Node_DynamicCast_AsBP_Action_Wire_Action_NPC_1;  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_Up_ReturnValue;                    // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromXZ_ReturnValue;                // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x00EC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_4;                   // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter;                   // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter_1;                 // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_CH_PC_Pino_C*                      K2Node_DynamicCast_AsABP_CH_PC_Pino;               // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_5;                   // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter_2;                 // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter;                 // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALNPCCharacter*                         K2Node_DynamicCast_AsLNPCCharacter;                // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELGrapplegunHitType                           CallFunc_GetGrapplegunHitType_ReturnValue;         // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0223(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActMgrComponent*                      CallFunc_GetActMgrComponent_ReturnValue_1;         // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ActionState_Invincible_ReturnValue_1;     // 0x0234(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array_1;                          // 0x0240(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_6;                   // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindActionStateAny_ReturnValue_1;         // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_GetLastPlayingAction_ReturnValue_2;       // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Action_WireAction_NPC_C*            K2Node_DynamicCast_AsBP_Action_Wire_Action_NPC_2;  // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_FindClosestBone_K2_BoneLocation;          // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_FindClosestBone_K2_ReturnValue;           // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_1;               // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALNPCCharacter*                         K2Node_DynamicCast_AsLNPCCharacter_1;              // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELGrapplegunHitType                           CallFunc_GetGrapplegunHitType_ReturnValue_1;       // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B3[0x5];                                      // 0x02B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_7;                   // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_GetHitProcComponentBP_Branches;           // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULHitProcComponent*                     CallFunc_GetHitProcComponentBP_ReturnValue;        // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x02E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E6[0x2];                                      // 0x02E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_8;                   // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActBase*                              CallFunc_GetLastPlayingAction_ReturnValue_3;       // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Action_WireAction_NPC_C*            K2Node_DynamicCast_AsBP_Action_Wire_Action_NPC_3;  // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_302[0x6];                                      // 0x0302(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_9;                   // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_GetLastPlayingAction_ReturnValue_4;       // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Action_WireAction_NPC_C*            K2Node_DynamicCast_AsBP_Action_Wire_Action_NPC_4;  // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC) == 0x000008, "Wrong alignment on BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC");
static_assert(sizeof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC) == 0x000330, "Wrong size on BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, EntryPoint) == 0x000000, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_ActionState_Invincible_ReturnValue) == 0x000010, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_ActionState_Invincible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_CheckHostileType_ReturnValue) == 0x000018, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_CheckHostileType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_ActionState_SuperArmor_ReturnValue) == 0x00001C, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_ActionState_SuperArmor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_ActionState_GrappleGun_Reflect_ReturnValue) == 0x000024, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_ActionState_GrappleGun_Reflect_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_MakeArray_Array) == 0x000030, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_GetOwner_ReturnValue_1) == 0x000040, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_GetCurrentActionCategory_ReturnValue) == 0x000048, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_GetCurrentActionCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_GetLastPlayingAction_ReturnValue) == 0x000050, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_GetLastPlayingAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000058, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_DynamicCast_AsBP_Action_Wire_Action_NPC) == 0x000060, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_DynamicCast_AsBP_Action_Wire_Action_NPC' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_GetActMgrComponent_ReturnValue) == 0x000070, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_GetActMgrComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_FindActionStateAny_ReturnValue) == 0x000078, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_FindActionStateAny_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_Not_PreBool_ReturnValue) == 0x000079, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_GetOwner_ReturnValue_2) == 0x000080, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_GetLastPlayingAction_ReturnValue_1) == 0x000088, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_GetLastPlayingAction_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_DynamicCast_AsBP_Action_Wire_Action_NPC_1) == 0x000090, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_DynamicCast_AsBP_Action_Wire_Action_NPC_1' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_GetActorForwardVector_ReturnValue) == 0x00009C, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000A8, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_Vector_Up_ReturnValue) == 0x0000B4, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_Vector_Up_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000C0, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_MakeRotFromXZ_ReturnValue) == 0x0000CC, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_MakeRotFromXZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_Vector_Distance_ReturnValue) == 0x0000D8, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000DC, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_FindLookAtRotation_ReturnValue) == 0x0000E0, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0000EC, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_GetOwner_ReturnValue_3) == 0x000178, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_GetOwner_ReturnValue_4) == 0x000180, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_GetOwner_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_DynamicCast_AsLCharacter) == 0x000188, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_DynamicCast_AsLCharacter' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_DynamicCast_bSuccess_2) == 0x000190, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_DynamicCast_AsLCharacter_1) == 0x000198, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_DynamicCast_AsLCharacter_1' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_DynamicCast_bSuccess_3) == 0x0001A0, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_GetAnimInstance_ReturnValue) == 0x0001A8, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_GetSocketRotation_ReturnValue) == 0x0001B0, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_GetSocketRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_DynamicCast_AsABP_CH_PC_Pino) == 0x0001C0, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_DynamicCast_AsABP_CH_PC_Pino' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_DynamicCast_bSuccess_4) == 0x0001C8, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_GetForwardVector_ReturnValue) == 0x0001CC, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001D8, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_Add_VectorVector_ReturnValue) == 0x0001E4, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_GetOwner_ReturnValue_5) == 0x0001F0, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_GetOwner_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_DynamicCast_AsLCharacter_2) == 0x0001F8, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_DynamicCast_AsLCharacter_2' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_DynamicCast_bSuccess_5) == 0x000200, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_DynamicCast_AsLPCCharacter) == 0x000208, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_DynamicCast_AsLPCCharacter' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_DynamicCast_bSuccess_6) == 0x000210, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_DynamicCast_AsLNPCCharacter) == 0x000218, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_DynamicCast_AsLNPCCharacter' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_DynamicCast_bSuccess_7) == 0x000220, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_GetGrapplegunHitType_ReturnValue) == 0x000221, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_GetGrapplegunHitType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_SwitchEnum_CmpSuccess) == 0x000222, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000223, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_IsValid_ReturnValue) == 0x000224, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_GetActMgrComponent_ReturnValue_1) == 0x000228, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_GetActMgrComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_IsValid_ReturnValue_1) == 0x000230, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_ActionState_Invincible_ReturnValue_1) == 0x000234, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_ActionState_Invincible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_MakeArray_Array_1) == 0x000240, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_GetOwner_ReturnValue_6) == 0x000250, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_GetOwner_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_FindActionStateAny_ReturnValue_1) == 0x000258, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_FindActionStateAny_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_GetLastPlayingAction_ReturnValue_2) == 0x000260, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_GetLastPlayingAction_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_Not_PreBool_ReturnValue_1) == 0x000268, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_DynamicCast_AsBP_Action_Wire_Action_NPC_2) == 0x000270, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_DynamicCast_AsBP_Action_Wire_Action_NPC_2' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_DynamicCast_bSuccess_8) == 0x000278, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_FindClosestBone_K2_BoneLocation) == 0x00027C, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_FindClosestBone_K2_BoneLocation' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_FindClosestBone_K2_ReturnValue) == 0x000288, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_FindClosestBone_K2_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_NotEqual_NameName_ReturnValue) == 0x000290, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000291, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_DynamicCast_AsLPCCharacter_1) == 0x000298, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_DynamicCast_AsLPCCharacter_1' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_DynamicCast_bSuccess_9) == 0x0002A0, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_DynamicCast_AsLNPCCharacter_1) == 0x0002A8, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_DynamicCast_AsLNPCCharacter_1' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_DynamicCast_bSuccess_10) == 0x0002B0, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_GetGrapplegunHitType_ReturnValue_1) == 0x0002B1, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_GetGrapplegunHitType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_SwitchEnum_CmpSuccess_1) == 0x0002B2, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_GetOwner_ReturnValue_7) == 0x0002B8, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_GetOwner_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0002C0, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_GetHitProcComponentBP_Branches) == 0x0002CC, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_GetHitProcComponentBP_Branches' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_GetHitProcComponentBP_ReturnValue) == 0x0002D0, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_GetHitProcComponentBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0002D8, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_SwitchEnum_CmpSuccess_2) == 0x0002E4, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_Not_PreBool_ReturnValue_2) == 0x0002E5, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_GetOwner_ReturnValue_8) == 0x0002E8, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_GetOwner_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_GetLastPlayingAction_ReturnValue_3) == 0x0002F0, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_GetLastPlayingAction_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_DynamicCast_AsBP_Action_Wire_Action_NPC_3) == 0x0002F8, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_DynamicCast_AsBP_Action_Wire_Action_NPC_3' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_DynamicCast_bSuccess_11) == 0x000300, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_IsValid_ReturnValue_2) == 0x000301, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_GetOwner_ReturnValue_9) == 0x000308, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_GetOwner_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_IsValid_ReturnValue_3) == 0x000310, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, CallFunc_GetLastPlayingAction_ReturnValue_4) == 0x000318, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::CallFunc_GetLastPlayingAction_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_DynamicCast_AsBP_Action_Wire_Action_NPC_4) == 0x000320, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_DynamicCast_AsBP_Action_Wire_Action_NPC_4' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC, K2Node_DynamicCast_bSuccess_12) == 0x000328, "Member 'BP_Wire_GrappleGun_NPC_C_ExecuteUbergraph_BP_Wire_GrappleGun_NPC::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");

// Function BP_Wire_GrappleGun_NPC.BP_Wire_GrappleGun_NPC_C.PlayFollowingAction
// 0x0030 (0x0030 - 0x0000)
struct BP_Wire_GrappleGun_NPC_C_PlayFollowingAction final
{
public:
	class ALCharacter*                            MoveActor_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALCharacter*                            DestActor;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActMgrComponent*                      CallFunc_GetActMgrComponent_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActBase*                              CallFunc_GetLastPlayingAction_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Action_WireAction_Following_NPC_C*  K2Node_DynamicCast_AsBP_Action_Wire_Action_Following_NPC; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Wire_GrappleGun_NPC_C_PlayFollowingAction) == 0x000008, "Wrong alignment on BP_Wire_GrappleGun_NPC_C_PlayFollowingAction");
static_assert(sizeof(BP_Wire_GrappleGun_NPC_C_PlayFollowingAction) == 0x000030, "Wrong size on BP_Wire_GrappleGun_NPC_C_PlayFollowingAction");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_PlayFollowingAction, MoveActor_0) == 0x000000, "Member 'BP_Wire_GrappleGun_NPC_C_PlayFollowingAction::MoveActor_0' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_PlayFollowingAction, DestActor) == 0x000008, "Member 'BP_Wire_GrappleGun_NPC_C_PlayFollowingAction::DestActor' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_PlayFollowingAction, CallFunc_GetActMgrComponent_ReturnValue) == 0x000010, "Member 'BP_Wire_GrappleGun_NPC_C_PlayFollowingAction::CallFunc_GetActMgrComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_PlayFollowingAction, CallFunc_GetLastPlayingAction_ReturnValue) == 0x000018, "Member 'BP_Wire_GrappleGun_NPC_C_PlayFollowingAction::CallFunc_GetLastPlayingAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_PlayFollowingAction, K2Node_DynamicCast_AsBP_Action_Wire_Action_Following_NPC) == 0x000020, "Member 'BP_Wire_GrappleGun_NPC_C_PlayFollowingAction::K2Node_DynamicCast_AsBP_Action_Wire_Action_Following_NPC' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_PlayFollowingAction, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Wire_GrappleGun_NPC_C_PlayFollowingAction::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_Wire_GrappleGun_NPC.BP_Wire_GrappleGun_NPC_C.SetWireDirection
// 0x00F8 (0x00F8 - 0x0000)
struct BP_Wire_GrappleGun_NPC_C_SetWireDirection final
{
public:
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_2;        // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALNPCCharacter*                         K2Node_DynamicCast_AsLNPCCharacter;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActMgrComponent*                      CallFunc_GetActMgrComponent_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSkillTarget_ReturnValue;           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter;                   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_3;                      // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_3;                     // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_3;                       // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ClampAngle_ReturnValue;                   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ClampAngle_ReturnValue_1;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue_1;        // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Wire_GrappleGun_NPC_C_SetWireDirection) == 0x000008, "Wrong alignment on BP_Wire_GrappleGun_NPC_C_SetWireDirection");
static_assert(sizeof(BP_Wire_GrappleGun_NPC_C_SetWireDirection) == 0x0000F8, "Wrong size on BP_Wire_GrappleGun_NPC_C_SetWireDirection");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_SetWireDirection, CallFunc_GetOwner_ReturnValue) == 0x000000, "Member 'BP_Wire_GrappleGun_NPC_C_SetWireDirection::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Wire_GrappleGun_NPC_C_SetWireDirection, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000008, "Member 'BP_Wire_GrappleGun_NPC_C_SetWireDirection::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
