#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPF_TAD_SpotLight

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BPF_TAD_SpotLight.BPF_TAD_SpotLight_C.BPF TAD Spot Light
// 0x0050 (0x0050 - 0x0000)
struct BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light final
{
public:
	class USpotLightComponent*                    SpotLight;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LightColor;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Intensity;                                         // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temperature;                                       // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttenuationRadius;                                 // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InnerConeAngle;                                    // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OuterConeAngle;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VolumScatterIntensity;                             // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EComponentMobility                            Mobility;                                          // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELightUnits                                   IntensityUnits;                                    // 0x0031(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CastShadow;                                        // 0x0032(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Specular_Scale;                                    // 0x0034(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Source_Radius;                                     // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Contact_Shadow;                                    // 0x003C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Shadow_Slop_Bias;                                  // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Shadow_Bias;                                       // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light) == 0x000008, "Wrong alignment on BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light");
static_assert(sizeof(BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light) == 0x000050, "Wrong size on BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light");
static_assert(offsetof(BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light, SpotLight) == 0x000000, "Member 'BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light::SpotLight' has a wrong offset!");
static_assert(offsetof(BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light, LightColor) == 0x000008, "Member 'BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light::LightColor' has a wrong offset!");
static_assert(offsetof(BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light, Intensity) == 0x000018, "Member 'BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light::Intensity' has a wrong offset!");
static_assert(offsetof(BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light, Temperature) == 0x00001C, "Member 'BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light::Temperature' has a wrong offset!");
static_assert(offsetof(BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light, AttenuationRadius) == 0x000020, "Member 'BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light::AttenuationRadius' has a wrong offset!");
static_assert(offsetof(BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light, InnerConeAngle) == 0x000024, "Member 'BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light::InnerConeAngle' has a wrong offset!");
static_assert(offsetof(BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light, OuterConeAngle) == 0x000028, "Member 'BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light::OuterConeAngle' has a wrong offset!");
static_assert(offsetof(BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light, VolumScatterIntensity) == 0x00002C, "Member 'BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light::VolumScatterIntensity' has a wrong offset!");
static_assert(offsetof(BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light, Mobility) == 0x000030, "Member 'BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light::Mobility' has a wrong offset!");
static_assert(offsetof(BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light, IntensityUnits) == 0x000031, "Member 'BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light::IntensityUnits' has a wrong offset!");
static_assert(offsetof(BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light, CastShadow) == 0x000032, "Member 'BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light::CastShadow' has a wrong offset!");
static_assert(offsetof(BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light, Specular_Scale) == 0x000034, "Member 'BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light::Specular_Scale' has a wrong offset!");
static_assert(offsetof(BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light, Source_Radius) == 0x000038, "Member 'BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light::Source_Radius' has a wrong offset!");
static_assert(offsetof(BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light, Contact_Shadow) == 0x00003C, "Member 'BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light::Contact_Shadow' has a wrong offset!");
static_assert(offsetof(BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light, __WorldContext) == 0x000040, "Member 'BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light, Shadow_Slop_Bias) == 0x000048, "Member 'BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light::Shadow_Slop_Bias' has a wrong offset!");
static_assert(offsetof(BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light, Shadow_Bias) == 0x00004C, "Member 'BPF_TAD_SpotLight_C_BPF_TAD_Spot_Light::Shadow_Bias' has a wrong offset!");

}

