#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BS_DisplacementShape

#include "Basic.hpp"

#include "BE_DisplacementShape_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct BS_DisplacementShape.BS_DisplacementShape
// 0x0050 (0x0050 - 0x0000)
struct FBS_DisplacementShape final
{
public:
	EBE_DisplacementShape                         Type_40_D9DCA5D148741869C2B30C98F47F045F;          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Intensity_65_6AD371EC45C33B6868E3A38617FCB979;     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform_46_B120AC2D41FD25FF4E14FF99E8D89E71;     // 0x0010(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class UTexture*                               Pattern_64_E169050C4EF699A1F28D369B40805FDD;       // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FBS_DisplacementShape) == 0x000010, "Wrong alignment on FBS_DisplacementShape");
static_assert(sizeof(FBS_DisplacementShape) == 0x000050, "Wrong size on FBS_DisplacementShape");
static_assert(offsetof(FBS_DisplacementShape, Type_40_D9DCA5D148741869C2B30C98F47F045F) == 0x000000, "Member 'FBS_DisplacementShape::Type_40_D9DCA5D148741869C2B30C98F47F045F' has a wrong offset!");
static_assert(offsetof(FBS_DisplacementShape, Intensity_65_6AD371EC45C33B6868E3A38617FCB979) == 0x000004, "Member 'FBS_DisplacementShape::Intensity_65_6AD371EC45C33B6868E3A38617FCB979' has a wrong offset!");
static_assert(offsetof(FBS_DisplacementShape, Transform_46_B120AC2D41FD25FF4E14FF99E8D89E71) == 0x000010, "Member 'FBS_DisplacementShape::Transform_46_B120AC2D41FD25FF4E14FF99E8D89E71' has a wrong offset!");
static_assert(offsetof(FBS_DisplacementShape, Pattern_64_E169050C4EF699A1F28D369B40805FDD) == 0x000040, "Member 'FBS_DisplacementShape::Pattern_64_E169050C4EF699A1F28D369B40805FDD' has a wrong offset!");

}

