#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BS_FootstepLoop

#include "Basic.hpp"

#include "BS_FootstepAttachement_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct BS_FootstepLoop.BS_FootstepLoop
// 0x0090 (0x0090 - 0x0000)
struct FBS_FootstepLoop final
{
public:
	bool                                          Active_7_021BBB0E4D8CADAAE8BAD8A4C007BEA1;         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    Parent_29_3B2DE5CC4236E0ADAB30E4BED5E4166D;        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBS_FootstepAttachement                Attachement_26_8C52E8664CD1E2061AC7CB856D1FDA3F;   // 0x0010(0x0050)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_FootstepPreset_C*                   Preset_18_AA5E45004FAF106536BF8D847EE7FA17;        // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Particle_33_D659FEB34A5D7800BF052F8F105A77FC;      // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio_34_16B7206A4B6FC66BF8957CAB191A1B1D;         // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PreviousLocation_37_D9FEE9F4422548814CF8FA80A4BBA1C2; // 0x0078(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FBS_FootstepLoop) == 0x000010, "Wrong alignment on FBS_FootstepLoop");
static_assert(sizeof(FBS_FootstepLoop) == 0x000090, "Wrong size on FBS_FootstepLoop");
static_assert(offsetof(FBS_FootstepLoop, Active_7_021BBB0E4D8CADAAE8BAD8A4C007BEA1) == 0x000000, "Member 'FBS_FootstepLoop::Active_7_021BBB0E4D8CADAAE8BAD8A4C007BEA1' has a wrong offset!");
static_assert(offsetof(FBS_FootstepLoop, Parent_29_3B2DE5CC4236E0ADAB30E4BED5E4166D) == 0x000008, "Member 'FBS_FootstepLoop::Parent_29_3B2DE5CC4236E0ADAB30E4BED5E4166D' has a wrong offset!");
static_assert(offsetof(FBS_FootstepLoop, Attachement_26_8C52E8664CD1E2061AC7CB856D1FDA3F) == 0x000010, "Member 'FBS_FootstepLoop::Attachement_26_8C52E8664CD1E2061AC7CB856D1FDA3F' has a wrong offset!");
static_assert(offsetof(FBS_FootstepLoop, Preset_18_AA5E45004FAF106536BF8D847EE7FA17) == 0x000060, "Member 'FBS_FootstepLoop::Preset_18_AA5E45004FAF106536BF8D847EE7FA17' has a wrong offset!");
static_assert(offsetof(FBS_FootstepLoop, Particle_33_D659FEB34A5D7800BF052F8F105A77FC) == 0x000068, "Member 'FBS_FootstepLoop::Particle_33_D659FEB34A5D7800BF052F8F105A77FC' has a wrong offset!");
static_assert(offsetof(FBS_FootstepLoop, Audio_34_16B7206A4B6FC66BF8957CAB191A1B1D) == 0x000070, "Member 'FBS_FootstepLoop::Audio_34_16B7206A4B6FC66BF8957CAB191A1B1D' has a wrong offset!");
static_assert(offsetof(FBS_FootstepLoop, PreviousLocation_37_D9FEE9F4422548814CF8FA80A4BBA1C2) == 0x000078, "Member 'FBS_FootstepLoop::PreviousLocation_37_D9FEE9F4422548814CF8FA80A4BBA1C2' has a wrong offset!");

}

