#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTask_ModifyCooltime

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTask_ModifyCooltime.BTask_ModifyCooltime_C
// 0x0030 (0x00E0 - 0x00B0)
class UBTask_ModifyCooltime_C final : public ULBTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	ELModifyCooltimeChangeType                    ChangeType;                                        // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           SkillCodeNames;                                    // 0x00C0(0x0010)(Edit, BlueprintVisible)
	ELAIFloatValueType                            ValueType;                                         // 0x00D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CoolTime;                                          // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELModifyCooltimeTargetType                    TargetType;                                        // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Except_Skill_Code_Names;                           // 0x00D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BTask_ModifyCooltime(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTask_ModifyCooltime_C">();
	}
	static class UBTask_ModifyCooltime_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTask_ModifyCooltime_C>();
	}
};
static_assert(alignof(UBTask_ModifyCooltime_C) == 0x000008, "Wrong alignment on UBTask_ModifyCooltime_C");
static_assert(sizeof(UBTask_ModifyCooltime_C) == 0x0000E0, "Wrong size on UBTask_ModifyCooltime_C");
static_assert(offsetof(UBTask_ModifyCooltime_C, UberGraphFrame) == 0x0000B0, "Member 'UBTask_ModifyCooltime_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTask_ModifyCooltime_C, ChangeType) == 0x0000B8, "Member 'UBTask_ModifyCooltime_C::ChangeType' has a wrong offset!");
static_assert(offsetof(UBTask_ModifyCooltime_C, SkillCodeNames) == 0x0000C0, "Member 'UBTask_ModifyCooltime_C::SkillCodeNames' has a wrong offset!");
static_assert(offsetof(UBTask_ModifyCooltime_C, ValueType) == 0x0000D0, "Member 'UBTask_ModifyCooltime_C::ValueType' has a wrong offset!");
static_assert(offsetof(UBTask_ModifyCooltime_C, CoolTime) == 0x0000D4, "Member 'UBTask_ModifyCooltime_C::CoolTime' has a wrong offset!");
static_assert(offsetof(UBTask_ModifyCooltime_C, TargetType) == 0x0000D8, "Member 'UBTask_ModifyCooltime_C::TargetType' has a wrong offset!");
static_assert(offsetof(UBTask_ModifyCooltime_C, Except_Skill_Code_Names) == 0x0000D9, "Member 'UBTask_ModifyCooltime_C::Except_Skill_Code_Names' has a wrong offset!");

}

