#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTask_Int_Set

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTask_Int_Set.BTask_Int_Set_C.ExecuteUbergraph_BTask_Int_Set
// 0x0030 (0x0030 - 0x0000)
struct BTask_Int_Set_C_ExecuteUbergraph_BTask_Int_Set final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBlackboardValueAsInt_ReturnValue;      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBlackboardValueAsInt_ReturnValue_1;    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTask_Int_Set_C_ExecuteUbergraph_BTask_Int_Set) == 0x000008, "Wrong alignment on BTask_Int_Set_C_ExecuteUbergraph_BTask_Int_Set");
static_assert(sizeof(BTask_Int_Set_C_ExecuteUbergraph_BTask_Int_Set) == 0x000030, "Wrong size on BTask_Int_Set_C_ExecuteUbergraph_BTask_Int_Set");
static_assert(offsetof(BTask_Int_Set_C_ExecuteUbergraph_BTask_Int_Set, EntryPoint) == 0x000000, "Member 'BTask_Int_Set_C_ExecuteUbergraph_BTask_Int_Set::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTask_Int_Set_C_ExecuteUbergraph_BTask_Int_Set, K2Node_Event_OwnerController) == 0x000008, "Member 'BTask_Int_Set_C_ExecuteUbergraph_BTask_Int_Set::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTask_Int_Set_C_ExecuteUbergraph_BTask_Int_Set, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTask_Int_Set_C_ExecuteUbergraph_BTask_Int_Set::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTask_Int_Set_C_ExecuteUbergraph_BTask_Int_Set, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'BTask_Int_Set_C_ExecuteUbergraph_BTask_Int_Set::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BTask_Int_Set_C_ExecuteUbergraph_BTask_Int_Set, CallFunc_GetBlackboardValueAsInt_ReturnValue) == 0x00001C, "Member 'BTask_Int_Set_C_ExecuteUbergraph_BTask_Int_Set::CallFunc_GetBlackboardValueAsInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_Int_Set_C_ExecuteUbergraph_BTask_Int_Set, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BTask_Int_Set_C_ExecuteUbergraph_BTask_Int_Set::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_Int_Set_C_ExecuteUbergraph_BTask_Int_Set, CallFunc_GetBlackboardValueAsInt_ReturnValue_1) == 0x000024, "Member 'BTask_Int_Set_C_ExecuteUbergraph_BTask_Int_Set::CallFunc_GetBlackboardValueAsInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTask_Int_Set_C_ExecuteUbergraph_BTask_Int_Set, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'BTask_Int_Set_C_ExecuteUbergraph_BTask_Int_Set::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function BTask_Int_Set.BTask_Int_Set_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTask_Int_Set_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTask_Int_Set_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTask_Int_Set_C_ReceiveExecuteAI");
static_assert(sizeof(BTask_Int_Set_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTask_Int_Set_C_ReceiveExecuteAI");
static_assert(offsetof(BTask_Int_Set_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTask_Int_Set_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTask_Int_Set_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTask_Int_Set_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

