#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTask_Suicide

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTask_Suicide.BTask_Suicide_C.ExecuteUbergraph_BTask_Suicide
// 0x0050 (0x0050 - 0x0000)
struct BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALNPCCharacter*                         K2Node_DynamicCast_AsLNPCCharacter;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide) == 0x000008, "Wrong alignment on BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide");
static_assert(sizeof(BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide) == 0x000050, "Wrong size on BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide");
static_assert(offsetof(BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide, EntryPoint) == 0x000000, "Member 'BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide, CallFunc_Array_Get_Item) == 0x000010, "Member 'BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide, K2Node_Event_OwnerController) == 0x000020, "Member 'BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide, K2Node_Event_ControlledPawn) == 0x000028, "Member 'BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide, K2Node_DynamicCast_AsLCharacter) == 0x000030, "Member 'BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide::K2Node_DynamicCast_AsLCharacter' has a wrong offset!");
static_assert(offsetof(BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide, K2Node_DynamicCast_AsLNPCCharacter) == 0x000040, "Member 'BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide::K2Node_DynamicCast_AsLNPCCharacter' has a wrong offset!");
static_assert(offsetof(BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BTask_Suicide_C_ExecuteUbergraph_BTask_Suicide::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BTask_Suicide.BTask_Suicide_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTask_Suicide_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTask_Suicide_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTask_Suicide_C_ReceiveExecuteAI");
static_assert(sizeof(BTask_Suicide_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTask_Suicide_C_ReceiveExecuteAI");
static_assert(offsetof(BTask_Suicide_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTask_Suicide_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTask_Suicide_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTask_Suicide_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

