#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTask_Teleport

#include "Basic.hpp"

#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BTask_Teleport.BTask_Teleport_C.ExecuteUbergraph_BTask_Teleport
// 0x0050 (0x0050 - 0x0000)
struct BTask_Teleport_C_ExecuteUbergraph_BTask_Teleport final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController_2;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_2;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLFloatInterval                        K2Node_MakeStruct_LFloatInterval;                  // 0x0018(0x0008)(NoDestructor)
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLFloatInterval                        K2Node_MakeStruct_LFloatInterval_1;                // 0x0034(0x0008)(NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTask_Teleport_C_ExecuteUbergraph_BTask_Teleport) == 0x000008, "Wrong alignment on BTask_Teleport_C_ExecuteUbergraph_BTask_Teleport");
static_assert(sizeof(BTask_Teleport_C_ExecuteUbergraph_BTask_Teleport) == 0x000050, "Wrong size on BTask_Teleport_C_ExecuteUbergraph_BTask_Teleport");
static_assert(offsetof(BTask_Teleport_C_ExecuteUbergraph_BTask_Teleport, EntryPoint) == 0x000000, "Member 'BTask_Teleport_C_ExecuteUbergraph_BTask_Teleport::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTask_Teleport_C_ExecuteUbergraph_BTask_Teleport, K2Node_Event_OwnerController_2) == 0x000008, "Member 'BTask_Teleport_C_ExecuteUbergraph_BTask_Teleport::K2Node_Event_OwnerController_2' has a wrong offset!");
static_assert(offsetof(BTask_Teleport_C_ExecuteUbergraph_BTask_Teleport, K2Node_Event_ControlledPawn_2) == 0x000010, "Member 'BTask_Teleport_C_ExecuteUbergraph_BTask_Teleport::K2Node_Event_ControlledPawn_2' has a wrong offset!");
static_assert(offsetof(BTask_Teleport_C_ExecuteUbergraph_BTask_Teleport, K2Node_MakeStruct_LFloatInterval) == 0x000018, "Member 'BTask_Teleport_C_ExecuteUbergraph_BTask_Teleport::K2Node_MakeStruct_LFloatInterval' has a wrong offset!");
static_assert(offsetof(BTask_Teleport_C_ExecuteUbergraph_BTask_Teleport, K2Node_Event_OwnerController_1) == 0x000020, "Member 'BTask_Teleport_C_ExecuteUbergraph_BTask_Teleport::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(BTask_Teleport_C_ExecuteUbergraph_BTask_Teleport, K2Node_Event_ControlledPawn_1) == 0x000028, "Member 'BTask_Teleport_C_ExecuteUbergraph_BTask_Teleport::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(BTask_Teleport_C_ExecuteUbergraph_BTask_Teleport, K2Node_Event_DeltaSeconds) == 0x000030, "Member 'BTask_Teleport_C_ExecuteUbergraph_BTask_Teleport::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTask_Teleport_C_ExecuteUbergraph_BTask_Teleport, K2Node_MakeStruct_LFloatInterval_1) == 0x000034, "Member 'BTask_Teleport_C_ExecuteUbergraph_BTask_Teleport::K2Node_MakeStruct_LFloatInterval_1' has a wrong offset!");
static_assert(offsetof(BTask_Teleport_C_ExecuteUbergraph_BTask_Teleport, K2Node_Event_OwnerController) == 0x000040, "Member 'BTask_Teleport_C_ExecuteUbergraph_BTask_Teleport::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTask_Teleport_C_ExecuteUbergraph_BTask_Teleport, K2Node_Event_ControlledPawn) == 0x000048, "Member 'BTask_Teleport_C_ExecuteUbergraph_BTask_Teleport::K2Node_Event_ControlledPawn' has a wrong offset!");

// Function BTask_Teleport.BTask_Teleport_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTask_Teleport_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTask_Teleport_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTask_Teleport_C_ReceiveExecuteAI");
static_assert(sizeof(BTask_Teleport_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTask_Teleport_C_ReceiveExecuteAI");
static_assert(offsetof(BTask_Teleport_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTask_Teleport_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTask_Teleport_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTask_Teleport_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function BTask_Teleport.BTask_Teleport_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTask_Teleport_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTask_Teleport_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTask_Teleport_C_ReceiveTickAI");
static_assert(sizeof(BTask_Teleport_C_ReceiveTickAI) == 0x000018, "Wrong size on BTask_Teleport_C_ReceiveTickAI");
static_assert(offsetof(BTask_Teleport_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTask_Teleport_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTask_Teleport_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTask_Teleport_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTask_Teleport_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTask_Teleport_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

// Function BTask_Teleport.BTask_Teleport_C.ReceiveAbortAI
// 0x0010 (0x0010 - 0x0000)
struct BTask_Teleport_C_ReceiveAbortAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTask_Teleport_C_ReceiveAbortAI) == 0x000008, "Wrong alignment on BTask_Teleport_C_ReceiveAbortAI");
static_assert(sizeof(BTask_Teleport_C_ReceiveAbortAI) == 0x000010, "Wrong size on BTask_Teleport_C_ReceiveAbortAI");
static_assert(offsetof(BTask_Teleport_C_ReceiveAbortAI, OwnerController) == 0x000000, "Member 'BTask_Teleport_C_ReceiveAbortAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTask_Teleport_C_ReceiveAbortAI, ControlledPawn) == 0x000008, "Member 'BTask_Teleport_C_ReceiveAbortAI::ControlledPawn' has a wrong offset!");

}

