#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTask_MoveToWayPoint

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTask_MoveToWayPoint.BTask_MoveToWayPoint_C
// 0x0018 (0x00C8 - 0x00B0)
class UBTask_MoveToWayPoint_C final : public ULBTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Rotate_Action_Deviation_Angle;                     // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELAIMoveSpeedType                             Move_Speed_Type;                                   // 0x00BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Move_Speed_Rate;                                   // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTask_MoveToWayPoint(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTask_MoveToWayPoint_C">();
	}
	static class UBTask_MoveToWayPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTask_MoveToWayPoint_C>();
	}
};
static_assert(alignof(UBTask_MoveToWayPoint_C) == 0x000008, "Wrong alignment on UBTask_MoveToWayPoint_C");
static_assert(sizeof(UBTask_MoveToWayPoint_C) == 0x0000C8, "Wrong size on UBTask_MoveToWayPoint_C");
static_assert(offsetof(UBTask_MoveToWayPoint_C, UberGraphFrame) == 0x0000B0, "Member 'UBTask_MoveToWayPoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTask_MoveToWayPoint_C, Rotate_Action_Deviation_Angle) == 0x0000B8, "Member 'UBTask_MoveToWayPoint_C::Rotate_Action_Deviation_Angle' has a wrong offset!");
static_assert(offsetof(UBTask_MoveToWayPoint_C, Move_Speed_Type) == 0x0000BC, "Member 'UBTask_MoveToWayPoint_C::Move_Speed_Type' has a wrong offset!");
static_assert(offsetof(UBTask_MoveToWayPoint_C, Move_Speed_Rate) == 0x0000C0, "Member 'UBTask_MoveToWayPoint_C::Move_Speed_Rate' has a wrong offset!");

}

