#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTask_Suicide

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTask_Suicide.BTask_Suicide_C
// 0x0030 (0x00E0 - 0x00B0)
class UBTask_Suicide_C final : public ULBTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	ELNPCSuicideType                              Suicide_Type;                                      // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Dead_Code_Name;                                    // 0x00BC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Item_Get;                                          // 0x00C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Exp_Get;                                           // 0x00C5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Use_Override_Respawn_State;                        // 0x00C6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Respawn_Enable;                                    // 0x00C7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bInvisibleHeadTag;                                 // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bPlayDeadSound;                                    // 0x00C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bTakeOffAbnormal;                                  // 0x00CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           TakeOffAbnormalCodeNames;                          // 0x00D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BTask_Suicide(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BTask_Suicide_C">();
	}
	static class UBTask_Suicide_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTask_Suicide_C>();
	}
};
static_assert(alignof(UBTask_Suicide_C) == 0x000008, "Wrong alignment on UBTask_Suicide_C");
static_assert(sizeof(UBTask_Suicide_C) == 0x0000E0, "Wrong size on UBTask_Suicide_C");
static_assert(offsetof(UBTask_Suicide_C, UberGraphFrame) == 0x0000B0, "Member 'UBTask_Suicide_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBTask_Suicide_C, Suicide_Type) == 0x0000B8, "Member 'UBTask_Suicide_C::Suicide_Type' has a wrong offset!");
static_assert(offsetof(UBTask_Suicide_C, Dead_Code_Name) == 0x0000BC, "Member 'UBTask_Suicide_C::Dead_Code_Name' has a wrong offset!");
static_assert(offsetof(UBTask_Suicide_C, Item_Get) == 0x0000C4, "Member 'UBTask_Suicide_C::Item_Get' has a wrong offset!");
static_assert(offsetof(UBTask_Suicide_C, Exp_Get) == 0x0000C5, "Member 'UBTask_Suicide_C::Exp_Get' has a wrong offset!");
static_assert(offsetof(UBTask_Suicide_C, Use_Override_Respawn_State) == 0x0000C6, "Member 'UBTask_Suicide_C::Use_Override_Respawn_State' has a wrong offset!");
static_assert(offsetof(UBTask_Suicide_C, Respawn_Enable) == 0x0000C7, "Member 'UBTask_Suicide_C::Respawn_Enable' has a wrong offset!");
static_assert(offsetof(UBTask_Suicide_C, bInvisibleHeadTag) == 0x0000C8, "Member 'UBTask_Suicide_C::bInvisibleHeadTag' has a wrong offset!");
static_assert(offsetof(UBTask_Suicide_C, bPlayDeadSound) == 0x0000C9, "Member 'UBTask_Suicide_C::bPlayDeadSound' has a wrong offset!");
static_assert(offsetof(UBTask_Suicide_C, bTakeOffAbnormal) == 0x0000CA, "Member 'UBTask_Suicide_C::bTakeOffAbnormal' has a wrong offset!");
static_assert(offsetof(UBTask_Suicide_C, TakeOffAbnormalCodeNames) == 0x0000D0, "Member 'UBTask_Suicide_C::TakeOffAbnormalCodeNames' has a wrong offset!");

}

