#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTask_SetBehaviorTreeState

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BTask_SetBehaviorTreeState.BTask_SetBehaviorTreeState_C.ExecuteUbergraph_BTask_SetBehaviorTreeState
// 0x00A8 (0x00A8 - 0x0000)
struct BTask_SetBehaviorTreeState_C_ExecuteUbergraph_BTask_SetBehaviorTreeState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0018(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BTask_SetBehaviorTreeState_C_ExecuteUbergraph_BTask_SetBehaviorTreeState) == 0x000008, "Wrong alignment on BTask_SetBehaviorTreeState_C_ExecuteUbergraph_BTask_SetBehaviorTreeState");
static_assert(sizeof(BTask_SetBehaviorTreeState_C_ExecuteUbergraph_BTask_SetBehaviorTreeState) == 0x0000A8, "Wrong size on BTask_SetBehaviorTreeState_C_ExecuteUbergraph_BTask_SetBehaviorTreeState");
static_assert(offsetof(BTask_SetBehaviorTreeState_C_ExecuteUbergraph_BTask_SetBehaviorTreeState, EntryPoint) == 0x000000, "Member 'BTask_SetBehaviorTreeState_C_ExecuteUbergraph_BTask_SetBehaviorTreeState::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTask_SetBehaviorTreeState_C_ExecuteUbergraph_BTask_SetBehaviorTreeState, K2Node_Event_OwnerController) == 0x000008, "Member 'BTask_SetBehaviorTreeState_C_ExecuteUbergraph_BTask_SetBehaviorTreeState::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTask_SetBehaviorTreeState_C_ExecuteUbergraph_BTask_SetBehaviorTreeState, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTask_SetBehaviorTreeState_C_ExecuteUbergraph_BTask_SetBehaviorTreeState::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTask_SetBehaviorTreeState_C_ExecuteUbergraph_BTask_SetBehaviorTreeState, CallFunc_Conv_NameToText_ReturnValue) == 0x000018, "Member 'BTask_SetBehaviorTreeState_C_ExecuteUbergraph_BTask_SetBehaviorTreeState::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_SetBehaviorTreeState_C_ExecuteUbergraph_BTask_SetBehaviorTreeState, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'BTask_SetBehaviorTreeState_C_ExecuteUbergraph_BTask_SetBehaviorTreeState::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BTask_SetBehaviorTreeState_C_ExecuteUbergraph_BTask_SetBehaviorTreeState, K2Node_MakeArray_Array) == 0x000070, "Member 'BTask_SetBehaviorTreeState_C_ExecuteUbergraph_BTask_SetBehaviorTreeState::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BTask_SetBehaviorTreeState_C_ExecuteUbergraph_BTask_SetBehaviorTreeState, CallFunc_Format_ReturnValue) == 0x000080, "Member 'BTask_SetBehaviorTreeState_C_ExecuteUbergraph_BTask_SetBehaviorTreeState::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_SetBehaviorTreeState_C_ExecuteUbergraph_BTask_SetBehaviorTreeState, CallFunc_Conv_TextToString_ReturnValue) == 0x000098, "Member 'BTask_SetBehaviorTreeState_C_ExecuteUbergraph_BTask_SetBehaviorTreeState::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function BTask_SetBehaviorTreeState.BTask_SetBehaviorTreeState_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTask_SetBehaviorTreeState_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTask_SetBehaviorTreeState_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTask_SetBehaviorTreeState_C_ReceiveExecuteAI");
static_assert(sizeof(BTask_SetBehaviorTreeState_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTask_SetBehaviorTreeState_C_ReceiveExecuteAI");
static_assert(offsetof(BTask_SetBehaviorTreeState_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTask_SetBehaviorTreeState_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTask_SetBehaviorTreeState_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTask_SetBehaviorTreeState_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

