#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTask_MoveToStrafe

#include "Basic.hpp"

#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BTask_MoveToStrafe.BTask_MoveToStrafe_C.ExecuteUbergraph_BTask_MoveToStrafe
// 0x0060 (0x0060 - 0x0000)
struct BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_2;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRunningMoveBehavior_ReturnValue;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRandomInInterval_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRandomInInterval_ReturnValue_1;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRandomInInterval_ReturnValue_2;        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLAIMoveBehaviorID                     CallFunc_MoveToStrafe_ReturnValue;                 // 0x0050(0x0004)(NoDestructor)
	struct FLAIMoveBehaviorID                     CallFunc_MoveToStrafe_ReturnValue_1;               // 0x0054(0x0004)(NoDestructor)
	struct FLAIMoveBehaviorID                     CallFunc_MoveToStrafe_ReturnValue_2;               // 0x0058(0x0004)(NoDestructor)
};
static_assert(alignof(BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe) == 0x000008, "Wrong alignment on BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe");
static_assert(sizeof(BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe) == 0x000060, "Wrong size on BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe");
static_assert(offsetof(BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe, EntryPoint) == 0x000000, "Member 'BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000004, "Member 'BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000005, "Member 'BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe, CallFunc_NotEqual_IntInt_ReturnValue_2) == 0x00000C, "Member 'BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe::CallFunc_NotEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000014, "Member 'BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe, CallFunc_Add_IntInt_ReturnValue_2) == 0x000018, "Member 'BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe, CallFunc_BooleanAND_ReturnValue) == 0x00001D, "Member 'BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe, CallFunc_Add_IntInt_ReturnValue_3) == 0x000020, "Member 'BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe, CallFunc_Add_IntInt_ReturnValue_4) == 0x000024, "Member 'BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe, CallFunc_Less_IntInt_ReturnValue_1) == 0x000028, "Member 'BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe, CallFunc_Less_IntInt_ReturnValue_2) == 0x000029, "Member 'BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe, CallFunc_BooleanAND_ReturnValue_1) == 0x00002A, "Member 'BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe, CallFunc_BooleanAND_ReturnValue_2) == 0x00002B, "Member 'BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe, K2Node_Event_OwnerController) == 0x000030, "Member 'BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe, K2Node_Event_ControlledPawn) == 0x000038, "Member 'BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe, CallFunc_IsRunningMoveBehavior_ReturnValue) == 0x000040, "Member 'BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe::CallFunc_IsRunningMoveBehavior_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe, CallFunc_GetRandomInInterval_ReturnValue) == 0x000044, "Member 'BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe::CallFunc_GetRandomInInterval_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe, CallFunc_GetRandomInInterval_ReturnValue_1) == 0x000048, "Member 'BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe::CallFunc_GetRandomInInterval_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe, CallFunc_GetRandomInInterval_ReturnValue_2) == 0x00004C, "Member 'BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe::CallFunc_GetRandomInInterval_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe, CallFunc_MoveToStrafe_ReturnValue) == 0x000050, "Member 'BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe::CallFunc_MoveToStrafe_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe, CallFunc_MoveToStrafe_ReturnValue_1) == 0x000054, "Member 'BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe::CallFunc_MoveToStrafe_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe, CallFunc_MoveToStrafe_ReturnValue_2) == 0x000058, "Member 'BTask_MoveToStrafe_C_ExecuteUbergraph_BTask_MoveToStrafe::CallFunc_MoveToStrafe_ReturnValue_2' has a wrong offset!");

// Function BTask_MoveToStrafe.BTask_MoveToStrafe_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTask_MoveToStrafe_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTask_MoveToStrafe_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTask_MoveToStrafe_C_ReceiveExecuteAI");
static_assert(sizeof(BTask_MoveToStrafe_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTask_MoveToStrafe_C_ReceiveExecuteAI");
static_assert(offsetof(BTask_MoveToStrafe_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTask_MoveToStrafe_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTask_MoveToStrafe_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTask_MoveToStrafe_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

