#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTask_MoveStop

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTask_MoveStop.BTask_MoveStop_C.ExecuteUbergraph_BTask_MoveStop
// 0x0028 (0x0028 - 0x0000)
struct BTask_MoveStop_C_ExecuteUbergraph_BTask_MoveStop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALNPCControllerBP_C*                    K2Node_DynamicCast_AsLNPCController_BP;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTask_MoveStop_C_ExecuteUbergraph_BTask_MoveStop) == 0x000008, "Wrong alignment on BTask_MoveStop_C_ExecuteUbergraph_BTask_MoveStop");
static_assert(sizeof(BTask_MoveStop_C_ExecuteUbergraph_BTask_MoveStop) == 0x000028, "Wrong size on BTask_MoveStop_C_ExecuteUbergraph_BTask_MoveStop");
static_assert(offsetof(BTask_MoveStop_C_ExecuteUbergraph_BTask_MoveStop, EntryPoint) == 0x000000, "Member 'BTask_MoveStop_C_ExecuteUbergraph_BTask_MoveStop::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTask_MoveStop_C_ExecuteUbergraph_BTask_MoveStop, K2Node_Event_OwnerController) == 0x000008, "Member 'BTask_MoveStop_C_ExecuteUbergraph_BTask_MoveStop::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTask_MoveStop_C_ExecuteUbergraph_BTask_MoveStop, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTask_MoveStop_C_ExecuteUbergraph_BTask_MoveStop::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTask_MoveStop_C_ExecuteUbergraph_BTask_MoveStop, K2Node_DynamicCast_AsLNPCController_BP) == 0x000018, "Member 'BTask_MoveStop_C_ExecuteUbergraph_BTask_MoveStop::K2Node_DynamicCast_AsLNPCController_BP' has a wrong offset!");
static_assert(offsetof(BTask_MoveStop_C_ExecuteUbergraph_BTask_MoveStop, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTask_MoveStop_C_ExecuteUbergraph_BTask_MoveStop::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BTask_MoveStop.BTask_MoveStop_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTask_MoveStop_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTask_MoveStop_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTask_MoveStop_C_ReceiveExecuteAI");
static_assert(sizeof(BTask_MoveStop_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTask_MoveStop_C_ReceiveExecuteAI");
static_assert(offsetof(BTask_MoveStop_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTask_MoveStop_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTask_MoveStop_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTask_MoveStop_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

