#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTask_RotateActionHome

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTask_RotateActionHome.BTask_RotateActionHome_C.ExecuteUbergraph_BTask_RotateActionHome
// 0x0060 (0x0060 - 0x0000)
struct BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALNPCCharacter*                         K2Node_DynamicCast_AsLNPCCharacter;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALNPCController*                        K2Node_DynamicCast_AsLNPCController;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              CallFunc_PlayAction_RotationToHome_ReturnValue;    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome) == 0x000008, "Wrong alignment on BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome");
static_assert(sizeof(BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome) == 0x000060, "Wrong size on BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome");
static_assert(offsetof(BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome, EntryPoint) == 0x000000, "Member 'BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome, K2Node_Event_OwnerController_1) == 0x000008, "Member 'BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome, K2Node_Event_ControlledPawn_1) == 0x000010, "Member 'BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome, K2Node_Event_OwnerController) == 0x000018, "Member 'BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome, K2Node_Event_ControlledPawn) == 0x000020, "Member 'BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome, K2Node_Event_DeltaSeconds) == 0x000028, "Member 'BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome, K2Node_DynamicCast_AsLNPCCharacter) == 0x000030, "Member 'BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome::K2Node_DynamicCast_AsLNPCCharacter' has a wrong offset!");
static_assert(offsetof(BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome, K2Node_DynamicCast_AsLNPCController) == 0x000040, "Member 'BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome::K2Node_DynamicCast_AsLNPCController' has a wrong offset!");
static_assert(offsetof(BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome, CallFunc_PlayAction_RotationToHome_ReturnValue) == 0x000050, "Member 'BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome::CallFunc_PlayAction_RotationToHome_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome, CallFunc_IsValid_ReturnValue_1) == 0x000059, "Member 'BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome, CallFunc_IsPlaying_ReturnValue) == 0x00005A, "Member 'BTask_RotateActionHome_C_ExecuteUbergraph_BTask_RotateActionHome::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");

// Function BTask_RotateActionHome.BTask_RotateActionHome_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct BTask_RotateActionHome_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTask_RotateActionHome_C_ReceiveTickAI) == 0x000008, "Wrong alignment on BTask_RotateActionHome_C_ReceiveTickAI");
static_assert(sizeof(BTask_RotateActionHome_C_ReceiveTickAI) == 0x000018, "Wrong size on BTask_RotateActionHome_C_ReceiveTickAI");
static_assert(offsetof(BTask_RotateActionHome_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'BTask_RotateActionHome_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTask_RotateActionHome_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'BTask_RotateActionHome_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTask_RotateActionHome_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'BTask_RotateActionHome_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

// Function BTask_RotateActionHome.BTask_RotateActionHome_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTask_RotateActionHome_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTask_RotateActionHome_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTask_RotateActionHome_C_ReceiveExecuteAI");
static_assert(sizeof(BTask_RotateActionHome_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTask_RotateActionHome_C_ReceiveExecuteAI");
static_assert(offsetof(BTask_RotateActionHome_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTask_RotateActionHome_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTask_RotateActionHome_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTask_RotateActionHome_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

