#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTask_MoveToWayPoint

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTask_MoveToWayPoint.BTask_MoveToWayPoint_C.ExecuteUbergraph_BTask_MoveToWayPoint
// 0x0038 (0x0038 - 0x0000)
struct BTask_MoveToWayPoint_C_ExecuteUbergraph_BTask_MoveToWayPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALNPCCharacter*                         K2Node_DynamicCast_AsLNPCCharacter;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALNPCController*                        K2Node_DynamicCast_AsLNPCController;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTask_MoveToWayPoint_C_ExecuteUbergraph_BTask_MoveToWayPoint) == 0x000008, "Wrong alignment on BTask_MoveToWayPoint_C_ExecuteUbergraph_BTask_MoveToWayPoint");
static_assert(sizeof(BTask_MoveToWayPoint_C_ExecuteUbergraph_BTask_MoveToWayPoint) == 0x000038, "Wrong size on BTask_MoveToWayPoint_C_ExecuteUbergraph_BTask_MoveToWayPoint");
static_assert(offsetof(BTask_MoveToWayPoint_C_ExecuteUbergraph_BTask_MoveToWayPoint, EntryPoint) == 0x000000, "Member 'BTask_MoveToWayPoint_C_ExecuteUbergraph_BTask_MoveToWayPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTask_MoveToWayPoint_C_ExecuteUbergraph_BTask_MoveToWayPoint, K2Node_Event_OwnerController) == 0x000008, "Member 'BTask_MoveToWayPoint_C_ExecuteUbergraph_BTask_MoveToWayPoint::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTask_MoveToWayPoint_C_ExecuteUbergraph_BTask_MoveToWayPoint, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTask_MoveToWayPoint_C_ExecuteUbergraph_BTask_MoveToWayPoint::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTask_MoveToWayPoint_C_ExecuteUbergraph_BTask_MoveToWayPoint, K2Node_DynamicCast_AsLNPCCharacter) == 0x000018, "Member 'BTask_MoveToWayPoint_C_ExecuteUbergraph_BTask_MoveToWayPoint::K2Node_DynamicCast_AsLNPCCharacter' has a wrong offset!");
static_assert(offsetof(BTask_MoveToWayPoint_C_ExecuteUbergraph_BTask_MoveToWayPoint, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTask_MoveToWayPoint_C_ExecuteUbergraph_BTask_MoveToWayPoint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTask_MoveToWayPoint_C_ExecuteUbergraph_BTask_MoveToWayPoint, K2Node_DynamicCast_AsLNPCController) == 0x000028, "Member 'BTask_MoveToWayPoint_C_ExecuteUbergraph_BTask_MoveToWayPoint::K2Node_DynamicCast_AsLNPCController' has a wrong offset!");
static_assert(offsetof(BTask_MoveToWayPoint_C_ExecuteUbergraph_BTask_MoveToWayPoint, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BTask_MoveToWayPoint_C_ExecuteUbergraph_BTask_MoveToWayPoint::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BTask_MoveToWayPoint.BTask_MoveToWayPoint_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTask_MoveToWayPoint_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTask_MoveToWayPoint_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTask_MoveToWayPoint_C_ReceiveExecuteAI");
static_assert(sizeof(BTask_MoveToWayPoint_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTask_MoveToWayPoint_C_ReceiveExecuteAI");
static_assert(offsetof(BTask_MoveToWayPoint_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTask_MoveToWayPoint_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTask_MoveToWayPoint_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTask_MoveToWayPoint_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

