#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTask_MoveToRoam

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"
#include "ProjectP_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTask_MoveToRoam.BTask_MoveToRoam_C.ExecuteUbergraph_BTask_MoveToRoam
// 0x0088 (0x0088 - 0x0000)
struct BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNPCInfoPtr                            CallFunc_GetNpcInfo_ReturnValue;                   // 0x0008(0x0008)(NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRoamRange_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetNavAgentLocation_ReturnValue;          // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRunningMoveBehavior_ReturnValue;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SampleLocations_ReturnValue;              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetRandomLocationInDistance_Location;     // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRandomLocationInDistance_ReturnValue;  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLAIMovementGoal                       CallFunc_GoalAsLocation_ReturnValue;               // 0x0054(0x002C)(NoDestructor)
	struct FLAIMoveBehaviorID                     CallFunc_MoveToPosition_ReturnValue;               // 0x0080(0x0004)(NoDestructor)
};
static_assert(alignof(BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam) == 0x000008, "Wrong alignment on BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam");
static_assert(sizeof(BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam) == 0x000088, "Wrong size on BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam");
static_assert(offsetof(BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam, EntryPoint) == 0x000000, "Member 'BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam, Temp_bool_Variable) == 0x000004, "Member 'BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam, CallFunc_GetNpcInfo_ReturnValue) == 0x000008, "Member 'BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam::CallFunc_GetNpcInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam, CallFunc_GetRoamRange_ReturnValue) == 0x000014, "Member 'BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam::CallFunc_GetRoamRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam, K2Node_Select_Default) == 0x000018, "Member 'BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam, K2Node_Event_OwnerController) == 0x000020, "Member 'BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam, K2Node_Event_ControlledPawn) == 0x000028, "Member 'BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000030, "Member 'BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam, CallFunc_GetNavAgentLocation_ReturnValue) == 0x000034, "Member 'BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam::CallFunc_GetNavAgentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam, CallFunc_IsRunningMoveBehavior_ReturnValue) == 0x000040, "Member 'BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam::CallFunc_IsRunningMoveBehavior_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam, CallFunc_SampleLocations_ReturnValue) == 0x000041, "Member 'BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam::CallFunc_SampleLocations_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam, CallFunc_GetRandomLocationInDistance_Location) == 0x000044, "Member 'BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam::CallFunc_GetRandomLocationInDistance_Location' has a wrong offset!");
static_assert(offsetof(BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam, CallFunc_GetRandomLocationInDistance_ReturnValue) == 0x000050, "Member 'BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam::CallFunc_GetRandomLocationInDistance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam, CallFunc_GoalAsLocation_ReturnValue) == 0x000054, "Member 'BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam::CallFunc_GoalAsLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam, CallFunc_MoveToPosition_ReturnValue) == 0x000080, "Member 'BTask_MoveToRoam_C_ExecuteUbergraph_BTask_MoveToRoam::CallFunc_MoveToPosition_ReturnValue' has a wrong offset!");

// Function BTask_MoveToRoam.BTask_MoveToRoam_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTask_MoveToRoam_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTask_MoveToRoam_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTask_MoveToRoam_C_ReceiveExecuteAI");
static_assert(sizeof(BTask_MoveToRoam_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTask_MoveToRoam_C_ReceiveExecuteAI");
static_assert(offsetof(BTask_MoveToRoam_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTask_MoveToRoam_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTask_MoveToRoam_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTask_MoveToRoam_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

