#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTask_HelpSignal

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTask_HelpSignal.BTask_HelpSignal_C.ExecuteUbergraph_BTask_HelpSignal
// 0x0020 (0x0020 - 0x0000)
struct BTask_HelpSignal_C_ExecuteUbergraph_BTask_HelpSignal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTask_HelpSignal_C_ExecuteUbergraph_BTask_HelpSignal) == 0x000008, "Wrong alignment on BTask_HelpSignal_C_ExecuteUbergraph_BTask_HelpSignal");
static_assert(sizeof(BTask_HelpSignal_C_ExecuteUbergraph_BTask_HelpSignal) == 0x000020, "Wrong size on BTask_HelpSignal_C_ExecuteUbergraph_BTask_HelpSignal");
static_assert(offsetof(BTask_HelpSignal_C_ExecuteUbergraph_BTask_HelpSignal, EntryPoint) == 0x000000, "Member 'BTask_HelpSignal_C_ExecuteUbergraph_BTask_HelpSignal::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTask_HelpSignal_C_ExecuteUbergraph_BTask_HelpSignal, K2Node_Event_OwnerController) == 0x000008, "Member 'BTask_HelpSignal_C_ExecuteUbergraph_BTask_HelpSignal::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTask_HelpSignal_C_ExecuteUbergraph_BTask_HelpSignal, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTask_HelpSignal_C_ExecuteUbergraph_BTask_HelpSignal::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTask_HelpSignal_C_ExecuteUbergraph_BTask_HelpSignal, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'BTask_HelpSignal_C_ExecuteUbergraph_BTask_HelpSignal::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function BTask_HelpSignal.BTask_HelpSignal_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTask_HelpSignal_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTask_HelpSignal_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTask_HelpSignal_C_ReceiveExecuteAI");
static_assert(sizeof(BTask_HelpSignal_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTask_HelpSignal_C_ReceiveExecuteAI");
static_assert(offsetof(BTask_HelpSignal_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTask_HelpSignal_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTask_HelpSignal_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTask_HelpSignal_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

