#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTask_MoveToPosition

#include "Basic.hpp"

#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function BTask_MoveToPosition.BTask_MoveToPosition_C.ExecuteUbergraph_BTask_MoveToPosition
// 0x0080 (0x0080 - 0x0000)
struct BTask_MoveToPosition_C_ExecuteUbergraph_BTask_MoveToPosition final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLAIMovementGoal                       CallFunc_GoalAsType_ReturnValue;                   // 0x0018(0x002C)(NoDestructor)
	struct FLAIMovementGoal                       CallFunc_GoalAsType_ReturnValue_1;                 // 0x0044(0x002C)(NoDestructor)
	bool                                          CallFunc_IsRunningMoveBehavior_ReturnValue;        // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLAIMoveBehaviorID                     CallFunc_MoveToPositionBack_ReturnValue;           // 0x0074(0x0004)(NoDestructor)
	struct FLAIMoveBehaviorID                     CallFunc_MoveToPosition_ReturnValue;               // 0x0078(0x0004)(NoDestructor)
};
static_assert(alignof(BTask_MoveToPosition_C_ExecuteUbergraph_BTask_MoveToPosition) == 0x000008, "Wrong alignment on BTask_MoveToPosition_C_ExecuteUbergraph_BTask_MoveToPosition");
static_assert(sizeof(BTask_MoveToPosition_C_ExecuteUbergraph_BTask_MoveToPosition) == 0x000080, "Wrong size on BTask_MoveToPosition_C_ExecuteUbergraph_BTask_MoveToPosition");
static_assert(offsetof(BTask_MoveToPosition_C_ExecuteUbergraph_BTask_MoveToPosition, EntryPoint) == 0x000000, "Member 'BTask_MoveToPosition_C_ExecuteUbergraph_BTask_MoveToPosition::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTask_MoveToPosition_C_ExecuteUbergraph_BTask_MoveToPosition, K2Node_Event_OwnerController) == 0x000008, "Member 'BTask_MoveToPosition_C_ExecuteUbergraph_BTask_MoveToPosition::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTask_MoveToPosition_C_ExecuteUbergraph_BTask_MoveToPosition, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTask_MoveToPosition_C_ExecuteUbergraph_BTask_MoveToPosition::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTask_MoveToPosition_C_ExecuteUbergraph_BTask_MoveToPosition, CallFunc_GoalAsType_ReturnValue) == 0x000018, "Member 'BTask_MoveToPosition_C_ExecuteUbergraph_BTask_MoveToPosition::CallFunc_GoalAsType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_MoveToPosition_C_ExecuteUbergraph_BTask_MoveToPosition, CallFunc_GoalAsType_ReturnValue_1) == 0x000044, "Member 'BTask_MoveToPosition_C_ExecuteUbergraph_BTask_MoveToPosition::CallFunc_GoalAsType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTask_MoveToPosition_C_ExecuteUbergraph_BTask_MoveToPosition, CallFunc_IsRunningMoveBehavior_ReturnValue) == 0x000070, "Member 'BTask_MoveToPosition_C_ExecuteUbergraph_BTask_MoveToPosition::CallFunc_IsRunningMoveBehavior_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_MoveToPosition_C_ExecuteUbergraph_BTask_MoveToPosition, CallFunc_Not_PreBool_ReturnValue) == 0x000071, "Member 'BTask_MoveToPosition_C_ExecuteUbergraph_BTask_MoveToPosition::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_MoveToPosition_C_ExecuteUbergraph_BTask_MoveToPosition, CallFunc_MoveToPositionBack_ReturnValue) == 0x000074, "Member 'BTask_MoveToPosition_C_ExecuteUbergraph_BTask_MoveToPosition::CallFunc_MoveToPositionBack_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTask_MoveToPosition_C_ExecuteUbergraph_BTask_MoveToPosition, CallFunc_MoveToPosition_ReturnValue) == 0x000078, "Member 'BTask_MoveToPosition_C_ExecuteUbergraph_BTask_MoveToPosition::CallFunc_MoveToPosition_ReturnValue' has a wrong offset!");

// Function BTask_MoveToPosition.BTask_MoveToPosition_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTask_MoveToPosition_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTask_MoveToPosition_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTask_MoveToPosition_C_ReceiveExecuteAI");
static_assert(sizeof(BTask_MoveToPosition_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTask_MoveToPosition_C_ReceiveExecuteAI");
static_assert(offsetof(BTask_MoveToPosition_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTask_MoveToPosition_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTask_MoveToPosition_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTask_MoveToPosition_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

