#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CH_StatRoom_P_LevelInstance_1

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CH_StatRoom_P_LevelInstance_1.CH_StatRoom_P_C
// 0x0020 (0x0208 - 0x01E8)
class ACH_StatRoom_P_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ASpotLight*                             Spot_KEY_01_ExecuteUbergraph_CH_StatRoom_P_RefProperty; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASpotLight*                             Spot_KEY_08_ExecuteUbergraph_CH_StatRoom_P_RefProperty; // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASpotLight*                             Spot_KEY_Mid_ExecuteUbergraph_CH_StatRoom_P_RefProperty; // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void SetActiveEnvironment(bool IsValid);
	void ExecuteUbergraph_CH_StatRoom_P(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CH_StatRoom_P_C">();
	}
	static class ACH_StatRoom_P_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACH_StatRoom_P_C>();
	}
};
static_assert(alignof(ACH_StatRoom_P_C) == 0x000008, "Wrong alignment on ACH_StatRoom_P_C");
static_assert(sizeof(ACH_StatRoom_P_C) == 0x000208, "Wrong size on ACH_StatRoom_P_C");
static_assert(offsetof(ACH_StatRoom_P_C, UberGraphFrame) == 0x0001E8, "Member 'ACH_StatRoom_P_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACH_StatRoom_P_C, Spot_KEY_01_ExecuteUbergraph_CH_StatRoom_P_RefProperty) == 0x0001F0, "Member 'ACH_StatRoom_P_C::Spot_KEY_01_ExecuteUbergraph_CH_StatRoom_P_RefProperty' has a wrong offset!");
static_assert(offsetof(ACH_StatRoom_P_C, Spot_KEY_08_ExecuteUbergraph_CH_StatRoom_P_RefProperty) == 0x0001F8, "Member 'ACH_StatRoom_P_C::Spot_KEY_08_ExecuteUbergraph_CH_StatRoom_P_RefProperty' has a wrong offset!");
static_assert(offsetof(ACH_StatRoom_P_C, Spot_KEY_Mid_ExecuteUbergraph_CH_StatRoom_P_RefProperty) == 0x000200, "Member 'ACH_StatRoom_P_C::Spot_KEY_Mid_ExecuteUbergraph_CH_StatRoom_P_RefProperty' has a wrong offset!");

}

