#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CWBP_Template_PCDistance

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CWBP_Template_PCDistance.CWBP_Template_PCDistance_C.ExecuteUbergraph_CWBP_Template_PCDistance
// 0x0170 (0x0170 - 0x0000)
struct CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCameraTargetArmLength_ReturnValue;     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          CallFunc_GetCameraCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLCameraWorkViewInfo                   K2Node_MakeStruct_LCameraWorkViewInfo;             // 0x0034(0x001C)(NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x0054(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_CalculateCameraLocationFromPC_ReturnValue; // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EE[0x2];                                       // 0x00EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x011C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance) == 0x000008, "Wrong alignment on CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance");
static_assert(sizeof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance) == 0x000170, "Wrong size on CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, EntryPoint) == 0x000000, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::EntryPoint' has a wrong offset!");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, K2Node_Event_DeltaTime) == 0x000004, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, CallFunc_GetCameraTargetArmLength_ReturnValue) == 0x000008, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::CallFunc_GetCameraTargetArmLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, CallFunc_GetCameraCharacter_ReturnValue) == 0x000010, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::CallFunc_GetCameraCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, K2Node_MakeArray_Array) == 0x000018, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, K2Node_MakeStruct_LCameraWorkViewInfo) == 0x000034, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::K2Node_MakeStruct_LCameraWorkViewInfo' has a wrong offset!");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000050, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, CallFunc_SphereTraceSingle_OutHit) == 0x000054, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::CallFunc_SphereTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, CallFunc_SphereTraceSingle_ReturnValue) == 0x0000DC, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::CallFunc_SphereTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, CallFunc_CalculateCameraLocationFromPC_ReturnValue) == 0x0000E0, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::CallFunc_CalculateCameraLocationFromPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, CallFunc_BreakHitResult_bBlockingHit) == 0x0000EC, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000ED, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, CallFunc_BreakHitResult_Time) == 0x0000F0, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, CallFunc_BreakHitResult_Distance) == 0x0000F4, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, CallFunc_BreakHitResult_Location) == 0x0000F8, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, CallFunc_BreakHitResult_ImpactPoint) == 0x000104, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, CallFunc_BreakHitResult_Normal) == 0x000110, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, CallFunc_BreakHitResult_ImpactNormal) == 0x00011C, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, CallFunc_BreakHitResult_PhysMat) == 0x000128, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, CallFunc_BreakHitResult_HitActor) == 0x000130, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, CallFunc_BreakHitResult_HitComponent) == 0x000138, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, CallFunc_BreakHitResult_HitBoneName) == 0x000140, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, CallFunc_BreakHitResult_HitItem) == 0x000148, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, CallFunc_BreakHitResult_ElementIndex) == 0x00014C, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, CallFunc_BreakHitResult_FaceIndex) == 0x000150, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, CallFunc_BreakHitResult_TraceStart) == 0x000154, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance, CallFunc_BreakHitResult_TraceEnd) == 0x000160, "Member 'CWBP_Template_PCDistance_C_ExecuteUbergraph_CWBP_Template_PCDistance::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");

// Function CWBP_Template_PCDistance.CWBP_Template_PCDistance_C.UpdateTargetView
// 0x0004 (0x0004 - 0x0000)
struct CWBP_Template_PCDistance_C_UpdateTargetView final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CWBP_Template_PCDistance_C_UpdateTargetView) == 0x000004, "Wrong alignment on CWBP_Template_PCDistance_C_UpdateTargetView");
static_assert(sizeof(CWBP_Template_PCDistance_C_UpdateTargetView) == 0x000004, "Wrong size on CWBP_Template_PCDistance_C_UpdateTargetView");
static_assert(offsetof(CWBP_Template_PCDistance_C_UpdateTargetView, DeltaTime) == 0x000000, "Member 'CWBP_Template_PCDistance_C_UpdateTargetView::DeltaTime' has a wrong offset!");

}

