#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CWBP_FatalAtk

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CWBP_FatalAtk.CWBP_FatalAtk_C.ExecuteUbergraph_CWBP_FatalAtk
// 0x00D0 (0x00D0 - 0x0000)
struct CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          CallFunc_GetCameraCharacter_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActMgrComponent*                      CallFunc_GetActMgrComponent_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActBase*                              CallFunc_GetLastPlayingAction_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULActPayloadBase*                       CallFunc_GetActPayload_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_ActPayload_FatalAttack_C*           K2Node_DynamicCast_AsBP_Act_Payload_Fatal_Attack;  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCameraTargetArmLocation_ReturnValue;   // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          CallFunc_GetCameraCharacter_ReturnValue_1;         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_1;       // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk) == 0x000008, "Wrong alignment on CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk");
static_assert(sizeof(CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk) == 0x0000D0, "Wrong size on CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk");
static_assert(offsetof(CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk, EntryPoint) == 0x000000, "Member 'CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk::EntryPoint' has a wrong offset!");
static_assert(offsetof(CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000004, "Member 'CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk, CallFunc_MakeVector_ReturnValue) == 0x000014, "Member 'CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk, CallFunc_GetCameraCharacter_ReturnValue) == 0x000020, "Member 'CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk::CallFunc_GetCameraCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk, CallFunc_GetActMgrComponent_ReturnValue) == 0x000028, "Member 'CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk::CallFunc_GetActMgrComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk, CallFunc_GetLastPlayingAction_ReturnValue) == 0x000030, "Member 'CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk::CallFunc_GetLastPlayingAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk, CallFunc_GetActPayload_ReturnValue) == 0x000038, "Member 'CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk::CallFunc_GetActPayload_ReturnValue' has a wrong offset!");
static_assert(offsetof(CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk, K2Node_DynamicCast_AsBP_Act_Payload_Fatal_Attack) == 0x000040, "Member 'CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk::K2Node_DynamicCast_AsBP_Act_Payload_Fatal_Attack' has a wrong offset!");
static_assert(offsetof(CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk, CallFunc_GetCameraTargetArmLocation_ReturnValue) == 0x00004C, "Member 'CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk::CallFunc_GetCameraTargetArmLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk, CallFunc_Add_VectorVector_ReturnValue) == 0x000058, "Member 'CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk, CallFunc_GetCameraCharacter_ReturnValue_1) == 0x000068, "Member 'CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk::CallFunc_GetCameraCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000070, "Member 'CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk, CallFunc_GetSocketRotation_ReturnValue) == 0x00007C, "Member 'CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk::CallFunc_GetSocketRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000088, "Member 'CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk, CallFunc_GetRightVector_ReturnValue) == 0x000094, "Member 'CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0000A0, "Member 'CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000AC, "Member 'CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk, CallFunc_Conv_VectorToRotator_ReturnValue_1) == 0x0000B8, "Member 'CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk::CallFunc_Conv_VectorToRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk, CallFunc_RLerp_ReturnValue) == 0x0000C4, "Member 'CWBP_FatalAtk_C_ExecuteUbergraph_CWBP_FatalAtk::CallFunc_RLerp_ReturnValue' has a wrong offset!");

}

