#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Deco_IsTargetCloserHome

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function Deco_IsTargetCloserHome.Deco_IsTargetCloserHome_C.PerformConditionCheckAI
// 0x0078 (0x0078 - 0x0000)
struct Deco_IsTargetCloserHome_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetHomeLocation_ReturnValue;              // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_DistanceSquared_ReturnValue;       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetHomeLocation_ReturnValue_1;            // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLAIObjective                          CallFunc_ObjectiveAsType_ReturnValue;              // 0x003C(0x0024)(NoDestructor)
	struct FVector                                CallFunc_ObjectiveGetLocation_ReturnValue;         // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_DistanceSquared_ReturnValue_1;     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Deco_IsTargetCloserHome_C_PerformConditionCheckAI) == 0x000008, "Wrong alignment on Deco_IsTargetCloserHome_C_PerformConditionCheckAI");
static_assert(sizeof(Deco_IsTargetCloserHome_C_PerformConditionCheckAI) == 0x000078, "Wrong size on Deco_IsTargetCloserHome_C_PerformConditionCheckAI");
static_assert(offsetof(Deco_IsTargetCloserHome_C_PerformConditionCheckAI, OwnerController) == 0x000000, "Member 'Deco_IsTargetCloserHome_C_PerformConditionCheckAI::OwnerController' has a wrong offset!");
static_assert(offsetof(Deco_IsTargetCloserHome_C_PerformConditionCheckAI, ControlledPawn) == 0x000008, "Member 'Deco_IsTargetCloserHome_C_PerformConditionCheckAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(Deco_IsTargetCloserHome_C_PerformConditionCheckAI, ReturnValue) == 0x000010, "Member 'Deco_IsTargetCloserHome_C_PerformConditionCheckAI::ReturnValue' has a wrong offset!");
static_assert(offsetof(Deco_IsTargetCloserHome_C_PerformConditionCheckAI, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000014, "Member 'Deco_IsTargetCloserHome_C_PerformConditionCheckAI::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deco_IsTargetCloserHome_C_PerformConditionCheckAI, CallFunc_GetHomeLocation_ReturnValue) == 0x000020, "Member 'Deco_IsTargetCloserHome_C_PerformConditionCheckAI::CallFunc_GetHomeLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deco_IsTargetCloserHome_C_PerformConditionCheckAI, CallFunc_Vector_DistanceSquared_ReturnValue) == 0x00002C, "Member 'Deco_IsTargetCloserHome_C_PerformConditionCheckAI::CallFunc_Vector_DistanceSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deco_IsTargetCloserHome_C_PerformConditionCheckAI, CallFunc_GetHomeLocation_ReturnValue_1) == 0x000030, "Member 'Deco_IsTargetCloserHome_C_PerformConditionCheckAI::CallFunc_GetHomeLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Deco_IsTargetCloserHome_C_PerformConditionCheckAI, CallFunc_ObjectiveAsType_ReturnValue) == 0x00003C, "Member 'Deco_IsTargetCloserHome_C_PerformConditionCheckAI::CallFunc_ObjectiveAsType_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deco_IsTargetCloserHome_C_PerformConditionCheckAI, CallFunc_ObjectiveGetLocation_ReturnValue) == 0x000060, "Member 'Deco_IsTargetCloserHome_C_PerformConditionCheckAI::CallFunc_ObjectiveGetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Deco_IsTargetCloserHome_C_PerformConditionCheckAI, CallFunc_Vector_DistanceSquared_ReturnValue_1) == 0x00006C, "Member 'Deco_IsTargetCloserHome_C_PerformConditionCheckAI::CallFunc_Vector_DistanceSquared_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Deco_IsTargetCloserHome_C_PerformConditionCheckAI, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000070, "Member 'Deco_IsTargetCloserHome_C_PerformConditionCheckAI::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

