#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DM_Boxbarri_1

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass DM_Boxbarri_1.DM_Boxbarri_1_C
// 0x00C0 (0x03F0 - 0x0330)
class ADM_Boxbarri_1_C final : public ALDestructionObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_PhysicsImpactSound_C*               BP_PhysicsImpactSound;                             // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh10;                             // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh13;                             // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh12;                             // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh11;                             // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh30;                             // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh39;                             // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh31;                             // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh32;                             // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh69;                             // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh21;                             // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh24;                             // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh22;                             // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh2;                              // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh62;                             // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh5;                              // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Box;                                               // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Visible;                                           // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh58;                             // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh56;                             // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh55;                             // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void OnDestructCrashed();
	void ExecuteUbergraph_DM_Boxbarri_1(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DM_Boxbarri_1_C">();
	}
	static class ADM_Boxbarri_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADM_Boxbarri_1_C>();
	}
};
static_assert(alignof(ADM_Boxbarri_1_C) == 0x000008, "Wrong alignment on ADM_Boxbarri_1_C");
static_assert(sizeof(ADM_Boxbarri_1_C) == 0x0003F0, "Wrong size on ADM_Boxbarri_1_C");
static_assert(offsetof(ADM_Boxbarri_1_C, UberGraphFrame) == 0x000330, "Member 'ADM_Boxbarri_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_1_C, BP_PhysicsImpactSound) == 0x000338, "Member 'ADM_Boxbarri_1_C::BP_PhysicsImpactSound' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_1_C, LDestructStaticMesh10) == 0x000340, "Member 'ADM_Boxbarri_1_C::LDestructStaticMesh10' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_1_C, LDestructStaticMesh13) == 0x000348, "Member 'ADM_Boxbarri_1_C::LDestructStaticMesh13' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_1_C, LDestructStaticMesh12) == 0x000350, "Member 'ADM_Boxbarri_1_C::LDestructStaticMesh12' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_1_C, LDestructStaticMesh11) == 0x000358, "Member 'ADM_Boxbarri_1_C::LDestructStaticMesh11' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_1_C, LDestructStaticMesh30) == 0x000360, "Member 'ADM_Boxbarri_1_C::LDestructStaticMesh30' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_1_C, LDestructStaticMesh39) == 0x000368, "Member 'ADM_Boxbarri_1_C::LDestructStaticMesh39' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_1_C, LDestructStaticMesh31) == 0x000370, "Member 'ADM_Boxbarri_1_C::LDestructStaticMesh31' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_1_C, LDestructStaticMesh32) == 0x000378, "Member 'ADM_Boxbarri_1_C::LDestructStaticMesh32' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_1_C, LDestructStaticMesh69) == 0x000380, "Member 'ADM_Boxbarri_1_C::LDestructStaticMesh69' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_1_C, LDestructStaticMesh21) == 0x000388, "Member 'ADM_Boxbarri_1_C::LDestructStaticMesh21' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_1_C, LDestructStaticMesh24) == 0x000390, "Member 'ADM_Boxbarri_1_C::LDestructStaticMesh24' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_1_C, LDestructStaticMesh22) == 0x000398, "Member 'ADM_Boxbarri_1_C::LDestructStaticMesh22' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_1_C, LDestructStaticMesh2) == 0x0003A0, "Member 'ADM_Boxbarri_1_C::LDestructStaticMesh2' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_1_C, LDestructStaticMesh62) == 0x0003A8, "Member 'ADM_Boxbarri_1_C::LDestructStaticMesh62' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_1_C, LDestructStaticMesh5) == 0x0003B0, "Member 'ADM_Boxbarri_1_C::LDestructStaticMesh5' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_1_C, Box) == 0x0003B8, "Member 'ADM_Boxbarri_1_C::Box' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_1_C, Visible) == 0x0003C0, "Member 'ADM_Boxbarri_1_C::Visible' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_1_C, LDestructStaticMesh58) == 0x0003C8, "Member 'ADM_Boxbarri_1_C::LDestructStaticMesh58' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_1_C, LDestructStaticMesh56) == 0x0003D0, "Member 'ADM_Boxbarri_1_C::LDestructStaticMesh56' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_1_C, LDestructStaticMesh55) == 0x0003D8, "Member 'ADM_Boxbarri_1_C::LDestructStaticMesh55' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_1_C, Audio) == 0x0003E0, "Member 'ADM_Boxbarri_1_C::Audio' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_1_C, Niagara) == 0x0003E8, "Member 'ADM_Boxbarri_1_C::Niagara' has a wrong offset!");

}

