#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DM_Boxbarri_2

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass DM_Boxbarri_2.DM_Boxbarri_2_C
// 0x0080 (0x03B0 - 0x0330)
class ADM_Boxbarri_2_C final : public ALDestructionObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_PhysicsImpactSound_C*               BP_PhysicsImpactSound;                             // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh35;                             // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh36;                             // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh25;                             // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh34;                             // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh31;                             // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh26;                             // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Box;                                               // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh19;                             // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh15;                             // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh13;                             // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh12;                             // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Visible;                                           // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void OnDestructCrashed();
	void ExecuteUbergraph_DM_Boxbarri_2(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DM_Boxbarri_2_C">();
	}
	static class ADM_Boxbarri_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADM_Boxbarri_2_C>();
	}
};
static_assert(alignof(ADM_Boxbarri_2_C) == 0x000008, "Wrong alignment on ADM_Boxbarri_2_C");
static_assert(sizeof(ADM_Boxbarri_2_C) == 0x0003B0, "Wrong size on ADM_Boxbarri_2_C");
static_assert(offsetof(ADM_Boxbarri_2_C, UberGraphFrame) == 0x000330, "Member 'ADM_Boxbarri_2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_2_C, BP_PhysicsImpactSound) == 0x000338, "Member 'ADM_Boxbarri_2_C::BP_PhysicsImpactSound' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_2_C, LDestructStaticMesh35) == 0x000340, "Member 'ADM_Boxbarri_2_C::LDestructStaticMesh35' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_2_C, LDestructStaticMesh36) == 0x000348, "Member 'ADM_Boxbarri_2_C::LDestructStaticMesh36' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_2_C, LDestructStaticMesh25) == 0x000350, "Member 'ADM_Boxbarri_2_C::LDestructStaticMesh25' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_2_C, LDestructStaticMesh34) == 0x000358, "Member 'ADM_Boxbarri_2_C::LDestructStaticMesh34' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_2_C, LDestructStaticMesh31) == 0x000360, "Member 'ADM_Boxbarri_2_C::LDestructStaticMesh31' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_2_C, LDestructStaticMesh26) == 0x000368, "Member 'ADM_Boxbarri_2_C::LDestructStaticMesh26' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_2_C, Box) == 0x000370, "Member 'ADM_Boxbarri_2_C::Box' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_2_C, LDestructStaticMesh19) == 0x000378, "Member 'ADM_Boxbarri_2_C::LDestructStaticMesh19' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_2_C, LDestructStaticMesh15) == 0x000380, "Member 'ADM_Boxbarri_2_C::LDestructStaticMesh15' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_2_C, LDestructStaticMesh13) == 0x000388, "Member 'ADM_Boxbarri_2_C::LDestructStaticMesh13' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_2_C, LDestructStaticMesh12) == 0x000390, "Member 'ADM_Boxbarri_2_C::LDestructStaticMesh12' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_2_C, Visible) == 0x000398, "Member 'ADM_Boxbarri_2_C::Visible' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_2_C, Audio) == 0x0003A0, "Member 'ADM_Boxbarri_2_C::Audio' has a wrong offset!");
static_assert(offsetof(ADM_Boxbarri_2_C, Niagara) == 0x0003A8, "Member 'ADM_Boxbarri_2_C::Niagara' has a wrong offset!");

}

