#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DM_Interior_WoodBoard_07_02

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass DM_Interior_WoodBoard_07_02.DM_Interior_WoodBoard_07_02_C
// 0x0078 (0x03A8 - 0x0330)
class ADM_Interior_WoodBoard_07_02_C final : public ALDestructionObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_PhysicsImpactSound_C*               BP_PhysicsImpactSound;                             // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh1;                              // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh9;                              // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh8;                              // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh7;                              // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh6;                              // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh;                               // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh4;                              // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh3;                              // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh2;                              // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh5;                              // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Mesh;                                              // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DM_Interior_WoodBoard_07_02(int32 EntryPoint);
	void OnDestructCrashed();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DM_Interior_WoodBoard_07_02_C">();
	}
	static class ADM_Interior_WoodBoard_07_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADM_Interior_WoodBoard_07_02_C>();
	}
};
static_assert(alignof(ADM_Interior_WoodBoard_07_02_C) == 0x000008, "Wrong alignment on ADM_Interior_WoodBoard_07_02_C");
static_assert(sizeof(ADM_Interior_WoodBoard_07_02_C) == 0x0003A8, "Wrong size on ADM_Interior_WoodBoard_07_02_C");
static_assert(offsetof(ADM_Interior_WoodBoard_07_02_C, UberGraphFrame) == 0x000330, "Member 'ADM_Interior_WoodBoard_07_02_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADM_Interior_WoodBoard_07_02_C, BP_PhysicsImpactSound) == 0x000338, "Member 'ADM_Interior_WoodBoard_07_02_C::BP_PhysicsImpactSound' has a wrong offset!");
static_assert(offsetof(ADM_Interior_WoodBoard_07_02_C, LDestructStaticMesh1) == 0x000340, "Member 'ADM_Interior_WoodBoard_07_02_C::LDestructStaticMesh1' has a wrong offset!");
static_assert(offsetof(ADM_Interior_WoodBoard_07_02_C, LDestructStaticMesh9) == 0x000348, "Member 'ADM_Interior_WoodBoard_07_02_C::LDestructStaticMesh9' has a wrong offset!");
static_assert(offsetof(ADM_Interior_WoodBoard_07_02_C, LDestructStaticMesh8) == 0x000350, "Member 'ADM_Interior_WoodBoard_07_02_C::LDestructStaticMesh8' has a wrong offset!");
static_assert(offsetof(ADM_Interior_WoodBoard_07_02_C, LDestructStaticMesh7) == 0x000358, "Member 'ADM_Interior_WoodBoard_07_02_C::LDestructStaticMesh7' has a wrong offset!");
static_assert(offsetof(ADM_Interior_WoodBoard_07_02_C, LDestructStaticMesh6) == 0x000360, "Member 'ADM_Interior_WoodBoard_07_02_C::LDestructStaticMesh6' has a wrong offset!");
static_assert(offsetof(ADM_Interior_WoodBoard_07_02_C, LDestructStaticMesh) == 0x000368, "Member 'ADM_Interior_WoodBoard_07_02_C::LDestructStaticMesh' has a wrong offset!");
static_assert(offsetof(ADM_Interior_WoodBoard_07_02_C, LDestructStaticMesh4) == 0x000370, "Member 'ADM_Interior_WoodBoard_07_02_C::LDestructStaticMesh4' has a wrong offset!");
static_assert(offsetof(ADM_Interior_WoodBoard_07_02_C, LDestructStaticMesh3) == 0x000378, "Member 'ADM_Interior_WoodBoard_07_02_C::LDestructStaticMesh3' has a wrong offset!");
static_assert(offsetof(ADM_Interior_WoodBoard_07_02_C, LDestructStaticMesh2) == 0x000380, "Member 'ADM_Interior_WoodBoard_07_02_C::LDestructStaticMesh2' has a wrong offset!");
static_assert(offsetof(ADM_Interior_WoodBoard_07_02_C, LDestructStaticMesh5) == 0x000388, "Member 'ADM_Interior_WoodBoard_07_02_C::LDestructStaticMesh5' has a wrong offset!");
static_assert(offsetof(ADM_Interior_WoodBoard_07_02_C, Mesh) == 0x000390, "Member 'ADM_Interior_WoodBoard_07_02_C::Mesh' has a wrong offset!");
static_assert(offsetof(ADM_Interior_WoodBoard_07_02_C, Audio) == 0x000398, "Member 'ADM_Interior_WoodBoard_07_02_C::Audio' has a wrong offset!");
static_assert(offsetof(ADM_Interior_WoodBoard_07_02_C, Niagara) == 0x0003A0, "Member 'ADM_Interior_WoodBoard_07_02_C::Niagara' has a wrong offset!");

}

