#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DM_Interior_Barrel_07_01

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass DM_Interior_Barrel_07_01.DM_Interior_Barrel_07_01_C
// 0x0050 (0x0380 - 0x0330)
class ADM_Interior_Barrel_07_01_C final : public ALDestructionObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_PhysicsImpactSound_C*               BP_PhysicsImpactSound;                             // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh7;                              // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh6;                              // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh5;                              // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh4;                              // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh;                               // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Barrel;                                            // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void OnDestructCrashed();
	void ExecuteUbergraph_DM_Interior_Barrel_07_01(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DM_Interior_Barrel_07_01_C">();
	}
	static class ADM_Interior_Barrel_07_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADM_Interior_Barrel_07_01_C>();
	}
};
static_assert(alignof(ADM_Interior_Barrel_07_01_C) == 0x000008, "Wrong alignment on ADM_Interior_Barrel_07_01_C");
static_assert(sizeof(ADM_Interior_Barrel_07_01_C) == 0x000380, "Wrong size on ADM_Interior_Barrel_07_01_C");
static_assert(offsetof(ADM_Interior_Barrel_07_01_C, UberGraphFrame) == 0x000330, "Member 'ADM_Interior_Barrel_07_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADM_Interior_Barrel_07_01_C, BP_PhysicsImpactSound) == 0x000338, "Member 'ADM_Interior_Barrel_07_01_C::BP_PhysicsImpactSound' has a wrong offset!");
static_assert(offsetof(ADM_Interior_Barrel_07_01_C, LDestructStaticMesh7) == 0x000340, "Member 'ADM_Interior_Barrel_07_01_C::LDestructStaticMesh7' has a wrong offset!");
static_assert(offsetof(ADM_Interior_Barrel_07_01_C, LDestructStaticMesh6) == 0x000348, "Member 'ADM_Interior_Barrel_07_01_C::LDestructStaticMesh6' has a wrong offset!");
static_assert(offsetof(ADM_Interior_Barrel_07_01_C, LDestructStaticMesh5) == 0x000350, "Member 'ADM_Interior_Barrel_07_01_C::LDestructStaticMesh5' has a wrong offset!");
static_assert(offsetof(ADM_Interior_Barrel_07_01_C, LDestructStaticMesh4) == 0x000358, "Member 'ADM_Interior_Barrel_07_01_C::LDestructStaticMesh4' has a wrong offset!");
static_assert(offsetof(ADM_Interior_Barrel_07_01_C, LDestructStaticMesh) == 0x000360, "Member 'ADM_Interior_Barrel_07_01_C::LDestructStaticMesh' has a wrong offset!");
static_assert(offsetof(ADM_Interior_Barrel_07_01_C, Barrel) == 0x000368, "Member 'ADM_Interior_Barrel_07_01_C::Barrel' has a wrong offset!");
static_assert(offsetof(ADM_Interior_Barrel_07_01_C, Niagara) == 0x000370, "Member 'ADM_Interior_Barrel_07_01_C::Niagara' has a wrong offset!");
static_assert(offsetof(ADM_Interior_Barrel_07_01_C, Audio) == 0x000378, "Member 'ADM_Interior_Barrel_07_01_C::Audio' has a wrong offset!");

}

