#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DM_Trap_Puppet_Elec_01

#include "Basic.hpp"

#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function DM_Trap_Puppet_Elec_01.DM_Trap_Puppet_Elec_01_C.ExecuteUbergraph_DM_Trap_Puppet_Elec_01
// 0x00B0 (0x00B0 - 0x0000)
struct DM_Trap_Puppet_Elec_01_C_ExecuteUbergraph_DM_Trap_Puppet_Elec_01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULProjectileSystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLProjectileSpawnParameter             K2Node_MakeStruct_LProjectileSpawnParameter;       // 0x0010(0x0090)(NoDestructor)
	class ALProjectile*                           CallFunc_LaunchProjectile_ReturnValue;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DM_Trap_Puppet_Elec_01_C_ExecuteUbergraph_DM_Trap_Puppet_Elec_01) == 0x000010, "Wrong alignment on DM_Trap_Puppet_Elec_01_C_ExecuteUbergraph_DM_Trap_Puppet_Elec_01");
static_assert(sizeof(DM_Trap_Puppet_Elec_01_C_ExecuteUbergraph_DM_Trap_Puppet_Elec_01) == 0x0000B0, "Wrong size on DM_Trap_Puppet_Elec_01_C_ExecuteUbergraph_DM_Trap_Puppet_Elec_01");
static_assert(offsetof(DM_Trap_Puppet_Elec_01_C_ExecuteUbergraph_DM_Trap_Puppet_Elec_01, EntryPoint) == 0x000000, "Member 'DM_Trap_Puppet_Elec_01_C_ExecuteUbergraph_DM_Trap_Puppet_Elec_01::EntryPoint' has a wrong offset!");
static_assert(offsetof(DM_Trap_Puppet_Elec_01_C_ExecuteUbergraph_DM_Trap_Puppet_Elec_01, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'DM_Trap_Puppet_Elec_01_C_ExecuteUbergraph_DM_Trap_Puppet_Elec_01::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(DM_Trap_Puppet_Elec_01_C_ExecuteUbergraph_DM_Trap_Puppet_Elec_01, K2Node_MakeStruct_LProjectileSpawnParameter) == 0x000010, "Member 'DM_Trap_Puppet_Elec_01_C_ExecuteUbergraph_DM_Trap_Puppet_Elec_01::K2Node_MakeStruct_LProjectileSpawnParameter' has a wrong offset!");
static_assert(offsetof(DM_Trap_Puppet_Elec_01_C_ExecuteUbergraph_DM_Trap_Puppet_Elec_01, CallFunc_LaunchProjectile_ReturnValue) == 0x0000A0, "Member 'DM_Trap_Puppet_Elec_01_C_ExecuteUbergraph_DM_Trap_Puppet_Elec_01::CallFunc_LaunchProjectile_ReturnValue' has a wrong offset!");

}

