#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DM_Trap_Puppet_Elec_01

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass DM_Trap_Puppet_Elec_01.DM_Trap_Puppet_Elec_01_C
// 0x0090 (0x03C0 - 0x0330)
class ADM_Trap_Puppet_Elec_01_C final : public ALDestructionObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh2;                              // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara3;                                          // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Capsule;                                           // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh;                               // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DamageLocation;                                    // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh1;                              // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULLockOnTargetComponent*                LLockOnTarget;                                     // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Destruction;                                       // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio2;                                            // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara2;                                          // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Hit;                                               // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio1;                                            // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara1;                                          // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DamageField;                                       // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Idle;                                              // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void OnDestructCrashed();
	void ExecuteUbergraph_DM_Trap_Puppet_Elec_01(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DM_Trap_Puppet_Elec_01_C">();
	}
	static class ADM_Trap_Puppet_Elec_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADM_Trap_Puppet_Elec_01_C>();
	}
};
static_assert(alignof(ADM_Trap_Puppet_Elec_01_C) == 0x000008, "Wrong alignment on ADM_Trap_Puppet_Elec_01_C");
static_assert(sizeof(ADM_Trap_Puppet_Elec_01_C) == 0x0003C0, "Wrong size on ADM_Trap_Puppet_Elec_01_C");
static_assert(offsetof(ADM_Trap_Puppet_Elec_01_C, UberGraphFrame) == 0x000330, "Member 'ADM_Trap_Puppet_Elec_01_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADM_Trap_Puppet_Elec_01_C, LDestructStaticMesh2) == 0x000338, "Member 'ADM_Trap_Puppet_Elec_01_C::LDestructStaticMesh2' has a wrong offset!");
static_assert(offsetof(ADM_Trap_Puppet_Elec_01_C, Niagara3) == 0x000340, "Member 'ADM_Trap_Puppet_Elec_01_C::Niagara3' has a wrong offset!");
static_assert(offsetof(ADM_Trap_Puppet_Elec_01_C, Capsule) == 0x000348, "Member 'ADM_Trap_Puppet_Elec_01_C::Capsule' has a wrong offset!");
static_assert(offsetof(ADM_Trap_Puppet_Elec_01_C, LDestructStaticMesh) == 0x000350, "Member 'ADM_Trap_Puppet_Elec_01_C::LDestructStaticMesh' has a wrong offset!");
static_assert(offsetof(ADM_Trap_Puppet_Elec_01_C, DamageLocation) == 0x000358, "Member 'ADM_Trap_Puppet_Elec_01_C::DamageLocation' has a wrong offset!");
static_assert(offsetof(ADM_Trap_Puppet_Elec_01_C, LDestructStaticMesh1) == 0x000360, "Member 'ADM_Trap_Puppet_Elec_01_C::LDestructStaticMesh1' has a wrong offset!");
static_assert(offsetof(ADM_Trap_Puppet_Elec_01_C, LLockOnTarget) == 0x000368, "Member 'ADM_Trap_Puppet_Elec_01_C::LLockOnTarget' has a wrong offset!");
static_assert(offsetof(ADM_Trap_Puppet_Elec_01_C, Destruction) == 0x000370, "Member 'ADM_Trap_Puppet_Elec_01_C::Destruction' has a wrong offset!");
static_assert(offsetof(ADM_Trap_Puppet_Elec_01_C, Audio2) == 0x000378, "Member 'ADM_Trap_Puppet_Elec_01_C::Audio2' has a wrong offset!");
static_assert(offsetof(ADM_Trap_Puppet_Elec_01_C, Niagara2) == 0x000380, "Member 'ADM_Trap_Puppet_Elec_01_C::Niagara2' has a wrong offset!");
static_assert(offsetof(ADM_Trap_Puppet_Elec_01_C, Hit) == 0x000388, "Member 'ADM_Trap_Puppet_Elec_01_C::Hit' has a wrong offset!");
static_assert(offsetof(ADM_Trap_Puppet_Elec_01_C, Audio1) == 0x000390, "Member 'ADM_Trap_Puppet_Elec_01_C::Audio1' has a wrong offset!");
static_assert(offsetof(ADM_Trap_Puppet_Elec_01_C, Niagara1) == 0x000398, "Member 'ADM_Trap_Puppet_Elec_01_C::Niagara1' has a wrong offset!");
static_assert(offsetof(ADM_Trap_Puppet_Elec_01_C, DamageField) == 0x0003A0, "Member 'ADM_Trap_Puppet_Elec_01_C::DamageField' has a wrong offset!");
static_assert(offsetof(ADM_Trap_Puppet_Elec_01_C, Niagara) == 0x0003A8, "Member 'ADM_Trap_Puppet_Elec_01_C::Niagara' has a wrong offset!");
static_assert(offsetof(ADM_Trap_Puppet_Elec_01_C, Audio) == 0x0003B0, "Member 'ADM_Trap_Puppet_Elec_01_C::Audio' has a wrong offset!");
static_assert(offsetof(ADM_Trap_Puppet_Elec_01_C, Idle) == 0x0003B8, "Member 'ADM_Trap_Puppet_Elec_01_C::Idle' has a wrong offset!");

}

