#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FluidActor

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass FluidActor.FluidActor_C
// 0x0018 (0x01F8 - 0x01E0)
class AFluidActor_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Cube;                                              // 0x01E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_FluidImplementation_C*              BP_FluidImplementation;                            // 0x01E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x01F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FluidActor_C">();
	}
	static class AFluidActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFluidActor_C>();
	}
};
static_assert(alignof(AFluidActor_C) == 0x000008, "Wrong alignment on AFluidActor_C");
static_assert(sizeof(AFluidActor_C) == 0x0001F8, "Wrong size on AFluidActor_C");
static_assert(offsetof(AFluidActor_C, Cube) == 0x0001E0, "Member 'AFluidActor_C::Cube' has a wrong offset!");
static_assert(offsetof(AFluidActor_C, BP_FluidImplementation) == 0x0001E8, "Member 'AFluidActor_C::BP_FluidImplementation' has a wrong offset!");
static_assert(offsetof(AFluidActor_C, DefaultSceneRoot) == 0x0001F0, "Member 'AFluidActor_C::DefaultSceneRoot' has a wrong offset!");

}

