#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FunctionalTesting

#include "Basic.hpp"

#include "FunctionalTesting_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class FunctionalTesting.AutomationEditorTask
// 0x0008 (0x0030 - 0x0028)
class UAutomationEditorTask final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsTaskDone() const;
	bool IsValidTask() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AutomationEditorTask">();
	}
	static class UAutomationEditorTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutomationEditorTask>();
	}
};
static_assert(alignof(UAutomationEditorTask) == 0x000008, "Wrong alignment on UAutomationEditorTask");
static_assert(sizeof(UAutomationEditorTask) == 0x000030, "Wrong size on UAutomationEditorTask");

// Class FunctionalTesting.AutomationBlueprintFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UAutomationBlueprintFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AddExpectedLogError(const class FString& ExpectedPatternString, int32 Occurrences, bool ExactMatch);
	static bool AreAutomatedTestsRunning();
	static void AutomationWaitForLoading(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, const struct FAutomationWaitForLoadingOptions& Options);
	static void DisableStatGroup(class UObject* WorldContextObject, class FName GroupName);
	static void EnableStatGroup(class UObject* WorldContextObject, class FName GroupName);
	static struct FAutomationScreenshotOptions GetDefaultScreenshotOptionsForGameplay(EComparisonTolerance Tolerance, float Delay);
	static struct FAutomationScreenshotOptions GetDefaultScreenshotOptionsForRendering(EComparisonTolerance Tolerance, float Delay);
	static float GetStatCallCount(class FName StatName);
	static float GetStatExcAverage(class FName StatName);
	static float GetStatExcMax(class FName StatName);
	static float GetStatIncAverage(class FName StatName);
	static float GetStatIncMax(class FName StatName);
	static void SetScalabilityQualityLevelRelativeToMax(class UObject* WorldContextObject, int32 Value);
	static void SetScalabilityQualityToEpic(class UObject* WorldContextObject);
	static void SetScalabilityQualityToLow(class UObject* WorldContextObject);
	static void TakeAutomationScreenshot(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, const class FString& Name_0, const class FString& Notes, const struct FAutomationScreenshotOptions& Options);
	static void TakeAutomationScreenshotAtCamera(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, class ACameraActor* Camera, const class FString& NameOverride, const class FString& Notes, const struct FAutomationScreenshotOptions& Options);
	static void TakeAutomationScreenshotOfUI(class UObject* WorldContextObject, const struct FLatentActionInfo& LatentInfo, const class FString& Name_0, const struct FAutomationScreenshotOptions& Options);
	static class UAutomationEditorTask* TakeHighResScreenshot(int32 ResX, int32 ResY, const class FString& Filename, class ACameraActor* Camera, bool bMaskEnabled, bool bCaptureHDR, EComparisonTolerance ComparisonTolerance, const class FString& ComparisonNotes, float Delay);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AutomationBlueprintFunctionLibrary">();
	}
	static class UAutomationBlueprintFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutomationBlueprintFunctionLibrary>();
	}
};
static_assert(alignof(UAutomationBlueprintFunctionLibrary) == 0x000008, "Wrong alignment on UAutomationBlueprintFunctionLibrary");
static_assert(sizeof(UAutomationBlueprintFunctionLibrary) == 0x000028, "Wrong size on UAutomationBlueprintFunctionLibrary");

// Class FunctionalTesting.AutomationViewSettings
// 0x0010 (0x0040 - 0x0030)
class UAutomationViewSettings final : public UDataAsset
{
public:
	bool                                          AntiAliasing;                                      // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MotionBlur;                                        // 0x0031(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          TemporalAA;                                        // 0x0032(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ScreenSpaceReflections;                            // 0x0033(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ScreenSpaceAO;                                     // 0x0034(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DistanceFieldAO;                                   // 0x0035(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ContactShadows;                                    // 0x0036(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EyeAdaptation;                                     // 0x0037(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Bloom;                                             // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AutomationViewSettings">();
	}
	static class UAutomationViewSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutomationViewSettings>();
	}
};
static_assert(alignof(UAutomationViewSettings) == 0x000008, "Wrong alignment on UAutomationViewSettings");
static_assert(sizeof(UAutomationViewSettings) == 0x000040, "Wrong size on UAutomationViewSettings");
static_assert(offsetof(UAutomationViewSettings, AntiAliasing) == 0x000030, "Member 'UAutomationViewSettings::AntiAliasing' has a wrong offset!");
static_assert(offsetof(UAutomationViewSettings, MotionBlur) == 0x000031, "Member 'UAutomationViewSettings::MotionBlur' has a wrong offset!");
static_assert(offsetof(UAutomationViewSettings, TemporalAA) == 0x000032, "Member 'UAutomationViewSettings::TemporalAA' has a wrong offset!");
static_assert(offsetof(UAutomationViewSettings, ScreenSpaceReflections) == 0x000033, "Member 'UAutomationViewSettings::ScreenSpaceReflections' has a wrong offset!");
static_assert(offsetof(UAutomationViewSettings, ScreenSpaceAO) == 0x000034, "Member 'UAutomationViewSettings::ScreenSpaceAO' has a wrong offset!");
static_assert(offsetof(UAutomationViewSettings, DistanceFieldAO) == 0x000035, "Member 'UAutomationViewSettings::DistanceFieldAO' has a wrong offset!");
static_assert(offsetof(UAutomationViewSettings, ContactShadows) == 0x000036, "Member 'UAutomationViewSettings::ContactShadows' has a wrong offset!");
static_assert(offsetof(UAutomationViewSettings, EyeAdaptation) == 0x000037, "Member 'UAutomationViewSettings::EyeAdaptation' has a wrong offset!");
static_assert(offsetof(UAutomationViewSettings, Bloom) == 0x000038, "Member 'UAutomationViewSettings::Bloom' has a wrong offset!");

// Class FunctionalTesting.FuncTestRenderingComponent
// 0x0000 (0x0440 - 0x0440)
class UFuncTestRenderingComponent final : public UPrimitiveComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FuncTestRenderingComponent">();
	}
	static class UFuncTestRenderingComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFuncTestRenderingComponent>();
	}
};
static_assert(alignof(UFuncTestRenderingComponent) == 0x000010, "Wrong alignment on UFuncTestRenderingComponent");
static_assert(sizeof(UFuncTestRenderingComponent) == 0x000440, "Wrong size on UFuncTestRenderingComponent");

// Class FunctionalTesting.FunctionalTest
// 0x0118 (0x02F8 - 0x01E0)
class AFunctionalTest : public AActor
{
public:
	class UBillboardComponent*                    SpriteComponent;                                   // 0x01E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bIsEnabled : 1;                                    // 0x01E8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EFunctionalTestLogHandling                    LogErrorHandling;                                  // 0x01EC(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EFunctionalTestLogHandling                    LogWarningHandling;                                // 0x01ED(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1EE[0x2];                                      // 0x01EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Author;                                            // 0x01F0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 Description;                                       // 0x0200(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                 ObservationPoint;                                  // 0x0210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRandomStream                          RandomNumbersStream;                               // 0x0218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	EFunctionalTestResult                         Result;                                            // 0x0220(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PreparationTimeLimit;                              // 0x0224(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeLimit;                                         // 0x0228(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   TimesUpMessage;                                    // 0x0230(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EFunctionalTestResult                         TimesUpResult;                                     // 0x0248(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnTestPrepare;                                     // 0x0250(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnTestStart;                                       // 0x0260(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnTestFinished;                                    // 0x0270(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         AutoDestroyActors;                                 // 0x0280(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_290[0x38];                                     // 0x0290(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsRunning;                                        // 0x02C8(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C9[0x17];                                     // 0x02C9(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TotalTime;                                         // 0x02E0(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E4[0x14];                                     // 0x02E4(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddError(const class FString& Message);
	void AddRerun(class FName Reason);
	void AddWarning(const class FString& Message);
	bool AssertEqual_Bool(const bool Actual, const bool Expected, const class FString& What, const class UObject* ContextObject);
	bool AssertEqual_Float(const float Actual, const float Expected, const class FString& What, const float Tolerance, const class UObject* ContextObject);
	bool AssertEqual_Int(const int32 Actual, const int32 Expected, const class FString& What, const class UObject* ContextObject);
	bool AssertEqual_Name(const class FName Actual, const class FName Expected, const class FString& What, const class UObject* ContextObject);
	bool AssertEqual_Object(class UObject* Actual, class UObject* Expected, const class FString& What, const class UObject* ContextObject);
	bool AssertEqual_Rotator(const struct FRotator& Actual, const struct FRotator& Expected, const class FString& What, const float Tolerance, const class UObject* ContextObject);
	bool AssertEqual_String(const class FString& Actual, const class FString& Expected, const class FString& What, const class UObject* ContextObject);
	bool AssertEqual_TraceQueryResults(const class UTraceQueryTestResults* Actual, const class UTraceQueryTestResults* Expected, const class FString& What, const class UObject* ContextObject);
	bool AssertEqual_Transform(const struct FTransform& Actual, const struct FTransform& Expected, const class FString& What, float Tolerance, const class UObject* ContextObject);
	bool AssertEqual_Vector(const struct FVector& Actual, const struct FVector& Expected, const class FString& What, const float Tolerance, const class UObject* ContextObject);
	bool AssertFalse(bool Condition, const class FString& Message, const class UObject* ContextObject);
	bool AssertIsValid(class UObject* Object, const class FString& Message, const class UObject* ContextObject);
	bool AssertNotEqual_Rotator(const struct FRotator& Actual, const struct FRotator& NotExpected, const class FString& What, const class UObject* ContextObject);
	bool AssertNotEqual_String(const class FString& Actual, const class FString& NotExpected, const class FString& What, const class UObject* ContextObject);
	bool AssertNotEqual_Transform(const struct FTransform& Actual, const struct FTransform& NotExpected, const class FString& What, const class UObject* ContextObject);
	bool AssertNotEqual_Vector(const struct FVector& Actual, const struct FVector& NotExpected, const class FString& What, const class UObject* ContextObject);
	bool AssertTrue(bool Condition, const class FString& Message, const class UObject* ContextObject);
	bool AssertValue_DateTime(const struct FDateTime& Actual, EComparisonMethod ShouldBe, const struct FDateTime& Expected, const class FString& What, const class UObject* ContextObject);
	bool AssertValue_Float(float Actual, EComparisonMethod ShouldBe, float Expected, const class FString& What, const class UObject* ContextObject);
	bool AssertValue_Int(int32 Actual, EComparisonMethod ShouldBe, int32 Expected, const class FString& What, const class UObject* ContextObject);
	void FinishTest(EFunctionalTestResult TestResult, const class FString& Message);
	bool IsReady();
	void LogMessage(const class FString& Message);
	void ReceivePrepareTest();
	void ReceiveStartTest();
	void RegisterAutoDestroyActor(class AActor* ActorToAutoDestroy);
	void SetTimeLimit(float NewTimeLimit, EFunctionalTestResult ResultWhenTimeRunsOut);

	TArray<class AActor*> DebugGatherRelevantActors() const;
	class FName GetCurrentRerunReason() const;
	bool IsEnabled() const;
	bool IsRunning() const;
	class FString OnAdditionalTestFinishedMessageRequest(EFunctionalTestResult TestResult) const;
	bool OnWantsReRunCheck() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FunctionalTest">();
	}
	static class AFunctionalTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFunctionalTest>();
	}
};
static_assert(alignof(AFunctionalTest) == 0x000008, "Wrong alignment on AFunctionalTest");
static_assert(sizeof(AFunctionalTest) == 0x0002F8, "Wrong size on AFunctionalTest");
static_assert(offsetof(AFunctionalTest, SpriteComponent) == 0x0001E0, "Member 'AFunctionalTest::SpriteComponent' has a wrong offset!");
static_assert(offsetof(AFunctionalTest, LogErrorHandling) == 0x0001EC, "Member 'AFunctionalTest::LogErrorHandling' has a wrong offset!");
static_assert(offsetof(AFunctionalTest, LogWarningHandling) == 0x0001ED, "Member 'AFunctionalTest::LogWarningHandling' has a wrong offset!");
static_assert(offsetof(AFunctionalTest, Author) == 0x0001F0, "Member 'AFunctionalTest::Author' has a wrong offset!");
static_assert(offsetof(AFunctionalTest, Description) == 0x000200, "Member 'AFunctionalTest::Description' has a wrong offset!");
static_assert(offsetof(AFunctionalTest, ObservationPoint) == 0x000210, "Member 'AFunctionalTest::ObservationPoint' has a wrong offset!");
static_assert(offsetof(AFunctionalTest, RandomNumbersStream) == 0x000218, "Member 'AFunctionalTest::RandomNumbersStream' has a wrong offset!");
static_assert(offsetof(AFunctionalTest, Result) == 0x000220, "Member 'AFunctionalTest::Result' has a wrong offset!");
static_assert(offsetof(AFunctionalTest, PreparationTimeLimit) == 0x000224, "Member 'AFunctionalTest::PreparationTimeLimit' has a wrong offset!");
static_assert(offsetof(AFunctionalTest, TimeLimit) == 0x000228, "Member 'AFunctionalTest::TimeLimit' has a wrong offset!");
static_assert(offsetof(AFunctionalTest, TimesUpMessage) == 0x000230, "Member 'AFunctionalTest::TimesUpMessage' has a wrong offset!");
static_assert(offsetof(AFunctionalTest, TimesUpResult) == 0x000248, "Member 'AFunctionalTest::TimesUpResult' has a wrong offset!");
static_assert(offsetof(AFunctionalTest, OnTestPrepare) == 0x000250, "Member 'AFunctionalTest::OnTestPrepare' has a wrong offset!");
static_assert(offsetof(AFunctionalTest, OnTestStart) == 0x000260, "Member 'AFunctionalTest::OnTestStart' has a wrong offset!");
static_assert(offsetof(AFunctionalTest, OnTestFinished) == 0x000270, "Member 'AFunctionalTest::OnTestFinished' has a wrong offset!");
static_assert(offsetof(AFunctionalTest, AutoDestroyActors) == 0x000280, "Member 'AFunctionalTest::AutoDestroyActors' has a wrong offset!");
static_assert(offsetof(AFunctionalTest, bIsRunning) == 0x0002C8, "Member 'AFunctionalTest::bIsRunning' has a wrong offset!");
static_assert(offsetof(AFunctionalTest, TotalTime) == 0x0002E0, "Member 'AFunctionalTest::TotalTime' has a wrong offset!");

// Class FunctionalTesting.FunctionalAITestBase
// 0x0088 (0x0380 - 0x02F8)
class AFunctionalAITestBase : public AFunctionalTest
{
public:
	float                                         SpawnLocationRandomizationRange;                   // 0x02F8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APawn*>                          SpawnedPawns;                                      // 0x0300(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FPendingDelayedSpawn>           PendingDelayedSpawns;                              // 0x0310(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	int32                                         CurrentSpawnSetIndex;                              // 0x0320(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CurrentSpawnSetName;                               // 0x0328(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             OnAISpawned;                                       // 0x0338(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             OnAllAISPawned;                                    // 0x0348(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	struct FVector                                NavMeshDebugOrigin;                                // 0x0358(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                NavMeshDebugExtent;                                // 0x0364(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bWaitForNavMesh : 1;                               // 0x0370(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bDebugNavMeshOnTimeout : 1;                        // 0x0370(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_371[0xF];                                      // 0x0371(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsOneOfSpawnedPawns(class AActor* Actor);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FunctionalAITestBase">();
	}
	static class AFunctionalAITestBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFunctionalAITestBase>();
	}
};
static_assert(alignof(AFunctionalAITestBase) == 0x000008, "Wrong alignment on AFunctionalAITestBase");
static_assert(sizeof(AFunctionalAITestBase) == 0x000380, "Wrong size on AFunctionalAITestBase");
static_assert(offsetof(AFunctionalAITestBase, SpawnLocationRandomizationRange) == 0x0002F8, "Member 'AFunctionalAITestBase::SpawnLocationRandomizationRange' has a wrong offset!");
static_assert(offsetof(AFunctionalAITestBase, SpawnedPawns) == 0x000300, "Member 'AFunctionalAITestBase::SpawnedPawns' has a wrong offset!");
static_assert(offsetof(AFunctionalAITestBase, PendingDelayedSpawns) == 0x000310, "Member 'AFunctionalAITestBase::PendingDelayedSpawns' has a wrong offset!");
static_assert(offsetof(AFunctionalAITestBase, CurrentSpawnSetIndex) == 0x000320, "Member 'AFunctionalAITestBase::CurrentSpawnSetIndex' has a wrong offset!");
static_assert(offsetof(AFunctionalAITestBase, CurrentSpawnSetName) == 0x000328, "Member 'AFunctionalAITestBase::CurrentSpawnSetName' has a wrong offset!");
static_assert(offsetof(AFunctionalAITestBase, OnAISpawned) == 0x000338, "Member 'AFunctionalAITestBase::OnAISpawned' has a wrong offset!");
static_assert(offsetof(AFunctionalAITestBase, OnAllAISPawned) == 0x000348, "Member 'AFunctionalAITestBase::OnAllAISPawned' has a wrong offset!");
static_assert(offsetof(AFunctionalAITestBase, NavMeshDebugOrigin) == 0x000358, "Member 'AFunctionalAITestBase::NavMeshDebugOrigin' has a wrong offset!");
static_assert(offsetof(AFunctionalAITestBase, NavMeshDebugExtent) == 0x000364, "Member 'AFunctionalAITestBase::NavMeshDebugExtent' has a wrong offset!");

// Class FunctionalTesting.FunctionalAITest
// 0x0010 (0x0390 - 0x0380)
class AFunctionalAITest final : public AFunctionalAITestBase
{
public:
	TArray<struct FAITestSpawnSet>                SpawnSets;                                         // 0x0380(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FunctionalAITest">();
	}
	static class AFunctionalAITest* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFunctionalAITest>();
	}
};
static_assert(alignof(AFunctionalAITest) == 0x000008, "Wrong alignment on AFunctionalAITest");
static_assert(sizeof(AFunctionalAITest) == 0x000390, "Wrong size on AFunctionalAITest");
static_assert(offsetof(AFunctionalAITest, SpawnSets) == 0x000380, "Member 'AFunctionalAITest::SpawnSets' has a wrong offset!");

// Class FunctionalTesting.AutomationPerformaceHelper
// 0x0038 (0x0060 - 0x0028)
class UAutomationPerformaceHelper final : public UObject
{
public:
	uint8                                         Pad_28[0x38];                                      // 0x0028(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BeginRecording(const class FString& RecordName, float InGPUBudget, float InRenderThreadBudget, float InGameThreadBudget);
	void BeginRecordingBaseline(const class FString& RecordName);
	void BeginStatsFile(const class FString& RecordName);
	void EndRecording();
	void EndRecordingBaseline();
	void EndStatsFile();
	void OnAllTestsComplete();
	void OnBeginTests();
	void Sample(float DeltaSeconds);
	void StartCPUProfiling();
	void StopCPUProfiling();
	void Tick(float DeltaSeconds);
	void TriggerGPUTraceIfRecordFallsBelowBudget();
	void WriteLogFile(const class FString& CaptureDir, const class FString& CaptureExtension);

	bool IsCurrentRecordWithinGameThreadBudget() const;
	bool IsCurrentRecordWithinGPUBudget() const;
	bool IsCurrentRecordWithinRenderThreadBudget() const;
	bool IsRecording() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AutomationPerformaceHelper">();
	}
	static class UAutomationPerformaceHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAutomationPerformaceHelper>();
	}
};
static_assert(alignof(UAutomationPerformaceHelper) == 0x000008, "Wrong alignment on UAutomationPerformaceHelper");
static_assert(sizeof(UAutomationPerformaceHelper) == 0x000060, "Wrong size on UAutomationPerformaceHelper");

// Class FunctionalTesting.FunctionalTestGameMode
// 0x0000 (0x0280 - 0x0280)
class AFunctionalTestGameMode final : public AGameModeBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FunctionalTestGameMode">();
	}
	static class AFunctionalTestGameMode* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFunctionalTestGameMode>();
	}
};
static_assert(alignof(AFunctionalTestGameMode) == 0x000008, "Wrong alignment on AFunctionalTestGameMode");
static_assert(sizeof(AFunctionalTestGameMode) == 0x000280, "Wrong size on AFunctionalTestGameMode");

// Class FunctionalTesting.FunctionalTestingManager
// 0x0098 (0x00C0 - 0x0028)
class UFunctionalTestingManager final : public UBlueprintFunctionLibrary
{
public:
	TArray<class AFunctionalTest*>                TestsLeft;                                         // 0x0028(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<class AFunctionalTest*>                AllTests;                                          // 0x0038(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnSetupTests;                                      // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnTestsComplete;                                   // 0x0058(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnTestsBegin;                                      // 0x0068(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x48];                                      // 0x0078(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static bool RunAllFunctionalTests(class UObject* WorldContextObject, bool bNewLog, bool bRunLooped, const class FString& FailedTestsReproString);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FunctionalTestingManager">();
	}
	static class UFunctionalTestingManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFunctionalTestingManager>();
	}
};
static_assert(alignof(UFunctionalTestingManager) == 0x000008, "Wrong alignment on UFunctionalTestingManager");
static_assert(sizeof(UFunctionalTestingManager) == 0x0000C0, "Wrong size on UFunctionalTestingManager");
static_assert(offsetof(UFunctionalTestingManager, TestsLeft) == 0x000028, "Member 'UFunctionalTestingManager::TestsLeft' has a wrong offset!");
static_assert(offsetof(UFunctionalTestingManager, AllTests) == 0x000038, "Member 'UFunctionalTestingManager::AllTests' has a wrong offset!");
static_assert(offsetof(UFunctionalTestingManager, OnSetupTests) == 0x000048, "Member 'UFunctionalTestingManager::OnSetupTests' has a wrong offset!");
static_assert(offsetof(UFunctionalTestingManager, OnTestsComplete) == 0x000058, "Member 'UFunctionalTestingManager::OnTestsComplete' has a wrong offset!");
static_assert(offsetof(UFunctionalTestingManager, OnTestsBegin) == 0x000068, "Member 'UFunctionalTestingManager::OnTestsBegin' has a wrong offset!");

// Class FunctionalTesting.PhasedAutomationActorBase
// 0x0000 (0x01E0 - 0x01E0)
class APhasedAutomationActorBase final : public AActor
{
public:
	void OnFunctionalTestingBegin();
	void OnFunctionalTestingComplete();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PhasedAutomationActorBase">();
	}
	static class APhasedAutomationActorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<APhasedAutomationActorBase>();
	}
};
static_assert(alignof(APhasedAutomationActorBase) == 0x000008, "Wrong alignment on APhasedAutomationActorBase");
static_assert(sizeof(APhasedAutomationActorBase) == 0x0001E0, "Wrong size on APhasedAutomationActorBase");

// Class FunctionalTesting.FunctionalTestLevelScript
// 0x0000 (0x01E8 - 0x01E8)
class AFunctionalTestLevelScript final : public ALevelScriptActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FunctionalTestLevelScript">();
	}
	static class AFunctionalTestLevelScript* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFunctionalTestLevelScript>();
	}
};
static_assert(alignof(AFunctionalTestLevelScript) == 0x000008, "Wrong alignment on AFunctionalTestLevelScript");
static_assert(sizeof(AFunctionalTestLevelScript) == 0x0001E8, "Wrong size on AFunctionalTestLevelScript");

// Class FunctionalTesting.FunctionalTestUtilityLibrary
// 0x0000 (0x0028 - 0x0028)
class UFunctionalTestUtilityLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UTraceQueryTestResults* TraceChannelTestUtil(class UObject* WorldContextObject, const struct FTraceChannelTestBatchOptions& BatchOptions, const struct FVector& Start, const struct FVector& End, float SphereCapsuleRadius, float CapsuleHalfHeight, const struct FVector& BoxHalfSize, const struct FRotator& Orientation, ETraceTypeQuery TraceChannel, const TArray<EObjectTypeQuery>& ObjectTypes, class FName ProfileName, bool bTraceComplex, const TArray<class AActor*>& ActorsToIgnore, bool bIgnoreSelf, EDrawDebugTrace DrawDebugType, const struct FLinearColor& TraceColor, const struct FLinearColor& TraceHitColor, float DrawTime);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FunctionalTestUtilityLibrary">();
	}
	static class UFunctionalTestUtilityLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFunctionalTestUtilityLibrary>();
	}
};
static_assert(alignof(UFunctionalTestUtilityLibrary) == 0x000008, "Wrong alignment on UFunctionalTestUtilityLibrary");
static_assert(sizeof(UFunctionalTestUtilityLibrary) == 0x000028, "Wrong size on UFunctionalTestUtilityLibrary");

// Class FunctionalTesting.ScreenshotFunctionalTestBase
// 0x0078 (0x0370 - 0x02F8)
class AScreenshotFunctionalTestBase : public AFunctionalTest
{
public:
	class FString                                 Notes;                                             // 0x02F8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCameraComponent*                       ScreenshotCamera;                                  // 0x0308(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FAutomationScreenshotOptions           ScreenshotOptions;                                 // 0x0310(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, SimpleDisplay, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_350[0x20];                                     // 0x0350(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ScreenshotFunctionalTestBase">();
	}
	static class AScreenshotFunctionalTestBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AScreenshotFunctionalTestBase>();
	}
};
static_assert(alignof(AScreenshotFunctionalTestBase) == 0x000008, "Wrong alignment on AScreenshotFunctionalTestBase");
static_assert(sizeof(AScreenshotFunctionalTestBase) == 0x000370, "Wrong size on AScreenshotFunctionalTestBase");
static_assert(offsetof(AScreenshotFunctionalTestBase, Notes) == 0x0002F8, "Member 'AScreenshotFunctionalTestBase::Notes' has a wrong offset!");
static_assert(offsetof(AScreenshotFunctionalTestBase, ScreenshotCamera) == 0x000308, "Member 'AScreenshotFunctionalTestBase::ScreenshotCamera' has a wrong offset!");
static_assert(offsetof(AScreenshotFunctionalTestBase, ScreenshotOptions) == 0x000310, "Member 'AScreenshotFunctionalTestBase::ScreenshotOptions' has a wrong offset!");

// Class FunctionalTesting.FunctionalUIScreenshotTest
// 0x0020 (0x0390 - 0x0370)
class AFunctionalUIScreenshotTest final : public AScreenshotFunctionalTestBase
{
public:
	TSubclassOf<class UUserWidget>                WidgetClass;                                       // 0x0370(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UUserWidget*                            SpawnedWidget;                                     // 0x0378(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EWidgetTestAppearLocation                     WidgetLocation;                                    // 0x0380(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 ScreenshotRT;                                      // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FunctionalUIScreenshotTest">();
	}
	static class AFunctionalUIScreenshotTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFunctionalUIScreenshotTest>();
	}
};
static_assert(alignof(AFunctionalUIScreenshotTest) == 0x000008, "Wrong alignment on AFunctionalUIScreenshotTest");
static_assert(sizeof(AFunctionalUIScreenshotTest) == 0x000390, "Wrong size on AFunctionalUIScreenshotTest");
static_assert(offsetof(AFunctionalUIScreenshotTest, WidgetClass) == 0x000370, "Member 'AFunctionalUIScreenshotTest::WidgetClass' has a wrong offset!");
static_assert(offsetof(AFunctionalUIScreenshotTest, SpawnedWidget) == 0x000378, "Member 'AFunctionalUIScreenshotTest::SpawnedWidget' has a wrong offset!");
static_assert(offsetof(AFunctionalUIScreenshotTest, WidgetLocation) == 0x000380, "Member 'AFunctionalUIScreenshotTest::WidgetLocation' has a wrong offset!");
static_assert(offsetof(AFunctionalUIScreenshotTest, ScreenshotRT) == 0x000388, "Member 'AFunctionalUIScreenshotTest::ScreenshotRT' has a wrong offset!");

// Class FunctionalTesting.GroundTruthData
// 0x0010 (0x0038 - 0x0028)
class UGroundTruthData final : public UObject
{
public:
	bool                                          bResetGroundTruth;                                 // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ObjectData;                                        // 0x0030(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UObject* LoadObject();
	void SaveObject(class UObject* GroundTruth);

	bool CanModify() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GroundTruthData">();
	}
	static class UGroundTruthData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroundTruthData>();
	}
};
static_assert(alignof(UGroundTruthData) == 0x000008, "Wrong alignment on UGroundTruthData");
static_assert(sizeof(UGroundTruthData) == 0x000038, "Wrong size on UGroundTruthData");
static_assert(offsetof(UGroundTruthData, bResetGroundTruth) == 0x000028, "Member 'UGroundTruthData::bResetGroundTruth' has a wrong offset!");
static_assert(offsetof(UGroundTruthData, ObjectData) == 0x000030, "Member 'UGroundTruthData::ObjectData' has a wrong offset!");

// Class FunctionalTesting.ScreenshotFunctionalTest
// 0x0008 (0x0378 - 0x0370)
class AScreenshotFunctionalTest final : public AScreenshotFunctionalTestBase
{
public:
	bool                                          bCameraCutOnScreenshotPrep;                        // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, SimpleDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ScreenshotFunctionalTest">();
	}
	static class AScreenshotFunctionalTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<AScreenshotFunctionalTest>();
	}
};
static_assert(alignof(AScreenshotFunctionalTest) == 0x000008, "Wrong alignment on AScreenshotFunctionalTest");
static_assert(sizeof(AScreenshotFunctionalTest) == 0x000378, "Wrong size on AScreenshotFunctionalTest");
static_assert(offsetof(AScreenshotFunctionalTest, bCameraCutOnScreenshotPrep) == 0x000370, "Member 'AScreenshotFunctionalTest::bCameraCutOnScreenshotPrep' has a wrong offset!");

// Class FunctionalTesting.TestPhaseComponent
// 0x0000 (0x01F0 - 0x01F0)
class UTestPhaseComponent final : public USceneComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TestPhaseComponent">();
	}
	static class UTestPhaseComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTestPhaseComponent>();
	}
};
static_assert(alignof(UTestPhaseComponent) == 0x000010, "Wrong alignment on UTestPhaseComponent");
static_assert(sizeof(UTestPhaseComponent) == 0x0001F0, "Wrong size on UTestPhaseComponent");

// Class FunctionalTesting.TraceQueryTestResults
// 0x09C8 (0x09F0 - 0x0028)
class UTraceQueryTestResults final : public UObject
{
public:
	struct FTraceQueryTestResultsInner            ChannelResults;                                    // 0x0028(0x0340)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FTraceQueryTestResultsInner            ObjectResults;                                     // 0x0368(0x0340)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FTraceQueryTestResultsInner            ProfileResults;                                    // 0x06A8(0x0340)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FTraceChannelTestBatchOptions          BatchOptions;                                      // 0x09E8(0x0007)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_9EF[0x1];                                      // 0x09EF(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class FString ToString();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TraceQueryTestResults">();
	}
	static class UTraceQueryTestResults* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTraceQueryTestResults>();
	}
};
static_assert(alignof(UTraceQueryTestResults) == 0x000008, "Wrong alignment on UTraceQueryTestResults");
static_assert(sizeof(UTraceQueryTestResults) == 0x0009F0, "Wrong size on UTraceQueryTestResults");
static_assert(offsetof(UTraceQueryTestResults, ChannelResults) == 0x000028, "Member 'UTraceQueryTestResults::ChannelResults' has a wrong offset!");
static_assert(offsetof(UTraceQueryTestResults, ObjectResults) == 0x000368, "Member 'UTraceQueryTestResults::ObjectResults' has a wrong offset!");
static_assert(offsetof(UTraceQueryTestResults, ProfileResults) == 0x0006A8, "Member 'UTraceQueryTestResults::ProfileResults' has a wrong offset!");
