#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GallerySystemDataBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GallerySystemDataBP.GallerySystemDataBP_C.ExecuteUbergraph_GallerySystemDataBP
// 0x02A0 (0x02A0 - 0x0000)
struct GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_1;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_CodeName;                             // 0x000C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_InLocation;                           // 0x0014(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACineCameraActor*                       K2Node_Event_InPreviewCam;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InPreviewCam_OriginZ;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0xC];                                       // 0x0054(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x009C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_2;          // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    K2Node_CustomEvent_Loaded;                         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TDelegate<void(TSubclassOf<class UObject> Loaded)> K2Node_CreateDelegate_OutputDelegate;              // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
	class ULGallerySystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULGallerySystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULGallerySystem*                        CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLGalleryAssetTableRowType             CallFunc_GetRecollectionAssetInfo_ReturnValue;     // 0x0158(0x0058)()
	class ALGalleryActor_C*                       K2Node_DynamicCast_AsLGallery_Actor;               // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftClassReference_ReturnValue;    // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Get_Camera_Pivot_Component_Component;     // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CalcCamZByPivot_OutInterval;              // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x01F0(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UClass*                                 K2Node_ClassDynamicCast_AsActor;                   // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP) == 0x000010, "Wrong alignment on GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP");
static_assert(sizeof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP) == 0x0002A0, "Wrong size on GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, EntryPoint) == 0x000000, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000004, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_NotEqual_NameName_ReturnValue) == 0x000005, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_NotEqual_NameName_ReturnValue_1) == 0x000006, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_NotEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_BooleanAND_ReturnValue) == 0x000007, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, K2Node_Event_CodeName) == 0x00000C, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::K2Node_Event_CodeName' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, K2Node_Event_InLocation) == 0x000014, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::K2Node_Event_InLocation' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, K2Node_Event_InPreviewCam) == 0x000020, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::K2Node_Event_InPreviewCam' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, K2Node_Event_InPreviewCam_OriginZ) == 0x000028, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::K2Node_Event_InPreviewCam_OriginZ' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000030, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00003C, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_BreakVector_X) == 0x000048, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_BreakVector_Y) == 0x00004C, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_BreakVector_Z) == 0x000050, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_MakeVector_ReturnValue) == 0x000090, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x00009C, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_NotEqual_NameName_ReturnValue_2) == 0x000124, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_NotEqual_NameName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, K2Node_CustomEvent_Loaded) == 0x000128, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, K2Node_CreateDelegate_OutputDelegate) == 0x000130, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000140, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000148, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000150, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_GetRecollectionAssetInfo_ReturnValue) == 0x000158, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_GetRecollectionAssetInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, K2Node_DynamicCast_AsLGallery_Actor) == 0x0001B0, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::K2Node_DynamicCast_AsLGallery_Actor' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, K2Node_DynamicCast_bSuccess) == 0x0001B8, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_IsValidSoftClassReference_ReturnValue) == 0x0001B9, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_IsValidSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x0001C0, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_Get_Camera_Pivot_Component_Component) == 0x0001C8, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_Get_Camera_Pivot_Component_Component' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x0001D0, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_CalcCamZByPivot_OutInterval) == 0x0001D4, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_CalcCamZByPivot_OutInterval' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_MakeVector_ReturnValue_1) == 0x0001D8, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, Temp_class_Variable) == 0x0001E8, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_K2_SetWorldLocation_SweepHitResult_1) == 0x0001F0, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_K2_SetWorldLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, K2Node_ClassDynamicCast_AsActor) == 0x000278, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::K2Node_ClassDynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, K2Node_ClassDynamicCast_bSuccess) == 0x000280, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000288, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP, CallFunc_FinishSpawningActor_ReturnValue) == 0x000290, "Member 'GallerySystemDataBP_C_ExecuteUbergraph_GallerySystemDataBP::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function GallerySystemDataBP.GallerySystemDataBP_C.Spawn
// 0x0028 (0x0028 - 0x0000)
struct GallerySystemDataBP_C_Spawn final
{
public:
	class FName                                   CodeName;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InLocation;                                        // 0x0008(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACineCameraActor*                       InPreviewCam;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InPreviewCam_OriginZ;                              // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GallerySystemDataBP_C_Spawn) == 0x000008, "Wrong alignment on GallerySystemDataBP_C_Spawn");
static_assert(sizeof(GallerySystemDataBP_C_Spawn) == 0x000028, "Wrong size on GallerySystemDataBP_C_Spawn");
static_assert(offsetof(GallerySystemDataBP_C_Spawn, CodeName) == 0x000000, "Member 'GallerySystemDataBP_C_Spawn::CodeName' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_Spawn, InLocation) == 0x000008, "Member 'GallerySystemDataBP_C_Spawn::InLocation' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_Spawn, InPreviewCam) == 0x000018, "Member 'GallerySystemDataBP_C_Spawn::InPreviewCam' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_Spawn, InPreviewCam_OriginZ) == 0x000020, "Member 'GallerySystemDataBP_C_Spawn::InPreviewCam_OriginZ' has a wrong offset!");

// Function GallerySystemDataBP.GallerySystemDataBP_C.OnLoaded_2FC58C774C8706F0E0E7C8A777D6A323
// 0x0008 (0x0008 - 0x0000)
struct GallerySystemDataBP_C_OnLoaded_2FC58C774C8706F0E0E7C8A777D6A323 final
{
public:
	TSubclassOf<class UObject>                    Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(GallerySystemDataBP_C_OnLoaded_2FC58C774C8706F0E0E7C8A777D6A323) == 0x000008, "Wrong alignment on GallerySystemDataBP_C_OnLoaded_2FC58C774C8706F0E0E7C8A777D6A323");
static_assert(sizeof(GallerySystemDataBP_C_OnLoaded_2FC58C774C8706F0E0E7C8A777D6A323) == 0x000008, "Wrong size on GallerySystemDataBP_C_OnLoaded_2FC58C774C8706F0E0E7C8A777D6A323");
static_assert(offsetof(GallerySystemDataBP_C_OnLoaded_2FC58C774C8706F0E0E7C8A777D6A323, Loaded) == 0x000000, "Member 'GallerySystemDataBP_C_OnLoaded_2FC58C774C8706F0E0E7C8A777D6A323::Loaded' has a wrong offset!");

// Function GallerySystemDataBP.GallerySystemDataBP_C.GetSpawned
// 0x0018 (0x0018 - 0x0000)
struct GallerySystemDataBP_C_GetSpawned final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALGalleryActor_C*                       K2Node_DynamicCast_AsLGallery_Actor;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GallerySystemDataBP_C_GetSpawned) == 0x000008, "Wrong alignment on GallerySystemDataBP_C_GetSpawned");
static_assert(sizeof(GallerySystemDataBP_C_GetSpawned) == 0x000018, "Wrong size on GallerySystemDataBP_C_GetSpawned");
static_assert(offsetof(GallerySystemDataBP_C_GetSpawned, ReturnValue) == 0x000000, "Member 'GallerySystemDataBP_C_GetSpawned::ReturnValue' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_GetSpawned, K2Node_DynamicCast_AsLGallery_Actor) == 0x000008, "Member 'GallerySystemDataBP_C_GetSpawned::K2Node_DynamicCast_AsLGallery_Actor' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_GetSpawned, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'GallerySystemDataBP_C_GetSpawned::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GallerySystemDataBP.GallerySystemDataBP_C.CalcCamZByPivot
// 0x0068 (0x0068 - 0x0000)
struct GallerySystemDataBP_C_CalcCamZByPivot final
{
public:
	class USceneComponent*                        InCam;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        InPivot;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutInterval;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegCos_ReturnValue;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegSin_ReturnValue;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GallerySystemDataBP_C_CalcCamZByPivot) == 0x000008, "Wrong alignment on GallerySystemDataBP_C_CalcCamZByPivot");
static_assert(sizeof(GallerySystemDataBP_C_CalcCamZByPivot) == 0x000068, "Wrong size on GallerySystemDataBP_C_CalcCamZByPivot");
static_assert(offsetof(GallerySystemDataBP_C_CalcCamZByPivot, InCam) == 0x000000, "Member 'GallerySystemDataBP_C_CalcCamZByPivot::InCam' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_CalcCamZByPivot, InPivot) == 0x000008, "Member 'GallerySystemDataBP_C_CalcCamZByPivot::InPivot' has a wrong offset!");
static_assert(offsetof(GallerySystemDataBP_C_CalcCamZByPivot, OutInterval) == 0x000010, "Member 'GallerySystemDataBP_C_CalcCamZByPivot::OutInterval' has a wrong offset!");
