#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ItemDropSystemDataBP

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ItemDropSystemDataBP.ItemDropSystemDataBP_C
// 0x0020 (0x0200 - 0x01E0)
class AItemDropSystemDataBP_C final : public ALItemDropSystemData
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x01E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   ErgoSpawnSocket;                                   // 0x01F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ErgoSpawnSocketDefault;                            // 0x01F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ItemDropSystemDataBP(int32 EntryPoint);
	void SpawnDropErgoData(const struct FLDropErgoData& DropErgoData);
	void SpawnDropErgoBP(struct FLDropErgoData& SpawnLocation, class ABP_Ergo_Trail_C** SpawnedErgo);
	void FIndErgoSocketLocation2(class ALCharacter* TargetCharacter, struct FVector* SpawnLocation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ItemDropSystemDataBP_C">();
	}
	static class AItemDropSystemDataBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AItemDropSystemDataBP_C>();
	}
};
static_assert(alignof(AItemDropSystemDataBP_C) == 0x000008, "Wrong alignment on AItemDropSystemDataBP_C");
static_assert(sizeof(AItemDropSystemDataBP_C) == 0x000200, "Wrong size on AItemDropSystemDataBP_C");
static_assert(offsetof(AItemDropSystemDataBP_C, UberGraphFrame) == 0x0001E0, "Member 'AItemDropSystemDataBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AItemDropSystemDataBP_C, DefaultSceneRoot) == 0x0001E8, "Member 'AItemDropSystemDataBP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AItemDropSystemDataBP_C, ErgoSpawnSocket) == 0x0001F0, "Member 'AItemDropSystemDataBP_C::ErgoSpawnSocket' has a wrong offset!");
static_assert(offsetof(AItemDropSystemDataBP_C, ErgoSpawnSocketDefault) == 0x0001F8, "Member 'AItemDropSystemDataBP_C::ErgoSpawnSocketDefault' has a wrong offset!");

}

