#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Krat_Tram_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Krat_Tram_BP.Krat_Tram_BP_C
// 0x0018 (0x01F8 - 0x01E0)
class AKrat_Tram_BP_C final : public AActor
{
public:
	class USpotLightComponent*                    Ew;                                                // 0x01E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Krat_Tram_rig;                                     // 0x01E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x01F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Krat_Tram_BP_C">();
	}
	static class AKrat_Tram_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AKrat_Tram_BP_C>();
	}
};
static_assert(alignof(AKrat_Tram_BP_C) == 0x000008, "Wrong alignment on AKrat_Tram_BP_C");
static_assert(sizeof(AKrat_Tram_BP_C) == 0x0001F8, "Wrong size on AKrat_Tram_BP_C");
static_assert(offsetof(AKrat_Tram_BP_C, Ew) == 0x0001E0, "Member 'AKrat_Tram_BP_C::Ew' has a wrong offset!");
static_assert(offsetof(AKrat_Tram_BP_C, Krat_Tram_rig) == 0x0001E8, "Member 'AKrat_Tram_BP_C::Krat_Tram_rig' has a wrong offset!");
static_assert(offsetof(AKrat_Tram_BP_C, DefaultSceneRoot) == 0x0001F0, "Member 'AKrat_Tram_BP_C::DefaultSceneRoot' has a wrong offset!");

}

