#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LAction_DebugHitTest

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function LAction_DebugHitTest.LAction_DebugHitTest_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct LAction_DebugHitTest_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LAction_DebugHitTest_C_OnStop) == 0x000008, "Wrong alignment on LAction_DebugHitTest_C_OnStop");
static_assert(sizeof(LAction_DebugHitTest_C_OnStop) == 0x000010, "Wrong size on LAction_DebugHitTest_C_OnStop");
static_assert(offsetof(LAction_DebugHitTest_C_OnStop, ReasonAction) == 0x000000, "Member 'LAction_DebugHitTest_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_OnStop, Reason) == 0x000008, "Member 'LAction_DebugHitTest_C_OnStop::Reason' has a wrong offset!");

// Function LAction_DebugHitTest.LAction_DebugHitTest_C.OnTick
// 0x0004 (0x0004 - 0x0000)
struct LAction_DebugHitTest_C_OnTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LAction_DebugHitTest_C_OnTick) == 0x000004, "Wrong alignment on LAction_DebugHitTest_C_OnTick");
static_assert(sizeof(LAction_DebugHitTest_C_OnTick) == 0x000004, "Wrong size on LAction_DebugHitTest_C_OnTick");
static_assert(offsetof(LAction_DebugHitTest_C_OnTick, DeltaTime) == 0x000000, "Member 'LAction_DebugHitTest_C_OnTick::DeltaTime' has a wrong offset!");

// Function LAction_DebugHitTest.LAction_DebugHitTest_C.ExecuteUbergraph_LAction_DebugHitTest
// 0x01B0 (0x01B0 - 0x0000)
struct LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalAnimationComponent*            CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0xF];                                       // 0x0021(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	class USceneComponent*                        CallFunc_GetAttachParent_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Stop_ReturnValue;                         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTime;                            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter_1;                 // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x0090(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         Temp_float_Variable_1;                             // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_123[0x1];                                      // 0x0123(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FPhysicalAnimationData                 K2Node_MakeStruct_PhysicalAnimationData;           // 0x0178(0x0024)(NoDestructor)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x019C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest) == 0x000010, "Wrong alignment on LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest");
static_assert(sizeof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest) == 0x0001B0, "Wrong size on LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, EntryPoint) == 0x000000, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::EntryPoint' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, Temp_float_Variable) == 0x000004, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, K2Node_DynamicCast_AsLCharacter) == 0x000008, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::K2Node_DynamicCast_AsLCharacter' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, CallFunc_GetRelativeTransform_ReturnValue) == 0x000030, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, CallFunc_GetAttachParent_ReturnValue) == 0x000060, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::CallFunc_GetAttachParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, CallFunc_Stop_ReturnValue) == 0x000068, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::CallFunc_Stop_ReturnValue' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, K2Node_Event_DeltaTime) == 0x00006C, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, K2Node_DynamicCast_AsLCharacter_1) == 0x000070, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::K2Node_DynamicCast_AsLCharacter_1' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, K2Node_Event_ReasonAction) == 0x000080, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, K2Node_Event_Reason) == 0x000088, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::K2Node_Event_Reason' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x000090, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, Temp_float_Variable_1) == 0x000118, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, CallFunc_Add_FloatFloat_ReturnValue) == 0x00011C, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000120, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, CallFunc_IsValid_ReturnValue_1) == 0x000121, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000122, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, Temp_float_Variable_2) == 0x000124, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, CallFunc_Conv_VectorToString_ReturnValue) == 0x000128, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::CallFunc_Conv_VectorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, CallFunc_Concat_StrStr_ReturnValue) == 0x000138, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, CallFunc_Conv_NameToString_ReturnValue) == 0x000148, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000158, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000168, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, K2Node_MakeStruct_PhysicalAnimationData) == 0x000178, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::K2Node_MakeStruct_PhysicalAnimationData' has a wrong offset!");
static_assert(offsetof(LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest, CallFunc_MakeLiteralName_ReturnValue) == 0x00019C, "Member 'LAction_DebugHitTest_C_ExecuteUbergraph_LAction_DebugHitTest::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");

}

