#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LAction_DebugHitTest

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass LAction_DebugHitTest.LAction_DebugHitTest_C
// 0x0078 (0x02D0 - 0x0258)
class ULAction_DebugHitTest_C final : public ULAction_LoopAnim
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FTransform                             Cached_PreTransform;                               // 0x0260(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         Lifetime;                                          // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        Cached_AttachParent;                               // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TargetBone;                                        // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impulse;                                           // 0x02A8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Interupted;                                        // 0x02B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InteruptStart;                                     // 0x02B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B6[0x2];                                      // 0x02B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ImpulsePos;                                        // 0x02B8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnStart();
	void OnStop(class ULActBase* ReasonAction, class FName Reason);
	void OnTick(float DeltaTime);
	void OnReset();
	void ExecuteUbergraph_LAction_DebugHitTest(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LAction_DebugHitTest_C">();
	}
	static class ULAction_DebugHitTest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULAction_DebugHitTest_C>();
	}
};
static_assert(alignof(ULAction_DebugHitTest_C) == 0x000010, "Wrong alignment on ULAction_DebugHitTest_C");
static_assert(sizeof(ULAction_DebugHitTest_C) == 0x0002D0, "Wrong size on ULAction_DebugHitTest_C");
static_assert(offsetof(ULAction_DebugHitTest_C, UberGraphFrame) == 0x000258, "Member 'ULAction_DebugHitTest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULAction_DebugHitTest_C, Cached_PreTransform) == 0x000260, "Member 'ULAction_DebugHitTest_C::Cached_PreTransform' has a wrong offset!");
static_assert(offsetof(ULAction_DebugHitTest_C, Lifetime) == 0x000290, "Member 'ULAction_DebugHitTest_C::Lifetime' has a wrong offset!");
static_assert(offsetof(ULAction_DebugHitTest_C, Cached_AttachParent) == 0x000298, "Member 'ULAction_DebugHitTest_C::Cached_AttachParent' has a wrong offset!");
static_assert(offsetof(ULAction_DebugHitTest_C, TargetBone) == 0x0002A0, "Member 'ULAction_DebugHitTest_C::TargetBone' has a wrong offset!");
static_assert(offsetof(ULAction_DebugHitTest_C, Impulse) == 0x0002A8, "Member 'ULAction_DebugHitTest_C::Impulse' has a wrong offset!");
static_assert(offsetof(ULAction_DebugHitTest_C, Interupted) == 0x0002B4, "Member 'ULAction_DebugHitTest_C::Interupted' has a wrong offset!");
static_assert(offsetof(ULAction_DebugHitTest_C, InteruptStart) == 0x0002B5, "Member 'ULAction_DebugHitTest_C::InteruptStart' has a wrong offset!");
static_assert(offsetof(ULAction_DebugHitTest_C, ImpulsePos) == 0x0002B8, "Member 'ULAction_DebugHitTest_C::ImpulsePos' has a wrong offset!");
static_assert(offsetof(ULAction_DebugHitTest_C, Radius) == 0x0002C4, "Member 'ULAction_DebugHitTest_C::Radius' has a wrong offset!");

}

