#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LAction_Disable_PerfectGuard

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function LAction_Disable_PerfectGuard.LAction_Disable_PerfectGuard_C.ExecuteUbergraph_LAction_Disable_PerfectGuard
// 0x0060 (0x0060 - 0x0000)
struct LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ULActMgrComponent* ActMgrComponent, class AActor* TargetActor, class FName Command, const struct FVector& Lever, bool SkipCommandPrerequisitiesCheck)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   CallFunc_ActionState_LockPerfectGuard_ReturnValue; // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_Stance_Perfect_Guard_ReturnValue; // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActMgrComponent*                      K2Node_CustomEvent_ActMgrComponent;                // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_TargetActor;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Command;                        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Lever;                          // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_SkipCommandPrerequisitiesCheck; // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActBase*                              K2Node_Event_ReasonAction;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Reason;                               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard) == 0x000008, "Wrong alignment on LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard");
static_assert(sizeof(LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard) == 0x000060, "Wrong size on LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard");
static_assert(offsetof(LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard, EntryPoint) == 0x000000, "Member 'LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard::EntryPoint' has a wrong offset!");
static_assert(offsetof(LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard, CallFunc_ActionState_LockPerfectGuard_ReturnValue) == 0x000014, "Member 'LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard::CallFunc_ActionState_LockPerfectGuard_ReturnValue' has a wrong offset!");
static_assert(offsetof(LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard, CallFunc_ActionState_Stance_Perfect_Guard_ReturnValue) == 0x00001C, "Member 'LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard::CallFunc_ActionState_Stance_Perfect_Guard_ReturnValue' has a wrong offset!");
static_assert(offsetof(LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard, K2Node_CustomEvent_ActMgrComponent) == 0x000028, "Member 'LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard::K2Node_CustomEvent_ActMgrComponent' has a wrong offset!");
static_assert(offsetof(LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard, K2Node_CustomEvent_TargetActor) == 0x000030, "Member 'LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard::K2Node_CustomEvent_TargetActor' has a wrong offset!");
static_assert(offsetof(LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard, K2Node_CustomEvent_Command) == 0x000038, "Member 'LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard::K2Node_CustomEvent_Command' has a wrong offset!");
static_assert(offsetof(LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard, K2Node_CustomEvent_Lever) == 0x000040, "Member 'LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard::K2Node_CustomEvent_Lever' has a wrong offset!");
static_assert(offsetof(LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard, K2Node_CustomEvent_SkipCommandPrerequisitiesCheck) == 0x00004C, "Member 'LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard::K2Node_CustomEvent_SkipCommandPrerequisitiesCheck' has a wrong offset!");
static_assert(offsetof(LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard, K2Node_SwitchName_CmpSuccess) == 0x00004D, "Member 'LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard, K2Node_Event_ReasonAction) == 0x000050, "Member 'LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard::K2Node_Event_ReasonAction' has a wrong offset!");
static_assert(offsetof(LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard, K2Node_Event_Reason) == 0x000058, "Member 'LAction_Disable_PerfectGuard_C_ExecuteUbergraph_LAction_Disable_PerfectGuard::K2Node_Event_Reason' has a wrong offset!");

// Function LAction_Disable_PerfectGuard.LAction_Disable_PerfectGuard_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct LAction_Disable_PerfectGuard_C_OnStop final
{
public:
	class ULActBase*                              ReasonAction;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Reason;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LAction_Disable_PerfectGuard_C_OnStop) == 0x000008, "Wrong alignment on LAction_Disable_PerfectGuard_C_OnStop");
static_assert(sizeof(LAction_Disable_PerfectGuard_C_OnStop) == 0x000010, "Wrong size on LAction_Disable_PerfectGuard_C_OnStop");
static_assert(offsetof(LAction_Disable_PerfectGuard_C_OnStop, ReasonAction) == 0x000000, "Member 'LAction_Disable_PerfectGuard_C_OnStop::ReasonAction' has a wrong offset!");
static_assert(offsetof(LAction_Disable_PerfectGuard_C_OnStop, Reason) == 0x000008, "Member 'LAction_Disable_PerfectGuard_C_OnStop::Reason' has a wrong offset!");

// Function LAction_Disable_PerfectGuard.LAction_Disable_PerfectGuard_C.OnCommandOccurred_Event
// 0x0028 (0x0028 - 0x0000)
struct LAction_Disable_PerfectGuard_C_OnCommandOccurred_Event final
{
public:
	class ULActMgrComponent*                      ActMgrComponent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Command;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Lever;                                             // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipCommandPrerequisitiesCheck;                    // 0x0024(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LAction_Disable_PerfectGuard_C_OnCommandOccurred_Event) == 0x000008, "Wrong alignment on LAction_Disable_PerfectGuard_C_OnCommandOccurred_Event");
static_assert(sizeof(LAction_Disable_PerfectGuard_C_OnCommandOccurred_Event) == 0x000028, "Wrong size on LAction_Disable_PerfectGuard_C_OnCommandOccurred_Event");
static_assert(offsetof(LAction_Disable_PerfectGuard_C_OnCommandOccurred_Event, ActMgrComponent) == 0x000000, "Member 'LAction_Disable_PerfectGuard_C_OnCommandOccurred_Event::ActMgrComponent' has a wrong offset!");
static_assert(offsetof(LAction_Disable_PerfectGuard_C_OnCommandOccurred_Event, TargetActor) == 0x000008, "Member 'LAction_Disable_PerfectGuard_C_OnCommandOccurred_Event::TargetActor' has a wrong offset!");
static_assert(offsetof(LAction_Disable_PerfectGuard_C_OnCommandOccurred_Event, Command) == 0x000010, "Member 'LAction_Disable_PerfectGuard_C_OnCommandOccurred_Event::Command' has a wrong offset!");
static_assert(offsetof(LAction_Disable_PerfectGuard_C_OnCommandOccurred_Event, Lever) == 0x000018, "Member 'LAction_Disable_PerfectGuard_C_OnCommandOccurred_Event::Lever' has a wrong offset!");
static_assert(offsetof(LAction_Disable_PerfectGuard_C_OnCommandOccurred_Event, SkipCommandPrerequisitiesCheck) == 0x000024, "Member 'LAction_Disable_PerfectGuard_C_OnCommandOccurred_Event::SkipCommandPrerequisitiesCheck' has a wrong offset!");

}

