#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LBodyStainComponentBP

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass LBodyStainComponentBP.LBodyStainComponentBP_C
// 0x0030 (0x0188 - 0x0158)
class ULBodyStainComponentBP_C final : public ULBodyStainComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0158(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         ApplyTime;                                         // 0x0160(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainTime;                                        // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CheckTime;                                         // 0x0168(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CachedSoakHeight;                                  // 0x016C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HeightMultiplier;                                  // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHairSoaked;                                      // 0x0174(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ALCharacter*                            OwnerCharacter;                                    // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bChangeLegColor;                                   // 0x0180(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_LBodyStainComponentBP(int32 EntryPoint);
	void PlayStain_Abnormal(class FName EventName);
	void PlayStain_Wet_Leg(ELPhysicalSurfaceType SurfaceType);
	void PlayStain_Wet_Body(ELPhysicalSurfaceType PhysicalSurface, float InAmount, bool IsWaterDrop);
	void PlayStain_Blood(ELBloodEffectType BloodType, int32 InBloodLevel, float ApplyTime_0);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LBodyStainComponentBP_C">();
	}
	static class ULBodyStainComponentBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULBodyStainComponentBP_C>();
	}
};
static_assert(alignof(ULBodyStainComponentBP_C) == 0x000008, "Wrong alignment on ULBodyStainComponentBP_C");
static_assert(sizeof(ULBodyStainComponentBP_C) == 0x000188, "Wrong size on ULBodyStainComponentBP_C");
static_assert(offsetof(ULBodyStainComponentBP_C, UberGraphFrame) == 0x000158, "Member 'ULBodyStainComponentBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULBodyStainComponentBP_C, ApplyTime) == 0x000160, "Member 'ULBodyStainComponentBP_C::ApplyTime' has a wrong offset!");
static_assert(offsetof(ULBodyStainComponentBP_C, RemainTime) == 0x000164, "Member 'ULBodyStainComponentBP_C::RemainTime' has a wrong offset!");
static_assert(offsetof(ULBodyStainComponentBP_C, CheckTime) == 0x000168, "Member 'ULBodyStainComponentBP_C::CheckTime' has a wrong offset!");
static_assert(offsetof(ULBodyStainComponentBP_C, CachedSoakHeight) == 0x00016C, "Member 'ULBodyStainComponentBP_C::CachedSoakHeight' has a wrong offset!");
static_assert(offsetof(ULBodyStainComponentBP_C, HeightMultiplier) == 0x000170, "Member 'ULBodyStainComponentBP_C::HeightMultiplier' has a wrong offset!");
static_assert(offsetof(ULBodyStainComponentBP_C, IsHairSoaked) == 0x000174, "Member 'ULBodyStainComponentBP_C::IsHairSoaked' has a wrong offset!");
static_assert(offsetof(ULBodyStainComponentBP_C, OwnerCharacter) == 0x000178, "Member 'ULBodyStainComponentBP_C::OwnerCharacter' has a wrong offset!");
static_assert(offsetof(ULBodyStainComponentBP_C, bChangeLegColor) == 0x000180, "Member 'ULBodyStainComponentBP_C::bChangeLegColor' has a wrong offset!");

}

