#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LCameraManagerBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function LCameraManagerBP.LCameraManagerBP_C.ExecuteUbergraph_LCameraManagerBP
// 0x0060 (0x0060 - 0x0000)
struct LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CH_PC_Pino_C*                       K2Node_DynamicCast_AsBP_CH_PC_Pino;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP) == 0x000008, "Wrong alignment on LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP");
static_assert(sizeof(LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP) == 0x000060, "Wrong size on LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP");
static_assert(offsetof(LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP, EntryPoint) == 0x000000, "Member 'LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000010, "Member 'LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP, K2Node_DynamicCast_AsBP_CH_PC_Pino) == 0x000018, "Member 'LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP::K2Node_DynamicCast_AsBP_CH_PC_Pino' has a wrong offset!");
static_assert(offsetof(LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP, CallFunc_GetMovementComponent_ReturnValue) == 0x000028, "Member 'LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP, CallFunc_GetCameraRotation_ReturnValue) == 0x000030, "Member 'LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP, CallFunc_GetForwardVector_ReturnValue) == 0x00003C, "Member 'LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP, CallFunc_Dot_VectorVector_ReturnValue) == 0x000048, "Member 'LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00004C, "Member 'LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000050, "Member 'LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP, CallFunc_Less_FloatFloat_ReturnValue) == 0x000051, "Member 'LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000052, "Member 'LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP, CallFunc_Less_FloatFloat_ReturnValue_2) == 0x000053, "Member 'LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP::CallFunc_Less_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000054, "Member 'LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000058, "Member 'LCameraManagerBP_C_ExecuteUbergraph_LCameraManagerBP::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");

// Function LCameraManagerBP.LCameraManagerBP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct LCameraManagerBP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LCameraManagerBP_C_ReceiveTick) == 0x000004, "Wrong alignment on LCameraManagerBP_C_ReceiveTick");
static_assert(sizeof(LCameraManagerBP_C_ReceiveTick) == 0x000004, "Wrong size on LCameraManagerBP_C_ReceiveTick");
static_assert(offsetof(LCameraManagerBP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'LCameraManagerBP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function LCameraManagerBP.LCameraManagerBP_C.SpawnCameraWorkByName
// 0x0090 (0x0090 - 0x0000)
struct LCameraManagerBP_C_SpawnCameraWorkByName final
{
public:
	class FName                                   CameraWorkName;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALCameraWork*                           CameraWork;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Map_Find_Value;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALCameraWork*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LCameraManagerBP_C_SpawnCameraWorkByName) == 0x000010, "Wrong alignment on LCameraManagerBP_C_SpawnCameraWorkByName");
static_assert(sizeof(LCameraManagerBP_C_SpawnCameraWorkByName) == 0x000090, "Wrong size on LCameraManagerBP_C_SpawnCameraWorkByName");
static_assert(offsetof(LCameraManagerBP_C_SpawnCameraWorkByName, CameraWorkName) == 0x000000, "Member 'LCameraManagerBP_C_SpawnCameraWorkByName::CameraWorkName' has a wrong offset!");
static_assert(offsetof(LCameraManagerBP_C_SpawnCameraWorkByName, CameraWork) == 0x000008, "Member 'LCameraManagerBP_C_SpawnCameraWorkByName::CameraWork' has a wrong offset!");
static_assert(offsetof(LCameraManagerBP_C_SpawnCameraWorkByName, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'LCameraManagerBP_C_SpawnCameraWorkByName::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(LCameraManagerBP_C_SpawnCameraWorkByName, CallFunc_Conv_NameToString_ReturnValue) == 0x000040, "Member 'LCameraManagerBP_C_SpawnCameraWorkByName::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(LCameraManagerBP_C_SpawnCameraWorkByName, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'LCameraManagerBP_C_SpawnCameraWorkByName::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(LCameraManagerBP_C_SpawnCameraWorkByName, CallFunc_Map_Find_Value) == 0x000060, "Member 'LCameraManagerBP_C_SpawnCameraWorkByName::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(LCameraManagerBP_C_SpawnCameraWorkByName, CallFunc_Map_Find_ReturnValue) == 0x000068, "Member 'LCameraManagerBP_C_SpawnCameraWorkByName::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(LCameraManagerBP_C_SpawnCameraWorkByName, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'LCameraManagerBP_C_SpawnCameraWorkByName::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(LCameraManagerBP_C_SpawnCameraWorkByName, CallFunc_FinishSpawningActor_ReturnValue) == 0x000078, "Member 'LCameraManagerBP_C_SpawnCameraWorkByName::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(LCameraManagerBP_C_SpawnCameraWorkByName, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'LCameraManagerBP_C_SpawnCameraWorkByName::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function LCameraManagerBP.LCameraManagerBP_C.DestoryCameraWork
// 0x0010 (0x0010 - 0x0000)
struct LCameraManagerBP_C_DestoryCameraWork final
{
public:
	class ALCameraWork*                           CameraWork;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LCameraManagerBP_C_DestoryCameraWork) == 0x000008, "Wrong alignment on LCameraManagerBP_C_DestoryCameraWork");
static_assert(sizeof(LCameraManagerBP_C_DestoryCameraWork) == 0x000010, "Wrong size on LCameraManagerBP_C_DestoryCameraWork");
static_assert(offsetof(LCameraManagerBP_C_DestoryCameraWork, CameraWork) == 0x000000, "Member 'LCameraManagerBP_C_DestoryCameraWork::CameraWork' has a wrong offset!");
static_assert(offsetof(LCameraManagerBP_C_DestoryCameraWork, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'LCameraManagerBP_C_DestoryCameraWork::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

