#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LGalleryActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LGalleryActor.LGalleryActor_C
// 0x0020 (0x0200 - 0x01E0)
class ALGalleryActor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x01E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         CameraMoveWidth;                                   // 0x01F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraMoveHeight;                                  // 0x01F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ActorController_C*                OwnerController;                                   // 0x01F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LGalleryActor(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Get_Camera_Pivot_Component(bool ForPreviewCam, class USceneComponent** Component);
	void GetGalleryMeshComponent(class UMeshComponent** GalleryMesh);
	void SetCameraMoveMaxInfo(float MaxWidth, float MaxHeight);

	void Get_Zoom_in_Out_Limit_Value(float* OutMin, float* OutMax) const;
	void Get_Zoom_Speed(float* OutSpeed) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LGalleryActor_C">();
	}
	static class ALGalleryActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALGalleryActor_C>();
	}
};
static_assert(alignof(ALGalleryActor_C) == 0x000008, "Wrong alignment on ALGalleryActor_C");
static_assert(sizeof(ALGalleryActor_C) == 0x000200, "Wrong size on ALGalleryActor_C");
static_assert(offsetof(ALGalleryActor_C, UberGraphFrame) == 0x0001E0, "Member 'ALGalleryActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALGalleryActor_C, DefaultSceneRoot) == 0x0001E8, "Member 'ALGalleryActor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ALGalleryActor_C, CameraMoveWidth) == 0x0001F0, "Member 'ALGalleryActor_C::CameraMoveWidth' has a wrong offset!");
static_assert(offsetof(ALGalleryActor_C, CameraMoveHeight) == 0x0001F4, "Member 'ALGalleryActor_C::CameraMoveHeight' has a wrong offset!");
static_assert(offsetof(ALGalleryActor_C, OwnerController) == 0x0001F8, "Member 'ALGalleryActor_C::OwnerController' has a wrong offset!");

}

