#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LNPCControllerBP

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"


namespace SDK::Params
{

// Function LNPCControllerBP.LNPCControllerBP_C.ExecuteUbergraph_LNPCControllerBP
// 0x0018 (0x0018 - 0x0000)
struct LNPCControllerBP_C_ExecuteUbergraph_LNPCControllerBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBehaviorTree*                          K2Node_Event_CustomBehaviroTree;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LNPCControllerBP_C_ExecuteUbergraph_LNPCControllerBP) == 0x000008, "Wrong alignment on LNPCControllerBP_C_ExecuteUbergraph_LNPCControllerBP");
static_assert(sizeof(LNPCControllerBP_C_ExecuteUbergraph_LNPCControllerBP) == 0x000018, "Wrong size on LNPCControllerBP_C_ExecuteUbergraph_LNPCControllerBP");
static_assert(offsetof(LNPCControllerBP_C_ExecuteUbergraph_LNPCControllerBP, EntryPoint) == 0x000000, "Member 'LNPCControllerBP_C_ExecuteUbergraph_LNPCControllerBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(LNPCControllerBP_C_ExecuteUbergraph_LNPCControllerBP, K2Node_Event_CustomBehaviroTree) == 0x000008, "Member 'LNPCControllerBP_C_ExecuteUbergraph_LNPCControllerBP::K2Node_Event_CustomBehaviroTree' has a wrong offset!");
static_assert(offsetof(LNPCControllerBP_C_ExecuteUbergraph_LNPCControllerBP, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'LNPCControllerBP_C_ExecuteUbergraph_LNPCControllerBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function LNPCControllerBP.LNPCControllerBP_C.RunInitBehaviorTree
// 0x0008 (0x0008 - 0x0000)
struct LNPCControllerBP_C_RunInitBehaviorTree final
{
public:
	class UBehaviorTree*                          CustomBehaviroTree;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LNPCControllerBP_C_RunInitBehaviorTree) == 0x000008, "Wrong alignment on LNPCControllerBP_C_RunInitBehaviorTree");
static_assert(sizeof(LNPCControllerBP_C_RunInitBehaviorTree) == 0x000008, "Wrong size on LNPCControllerBP_C_RunInitBehaviorTree");
static_assert(offsetof(LNPCControllerBP_C_RunInitBehaviorTree, CustomBehaviroTree) == 0x000000, "Member 'LNPCControllerBP_C_RunInitBehaviorTree::CustomBehaviroTree' has a wrong offset!");

// Function LNPCControllerBP.LNPCControllerBP_C.OnMovementNavigationQueryFilter
// 0x0010 (0x0010 - 0x0000)
struct LNPCControllerBP_C_OnMovementNavigationQueryFilter final
{
public:
	TSubclassOf<class UNavigationQueryFilter>     FilterClass;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	ENPCGradeType                                 CallFunc_GetGrade_ReturnValue;                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LNPCControllerBP_C_OnMovementNavigationQueryFilter) == 0x000008, "Wrong alignment on LNPCControllerBP_C_OnMovementNavigationQueryFilter");
static_assert(sizeof(LNPCControllerBP_C_OnMovementNavigationQueryFilter) == 0x000010, "Wrong size on LNPCControllerBP_C_OnMovementNavigationQueryFilter");
static_assert(offsetof(LNPCControllerBP_C_OnMovementNavigationQueryFilter, FilterClass) == 0x000000, "Member 'LNPCControllerBP_C_OnMovementNavigationQueryFilter::FilterClass' has a wrong offset!");
static_assert(offsetof(LNPCControllerBP_C_OnMovementNavigationQueryFilter, CallFunc_GetGrade_ReturnValue) == 0x000008, "Member 'LNPCControllerBP_C_OnMovementNavigationQueryFilter::CallFunc_GetGrade_ReturnValue' has a wrong offset!");
static_assert(offsetof(LNPCControllerBP_C_OnMovementNavigationQueryFilter, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000009, "Member 'LNPCControllerBP_C_OnMovementNavigationQueryFilter::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

}

