#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LNPCActMgrComponentBP

#include "Basic.hpp"


namespace SDK::Params
{

// Function LNPCActMgrComponentBP.LNPCActMgrComponentBP_C.ExecuteUbergraph_LNPCActMgrComponentBP
// 0x0030 (0x0030 - 0x0000)
struct LNPCActMgrComponentBP_C_ExecuteUbergraph_LNPCActMgrComponentBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_ConsumeMovement_ReturnValue;  // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ActionState_ConsumeRotation_ReturnValue;  // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AddActionState_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AddActionState_ReturnValue_1;             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_LNPCCharacterBP_NoneMove_Base_C*    K2Node_DynamicCast_AsBP_LNPCCharacter_BP_None_Move_Base; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LNPCActMgrComponentBP_C_ExecuteUbergraph_LNPCActMgrComponentBP) == 0x000008, "Wrong alignment on LNPCActMgrComponentBP_C_ExecuteUbergraph_LNPCActMgrComponentBP");
static_assert(sizeof(LNPCActMgrComponentBP_C_ExecuteUbergraph_LNPCActMgrComponentBP) == 0x000030, "Wrong size on LNPCActMgrComponentBP_C_ExecuteUbergraph_LNPCActMgrComponentBP");
static_assert(offsetof(LNPCActMgrComponentBP_C_ExecuteUbergraph_LNPCActMgrComponentBP, EntryPoint) == 0x000000, "Member 'LNPCActMgrComponentBP_C_ExecuteUbergraph_LNPCActMgrComponentBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(LNPCActMgrComponentBP_C_ExecuteUbergraph_LNPCActMgrComponentBP, CallFunc_ActionState_ConsumeMovement_ReturnValue) == 0x000004, "Member 'LNPCActMgrComponentBP_C_ExecuteUbergraph_LNPCActMgrComponentBP::CallFunc_ActionState_ConsumeMovement_ReturnValue' has a wrong offset!");
static_assert(offsetof(LNPCActMgrComponentBP_C_ExecuteUbergraph_LNPCActMgrComponentBP, CallFunc_ActionState_ConsumeRotation_ReturnValue) == 0x00000C, "Member 'LNPCActMgrComponentBP_C_ExecuteUbergraph_LNPCActMgrComponentBP::CallFunc_ActionState_ConsumeRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LNPCActMgrComponentBP_C_ExecuteUbergraph_LNPCActMgrComponentBP, CallFunc_AddActionState_ReturnValue) == 0x000014, "Member 'LNPCActMgrComponentBP_C_ExecuteUbergraph_LNPCActMgrComponentBP::CallFunc_AddActionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(LNPCActMgrComponentBP_C_ExecuteUbergraph_LNPCActMgrComponentBP, CallFunc_AddActionState_ReturnValue_1) == 0x000015, "Member 'LNPCActMgrComponentBP_C_ExecuteUbergraph_LNPCActMgrComponentBP::CallFunc_AddActionState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LNPCActMgrComponentBP_C_ExecuteUbergraph_LNPCActMgrComponentBP, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'LNPCActMgrComponentBP_C_ExecuteUbergraph_LNPCActMgrComponentBP::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(LNPCActMgrComponentBP_C_ExecuteUbergraph_LNPCActMgrComponentBP, K2Node_DynamicCast_AsBP_LNPCCharacter_BP_None_Move_Base) == 0x000020, "Member 'LNPCActMgrComponentBP_C_ExecuteUbergraph_LNPCActMgrComponentBP::K2Node_DynamicCast_AsBP_LNPCCharacter_BP_None_Move_Base' has a wrong offset!");
static_assert(offsetof(LNPCActMgrComponentBP_C_ExecuteUbergraph_LNPCActMgrComponentBP, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'LNPCActMgrComponentBP_C_ExecuteUbergraph_LNPCActMgrComponentBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LNPCActMgrComponentBP_C_ExecuteUbergraph_LNPCActMgrComponentBP, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'LNPCActMgrComponentBP_C_ExecuteUbergraph_LNPCActMgrComponentBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

