#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LOPARTnMusicPlugin

#include "Basic.hpp"


namespace SDK::Params
{

// Function LOPARTnMusicPlugin.LOPARTnMusicPluginBPLibrary.GetPlayerNickName
// 0x0010 (0x0010 - 0x0000)
struct LOPARTnMusicPluginBPLibrary_GetPlayerNickName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LOPARTnMusicPluginBPLibrary_GetPlayerNickName) == 0x000008, "Wrong alignment on LOPARTnMusicPluginBPLibrary_GetPlayerNickName");
static_assert(sizeof(LOPARTnMusicPluginBPLibrary_GetPlayerNickName) == 0x000010, "Wrong size on LOPARTnMusicPluginBPLibrary_GetPlayerNickName");
static_assert(offsetof(LOPARTnMusicPluginBPLibrary_GetPlayerNickName, ReturnValue) == 0x000000, "Member 'LOPARTnMusicPluginBPLibrary_GetPlayerNickName::ReturnValue' has a wrong offset!");

// Function LOPARTnMusicPlugin.LOPARTnMusicPluginBPLibrary.IsRightAcceptButton
// 0x0001 (0x0001 - 0x0000)
struct LOPARTnMusicPluginBPLibrary_IsRightAcceptButton final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LOPARTnMusicPluginBPLibrary_IsRightAcceptButton) == 0x000001, "Wrong alignment on LOPARTnMusicPluginBPLibrary_IsRightAcceptButton");
static_assert(sizeof(LOPARTnMusicPluginBPLibrary_IsRightAcceptButton) == 0x000001, "Wrong size on LOPARTnMusicPluginBPLibrary_IsRightAcceptButton");
static_assert(offsetof(LOPARTnMusicPluginBPLibrary_IsRightAcceptButton, ReturnValue) == 0x000000, "Member 'LOPARTnMusicPluginBPLibrary_IsRightAcceptButton::ReturnValue' has a wrong offset!");

// Function LOPARTnMusicPlugin.LOPARTnMusicPluginBPLibrary.LOPARTnMusicPluginSampleFunction
// 0x0008 (0x0008 - 0x0000)
struct LOPARTnMusicPluginBPLibrary_LOPARTnMusicPluginSampleFunction final
{
public:
	float                                         Param;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LOPARTnMusicPluginBPLibrary_LOPARTnMusicPluginSampleFunction) == 0x000004, "Wrong alignment on LOPARTnMusicPluginBPLibrary_LOPARTnMusicPluginSampleFunction");
static_assert(sizeof(LOPARTnMusicPluginBPLibrary_LOPARTnMusicPluginSampleFunction) == 0x000008, "Wrong size on LOPARTnMusicPluginBPLibrary_LOPARTnMusicPluginSampleFunction");
static_assert(offsetof(LOPARTnMusicPluginBPLibrary_LOPARTnMusicPluginSampleFunction, Param) == 0x000000, "Member 'LOPARTnMusicPluginBPLibrary_LOPARTnMusicPluginSampleFunction::Param' has a wrong offset!");
static_assert(offsetof(LOPARTnMusicPluginBPLibrary_LOPARTnMusicPluginSampleFunction, ReturnValue) == 0x000004, "Member 'LOPARTnMusicPluginBPLibrary_LOPARTnMusicPluginSampleFunction::ReturnValue' has a wrong offset!");

}

