#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LPCAnimationBP_StatRoom2

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function LPCAnimationBP_StatRoom2.LPCAnimationBP_StatRoom2_C.ExecuteUbergraph_LPCAnimationBP_StatRoom2
// 0x0080 (0x0080 - 0x0000)
struct LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacterBP_StatRoom_C*             K2Node_DynamicCast_AsLPCCharacter_BP_Stat_Room;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULSlaveArmInfo*                         CallFunc_GetSlaveArmInfo_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_GetActMgrComponentBP_Branches;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActMgrComponent*                      CallFunc_GetActMgrComponentBP_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EExecutePin                                   CallFunc_GetSlaveArmActionForVisualActionBP_Branches; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULAction_SlaveArmVisual*                CallFunc_GetSlaveArmActionForVisualActionBP_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      CallFunc_GetSlaveArmAdditiveAnim_ReturnValue;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSlaveArmAdditiveAlpha_ReturnValue;     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2) == 0x000008, "Wrong alignment on LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2");
static_assert(sizeof(LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2) == 0x000080, "Wrong size on LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2");
static_assert(offsetof(LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2, EntryPoint) == 0x000000, "Member 'LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2::EntryPoint' has a wrong offset!");
static_assert(offsetof(LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2, K2Node_Event_DeltaTimeX) == 0x000008, "Member 'LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000010, "Member 'LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2, K2Node_DynamicCast_AsLPCCharacter_BP_Stat_Room) == 0x000018, "Member 'LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2::K2Node_DynamicCast_AsLPCCharacter_BP_Stat_Room' has a wrong offset!");
static_assert(offsetof(LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2, CallFunc_GetSlaveArmInfo_ReturnValue) == 0x000028, "Member 'LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2::CallFunc_GetSlaveArmInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2, K2Node_SwitchEnum_CmpSuccess) == 0x000030, "Member 'LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2, CallFunc_IsValid_ReturnValue_1) == 0x000031, "Member 'LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2, K2Node_SwitchName_CmpSuccess) == 0x000032, "Member 'LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000038, "Member 'LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2, CallFunc_GetActMgrComponentBP_Branches) == 0x000040, "Member 'LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2::CallFunc_GetActMgrComponentBP_Branches' has a wrong offset!");
static_assert(offsetof(LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2, CallFunc_GetActMgrComponentBP_ReturnValue) == 0x000048, "Member 'LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2::CallFunc_GetActMgrComponentBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2, CallFunc_GetSlaveArmActionForVisualActionBP_Branches) == 0x000050, "Member 'LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2::CallFunc_GetSlaveArmActionForVisualActionBP_Branches' has a wrong offset!");
static_assert(offsetof(LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2, CallFunc_GetSlaveArmActionForVisualActionBP_ReturnValue) == 0x000058, "Member 'LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2::CallFunc_GetSlaveArmActionForVisualActionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000060, "Member 'LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2, CallFunc_GetSlaveArmAdditiveAnim_ReturnValue) == 0x000068, "Member 'LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2::CallFunc_GetSlaveArmAdditiveAnim_ReturnValue' has a wrong offset!");
static_assert(offsetof(LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2, CallFunc_GetSlaveArmAdditiveAlpha_ReturnValue) == 0x000070, "Member 'LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2::CallFunc_GetSlaveArmAdditiveAlpha_ReturnValue' has a wrong offset!");
static_assert(offsetof(LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2, K2Node_SwitchEnum_CmpSuccess_1) == 0x000074, "Member 'LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2, K2Node_SwitchEnum_CmpSuccess_2) == 0x000075, "Member 'LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000078, "Member 'LPCAnimationBP_StatRoom2_C_ExecuteUbergraph_LPCAnimationBP_StatRoom2::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");

// Function LPCAnimationBP_StatRoom2.LPCAnimationBP_StatRoom2_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct LPCAnimationBP_StatRoom2_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LPCAnimationBP_StatRoom2_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on LPCAnimationBP_StatRoom2_C_BlueprintUpdateAnimation");
static_assert(sizeof(LPCAnimationBP_StatRoom2_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on LPCAnimationBP_StatRoom2_C_BlueprintUpdateAnimation");
static_assert(offsetof(LPCAnimationBP_StatRoom2_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'LPCAnimationBP_StatRoom2_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function LPCAnimationBP_StatRoom2.LPCAnimationBP_StatRoom2_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct LPCAnimationBP_StatRoom2_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(LPCAnimationBP_StatRoom2_C_AnimGraph) == 0x000008, "Wrong alignment on LPCAnimationBP_StatRoom2_C_AnimGraph");
static_assert(sizeof(LPCAnimationBP_StatRoom2_C_AnimGraph) == 0x000010, "Wrong size on LPCAnimationBP_StatRoom2_C_AnimGraph");
static_assert(offsetof(LPCAnimationBP_StatRoom2_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'LPCAnimationBP_StatRoom2_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

