#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LPCCharacterBP_StatRoom

#include "Basic.hpp"


namespace SDK::Params
{

// Function LPCCharacterBP_StatRoom.LPCCharacterBP_StatRoom_C.ExecuteUbergraph_LPCCharacterBP_StatRoom
// 0x0088 (0x0088 - 0x0000)
struct LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CH_PC_Pino_C*                       K2Node_DynamicCast_AsBP_CH_PC_Pino;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Active;                               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULActionSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnApplyNeedShrink_ReturnValue;            // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPCAnimationBP_StatRoom2_C*            K2Node_DynamicCast_AsLPCAnimation_BP_Stat_Room_2;  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraComponent*                       CallFunc_GetComponentByClass_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CH_PC_Pino_C*                       K2Node_DynamicCast_AsBP_CH_PC_Pino_1;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEyeColorChanged_ReturnValue;            // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom) == 0x000008, "Wrong alignment on LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom");
static_assert(sizeof(LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom) == 0x000088, "Wrong size on LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom, EntryPoint) == 0x000000, "Member 'LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom::EntryPoint' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000010, "Member 'LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom, K2Node_DynamicCast_AsBP_CH_PC_Pino) == 0x000018, "Member 'LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom::K2Node_DynamicCast_AsBP_CH_PC_Pino' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom, K2Node_Event_Active) == 0x000021, "Member 'LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom::K2Node_Event_Active' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom, CallFunc_Not_PreBool_ReturnValue) == 0x000022, "Member 'LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000023, "Member 'LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom, CallFunc_Not_PreBool_ReturnValue_1) == 0x000024, "Member 'LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000028, "Member 'LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom, CallFunc_OnApplyNeedShrink_ReturnValue) == 0x000035, "Member 'LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom::CallFunc_OnApplyNeedShrink_ReturnValue' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom, Temp_int_Array_Index_Variable) == 0x000038, "Member 'LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom, CallFunc_GetAnimInstance_ReturnValue) == 0x000040, "Member 'LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom, CallFunc_Array_Get_Item) == 0x000048, "Member 'LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom, K2Node_DynamicCast_AsLPCAnimation_BP_Stat_Room_2) == 0x000050, "Member 'LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom::K2Node_DynamicCast_AsLPCAnimation_BP_Stat_Room_2' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom, CallFunc_GetComponentByClass_ReturnValue) == 0x000060, "Member 'LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom, CallFunc_GetPlayerPawn_ReturnValue) == 0x000070, "Member 'LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom, K2Node_DynamicCast_AsBP_CH_PC_Pino_1) == 0x000078, "Member 'LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom::K2Node_DynamicCast_AsBP_CH_PC_Pino_1' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom, K2Node_DynamicCast_bSuccess_2) == 0x000080, "Member 'LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom, CallFunc_IsEyeColorChanged_ReturnValue) == 0x000081, "Member 'LPCCharacterBP_StatRoom_C_ExecuteUbergraph_LPCCharacterBP_StatRoom::CallFunc_IsEyeColorChanged_ReturnValue' has a wrong offset!");

// Function LPCCharacterBP_StatRoom.LPCCharacterBP_StatRoom_C.OnActiveMesh
// 0x0001 (0x0001 - 0x0000)
struct LPCCharacterBP_StatRoom_C_OnActiveMesh final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LPCCharacterBP_StatRoom_C_OnActiveMesh) == 0x000001, "Wrong alignment on LPCCharacterBP_StatRoom_C_OnActiveMesh");
static_assert(sizeof(LPCCharacterBP_StatRoom_C_OnActiveMesh) == 0x000001, "Wrong size on LPCCharacterBP_StatRoom_C_OnActiveMesh");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_OnActiveMesh, Active) == 0x000000, "Member 'LPCCharacterBP_StatRoom_C_OnActiveMesh::Active' has a wrong offset!");

// Function LPCCharacterBP_StatRoom.LPCCharacterBP_StatRoom_C.UserConstructionScript
// 0x00B0 (0x00B0 - 0x0000)
struct LPCCharacterBP_StatRoom_C_UserConstructionScript final
{
public:
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors;            // 0x0000(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors_1;          // 0x0018(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors_2;          // 0x0030(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors_3;          // 0x0048(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_3;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors_4;          // 0x0060(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_4;                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors_5;          // 0x0090(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_5;                         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LPCCharacterBP_StatRoom_C_UserConstructionScript) == 0x000008, "Wrong alignment on LPCCharacterBP_StatRoom_C_UserConstructionScript");
static_assert(sizeof(LPCCharacterBP_StatRoom_C_UserConstructionScript) == 0x0000B0, "Wrong size on LPCCharacterBP_StatRoom_C_UserConstructionScript");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_UserConstructionScript, CallFunc_GetAllActorsWithTag_OutActors) == 0x000000, "Member 'LPCCharacterBP_StatRoom_C_UserConstructionScript::CallFunc_GetAllActorsWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000010, "Member 'LPCCharacterBP_StatRoom_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_UserConstructionScript, CallFunc_GetAllActorsWithTag_OutActors_1) == 0x000018, "Member 'LPCCharacterBP_StatRoom_C_UserConstructionScript::CallFunc_GetAllActorsWithTag_OutActors_1' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_UserConstructionScript, CallFunc_Array_Get_Item_1) == 0x000028, "Member 'LPCCharacterBP_StatRoom_C_UserConstructionScript::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_UserConstructionScript, CallFunc_GetAllActorsWithTag_OutActors_2) == 0x000030, "Member 'LPCCharacterBP_StatRoom_C_UserConstructionScript::CallFunc_GetAllActorsWithTag_OutActors_2' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_UserConstructionScript, CallFunc_Array_Get_Item_2) == 0x000040, "Member 'LPCCharacterBP_StatRoom_C_UserConstructionScript::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_UserConstructionScript, CallFunc_GetAllActorsWithTag_OutActors_3) == 0x000048, "Member 'LPCCharacterBP_StatRoom_C_UserConstructionScript::CallFunc_GetAllActorsWithTag_OutActors_3' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_UserConstructionScript, CallFunc_Array_Get_Item_3) == 0x000058, "Member 'LPCCharacterBP_StatRoom_C_UserConstructionScript::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_UserConstructionScript, CallFunc_GetAllActorsWithTag_OutActors_4) == 0x000060, "Member 'LPCCharacterBP_StatRoom_C_UserConstructionScript::CallFunc_GetAllActorsWithTag_OutActors_4' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_UserConstructionScript, CallFunc_Array_Get_Item_4) == 0x000070, "Member 'LPCCharacterBP_StatRoom_C_UserConstructionScript::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue) == 0x000078, "Member 'LPCCharacterBP_StatRoom_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue_1) == 0x00007C, "Member 'LPCCharacterBP_StatRoom_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue_2) == 0x000080, "Member 'LPCCharacterBP_StatRoom_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue_3) == 0x000084, "Member 'LPCCharacterBP_StatRoom_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue_4) == 0x000088, "Member 'LPCCharacterBP_StatRoom_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_UserConstructionScript, CallFunc_GetAllActorsWithTag_OutActors_5) == 0x000090, "Member 'LPCCharacterBP_StatRoom_C_UserConstructionScript::CallFunc_GetAllActorsWithTag_OutActors_5' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_UserConstructionScript, CallFunc_Array_Get_Item_5) == 0x0000A0, "Member 'LPCCharacterBP_StatRoom_C_UserConstructionScript::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(LPCCharacterBP_StatRoom_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue_5) == 0x0000A8, "Member 'LPCCharacterBP_StatRoom_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue_5' has a wrong offset!");

}

