#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LPCCharacterBP_StatRoom

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"
#include "EN_StatRoomMotionType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass LPCCharacterBP_StatRoom.LPCCharacterBP_StatRoom_C
// 0x0070 (0x0D50 - 0x0CE0)
class ALPCCharacterBP_StatRoom_C final : public ALStatRoomPCCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0CE0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Mesh_Eyewear;                                      // 0x0CE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mesh_Mask;                                         // 0x0CF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULEquipmentComponentBP_C*               LEquipmentComponentBP;                             // 0x0CF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mesh_Hair;                                         // 0x0D00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mesh_Face;                                         // 0x0D08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Monad_Active_01_GDH;                            // 0x0D10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Monad_1_Grow_01_GDH;                            // 0x0D18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_PC_PROB_PCLamp_01;                              // 0x0D20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EN_StatRoomMotionType                         MotionType;                                        // 0x0D28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D29[0x7];                                      // 0x0D29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CameraActor;                                       // 0x0D30(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          ResetAnimState;                                    // 0x0D40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_LPCCharacterBP_StatRoom(int32 EntryPoint);
	void OnApplyNeedShrink();
	void OnActiveMesh(bool Active);
	void AttachPCLamp();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LPCCharacterBP_StatRoom_C">();
	}
	static class ALPCCharacterBP_StatRoom_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALPCCharacterBP_StatRoom_C>();
	}
};
static_assert(alignof(ALPCCharacterBP_StatRoom_C) == 0x000010, "Wrong alignment on ALPCCharacterBP_StatRoom_C");
static_assert(sizeof(ALPCCharacterBP_StatRoom_C) == 0x000D50, "Wrong size on ALPCCharacterBP_StatRoom_C");
static_assert(offsetof(ALPCCharacterBP_StatRoom_C, UberGraphFrame) == 0x000CE0, "Member 'ALPCCharacterBP_StatRoom_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALPCCharacterBP_StatRoom_C, Mesh_Eyewear) == 0x000CE8, "Member 'ALPCCharacterBP_StatRoom_C::Mesh_Eyewear' has a wrong offset!");
static_assert(offsetof(ALPCCharacterBP_StatRoom_C, Mesh_Mask) == 0x000CF0, "Member 'ALPCCharacterBP_StatRoom_C::Mesh_Mask' has a wrong offset!");
static_assert(offsetof(ALPCCharacterBP_StatRoom_C, LEquipmentComponentBP) == 0x000CF8, "Member 'ALPCCharacterBP_StatRoom_C::LEquipmentComponentBP' has a wrong offset!");
static_assert(offsetof(ALPCCharacterBP_StatRoom_C, Mesh_Hair) == 0x000D00, "Member 'ALPCCharacterBP_StatRoom_C::Mesh_Hair' has a wrong offset!");
static_assert(offsetof(ALPCCharacterBP_StatRoom_C, Mesh_Face) == 0x000D08, "Member 'ALPCCharacterBP_StatRoom_C::Mesh_Face' has a wrong offset!");
static_assert(offsetof(ALPCCharacterBP_StatRoom_C, NS_Monad_Active_01_GDH) == 0x000D10, "Member 'ALPCCharacterBP_StatRoom_C::NS_Monad_Active_01_GDH' has a wrong offset!");
static_assert(offsetof(ALPCCharacterBP_StatRoom_C, NS_Monad_1_Grow_01_GDH) == 0x000D18, "Member 'ALPCCharacterBP_StatRoom_C::NS_Monad_1_Grow_01_GDH' has a wrong offset!");
static_assert(offsetof(ALPCCharacterBP_StatRoom_C, SM_PC_PROB_PCLamp_01) == 0x000D20, "Member 'ALPCCharacterBP_StatRoom_C::SM_PC_PROB_PCLamp_01' has a wrong offset!");
static_assert(offsetof(ALPCCharacterBP_StatRoom_C, MotionType) == 0x000D28, "Member 'ALPCCharacterBP_StatRoom_C::MotionType' has a wrong offset!");
static_assert(offsetof(ALPCCharacterBP_StatRoom_C, CameraActor) == 0x000D30, "Member 'ALPCCharacterBP_StatRoom_C::CameraActor' has a wrong offset!");
static_assert(offsetof(ALPCCharacterBP_StatRoom_C, ResetAnimState) == 0x000D40, "Member 'ALPCCharacterBP_StatRoom_C::ResetAnimState' has a wrong offset!");

}

