#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LV_Inner_UpperStreet_Sound

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LV_Inner_UpperStreet_Sound.LV_Inner_UpperStreet_Sound_C
// 0x0018 (0x0200 - 0x01E8)
class ALV_Inner_UpperStreet_Sound_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AAmbientSound*                          AMB_MS_Inner_Bridge_Mood_02_ExecuteUbergraph_LV_Inner_UpperStreet_Sound_RefProperty; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAmbientSound*                          AMB_MS_Inner_Bridge_Mood_01_ExecuteUbergraph_LV_Inner_UpperStreet_Sound_RefProperty; // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LV_Inner_UpperStreet_Sound(int32 EntryPoint);
	void BndEvt__LV_Inner_UpperStreet_Sound_AMB_TR_Inner_Bridge_Mood_IO_02_K2Node_ActorBoundEvent_17_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_UpperStreet_Sound_AMB_TR_Inner_Bridge_Mood_IO_01_K2Node_ActorBoundEvent_16_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_UpperStreet_Sound_AMB_TR_Inner_Out_K2Node_ActorBoundEvent_15_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_UpperStreet_Sound_AMB_TR_Inner_Out_K2Node_ActorBoundEvent_14_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_UpperStreet_Sound_AMB_TR_Inner_Interior_05_1_K2Node_ActorBoundEvent_13_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_UpperStreet_Sound_AMB_TR_Inner_Interior_05_1_K2Node_ActorBoundEvent_12_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_UpperStreet_Sound_AMB_TR_Inner_Interior_04_13_K2Node_ActorBoundEvent_11_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_UpperStreet_Sound_AMB_TR_Inner_Interior_04_13_K2Node_ActorBoundEvent_10_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_UpperStreet_Sound_AMB_TR_Inner_Interior_03_11_K2Node_ActorBoundEvent_9_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_UpperStreet_Sound_AMB_TR_Inner_Interior_03_11_K2Node_ActorBoundEvent_8_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_UpperStreet_Sound_AMB_TR_Inner_Interior_02_9_K2Node_ActorBoundEvent_7_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_UpperStreet_Sound_AMB_TR_Inner_Interior_02_9_K2Node_ActorBoundEvent_6_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_UpperStreet_Sound_AMB_TR_Inner_Interior_01_7_K2Node_ActorBoundEvent_5_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_UpperStreet_Sound_AMB_TR_Inner_Interior_01_7_K2Node_ActorBoundEvent_4_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_UpperStreet_Sound_AMB_TR_Inner_City_Hall_5_K2Node_ActorBoundEvent_3_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_UpperStreet_Sound_AMB_TR_Inner_City_Hall_5_K2Node_ActorBoundEvent_2_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_UpperStreet_Sound_AMB_TR_Inner_Building_3_K2Node_ActorBoundEvent_1_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_UpperStreet_Sound_AMB_TR_Inner_Building_3_K2Node_ActorBoundEvent_0_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LV_Inner_UpperStreet_Sound_C">();
	}
	static class ALV_Inner_UpperStreet_Sound_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALV_Inner_UpperStreet_Sound_C>();
	}
};
static_assert(alignof(ALV_Inner_UpperStreet_Sound_C) == 0x000008, "Wrong alignment on ALV_Inner_UpperStreet_Sound_C");
static_assert(sizeof(ALV_Inner_UpperStreet_Sound_C) == 0x000200, "Wrong size on ALV_Inner_UpperStreet_Sound_C");
static_assert(offsetof(ALV_Inner_UpperStreet_Sound_C, UberGraphFrame) == 0x0001E8, "Member 'ALV_Inner_UpperStreet_Sound_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALV_Inner_UpperStreet_Sound_C, AMB_MS_Inner_Bridge_Mood_02_ExecuteUbergraph_LV_Inner_UpperStreet_Sound_RefProperty) == 0x0001F0, "Member 'ALV_Inner_UpperStreet_Sound_C::AMB_MS_Inner_Bridge_Mood_02_ExecuteUbergraph_LV_Inner_UpperStreet_Sound_RefProperty' has a wrong offset!");
static_assert(offsetof(ALV_Inner_UpperStreet_Sound_C, AMB_MS_Inner_Bridge_Mood_01_ExecuteUbergraph_LV_Inner_UpperStreet_Sound_RefProperty) == 0x0001F8, "Member 'ALV_Inner_UpperStreet_Sound_C::AMB_MS_Inner_Bridge_Mood_01_ExecuteUbergraph_LV_Inner_UpperStreet_Sound_RefProperty' has a wrong offset!");

}

