#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LV_Inner_Cathedral_Sound

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass LV_Inner_Cathedral_Sound.LV_Inner_Cathedral_Sound_C
// 0x0028 (0x0210 - 0x01E8)
class ALV_Inner_Cathedral_Sound_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FTimerHandle                           Timer_NpcSpawnCheck;                               // 0x01F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AAmbientSound*                          AMB_MS_Secret_Room_ExecuteUbergraph_LV_Inner_Cathedral_Sound_RefProperty; // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAmbientSound*                          AMB_MS_Organ_B3_ExecuteUbergraph_LV_Inner_Cathedral_Sound_RefProperty; // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAmbientSound*                          AMB_MS_Organ_F1_ExecuteUbergraph_LV_Inner_Cathedral_Sound_RefProperty; // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LV_Inner_Cathedral_Sound(int32 EntryPoint);
	void OnBossRoomDestroyed(const class FString& BossRoomSpotUniqueID);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Organ_B3_IO_K2Node_ActorBoundEvent_39_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Street_Cave_01_2_K2Node_ActorBoundEvent_12_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Street_Cave_01_2_K2Node_ActorBoundEvent_11_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Street_Cave_01_1_K2Node_ActorBoundEvent_48_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Street_Cave_01_1_K2Node_ActorBoundEvent_47_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Platform_01_34_K2Node_ActorBoundEvent_46_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Platform_01_34_K2Node_ActorBoundEvent_45_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Cathedral_Tram_36_K2Node_ActorBoundEvent_44_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Cathedral_Tram_36_K2Node_ActorBoundEvent_43_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Platform_02_K2Node_ActorBoundEvent_42_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Platform_02_K2Node_ActorBoundEvent_41_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Street_House_09_K2Node_ActorBoundEvent_38_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Street_House_09_K2Node_ActorBoundEvent_37_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Street_House_08_K2Node_ActorBoundEvent_36_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Street_House_08_K2Node_ActorBoundEvent_35_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Street_House_07_K2Node_ActorBoundEvent_34_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Street_House_07_K2Node_ActorBoundEvent_33_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Street_House_06_K2Node_ActorBoundEvent_32_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Street_House_06_K2Node_ActorBoundEvent_31_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Street_House_05_K2Node_ActorBoundEvent_30_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Street_House_05_K2Node_ActorBoundEvent_29_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Street_House_04_K2Node_ActorBoundEvent_28_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Street_House_04_K2Node_ActorBoundEvent_27_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Street_House_03_K2Node_ActorBoundEvent_26_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Street_House_03_K2Node_ActorBoundEvent_25_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_tr_Street_House_02_K2Node_ActorBoundEvent_24_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_tr_Street_House_02_K2Node_ActorBoundEvent_23_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_tr_Street_House_01_K2Node_ActorBoundEvent_22_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_tr_Street_House_01_K2Node_ActorBoundEvent_21_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Street_Bridge_03_K2Node_ActorBoundEvent_20_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Street_Bridge_03_K2Node_ActorBoundEvent_19_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Street_Bridge_02_K2Node_ActorBoundEvent_18_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Street_Bridge_02_K2Node_ActorBoundEvent_17_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Street_Cave_03_1_K2Node_ActorBoundEvent_16_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Street_Cave_03_1_K2Node_ActorBoundEvent_15_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Street_Cave_02_5_K2Node_ActorBoundEvent_14_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Street_Cave_02_5_K2Node_ActorBoundEvent_13_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Cathedral_Lift_K2Node_ActorBoundEvent_10_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Cathedral_Lift_K2Node_ActorBoundEvent_9_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Cathedral_S_Bridge_1_K2Node_ActorBoundEvent_8_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Cathedral_S_Bridge_1_K2Node_ActorBoundEvent_7_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Cathedral_S_K2Node_ActorBoundEvent_4_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Cathedral_S_K2Node_ActorBoundEvent_3_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Cathedral_Inside_K2Node_ActorBoundEvent_2_ActorEndOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Cathedral_Inside_K2Node_ActorBoundEvent_1_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void PlayF1OrganBGM();
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Organ_B3_IO_K2Node_ActorBoundEvent_6_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Organ_F1_IO_K2Node_ActorBoundEvent_5_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);
	void ReceiveTick(float DeltaSeconds);
	void BndEvt__LV_Inner_Cathedral_Sound_AMB_TR_Secret_Room_IO_K2Node_ActorBoundEvent_2_ActorBeginOverlapSignature__DelegateSignature(class AActor* OverlappedActor, class AActor* OtherActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LV_Inner_Cathedral_Sound_C">();
	}
	static class ALV_Inner_Cathedral_Sound_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALV_Inner_Cathedral_Sound_C>();
	}
};
static_assert(alignof(ALV_Inner_Cathedral_Sound_C) == 0x000008, "Wrong alignment on ALV_Inner_Cathedral_Sound_C");
static_assert(sizeof(ALV_Inner_Cathedral_Sound_C) == 0x000210, "Wrong size on ALV_Inner_Cathedral_Sound_C");
static_assert(offsetof(ALV_Inner_Cathedral_Sound_C, UberGraphFrame) == 0x0001E8, "Member 'ALV_Inner_Cathedral_Sound_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALV_Inner_Cathedral_Sound_C, Timer_NpcSpawnCheck) == 0x0001F0, "Member 'ALV_Inner_Cathedral_Sound_C::Timer_NpcSpawnCheck' has a wrong offset!");
static_assert(offsetof(ALV_Inner_Cathedral_Sound_C, AMB_MS_Secret_Room_ExecuteUbergraph_LV_Inner_Cathedral_Sound_RefProperty) == 0x0001F8, "Member 'ALV_Inner_Cathedral_Sound_C::AMB_MS_Secret_Room_ExecuteUbergraph_LV_Inner_Cathedral_Sound_RefProperty' has a wrong offset!");
static_assert(offsetof(ALV_Inner_Cathedral_Sound_C, AMB_MS_Organ_B3_ExecuteUbergraph_LV_Inner_Cathedral_Sound_RefProperty) == 0x000200, "Member 'ALV_Inner_Cathedral_Sound_C::AMB_MS_Organ_B3_ExecuteUbergraph_LV_Inner_Cathedral_Sound_RefProperty' has a wrong offset!");
static_assert(offsetof(ALV_Inner_Cathedral_Sound_C, AMB_MS_Organ_F1_ExecuteUbergraph_LV_Inner_Cathedral_Sound_RefProperty) == 0x000208, "Member 'ALV_Inner_Cathedral_Sound_C::AMB_MS_Organ_F1_ExecuteUbergraph_LV_Inner_Cathedral_Sound_RefProperty' has a wrong offset!");

}

