#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LV_Krat_Box02_DBP_HSH

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass LV_Krat_Box02_DBP_HSH.LV_Krat_Box02_DBP_HSH_C
// 0x0098 (0x03C8 - 0x0330)
class ALV_Krat_Box02_DBP_HSH_C final : public ALDestructionObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_PhysicsImpactSound_C*               BP_PhysicsImpactSound;                             // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh14;                             // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh13;                             // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh12;                             // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh11;                             // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh10;                             // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh9;                              // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh8;                              // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh7;                              // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh6;                              // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh5;                              // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh4;                              // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh3;                              // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh2;                              // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh1;                              // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULDestructStaticMeshComponent*          LDestructStaticMesh;                               // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio;                                             // 0x03B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Niagara;                                           // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void OnDestructCrashed();
	void ExecuteUbergraph_LV_Krat_Box02_DBP_HSH(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LV_Krat_Box02_DBP_HSH_C">();
	}
	static class ALV_Krat_Box02_DBP_HSH_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALV_Krat_Box02_DBP_HSH_C>();
	}
};
static_assert(alignof(ALV_Krat_Box02_DBP_HSH_C) == 0x000008, "Wrong alignment on ALV_Krat_Box02_DBP_HSH_C");
static_assert(sizeof(ALV_Krat_Box02_DBP_HSH_C) == 0x0003C8, "Wrong size on ALV_Krat_Box02_DBP_HSH_C");
static_assert(offsetof(ALV_Krat_Box02_DBP_HSH_C, UberGraphFrame) == 0x000330, "Member 'ALV_Krat_Box02_DBP_HSH_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALV_Krat_Box02_DBP_HSH_C, BP_PhysicsImpactSound) == 0x000338, "Member 'ALV_Krat_Box02_DBP_HSH_C::BP_PhysicsImpactSound' has a wrong offset!");
static_assert(offsetof(ALV_Krat_Box02_DBP_HSH_C, LDestructStaticMesh14) == 0x000340, "Member 'ALV_Krat_Box02_DBP_HSH_C::LDestructStaticMesh14' has a wrong offset!");
static_assert(offsetof(ALV_Krat_Box02_DBP_HSH_C, LDestructStaticMesh13) == 0x000348, "Member 'ALV_Krat_Box02_DBP_HSH_C::LDestructStaticMesh13' has a wrong offset!");
static_assert(offsetof(ALV_Krat_Box02_DBP_HSH_C, LDestructStaticMesh12) == 0x000350, "Member 'ALV_Krat_Box02_DBP_HSH_C::LDestructStaticMesh12' has a wrong offset!");
static_assert(offsetof(ALV_Krat_Box02_DBP_HSH_C, LDestructStaticMesh11) == 0x000358, "Member 'ALV_Krat_Box02_DBP_HSH_C::LDestructStaticMesh11' has a wrong offset!");
static_assert(offsetof(ALV_Krat_Box02_DBP_HSH_C, LDestructStaticMesh10) == 0x000360, "Member 'ALV_Krat_Box02_DBP_HSH_C::LDestructStaticMesh10' has a wrong offset!");
static_assert(offsetof(ALV_Krat_Box02_DBP_HSH_C, LDestructStaticMesh9) == 0x000368, "Member 'ALV_Krat_Box02_DBP_HSH_C::LDestructStaticMesh9' has a wrong offset!");
static_assert(offsetof(ALV_Krat_Box02_DBP_HSH_C, LDestructStaticMesh8) == 0x000370, "Member 'ALV_Krat_Box02_DBP_HSH_C::LDestructStaticMesh8' has a wrong offset!");
static_assert(offsetof(ALV_Krat_Box02_DBP_HSH_C, LDestructStaticMesh7) == 0x000378, "Member 'ALV_Krat_Box02_DBP_HSH_C::LDestructStaticMesh7' has a wrong offset!");
static_assert(offsetof(ALV_Krat_Box02_DBP_HSH_C, LDestructStaticMesh6) == 0x000380, "Member 'ALV_Krat_Box02_DBP_HSH_C::LDestructStaticMesh6' has a wrong offset!");
static_assert(offsetof(ALV_Krat_Box02_DBP_HSH_C, LDestructStaticMesh5) == 0x000388, "Member 'ALV_Krat_Box02_DBP_HSH_C::LDestructStaticMesh5' has a wrong offset!");
static_assert(offsetof(ALV_Krat_Box02_DBP_HSH_C, LDestructStaticMesh4) == 0x000390, "Member 'ALV_Krat_Box02_DBP_HSH_C::LDestructStaticMesh4' has a wrong offset!");
static_assert(offsetof(ALV_Krat_Box02_DBP_HSH_C, LDestructStaticMesh3) == 0x000398, "Member 'ALV_Krat_Box02_DBP_HSH_C::LDestructStaticMesh3' has a wrong offset!");
static_assert(offsetof(ALV_Krat_Box02_DBP_HSH_C, LDestructStaticMesh2) == 0x0003A0, "Member 'ALV_Krat_Box02_DBP_HSH_C::LDestructStaticMesh2' has a wrong offset!");
static_assert(offsetof(ALV_Krat_Box02_DBP_HSH_C, LDestructStaticMesh1) == 0x0003A8, "Member 'ALV_Krat_Box02_DBP_HSH_C::LDestructStaticMesh1' has a wrong offset!");
static_assert(offsetof(ALV_Krat_Box02_DBP_HSH_C, LDestructStaticMesh) == 0x0003B0, "Member 'ALV_Krat_Box02_DBP_HSH_C::LDestructStaticMesh' has a wrong offset!");
static_assert(offsetof(ALV_Krat_Box02_DBP_HSH_C, Audio) == 0x0003B8, "Member 'ALV_Krat_Box02_DBP_HSH_C::Audio' has a wrong offset!");
static_assert(offsetof(ALV_Krat_Box02_DBP_HSH_C, Niagara) == 0x0003C0, "Member 'ALV_Krat_Box02_DBP_HSH_C::Niagara' has a wrong offset!");

}

