#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LV_Krat_Old_Town_Sound

#include "Basic.hpp"


namespace SDK::Params
{

// Function LV_Krat_Old_Town_Sound.LV_Krat_Old_Town_Sound_C.ExecuteUbergraph_LV_Krat_Old_Town_Sound
// 0x04C8 (0x04C8 - 0x0000)
struct LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_37;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_37;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_36;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_36;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_1;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_35;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_35;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_34;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_34;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_2;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_3;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_33;         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_33;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_32;         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_32;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_4;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_5;               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C3[0x5];                                       // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_31;         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_31;              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_30;         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_30;              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_6;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_7;               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_103[0x5];                                      // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_29;         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_29;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_28;         // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_28;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_8;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_9;               // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_143[0x5];                                      // 0x0143(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_27;         // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_27;              // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_26;         // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_26;              // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_10;              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_11;              // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_183[0x5];                                      // 0x0183(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_25;         // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_25;              // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_24;         // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_24;              // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_12;              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_13;              // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C3[0x5];                                      // 0x01C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_23;         // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_23;              // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_22;         // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_22;              // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_14;              // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_15;              // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_203[0x5];                                      // 0x0203(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_21;         // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_21;              // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_20;         // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_20;              // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_16;              // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_17;              // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_17;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_17;                   // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_243[0x5];                                      // 0x0243(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_19;         // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_19;              // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_18;         // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_18;              // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_18;              // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_18;                    // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_19;              // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_19;                    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_18;                   // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_19;                   // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_283[0x5];                                      // 0x0283(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_17;         // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_17;              // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_16;         // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_16;              // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_20;              // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_20;                    // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_21;              // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_21;                    // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_20;                   // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_21;                   // 0x02C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C3[0x5];                                      // 0x02C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_15;         // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_15;              // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_14;         // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_14;              // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_22;              // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_22;                    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_23;              // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_23;                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_22;                   // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_23;                   // 0x0302(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_303[0x5];                                      // 0x0303(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_13;         // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_13;              // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_12;         // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_12;              // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_24;              // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_24;                    // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_25;              // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_25;                    // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_24;                   // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_25;                   // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_343[0x5];                                      // 0x0343(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_11;         // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_11;              // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_10;         // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_10;              // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_26;              // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_26;                    // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_27;              // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_27;                    // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_26;                   // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_27;                   // 0x0382(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_383[0x5];                                      // 0x0383(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_9;          // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_9;               // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_8;          // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_8;               // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_28;              // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_28;                    // 0x03B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_29;              // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_29;                    // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_28;                   // 0x03C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_29;                   // 0x03C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C3[0x5];                                      // 0x03C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_7;          // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_7;               // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_6;          // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_6;               // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_30;              // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_30;                    // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_31;              // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_31;                    // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_30;                   // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_31;                   // 0x0402(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_403[0x5];                                      // 0x0403(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_5;          // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_5;               // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_4;          // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_4;               // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_32;              // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_32;                    // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_33;              // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_33;                    // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_32;                   // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_33;                   // 0x0442(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_443[0x5];                                      // 0x0443(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_3;          // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_3;               // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_2;          // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_2;               // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_34;              // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_34;                    // 0x0470(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_471[0x7];                                      // 0x0471(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_35;              // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_35;                    // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_34;                   // 0x0481(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_35;                   // 0x0482(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_483[0x5];                                      // 0x0483(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor_1;          // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor_1;               // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OverlappedActor;            // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ActorBoundEvent_OtherActor;                 // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_36;              // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_36;                    // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter_37;              // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_37;                    // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_36;                   // 0x04C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_37;                   // 0x04C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound) == 0x000008, "Wrong alignment on LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound");
static_assert(sizeof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound) == 0x0004C8, "Wrong size on LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, EntryPoint) == 0x000000, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::EntryPoint' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OverlappedActor_37) == 0x000008, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OverlappedActor_37' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OtherActor_37) == 0x000010, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OtherActor_37' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OverlappedActor_36) == 0x000018, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OverlappedActor_36' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OtherActor_36) == 0x000020, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OtherActor_36' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_AsLPCCharacter) == 0x000028, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_AsLPCCharacter' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_AsLPCCharacter_1) == 0x000038, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_AsLPCCharacter_1' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, CallFunc_IsValid_ReturnValue_1) == 0x000042, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OverlappedActor_35) == 0x000048, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OverlappedActor_35' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OtherActor_35) == 0x000050, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OtherActor_35' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OverlappedActor_34) == 0x000058, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OverlappedActor_34' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OtherActor_34) == 0x000060, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OtherActor_34' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_AsLPCCharacter_2) == 0x000068, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_AsLPCCharacter_2' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_AsLPCCharacter_3) == 0x000078, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_AsLPCCharacter_3' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_bSuccess_3) == 0x000080, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, CallFunc_IsValid_ReturnValue_2) == 0x000081, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, CallFunc_IsValid_ReturnValue_3) == 0x000082, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OverlappedActor_33) == 0x000088, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OverlappedActor_33' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OtherActor_33) == 0x000090, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OtherActor_33' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OverlappedActor_32) == 0x000098, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OverlappedActor_32' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OtherActor_32) == 0x0000A0, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OtherActor_32' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_AsLPCCharacter_4) == 0x0000A8, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_AsLPCCharacter_4' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_bSuccess_4) == 0x0000B0, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_AsLPCCharacter_5) == 0x0000B8, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_AsLPCCharacter_5' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_bSuccess_5) == 0x0000C0, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, CallFunc_IsValid_ReturnValue_4) == 0x0000C1, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, CallFunc_IsValid_ReturnValue_5) == 0x0000C2, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OverlappedActor_31) == 0x0000C8, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OverlappedActor_31' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OtherActor_31) == 0x0000D0, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OtherActor_31' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OverlappedActor_30) == 0x0000D8, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OverlappedActor_30' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OtherActor_30) == 0x0000E0, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OtherActor_30' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_AsLPCCharacter_6) == 0x0000E8, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_AsLPCCharacter_6' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_bSuccess_6) == 0x0000F0, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_AsLPCCharacter_7) == 0x0000F8, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_AsLPCCharacter_7' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_bSuccess_7) == 0x000100, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, CallFunc_IsValid_ReturnValue_6) == 0x000101, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, CallFunc_IsValid_ReturnValue_7) == 0x000102, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OverlappedActor_29) == 0x000108, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OverlappedActor_29' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OtherActor_29) == 0x000110, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OtherActor_29' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OverlappedActor_28) == 0x000118, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OverlappedActor_28' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OtherActor_28) == 0x000120, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OtherActor_28' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_AsLPCCharacter_8) == 0x000128, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_AsLPCCharacter_8' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_bSuccess_8) == 0x000130, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_AsLPCCharacter_9) == 0x000138, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_AsLPCCharacter_9' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_bSuccess_9) == 0x000140, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, CallFunc_IsValid_ReturnValue_8) == 0x000141, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, CallFunc_IsValid_ReturnValue_9) == 0x000142, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OverlappedActor_27) == 0x000148, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OverlappedActor_27' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OtherActor_27) == 0x000150, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OtherActor_27' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OverlappedActor_26) == 0x000158, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OverlappedActor_26' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OtherActor_26) == 0x000160, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OtherActor_26' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_AsLPCCharacter_10) == 0x000168, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_AsLPCCharacter_10' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_bSuccess_10) == 0x000170, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_AsLPCCharacter_11) == 0x000178, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_AsLPCCharacter_11' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_bSuccess_11) == 0x000180, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, CallFunc_IsValid_ReturnValue_10) == 0x000181, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, CallFunc_IsValid_ReturnValue_11) == 0x000182, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OverlappedActor_25) == 0x000188, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OverlappedActor_25' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OtherActor_25) == 0x000190, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OtherActor_25' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OverlappedActor_24) == 0x000198, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OverlappedActor_24' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_ActorBoundEvent_OtherActor_24) == 0x0001A0, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_ActorBoundEvent_OtherActor_24' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_AsLPCCharacter_12) == 0x0001A8, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_AsLPCCharacter_12' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_bSuccess_12) == 0x0001B0, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_bSuccess_12' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_AsLPCCharacter_13) == 0x0001B8, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_AsLPCCharacter_13' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, K2Node_DynamicCast_bSuccess_13) == 0x0001C0, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::K2Node_DynamicCast_bSuccess_13' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, CallFunc_IsValid_ReturnValue_12) == 0x0001C1, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound, CallFunc_IsValid_ReturnValue_13) == 0x0001C2, "Member 'LV_Krat_Old_Town_Sound_C_ExecuteUbergraph_LV_Krat_Old_Town_Sound::CallFunc_IsValid_ReturnValue_13' has a wrong offset!");
