#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MovieSystemDataBP

#include "Basic.hpp"

#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function MovieSystemDataBP.MovieSystemDataBP_C.ExecuteUbergraph_MovieSystemDataBP
// 0x0068 (0x0068 - 0x0000)
struct MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULMovieSystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULCommonConstantValues*                 CallFunc_GetConstantValues_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetOpeningMovieCodeName_ReturnValue;      // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_OpenedUrl;              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULMovieSystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_MovieCodeName;                        // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULMovieSystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULMovieSystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP) == 0x000008, "Wrong alignment on MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP");
static_assert(sizeof(MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP) == 0x000068, "Wrong size on MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP");
static_assert(offsetof(MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP, EntryPoint) == 0x000000, "Member 'MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP, CallFunc_GetConstantValues_ReturnValue) == 0x000010, "Member 'MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP::CallFunc_GetConstantValues_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP, CallFunc_NotEqual_NameName_ReturnValue) == 0x000018, "Member 'MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP, CallFunc_GetOpeningMovieCodeName_ReturnValue) == 0x00001C, "Member 'MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP::CallFunc_GetOpeningMovieCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP, K2Node_ComponentBoundEvent_OpenedUrl) == 0x000028, "Member 'MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP::K2Node_ComponentBoundEvent_OpenedUrl' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000038, "Member 'MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000040, "Member 'MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP, K2Node_Event_MovieCodeName) == 0x00004C, "Member 'MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP::K2Node_Event_MovieCodeName' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000058, "Member 'MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000060, "Member 'MovieSystemDataBP_C_ExecuteUbergraph_MovieSystemDataBP::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");

// Function MovieSystemDataBP.MovieSystemDataBP_C.StopBinkMovie
// 0x0008 (0x0008 - 0x0000)
struct MovieSystemDataBP_C_StopBinkMovie final
{
public:
	class FName                                   MovieCodeName;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MovieSystemDataBP_C_StopBinkMovie) == 0x000004, "Wrong alignment on MovieSystemDataBP_C_StopBinkMovie");
static_assert(sizeof(MovieSystemDataBP_C_StopBinkMovie) == 0x000008, "Wrong size on MovieSystemDataBP_C_StopBinkMovie");
static_assert(offsetof(MovieSystemDataBP_C_StopBinkMovie, MovieCodeName) == 0x000000, "Member 'MovieSystemDataBP_C_StopBinkMovie::MovieCodeName' has a wrong offset!");

// Function MovieSystemDataBP.MovieSystemDataBP_C.BndEvt__MovieSystemData_FullScreenMoviePlayer_K2Node_ComponentBoundEvent_0_OnBinkMediaPlayerMediaOpened__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct MovieSystemDataBP_C_BndEvt__MovieSystemData_FullScreenMoviePlayer_K2Node_ComponentBoundEvent_0_OnBinkMediaPlayerMediaOpened__DelegateSignature final
{
public:
	class FString                                 OpenedUrl;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(MovieSystemDataBP_C_BndEvt__MovieSystemData_FullScreenMoviePlayer_K2Node_ComponentBoundEvent_0_OnBinkMediaPlayerMediaOpened__DelegateSignature) == 0x000008, "Wrong alignment on MovieSystemDataBP_C_BndEvt__MovieSystemData_FullScreenMoviePlayer_K2Node_ComponentBoundEvent_0_OnBinkMediaPlayerMediaOpened__DelegateSignature");
static_assert(sizeof(MovieSystemDataBP_C_BndEvt__MovieSystemData_FullScreenMoviePlayer_K2Node_ComponentBoundEvent_0_OnBinkMediaPlayerMediaOpened__DelegateSignature) == 0x000010, "Wrong size on MovieSystemDataBP_C_BndEvt__MovieSystemData_FullScreenMoviePlayer_K2Node_ComponentBoundEvent_0_OnBinkMediaPlayerMediaOpened__DelegateSignature");
static_assert(offsetof(MovieSystemDataBP_C_BndEvt__MovieSystemData_FullScreenMoviePlayer_K2Node_ComponentBoundEvent_0_OnBinkMediaPlayerMediaOpened__DelegateSignature, OpenedUrl) == 0x000000, "Member 'MovieSystemDataBP_C_BndEvt__MovieSystemData_FullScreenMoviePlayer_K2Node_ComponentBoundEvent_0_OnBinkMediaPlayerMediaOpened__DelegateSignature::OpenedUrl' has a wrong offset!");

// Function MovieSystemDataBP.MovieSystemDataBP_C.PlayBinkMovie
// 0x0058 (0x0058 - 0x0000)
struct MovieSystemDataBP_C_PlayBinkMovie final
{
public:
	class FName                                   MovieCodeName;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 MovieUrl;                                          // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bPauseOnReachedEnd;                                // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          RetVal;                                            // 0x001A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMovieVolume_Volume;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OpenUrl_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ULSoundSystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULOptionSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetVolume_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetVolume_ReturnValue_1;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVolumeStep_ReturnValue;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVolumeStep_ReturnValue_1;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MovieSystemDataBP_C_PlayBinkMovie) == 0x000008, "Wrong alignment on MovieSystemDataBP_C_PlayBinkMovie");
static_assert(sizeof(MovieSystemDataBP_C_PlayBinkMovie) == 0x000058, "Wrong size on MovieSystemDataBP_C_PlayBinkMovie");
static_assert(offsetof(MovieSystemDataBP_C_PlayBinkMovie, MovieCodeName) == 0x000000, "Member 'MovieSystemDataBP_C_PlayBinkMovie::MovieCodeName' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PlayBinkMovie, MovieUrl) == 0x000008, "Member 'MovieSystemDataBP_C_PlayBinkMovie::MovieUrl' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PlayBinkMovie, bPauseOnReachedEnd) == 0x000018, "Member 'MovieSystemDataBP_C_PlayBinkMovie::bPauseOnReachedEnd' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PlayBinkMovie, ReturnValue) == 0x000019, "Member 'MovieSystemDataBP_C_PlayBinkMovie::ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PlayBinkMovie, RetVal) == 0x00001A, "Member 'MovieSystemDataBP_C_PlayBinkMovie::RetVal' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PlayBinkMovie, CallFunc_GetMovieVolume_Volume) == 0x00001C, "Member 'MovieSystemDataBP_C_PlayBinkMovie::CallFunc_GetMovieVolume_Volume' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PlayBinkMovie, CallFunc_Play_ReturnValue) == 0x000020, "Member 'MovieSystemDataBP_C_PlayBinkMovie::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PlayBinkMovie, CallFunc_OpenUrl_ReturnValue) == 0x000021, "Member 'MovieSystemDataBP_C_PlayBinkMovie::CallFunc_OpenUrl_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PlayBinkMovie, CallFunc_IsPlaying_ReturnValue) == 0x000022, "Member 'MovieSystemDataBP_C_PlayBinkMovie::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PlayBinkMovie, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000028, "Member 'MovieSystemDataBP_C_PlayBinkMovie::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PlayBinkMovie, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000030, "Member 'MovieSystemDataBP_C_PlayBinkMovie::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PlayBinkMovie, CallFunc_GetVolume_ReturnValue) == 0x000038, "Member 'MovieSystemDataBP_C_PlayBinkMovie::CallFunc_GetVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PlayBinkMovie, CallFunc_GetVolume_ReturnValue_1) == 0x00003C, "Member 'MovieSystemDataBP_C_PlayBinkMovie::CallFunc_GetVolume_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PlayBinkMovie, CallFunc_GetVolumeStep_ReturnValue) == 0x000040, "Member 'MovieSystemDataBP_C_PlayBinkMovie::CallFunc_GetVolumeStep_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PlayBinkMovie, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000044, "Member 'MovieSystemDataBP_C_PlayBinkMovie::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PlayBinkMovie, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000048, "Member 'MovieSystemDataBP_C_PlayBinkMovie::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PlayBinkMovie, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00004C, "Member 'MovieSystemDataBP_C_PlayBinkMovie::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PlayBinkMovie, CallFunc_GetVolumeStep_ReturnValue_1) == 0x000050, "Member 'MovieSystemDataBP_C_PlayBinkMovie::CallFunc_GetVolumeStep_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PlayBinkMovie, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000054, "Member 'MovieSystemDataBP_C_PlayBinkMovie::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PlayBinkMovie, CallFunc_BooleanAND_ReturnValue) == 0x000055, "Member 'MovieSystemDataBP_C_PlayBinkMovie::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PlayBinkMovie, CallFunc_IsValid_ReturnValue) == 0x000056, "Member 'MovieSystemDataBP_C_PlayBinkMovie::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function MovieSystemDataBP.MovieSystemDataBP_C.IsPlayingBinkMovie
// 0x0004 (0x0004 - 0x0000)
struct MovieSystemDataBP_C_IsPlayingBinkMovie final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          RetVal;                                            // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MovieSystemDataBP_C_IsPlayingBinkMovie) == 0x000001, "Wrong alignment on MovieSystemDataBP_C_IsPlayingBinkMovie");
static_assert(sizeof(MovieSystemDataBP_C_IsPlayingBinkMovie) == 0x000004, "Wrong size on MovieSystemDataBP_C_IsPlayingBinkMovie");
static_assert(offsetof(MovieSystemDataBP_C_IsPlayingBinkMovie, ReturnValue) == 0x000000, "Member 'MovieSystemDataBP_C_IsPlayingBinkMovie::ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_IsPlayingBinkMovie, RetVal) == 0x000001, "Member 'MovieSystemDataBP_C_IsPlayingBinkMovie::RetVal' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_IsPlayingBinkMovie, CallFunc_IsPlaying_ReturnValue) == 0x000002, "Member 'MovieSystemDataBP_C_IsPlayingBinkMovie::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_IsPlayingBinkMovie, CallFunc_IsValid_ReturnValue) == 0x000003, "Member 'MovieSystemDataBP_C_IsPlayingBinkMovie::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function MovieSystemDataBP.MovieSystemDataBP_C.GetMovieVolume
// 0x0040 (0x0040 - 0x0000)
struct MovieSystemDataBP_C_GetMovieVolume final
{
public:
	class FName                                   InMovieCodeName;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Volume;                                            // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLMovieAudioSetting                    CallFunc_Map_Find_Value;                           // 0x0010(0x0028)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MovieSystemDataBP_C_GetMovieVolume) == 0x000008, "Wrong alignment on MovieSystemDataBP_C_GetMovieVolume");
static_assert(sizeof(MovieSystemDataBP_C_GetMovieVolume) == 0x000040, "Wrong size on MovieSystemDataBP_C_GetMovieVolume");
static_assert(offsetof(MovieSystemDataBP_C_GetMovieVolume, InMovieCodeName) == 0x000000, "Member 'MovieSystemDataBP_C_GetMovieVolume::InMovieCodeName' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_GetMovieVolume, Volume) == 0x000008, "Member 'MovieSystemDataBP_C_GetMovieVolume::Volume' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_GetMovieVolume, CallFunc_Map_Find_Value) == 0x000010, "Member 'MovieSystemDataBP_C_GetMovieVolume::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_GetMovieVolume, CallFunc_Map_Find_ReturnValue) == 0x000038, "Member 'MovieSystemDataBP_C_GetMovieVolume::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function MovieSystemDataBP.MovieSystemDataBP_C.PushMovieSoundMixes
// 0x00D0 (0x00D0 - 0x0000)
struct MovieSystemDataBP_C_PushMovieSoundMixes final
{
public:
	class FName                                   MovieCodeName;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLMovieAudioSetting                    CallFunc_Map_Find_Value;                           // 0x0070(0x0028)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundMix*                              CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(MovieSystemDataBP_C_PushMovieSoundMixes) == 0x000008, "Wrong alignment on MovieSystemDataBP_C_PushMovieSoundMixes");
static_assert(sizeof(MovieSystemDataBP_C_PushMovieSoundMixes) == 0x0000D0, "Wrong size on MovieSystemDataBP_C_PushMovieSoundMixes");
static_assert(offsetof(MovieSystemDataBP_C_PushMovieSoundMixes, MovieCodeName) == 0x000000, "Member 'MovieSystemDataBP_C_PushMovieSoundMixes::MovieCodeName' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PushMovieSoundMixes, CallFunc_Concat_StrStr_ReturnValue) == 0x000008, "Member 'MovieSystemDataBP_C_PushMovieSoundMixes::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PushMovieSoundMixes, CallFunc_Conv_NameToString_ReturnValue) == 0x000018, "Member 'MovieSystemDataBP_C_PushMovieSoundMixes::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PushMovieSoundMixes, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'MovieSystemDataBP_C_PushMovieSoundMixes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PushMovieSoundMixes, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000030, "Member 'MovieSystemDataBP_C_PushMovieSoundMixes::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PushMovieSoundMixes, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'MovieSystemDataBP_C_PushMovieSoundMixes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PushMovieSoundMixes, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000048, "Member 'MovieSystemDataBP_C_PushMovieSoundMixes::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PushMovieSoundMixes, Temp_int_Array_Index_Variable) == 0x000058, "Member 'MovieSystemDataBP_C_PushMovieSoundMixes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PushMovieSoundMixes, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000060, "Member 'MovieSystemDataBP_C_PushMovieSoundMixes::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PushMovieSoundMixes, CallFunc_Map_Find_Value) == 0x000070, "Member 'MovieSystemDataBP_C_PushMovieSoundMixes::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PushMovieSoundMixes, CallFunc_Map_Find_ReturnValue) == 0x000098, "Member 'MovieSystemDataBP_C_PushMovieSoundMixes::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PushMovieSoundMixes, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'MovieSystemDataBP_C_PushMovieSoundMixes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PushMovieSoundMixes, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'MovieSystemDataBP_C_PushMovieSoundMixes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PushMovieSoundMixes, CallFunc_IsValid_ReturnValue) == 0x0000AC, "Member 'MovieSystemDataBP_C_PushMovieSoundMixes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PushMovieSoundMixes, CallFunc_Less_IntInt_ReturnValue) == 0x0000AD, "Member 'MovieSystemDataBP_C_PushMovieSoundMixes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PushMovieSoundMixes, CallFunc_GetDisplayName_ReturnValue) == 0x0000B0, "Member 'MovieSystemDataBP_C_PushMovieSoundMixes::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_PushMovieSoundMixes, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000C0, "Member 'MovieSystemDataBP_C_PushMovieSoundMixes::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");

// Function MovieSystemDataBP.MovieSystemDataBP_C.ClearMovieSoundMixes
// 0x00D0 (0x00D0 - 0x0000)
struct MovieSystemDataBP_C_ClearMovieSoundMixes final
{
public:
	class FName                                   MovieCodeName;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULSoundSystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLMovieAudioSetting                    CallFunc_Map_Find_Value;                           // 0x0070(0x0028)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundMix*                              CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(MovieSystemDataBP_C_ClearMovieSoundMixes) == 0x000008, "Wrong alignment on MovieSystemDataBP_C_ClearMovieSoundMixes");
static_assert(sizeof(MovieSystemDataBP_C_ClearMovieSoundMixes) == 0x0000D0, "Wrong size on MovieSystemDataBP_C_ClearMovieSoundMixes");
static_assert(offsetof(MovieSystemDataBP_C_ClearMovieSoundMixes, MovieCodeName) == 0x000000, "Member 'MovieSystemDataBP_C_ClearMovieSoundMixes::MovieCodeName' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ClearMovieSoundMixes, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'MovieSystemDataBP_C_ClearMovieSoundMixes::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ClearMovieSoundMixes, CallFunc_Conv_NameToString_ReturnValue) == 0x000010, "Member 'MovieSystemDataBP_C_ClearMovieSoundMixes::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ClearMovieSoundMixes, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'MovieSystemDataBP_C_ClearMovieSoundMixes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ClearMovieSoundMixes, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'MovieSystemDataBP_C_ClearMovieSoundMixes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ClearMovieSoundMixes, Temp_int_Array_Index_Variable) == 0x000028, "Member 'MovieSystemDataBP_C_ClearMovieSoundMixes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ClearMovieSoundMixes, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'MovieSystemDataBP_C_ClearMovieSoundMixes::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ClearMovieSoundMixes, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000040, "Member 'MovieSystemDataBP_C_ClearMovieSoundMixes::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ClearMovieSoundMixes, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000050, "Member 'MovieSystemDataBP_C_ClearMovieSoundMixes::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ClearMovieSoundMixes, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000060, "Member 'MovieSystemDataBP_C_ClearMovieSoundMixes::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ClearMovieSoundMixes, CallFunc_Map_Find_Value) == 0x000070, "Member 'MovieSystemDataBP_C_ClearMovieSoundMixes::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ClearMovieSoundMixes, CallFunc_Map_Find_ReturnValue) == 0x000098, "Member 'MovieSystemDataBP_C_ClearMovieSoundMixes::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ClearMovieSoundMixes, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'MovieSystemDataBP_C_ClearMovieSoundMixes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ClearMovieSoundMixes, CallFunc_Array_Length_ReturnValue) == 0x0000A8, "Member 'MovieSystemDataBP_C_ClearMovieSoundMixes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ClearMovieSoundMixes, CallFunc_IsValid_ReturnValue) == 0x0000AC, "Member 'MovieSystemDataBP_C_ClearMovieSoundMixes::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ClearMovieSoundMixes, CallFunc_Less_IntInt_ReturnValue) == 0x0000AD, "Member 'MovieSystemDataBP_C_ClearMovieSoundMixes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ClearMovieSoundMixes, CallFunc_GetDisplayName_ReturnValue) == 0x0000B0, "Member 'MovieSystemDataBP_C_ClearMovieSoundMixes::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_ClearMovieSoundMixes, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000C0, "Member 'MovieSystemDataBP_C_ClearMovieSoundMixes::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");

// Function MovieSystemDataBP.MovieSystemDataBP_C.EndMoviePushSoundMixes
// 0x0058 (0x0058 - 0x0000)
struct MovieSystemDataBP_C_EndMoviePushSoundMixes final
{
public:
	class FName                                   MovieCodeName;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLMovieAudioSetting                    CallFunc_Map_Find_Value;                           // 0x0018(0x0028)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundMix*                              CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MovieSystemDataBP_C_EndMoviePushSoundMixes) == 0x000008, "Wrong alignment on MovieSystemDataBP_C_EndMoviePushSoundMixes");
static_assert(sizeof(MovieSystemDataBP_C_EndMoviePushSoundMixes) == 0x000058, "Wrong size on MovieSystemDataBP_C_EndMoviePushSoundMixes");
static_assert(offsetof(MovieSystemDataBP_C_EndMoviePushSoundMixes, MovieCodeName) == 0x000000, "Member 'MovieSystemDataBP_C_EndMoviePushSoundMixes::MovieCodeName' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_EndMoviePushSoundMixes, Temp_int_Array_Index_Variable) == 0x000008, "Member 'MovieSystemDataBP_C_EndMoviePushSoundMixes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_EndMoviePushSoundMixes, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'MovieSystemDataBP_C_EndMoviePushSoundMixes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_EndMoviePushSoundMixes, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'MovieSystemDataBP_C_EndMoviePushSoundMixes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_EndMoviePushSoundMixes, CallFunc_Map_Find_Value) == 0x000018, "Member 'MovieSystemDataBP_C_EndMoviePushSoundMixes::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_EndMoviePushSoundMixes, CallFunc_Map_Find_ReturnValue) == 0x000040, "Member 'MovieSystemDataBP_C_EndMoviePushSoundMixes::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_EndMoviePushSoundMixes, CallFunc_Array_Get_Item) == 0x000048, "Member 'MovieSystemDataBP_C_EndMoviePushSoundMixes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_EndMoviePushSoundMixes, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'MovieSystemDataBP_C_EndMoviePushSoundMixes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_EndMoviePushSoundMixes, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'MovieSystemDataBP_C_EndMoviePushSoundMixes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function MovieSystemDataBP.MovieSystemDataBP_C.IsPauseOnReachedEnd
// 0x0003 (0x0003 - 0x0000)
struct MovieSystemDataBP_C_IsPauseOnReachedEnd final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPauseOnReachedEnd_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MovieSystemDataBP_C_IsPauseOnReachedEnd) == 0x000001, "Wrong alignment on MovieSystemDataBP_C_IsPauseOnReachedEnd");
static_assert(sizeof(MovieSystemDataBP_C_IsPauseOnReachedEnd) == 0x000003, "Wrong size on MovieSystemDataBP_C_IsPauseOnReachedEnd");
static_assert(offsetof(MovieSystemDataBP_C_IsPauseOnReachedEnd, ReturnValue) == 0x000000, "Member 'MovieSystemDataBP_C_IsPauseOnReachedEnd::ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_IsPauseOnReachedEnd, CallFunc_IsPauseOnReachedEnd_ReturnValue) == 0x000001, "Member 'MovieSystemDataBP_C_IsPauseOnReachedEnd::CallFunc_IsPauseOnReachedEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(MovieSystemDataBP_C_IsPauseOnReachedEnd, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'MovieSystemDataBP_C_IsPauseOnReachedEnd::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function MovieSystemDataBP.MovieSystemDataBP_C.MovieSeekToLast
// 0x0001 (0x0001 - 0x0000)
struct MovieSystemDataBP_C_MovieSeekToLast final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MovieSystemDataBP_C_MovieSeekToLast) == 0x000001, "Wrong alignment on MovieSystemDataBP_C_MovieSeekToLast");
static_assert(sizeof(MovieSystemDataBP_C_MovieSeekToLast) == 0x000001, "Wrong size on MovieSystemDataBP_C_MovieSeekToLast");
static_assert(offsetof(MovieSystemDataBP_C_MovieSeekToLast, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'MovieSystemDataBP_C_MovieSeekToLast::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

