#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPCJumpSkill_Struct_Curve

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct NPCJumpSkill_Struct_Curve.NPCJumpSkill_Struct_Curve
// 0x0048 (0x0048 - 0x0000)
struct FNPCJumpSkill_Struct_Curve final
{
public:
	struct FVector                                Option_MeshMove_Offset_15_7FE07F2A45AFD20001704080AC87EEC2; // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Option_MeshMove_StartTime_16_63AAB3BD48748CFA7A8554AC59FB5345; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rootmotion_MoveDistance_17_5DD348294719D27674334DA0317F9917; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAnimSequenceBase*>              TargetAnimArray_14_49D51D6749C8BF364EAD63864FD9E71A; // 0x0018(0x0010)(Edit, BlueprintVisible)
	ELLandPositionSelectType                      LandPositionSelectType_20_FA765BC54161A5C4DE5FFBAABDEF7FC5; // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LandPositionSelectType_Offset_23_F9FBE7F54E6806F50BAE0DAE34EC3AED; // 0x002C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RootmotionScaleLimit_Horizontal_Min_32_FFBC79014420A1E633B10FB287229EB8; // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RootmotionScaleLimit_Horizontal_Max_33_E98C597A4BE7D8357170B28E38CBDC2F; // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RootmotionScaleLimit_Vertical_Min_34_2870D42440D558180F44B1B6B76D545B; // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RootmotionScaleLimit_Vertical_Max_35_CD2953764A025A47D6352293043F6238; // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FNPCJumpSkill_Struct_Curve) == 0x000008, "Wrong alignment on FNPCJumpSkill_Struct_Curve");
static_assert(sizeof(FNPCJumpSkill_Struct_Curve) == 0x000048, "Wrong size on FNPCJumpSkill_Struct_Curve");
static_assert(offsetof(FNPCJumpSkill_Struct_Curve, Option_MeshMove_Offset_15_7FE07F2A45AFD20001704080AC87EEC2) == 0x000000, "Member 'FNPCJumpSkill_Struct_Curve::Option_MeshMove_Offset_15_7FE07F2A45AFD20001704080AC87EEC2' has a wrong offset!");
static_assert(offsetof(FNPCJumpSkill_Struct_Curve, Option_MeshMove_StartTime_16_63AAB3BD48748CFA7A8554AC59FB5345) == 0x00000C, "Member 'FNPCJumpSkill_Struct_Curve::Option_MeshMove_StartTime_16_63AAB3BD48748CFA7A8554AC59FB5345' has a wrong offset!");
static_assert(offsetof(FNPCJumpSkill_Struct_Curve, Rootmotion_MoveDistance_17_5DD348294719D27674334DA0317F9917) == 0x000010, "Member 'FNPCJumpSkill_Struct_Curve::Rootmotion_MoveDistance_17_5DD348294719D27674334DA0317F9917' has a wrong offset!");
static_assert(offsetof(FNPCJumpSkill_Struct_Curve, TargetAnimArray_14_49D51D6749C8BF364EAD63864FD9E71A) == 0x000018, "Member 'FNPCJumpSkill_Struct_Curve::TargetAnimArray_14_49D51D6749C8BF364EAD63864FD9E71A' has a wrong offset!");
static_assert(offsetof(FNPCJumpSkill_Struct_Curve, LandPositionSelectType_20_FA765BC54161A5C4DE5FFBAABDEF7FC5) == 0x000028, "Member 'FNPCJumpSkill_Struct_Curve::LandPositionSelectType_20_FA765BC54161A5C4DE5FFBAABDEF7FC5' has a wrong offset!");
static_assert(offsetof(FNPCJumpSkill_Struct_Curve, LandPositionSelectType_Offset_23_F9FBE7F54E6806F50BAE0DAE34EC3AED) == 0x00002C, "Member 'FNPCJumpSkill_Struct_Curve::LandPositionSelectType_Offset_23_F9FBE7F54E6806F50BAE0DAE34EC3AED' has a wrong offset!");
static_assert(offsetof(FNPCJumpSkill_Struct_Curve, RootmotionScaleLimit_Horizontal_Min_32_FFBC79014420A1E633B10FB287229EB8) == 0x000038, "Member 'FNPCJumpSkill_Struct_Curve::RootmotionScaleLimit_Horizontal_Min_32_FFBC79014420A1E633B10FB287229EB8' has a wrong offset!");
static_assert(offsetof(FNPCJumpSkill_Struct_Curve, RootmotionScaleLimit_Horizontal_Max_33_E98C597A4BE7D8357170B28E38CBDC2F) == 0x00003C, "Member 'FNPCJumpSkill_Struct_Curve::RootmotionScaleLimit_Horizontal_Max_33_E98C597A4BE7D8357170B28E38CBDC2F' has a wrong offset!");
static_assert(offsetof(FNPCJumpSkill_Struct_Curve, RootmotionScaleLimit_Vertical_Min_34_2870D42440D558180F44B1B6B76D545B) == 0x000040, "Member 'FNPCJumpSkill_Struct_Curve::RootmotionScaleLimit_Vertical_Min_34_2870D42440D558180F44B1B6B76D545B' has a wrong offset!");
static_assert(offsetof(FNPCJumpSkill_Struct_Curve, RootmotionScaleLimit_Vertical_Max_35_CD2953764A025A47D6352293043F6238) == 0x000044, "Member 'FNPCJumpSkill_Struct_Curve::RootmotionScaleLimit_Vertical_Max_35_CD2953764A025A47D6352293043F6238' has a wrong offset!");

}

