#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ObjectPoolSystemDataBp

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ObjectPoolSystemDataBp.ObjectPoolSystemDataBp_C.ExecuteUbergraph_ObjectPoolSystemDataBp
// 0x0048 (0x0048 - 0x0000)
struct ObjectPoolSystemDataBp_C_ExecuteUbergraph_ObjectPoolSystemDataBp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   CallFunc_Conv_ClassToSoftClassReference_ReturnValue; // 0x0008(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class ULObjectPoolSystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULObjectPoolSystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ObjectPoolSystemDataBp_C_ExecuteUbergraph_ObjectPoolSystemDataBp) == 0x000008, "Wrong alignment on ObjectPoolSystemDataBp_C_ExecuteUbergraph_ObjectPoolSystemDataBp");
static_assert(sizeof(ObjectPoolSystemDataBp_C_ExecuteUbergraph_ObjectPoolSystemDataBp) == 0x000048, "Wrong size on ObjectPoolSystemDataBp_C_ExecuteUbergraph_ObjectPoolSystemDataBp");
static_assert(offsetof(ObjectPoolSystemDataBp_C_ExecuteUbergraph_ObjectPoolSystemDataBp, EntryPoint) == 0x000000, "Member 'ObjectPoolSystemDataBp_C_ExecuteUbergraph_ObjectPoolSystemDataBp::EntryPoint' has a wrong offset!");
static_assert(offsetof(ObjectPoolSystemDataBp_C_ExecuteUbergraph_ObjectPoolSystemDataBp, K2Node_Event_EndPlayReason) == 0x000004, "Member 'ObjectPoolSystemDataBp_C_ExecuteUbergraph_ObjectPoolSystemDataBp::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(ObjectPoolSystemDataBp_C_ExecuteUbergraph_ObjectPoolSystemDataBp, CallFunc_Conv_ClassToSoftClassReference_ReturnValue) == 0x000008, "Member 'ObjectPoolSystemDataBp_C_ExecuteUbergraph_ObjectPoolSystemDataBp::CallFunc_Conv_ClassToSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectPoolSystemDataBp_C_ExecuteUbergraph_ObjectPoolSystemDataBp, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'ObjectPoolSystemDataBp_C_ExecuteUbergraph_ObjectPoolSystemDataBp::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectPoolSystemDataBp_C_ExecuteUbergraph_ObjectPoolSystemDataBp, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000038, "Member 'ObjectPoolSystemDataBp_C_ExecuteUbergraph_ObjectPoolSystemDataBp::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ObjectPoolSystemDataBp_C_ExecuteUbergraph_ObjectPoolSystemDataBp, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'ObjectPoolSystemDataBp_C_ExecuteUbergraph_ObjectPoolSystemDataBp::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectPoolSystemDataBp_C_ExecuteUbergraph_ObjectPoolSystemDataBp, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'ObjectPoolSystemDataBp_C_ExecuteUbergraph_ObjectPoolSystemDataBp::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function ObjectPoolSystemDataBp.ObjectPoolSystemDataBp_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct ObjectPoolSystemDataBp_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ObjectPoolSystemDataBp_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on ObjectPoolSystemDataBp_C_ReceiveEndPlay");
static_assert(sizeof(ObjectPoolSystemDataBp_C_ReceiveEndPlay) == 0x000001, "Wrong size on ObjectPoolSystemDataBp_C_ReceiveEndPlay");
static_assert(offsetof(ObjectPoolSystemDataBp_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'ObjectPoolSystemDataBp_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function ObjectPoolSystemDataBp.ObjectPoolSystemDataBp_C.GetHeadtagWidget
// 0x0058 (0x0058 - 0x0000)
struct ObjectPoolSystemDataBp_C_GetHeadtagWidget final
{
public:
	class UUserWidget*                            OutHeadtagWidget;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULObjectPoolSystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CallFunc_Conv_ClassToSoftClassReference_ReturnValue; // 0x0010(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetRecyclableObject_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            K2Node_DynamicCast_AsUser_Widget;                  // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ObjectPoolSystemDataBp_C_GetHeadtagWidget) == 0x000008, "Wrong alignment on ObjectPoolSystemDataBp_C_GetHeadtagWidget");
static_assert(sizeof(ObjectPoolSystemDataBp_C_GetHeadtagWidget) == 0x000058, "Wrong size on ObjectPoolSystemDataBp_C_GetHeadtagWidget");
static_assert(offsetof(ObjectPoolSystemDataBp_C_GetHeadtagWidget, OutHeadtagWidget) == 0x000000, "Member 'ObjectPoolSystemDataBp_C_GetHeadtagWidget::OutHeadtagWidget' has a wrong offset!");
static_assert(offsetof(ObjectPoolSystemDataBp_C_GetHeadtagWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'ObjectPoolSystemDataBp_C_GetHeadtagWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectPoolSystemDataBp_C_GetHeadtagWidget, CallFunc_Conv_ClassToSoftClassReference_ReturnValue) == 0x000010, "Member 'ObjectPoolSystemDataBp_C_GetHeadtagWidget::CallFunc_Conv_ClassToSoftClassReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectPoolSystemDataBp_C_GetHeadtagWidget, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'ObjectPoolSystemDataBp_C_GetHeadtagWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectPoolSystemDataBp_C_GetHeadtagWidget, CallFunc_GetRecyclableObject_ReturnValue) == 0x000040, "Member 'ObjectPoolSystemDataBp_C_GetHeadtagWidget::CallFunc_GetRecyclableObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectPoolSystemDataBp_C_GetHeadtagWidget, K2Node_DynamicCast_AsUser_Widget) == 0x000048, "Member 'ObjectPoolSystemDataBp_C_GetHeadtagWidget::K2Node_DynamicCast_AsUser_Widget' has a wrong offset!");
static_assert(offsetof(ObjectPoolSystemDataBp_C_GetHeadtagWidget, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'ObjectPoolSystemDataBp_C_GetHeadtagWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ObjectPoolSystemDataBp.ObjectPoolSystemDataBp_C.RemoveHeadtagWidget
// 0x0018 (0x0018 - 0x0000)
struct ObjectPoolSystemDataBp_C_RemoveHeadtagWidget final
{
public:
	class UUserWidget*                            HeadTagWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULObjectPoolSystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ReturnToRecyclingBin_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ObjectPoolSystemDataBp_C_RemoveHeadtagWidget) == 0x000008, "Wrong alignment on ObjectPoolSystemDataBp_C_RemoveHeadtagWidget");
static_assert(sizeof(ObjectPoolSystemDataBp_C_RemoveHeadtagWidget) == 0x000018, "Wrong size on ObjectPoolSystemDataBp_C_RemoveHeadtagWidget");
static_assert(offsetof(ObjectPoolSystemDataBp_C_RemoveHeadtagWidget, HeadTagWidget) == 0x000000, "Member 'ObjectPoolSystemDataBp_C_RemoveHeadtagWidget::HeadTagWidget' has a wrong offset!");
static_assert(offsetof(ObjectPoolSystemDataBp_C_RemoveHeadtagWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'ObjectPoolSystemDataBp_C_RemoveHeadtagWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectPoolSystemDataBp_C_RemoveHeadtagWidget, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'ObjectPoolSystemDataBp_C_RemoveHeadtagWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ObjectPoolSystemDataBp_C_RemoveHeadtagWidget, CallFunc_ReturnToRecyclingBin_ReturnValue) == 0x000011, "Member 'ObjectPoolSystemDataBp_C_RemoveHeadtagWidget::CallFunc_ReturnToRecyclingBin_ReturnValue' has a wrong offset!");

}

