#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PABP_Pino_01_Body

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KawaiiPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass PABP_Pino_01_Body.PABP_Pino_01_Body_C
// 0x1D310 (0x1D5D0 - 0x02C0)
class UPABP_Pino_01_Body_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x02F8(0x0118)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0410(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0430(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_52;                    // 0x0450(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_51;                    // 0x0CF0(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_50;                    // 0x1590(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_49;                    // 0x1E30(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_48;                    // 0x26D0(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_47;                    // 0x2F70(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_46;                    // 0x3810(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_45;                    // 0x40B0(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_44;                    // 0x4950(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_43;                    // 0x51F0(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_42;                    // 0x5A90(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_41;                    // 0x6330(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_40;                    // 0x6BD0(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_39;                    // 0x7470(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_38;                    // 0x7D10(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_37;                    // 0x85B0(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_36;                    // 0x8E50(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_35;                    // 0x96F0(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_34;                    // 0x9F90(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_33;                    // 0xA830(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_32;                    // 0xB0D0(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_31;                    // 0xB970(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_30;                    // 0xC210(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_29;                    // 0xCAB0(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_28;                    // 0xD350(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_27;                    // 0xDBF0(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_26;                    // 0xE490(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_25;                    // 0xED30(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_24;                    // 0xF5D0(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_23;                    // 0xFE70(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_22;                    // 0x10710(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_21;                    // 0x10FB0(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_20;                    // 0x11850(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_19;                    // 0x120F0(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_18;                    // 0x12990(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_17;                    // 0x13230(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_16;                    // 0x13AD0(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0x14370(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0x14C10(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x154B0(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x15D50(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x165F0(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x16E90(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x17730(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x17FD0(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x18870(0x08A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x19110(0x0108)()
	uint8                                         Pad_19218[0x8];                                    // 0x19218(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x19220(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x19AC0(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x1A360(0x08A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x1AC00(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x1AD08(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x1AE10(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x1AF18(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1B020(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1B128(0x0108)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x1B230(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x1BAD0(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x1C370(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x1CC10(0x08A0)()
	struct FKawaiiPhysicsSettings                 KP_Robe_Default;                                   // 0x1D4B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 KP_ACC_Default;                                    // 0x1D4C8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 KP_Helmet_Cat;                                     // 0x1D4E0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 KP_Helmet_WhiteLady;                               // 0x1D4F8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 KP_Helmet_WhiteLady_02;                            // 0x1D510(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 KP_Helmet_Weasel_01;                               // 0x1D528(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 KP_Helmet_Weasel_02;                               // 0x1D540(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 KP_Helmet_Donkey;                                  // 0x1D558(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 KP_Helmet_FestivalLeader;                          // 0x1D570(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 KP_Helmet_Alidoro_Rope;                            // 0x1D588(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 KP_Helmet_Alidoro;                                 // 0x1D5A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 KP_GuanYu_helmet;                                  // 0x1D5B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_PABP_Pino_01_Body(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PABP_Pino_01_Body_C">();
	}
	static class UPABP_Pino_01_Body_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPABP_Pino_01_Body_C>();
	}
};
static_assert(alignof(UPABP_Pino_01_Body_C) == 0x000010, "Wrong alignment on UPABP_Pino_01_Body_C");
static_assert(sizeof(UPABP_Pino_01_Body_C) == 0x01D5D0, "Wrong size on UPABP_Pino_01_Body_C");
static_assert(offsetof(UPABP_Pino_01_Body_C, UberGraphFrame) == 0x0002C0, "Member 'UPABP_Pino_01_Body_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_LinkedInputPose) == 0x0002F8, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_LocalToComponentSpace) == 0x000410, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_ComponentToLocalSpace) == 0x000430, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_52) == 0x000450, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_52' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_51) == 0x000CF0, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_51' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_50) == 0x001590, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_50' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_49) == 0x001E30, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_49' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_48) == 0x0026D0, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_48' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_47) == 0x002F70, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_47' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_46) == 0x003810, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_46' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_45) == 0x0040B0, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_45' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_44) == 0x004950, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_44' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_43) == 0x0051F0, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_43' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_42) == 0x005A90, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_42' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_41) == 0x006330, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_41' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_40) == 0x006BD0, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_40' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_39) == 0x007470, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_39' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_38) == 0x007D10, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_38' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_37) == 0x0085B0, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_37' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_36) == 0x008E50, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_36' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_35) == 0x0096F0, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_35' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_34) == 0x009F90, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_34' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_33) == 0x00A830, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_33' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_32) == 0x00B0D0, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_32' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_31) == 0x00B970, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_31' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_30) == 0x00C210, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_30' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_29) == 0x00CAB0, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_29' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_28) == 0x00D350, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_28' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_27) == 0x00DBF0, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_27' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_26) == 0x00E490, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_26' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_25) == 0x00ED30, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_25' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_24) == 0x00F5D0, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_24' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_23) == 0x00FE70, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_23' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_22) == 0x010710, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_22' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_21) == 0x010FB0, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_21' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_20) == 0x011850, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_20' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_19) == 0x0120F0, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_19' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_18) == 0x012990, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_18' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_17) == 0x013230, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_17' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_16) == 0x013AD0, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_16' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_15) == 0x014370, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_15' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_14) == 0x014C10, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_14' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_13) == 0x0154B0, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_13' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_12) == 0x015D50, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_12' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_11) == 0x0165F0, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_11' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_10) == 0x016E90, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_10' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_9) == 0x017730, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_9' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_8) == 0x017FD0, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_8' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_7) == 0x018870, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_ModifyBone_6) == 0x019110, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_6) == 0x019220, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_5) == 0x019AC0, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_4) == 0x01A360, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_ModifyBone_5) == 0x01AC00, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_ModifyBone_4) == 0x01AD08, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_ModifyBone_3) == 0x01AE10, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_ModifyBone_2) == 0x01AF18, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_ModifyBone_1) == 0x01B020, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_ModifyBone) == 0x01B128, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_3) == 0x01B230, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_2) == 0x01BAD0, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics_1) == 0x01C370, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, AnimGraphNode_KawaiiPhysics) == 0x01CC10, "Member 'UPABP_Pino_01_Body_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, KP_Robe_Default) == 0x01D4B0, "Member 'UPABP_Pino_01_Body_C::KP_Robe_Default' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, KP_ACC_Default) == 0x01D4C8, "Member 'UPABP_Pino_01_Body_C::KP_ACC_Default' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, KP_Helmet_Cat) == 0x01D4E0, "Member 'UPABP_Pino_01_Body_C::KP_Helmet_Cat' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, KP_Helmet_WhiteLady) == 0x01D4F8, "Member 'UPABP_Pino_01_Body_C::KP_Helmet_WhiteLady' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, KP_Helmet_WhiteLady_02) == 0x01D510, "Member 'UPABP_Pino_01_Body_C::KP_Helmet_WhiteLady_02' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, KP_Helmet_Weasel_01) == 0x01D528, "Member 'UPABP_Pino_01_Body_C::KP_Helmet_Weasel_01' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, KP_Helmet_Weasel_02) == 0x01D540, "Member 'UPABP_Pino_01_Body_C::KP_Helmet_Weasel_02' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, KP_Helmet_Donkey) == 0x01D558, "Member 'UPABP_Pino_01_Body_C::KP_Helmet_Donkey' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, KP_Helmet_FestivalLeader) == 0x01D570, "Member 'UPABP_Pino_01_Body_C::KP_Helmet_FestivalLeader' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, KP_Helmet_Alidoro_Rope) == 0x01D588, "Member 'UPABP_Pino_01_Body_C::KP_Helmet_Alidoro_Rope' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, KP_Helmet_Alidoro) == 0x01D5A0, "Member 'UPABP_Pino_01_Body_C::KP_Helmet_Alidoro' has a wrong offset!");
static_assert(offsetof(UPABP_Pino_01_Body_C, KP_GuanYu_helmet) == 0x01D5B8, "Member 'UPABP_Pino_01_Body_C::KP_GuanYu_helmet' has a wrong offset!");

}

