#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PABP_Stalker_Exile

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PABP_Stalker_Exile.PABP_Stalker_Exile_C.ExecuteUbergraph_PABP_Stalker_Exile
// 0x0004 (0x0004 - 0x0000)
struct PABP_Stalker_Exile_C_ExecuteUbergraph_PABP_Stalker_Exile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PABP_Stalker_Exile_C_ExecuteUbergraph_PABP_Stalker_Exile) == 0x000004, "Wrong alignment on PABP_Stalker_Exile_C_ExecuteUbergraph_PABP_Stalker_Exile");
static_assert(sizeof(PABP_Stalker_Exile_C_ExecuteUbergraph_PABP_Stalker_Exile) == 0x000004, "Wrong size on PABP_Stalker_Exile_C_ExecuteUbergraph_PABP_Stalker_Exile");
static_assert(offsetof(PABP_Stalker_Exile_C_ExecuteUbergraph_PABP_Stalker_Exile, EntryPoint) == 0x000000, "Member 'PABP_Stalker_Exile_C_ExecuteUbergraph_PABP_Stalker_Exile::EntryPoint' has a wrong offset!");

// Function PABP_Stalker_Exile.PABP_Stalker_Exile_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct PABP_Stalker_Exile_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(PABP_Stalker_Exile_C_AnimGraph) == 0x000008, "Wrong alignment on PABP_Stalker_Exile_C_AnimGraph");
static_assert(sizeof(PABP_Stalker_Exile_C_AnimGraph) == 0x000020, "Wrong size on PABP_Stalker_Exile_C_AnimGraph");
static_assert(offsetof(PABP_Stalker_Exile_C_AnimGraph, InPose) == 0x000000, "Member 'PABP_Stalker_Exile_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(PABP_Stalker_Exile_C_AnimGraph, AnimGraph_0) == 0x000010, "Member 'PABP_Stalker_Exile_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

