#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProjectPContentInfo

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK
{

// Class ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UAbnormalStateCommonInfoFuncLibrary final : public UObject
{
public:
	static ELAbnormalBuffDebuffType GetAbstateBuffdebuffType(const struct FAbnormalStateCommonInfo& Info);
	static ELAbnormalAbstateClass GetAbstateClass(const struct FAbnormalStateCommonInfo& Info);
	static const TArray<struct FActionStateType> GetActionStateArray(const struct FAbnormalStateCommonInfo& Info);
	static ELAbnormalActivation GetActivationType(const struct FAbnormalStateCommonInfo& Info);
	static bool GetApplyBuildUpRecoverIncrease(const struct FAbnormalStateCommonInfo& Info);
	static bool GetApplyDurationPenalty(const struct FAbnormalStateCommonInfo& Info);
	static bool GetApplyTickPenalty(const struct FAbnormalStateCommonInfo& Info);
	static const class FName GetAttachActionCommand(const struct FAbnormalStateCommonInfo& Info);
	static bool GetAttachFxAllWeapon(const struct FAbnormalStateCommonInfo& Info);
	static const class FName GetAttachFxCodeName(const struct FAbnormalStateCommonInfo& Info);
	static const class FName GetAttachFxSocket(const struct FAbnormalStateCommonInfo& Info);
	static const TSoftObjectPtr<class UObject> GetAttachMotion(const struct FAbnormalStateCommonInfo& Info);
	static const class FName GetAuraAbnormalCodeName(const struct FAbnormalStateCommonInfo& Info);
	static ELAuraNPCKindType GetAuraNpcKind(const struct FAbnormalStateCommonInfo& Info);
	static int32 GetAuraRadius(const struct FAbnormalStateCommonInfo& Info);
	static int32 GetBuildUpAttack(const struct FAbnormalStateCommonInfo& Info);
	static ELBuildupGuardType GetBuildUpAttackGuardType(const struct FAbnormalStateCommonInfo& Info);
	static int32 GetBuildUpAttackModify(const struct FAbnormalStateCommonInfo& Info);
	static float GetBuildUpRecoverDelayOverride(const struct FAbnormalStateCommonInfo& Info);
	static float GetBuildUpRecoverOverride(const struct FAbnormalStateCommonInfo& Info);
	static const class FName GetCodeName(const struct FAbnormalStateCommonInfo& Info);
	static const class FName GetContentconditionCodeName(const struct FAbnormalStateCommonInfo& Info);
	static int32 GetDecreaseFrenzyPointPerSecond(const struct FAbnormalStateCommonInfo& Info);
	static const class FName GetDetachFxCodeName(const struct FAbnormalStateCommonInfo& Info);
	static const class FName GetDetachFxSocket(const struct FAbnormalStateCommonInfo& Info);
	static const TSoftObjectPtr<class UObject> GetDetachMotion(const struct FAbnormalStateCommonInfo& Info);
	static const class FName GetDisableContentconditionCodeName(const struct FAbnormalStateCommonInfo& Info);
	static int32 GetDuration(const struct FAbnormalStateCommonInfo& Info);
	static ELAbnormalCSCalcType GetDurationModifyCalType(const struct FAbnormalStateCommonInfo& Info);
	static const class FName GetDurationModifyMoment(const struct FAbnormalStateCommonInfo& Info);
	static ELStateEffectTargetType GetDurationModifyMomentTarget(const struct FAbnormalStateCommonInfo& Info);
	static int32 GetDurationModifyValue(const struct FAbnormalStateCommonInfo& Info);
	static ELAbnormalEnchantType GetEnchantSdType(const struct FAbnormalStateCommonInfo& Info);
	static const class FName GetGroupCodeName(const struct FAbnormalStateCommonInfo& Info);
	static const class FName GetHumanizationBuffAlterCodeName(const struct FAbnormalStateCommonInfo& Info);
	static const TSoftObjectPtr<class UObject> GetIconResource(const struct FAbnormalStateCommonInfo& Info);
	static bool GetIgnoreSensitiveRange(const struct FAbnormalStateCommonInfo& Info);
	static bool GetIsFableBuff(const struct FAbnormalStateCommonInfo& Info);
	static bool GetIsWeaponEnchant(const struct FAbnormalStateCommonInfo& Info);
	static bool GetKeepDead(const struct FAbnormalStateCommonInfo& Info);
	static bool GetKeepLogout(const struct FAbnormalStateCommonInfo& Info);
	static bool GetKeepRespawn(const struct FAbnormalStateCommonInfo& Info);
	static const class FName GetLoopFxCodeName(const struct FAbnormalStateCommonInfo& Info);
	static const class FName GetLoopFxSocket(const struct FAbnormalStateCommonInfo& Info);
	static const TSoftObjectPtr<class UObject> GetLoopMotion(const struct FAbnormalStateCommonInfo& Info);
	static const class FName GetMaterialFxCodeName(const struct FAbnormalStateCommonInfo& Info);
	static const class FName GetMomentconditionCodeName(const struct FAbnormalStateCommonInfo& Info);
	static int32 GetMomentconditionCount(const struct FAbnormalStateCommonInfo& Info);
	static int32 GetMomentconditionProbability(const struct FAbnormalStateCommonInfo& Info);
	static ELStateEffectTargetType GetMomentconditionTarget(const struct FAbnormalStateCommonInfo& Info);
	static class FString GetName(const struct FAbnormalStateCommonInfo& Info);
	static const class FName GetNameCn(const struct FAbnormalStateCommonInfo& Info);
	static class FText GetNameLocalize(const struct FAbnormalStateCommonInfo& Info);
	static int32 GetPriority(const struct FAbnormalStateCommonInfo& Info);
	static int32 GetPriorityGroupId(const struct FAbnormalStateCommonInfo& Info);
	static bool GetShowUi(const struct FAbnormalStateCommonInfo& Info);
	static ELAbnormalStackType GetStackType(const struct FAbnormalStateCommonInfo& Info);
	static int32 GetTick(const struct FAbnormalStateCommonInfo& Info);
	static const class FName GetTimeoutBuffCodeName(const struct FAbnormalStateCommonInfo& Info);
	static class FString GetTooltip(const struct FAbnormalStateCommonInfo& Info);
	static const class FName GetTooltipCn(const struct FAbnormalStateCommonInfo& Info);
	static class FText GetTooltipLocalize(const struct FAbnormalStateCommonInfo& Info);
	static const class FName GetVaryingFxCodeName(const struct FAbnormalStateCommonInfo& Info);
	static ELWeaponPartType GetWeaponAnimPartsType(const struct FAbnormalStateCommonInfo& Info);
	static const class FName GetWeaponAnimState(const struct FAbnormalStateCommonInfo& Info);
	static const class FName GetWeaponAnimStateExit(const struct FAbnormalStateCommonInfo& Info);
	static ELWeaponAttachPointType GetWeaponAttachPointType(const struct FAbnormalStateCommonInfo& Info);
	static ELElementDamageType GetWeaponElementOverride(const struct FAbnormalStateCommonInfo& Info);
	static const class FName GetWeaponMaterialFxCodeName(const struct FAbnormalStateCommonInfo& Info);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbnormalStateCommonInfoFuncLibrary">();
	}
	static class UAbnormalStateCommonInfoFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbnormalStateCommonInfoFuncLibrary>();
	}
};
static_assert(alignof(UAbnormalStateCommonInfoFuncLibrary) == 0x000008, "Wrong alignment on UAbnormalStateCommonInfoFuncLibrary");
static_assert(sizeof(UAbnormalStateCommonInfoFuncLibrary) == 0x000028, "Wrong size on UAbnormalStateCommonInfoFuncLibrary");

// Class ProjectPContentInfo.WorldZoneInfoPtrFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UWorldZoneInfoPtrFuncLibrary final : public UObject
{
public:
	static const class FName GetCodeName(const struct FWorldZoneInfoPtr& Ptr);
	static const class FName GetLightScenarioAm(const struct FWorldZoneInfoPtr& Ptr);
	static const class FName GetLightScenarioPm(const struct FWorldZoneInfoPtr& Ptr);
	static bool IsValid(const struct FWorldZoneInfoPtr& Ptr);
	static void IsValidBranch(const struct FWorldZoneInfoPtr& Ptr, EContentInfoExecutePin* Branches);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WorldZoneInfoPtrFuncLibrary">();
	}
	static class UWorldZoneInfoPtrFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWorldZoneInfoPtrFuncLibrary>();
	}
};
static_assert(alignof(UWorldZoneInfoPtrFuncLibrary) == 0x000008, "Wrong alignment on UWorldZoneInfoPtrFuncLibrary");
static_assert(sizeof(UWorldZoneInfoPtrFuncLibrary) == 0x000028, "Wrong size on UWorldZoneInfoPtrFuncLibrary");

// Class ProjectPContentInfo.AbnormalStateCommonInfoPtrFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UAbnormalStateCommonInfoPtrFuncLibrary final : public UObject
{
public:
	static ELAbnormalBuffDebuffType GetAbstateBuffdebuffType(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static ELAbnormalAbstateClass GetAbstateClass(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const TArray<struct FActionStateType> GetActionStateArray(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static ELAbnormalActivation GetActivationType(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static bool GetApplyBuildUpRecoverIncrease(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static bool GetApplyDurationPenalty(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static bool GetApplyTickPenalty(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const class FName GetAttachActionCommand(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static bool GetAttachFxAllWeapon(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const class FName GetAttachFxCodeName(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const class FName GetAttachFxSocket(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const TSoftObjectPtr<class UObject> GetAttachMotion(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const class FName GetAuraAbnormalCodeName(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static ELAuraNPCKindType GetAuraNpcKind(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static int32 GetAuraRadius(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static int32 GetBuildUpAttack(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static ELBuildupGuardType GetBuildUpAttackGuardType(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static int32 GetBuildUpAttackModify(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static float GetBuildUpRecoverDelayOverride(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static float GetBuildUpRecoverOverride(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const class FName GetCodeName(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const class FName GetContentconditionCodeName(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static int32 GetDecreaseFrenzyPointPerSecond(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const class FName GetDetachFxCodeName(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const class FName GetDetachFxSocket(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const TSoftObjectPtr<class UObject> GetDetachMotion(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const class FName GetDisableContentconditionCodeName(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static int32 GetDuration(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static ELAbnormalCSCalcType GetDurationModifyCalType(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const class FName GetDurationModifyMoment(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static ELStateEffectTargetType GetDurationModifyMomentTarget(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static int32 GetDurationModifyValue(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static ELAbnormalEnchantType GetEnchantSdType(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const class FName GetGroupCodeName(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const class FName GetHumanizationBuffAlterCodeName(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const TSoftObjectPtr<class UObject> GetIconResource(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static bool GetIgnoreSensitiveRange(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static bool GetIsFableBuff(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static bool GetIsWeaponEnchant(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static bool GetKeepDead(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static bool GetKeepLogout(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static bool GetKeepRespawn(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const class FName GetLoopFxCodeName(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const class FName GetLoopFxSocket(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const TSoftObjectPtr<class UObject> GetLoopMotion(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const class FName GetMaterialFxCodeName(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const class FName GetMomentconditionCodeName(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static int32 GetMomentconditionCount(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static int32 GetMomentconditionProbability(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static ELStateEffectTargetType GetMomentconditionTarget(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static class FString GetName(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const class FName GetNameCn(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static class FText GetNameLocalize(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static int32 GetPriority(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static int32 GetPriorityGroupId(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static bool GetShowUi(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static ELAbnormalStackType GetStackType(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static int32 GetTick(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const class FName GetTimeoutBuffCodeName(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static class FString GetTooltip(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const class FName GetTooltipCn(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static class FText GetTooltipLocalize(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const class FName GetVaryingFxCodeName(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static ELWeaponPartType GetWeaponAnimPartsType(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const class FName GetWeaponAnimState(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const class FName GetWeaponAnimStateExit(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static ELWeaponAttachPointType GetWeaponAttachPointType(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static ELElementDamageType GetWeaponElementOverride(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static const class FName GetWeaponMaterialFxCodeName(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static bool IsValid(const struct FAbnormalStateCommonInfoPtr& Ptr);
	static void IsValidBranch(const struct FAbnormalStateCommonInfoPtr& Ptr, EContentInfoExecutePin* Branches);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbnormalStateCommonInfoPtrFuncLibrary">();
	}
	static class UAbnormalStateCommonInfoPtrFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbnormalStateCommonInfoPtrFuncLibrary>();
	}
};
static_assert(alignof(UAbnormalStateCommonInfoPtrFuncLibrary) == 0x000008, "Wrong alignment on UAbnormalStateCommonInfoPtrFuncLibrary");
static_assert(sizeof(UAbnormalStateCommonInfoPtrFuncLibrary) == 0x000028, "Wrong size on UAbnormalStateCommonInfoPtrFuncLibrary");

// Class ProjectPContentInfo.AbnormalStateChangeStatusInfoFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UAbnormalStateChangeStatusInfoFuncLibrary final : public UObject
{
public:
	static ELAbnormalCSCalcType GetCalculateType(const struct FAbnormalStateChangeStatusInfo& Info);
	static const class FName GetCodeName(const struct FAbnormalStateChangeStatusInfo& Info);
	static ELSecondStat GetMulAddBaseStatCodeName(const struct FAbnormalStateChangeStatusInfo& Info);
	static ELFirstStat GetTargetFirstStatCodeName(const struct FAbnormalStateChangeStatusInfo& Info);
	static ELSecondStat GetTargetStatCodeName(const struct FAbnormalStateChangeStatusInfo& Info);
	static int32 GetValue(const struct FAbnormalStateChangeStatusInfo& Info);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbnormalStateChangeStatusInfoFuncLibrary">();
	}
	static class UAbnormalStateChangeStatusInfoFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbnormalStateChangeStatusInfoFuncLibrary>();
	}
};
static_assert(alignof(UAbnormalStateChangeStatusInfoFuncLibrary) == 0x000008, "Wrong alignment on UAbnormalStateChangeStatusInfoFuncLibrary");
static_assert(sizeof(UAbnormalStateChangeStatusInfoFuncLibrary) == 0x000028, "Wrong size on UAbnormalStateChangeStatusInfoFuncLibrary");

// Class ProjectPContentInfo.ContentInfoAsset
// 0x0050 (0x0078 - 0x0028)
#pragma pack(push, 0x1)
class alignas(0x08) UContentInfoAsset : public UObject
{
public:
	uint8                                         Pad_28[0x50];                                      // 0x0028(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ContentInfoAsset">();
	}
	static class UContentInfoAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContentInfoAsset>();
	}
};
#pragma pack(pop)
static_assert(alignof(UContentInfoAsset) == 0x000008, "Wrong alignment on UContentInfoAsset");
static_assert(sizeof(UContentInfoAsset) == 0x000078, "Wrong size on UContentInfoAsset");

// Class ProjectPContentInfo.SkillInfoAsset
// 0x00A8 (0x0120 - 0x0078)
class alignas(0x10) USkillInfoAsset final : public UContentInfoAsset
{
public:
	struct FSkillInfoDB                           ContentInfoDB;                                     // 0x0078(0x00A0)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static struct FSkillInfoPtr FindSkillInfoByNameBP(class FName CodeName);
	static const TArray<struct FSkillInfo> GetSkillInfoArrayBP();
	static void StaticParseInfo();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SkillInfoAsset">();
	}
	static class USkillInfoAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<USkillInfoAsset>();
	}
};
static_assert(alignof(USkillInfoAsset) == 0x000010, "Wrong alignment on USkillInfoAsset");
static_assert(sizeof(USkillInfoAsset) == 0x000120, "Wrong size on USkillInfoAsset");
static_assert(offsetof(USkillInfoAsset, ContentInfoDB) == 0x000078, "Member 'USkillInfoAsset::ContentInfoDB' has a wrong offset!");

// Class ProjectPContentInfo.AbnormalStateChangeStatusInfoPtrFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UAbnormalStateChangeStatusInfoPtrFuncLibrary final : public UObject
{
public:
	static ELAbnormalCSCalcType GetCalculateType(const struct FAbnormalStateChangeStatusInfoPtr& Ptr);
	static const class FName GetCodeName(const struct FAbnormalStateChangeStatusInfoPtr& Ptr);
	static ELSecondStat GetMulAddBaseStatCodeName(const struct FAbnormalStateChangeStatusInfoPtr& Ptr);
	static ELFirstStat GetTargetFirstStatCodeName(const struct FAbnormalStateChangeStatusInfoPtr& Ptr);
	static ELSecondStat GetTargetStatCodeName(const struct FAbnormalStateChangeStatusInfoPtr& Ptr);
	static int32 GetValue(const struct FAbnormalStateChangeStatusInfoPtr& Ptr);
	static bool IsValid(const struct FAbnormalStateChangeStatusInfoPtr& Ptr);
	static void IsValidBranch(const struct FAbnormalStateChangeStatusInfoPtr& Ptr, EContentInfoExecutePin* Branches);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbnormalStateChangeStatusInfoPtrFuncLibrary">();
	}
	static class UAbnormalStateChangeStatusInfoPtrFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbnormalStateChangeStatusInfoPtrFuncLibrary>();
	}
};
static_assert(alignof(UAbnormalStateChangeStatusInfoPtrFuncLibrary) == 0x000008, "Wrong alignment on UAbnormalStateChangeStatusInfoPtrFuncLibrary");
static_assert(sizeof(UAbnormalStateChangeStatusInfoPtrFuncLibrary) == 0x000028, "Wrong size on UAbnormalStateChangeStatusInfoPtrFuncLibrary");

// Class ProjectPContentInfo.AbnormalStateDamageHealInfoFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UAbnormalStateDamageHealInfoFuncLibrary final : public UObject
{
public:
	static const class FName GetAbnormalStateCodeName(const struct FAbnormalStateDamageHealInfo& Info);
	static bool GetApplyRateDotReduce(const struct FAbnormalStateDamageHealInfo& Info);
	static ELAbnormalDHCalcType GetCalculateType(const struct FAbnormalStateDamageHealInfo& Info);
	static const class FName GetCodeName(const struct FAbnormalStateDamageHealInfo& Info);
	static int32 GetNGPDetailIndex(const struct FAbnormalStateDamageHealInfo& Info);
	static ELSecondStat GetRateBaseStatCodeName(const struct FAbnormalStateDamageHealInfo& Info);
	static ELAbnormalDamageHealTargetType GetTargetType(const struct FAbnormalStateDamageHealInfo& Info);
	static int32 GetValue(const struct FAbnormalStateDamageHealInfo& Info);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbnormalStateDamageHealInfoFuncLibrary">();
	}
	static class UAbnormalStateDamageHealInfoFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbnormalStateDamageHealInfoFuncLibrary>();
	}
};
static_assert(alignof(UAbnormalStateDamageHealInfoFuncLibrary) == 0x000008, "Wrong alignment on UAbnormalStateDamageHealInfoFuncLibrary");
static_assert(sizeof(UAbnormalStateDamageHealInfoFuncLibrary) == 0x000028, "Wrong size on UAbnormalStateDamageHealInfoFuncLibrary");

// Class ProjectPContentInfo.AbnormalStateDamageHealInfoPtrFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UAbnormalStateDamageHealInfoPtrFuncLibrary final : public UObject
{
public:
	static const class FName GetAbnormalStateCodeName(const struct FAbnormalStateDamageHealInfoPtr& Ptr);
	static bool GetApplyRateDotReduce(const struct FAbnormalStateDamageHealInfoPtr& Ptr);
	static ELAbnormalDHCalcType GetCalculateType(const struct FAbnormalStateDamageHealInfoPtr& Ptr);
	static const class FName GetCodeName(const struct FAbnormalStateDamageHealInfoPtr& Ptr);
	static int32 GetNGPDetailIndex(const struct FAbnormalStateDamageHealInfoPtr& Ptr);
	static ELSecondStat GetRateBaseStatCodeName(const struct FAbnormalStateDamageHealInfoPtr& Ptr);
	static ELAbnormalDamageHealTargetType GetTargetType(const struct FAbnormalStateDamageHealInfoPtr& Ptr);
	static int32 GetValue(const struct FAbnormalStateDamageHealInfoPtr& Ptr);
	static bool IsValid(const struct FAbnormalStateDamageHealInfoPtr& Ptr);
	static void IsValidBranch(const struct FAbnormalStateDamageHealInfoPtr& Ptr, EContentInfoExecutePin* Branches);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbnormalStateDamageHealInfoPtrFuncLibrary">();
	}
	static class UAbnormalStateDamageHealInfoPtrFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbnormalStateDamageHealInfoPtrFuncLibrary>();
	}
};
static_assert(alignof(UAbnormalStateDamageHealInfoPtrFuncLibrary) == 0x000008, "Wrong alignment on UAbnormalStateDamageHealInfoPtrFuncLibrary");
static_assert(sizeof(UAbnormalStateDamageHealInfoPtrFuncLibrary) == 0x000028, "Wrong size on UAbnormalStateDamageHealInfoPtrFuncLibrary");

// Class ProjectPContentInfo.ItemPackageInfoAsset
// 0x00A8 (0x0120 - 0x0078)
class alignas(0x10) UItemPackageInfoAsset final : public UContentInfoAsset
{
public:
	struct FItemPackageInfoDB                     ContentInfoDB;                                     // 0x0078(0x00A0)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static struct FItemPackageInfoPtr FindItemPackageInfoByNameBP(class FName CodeName);
	static const TArray<struct FItemPackageInfo> GetItemPackageInfoArrayBP();
	static void StaticParseInfo();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemPackageInfoAsset">();
	}
	static class UItemPackageInfoAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemPackageInfoAsset>();
	}
};
static_assert(alignof(UItemPackageInfoAsset) == 0x000010, "Wrong alignment on UItemPackageInfoAsset");
static_assert(sizeof(UItemPackageInfoAsset) == 0x000120, "Wrong size on UItemPackageInfoAsset");
static_assert(offsetof(UItemPackageInfoAsset, ContentInfoDB) == 0x000078, "Member 'UItemPackageInfoAsset::ContentInfoDB' has a wrong offset!");

// Class ProjectPContentInfo.AbnormalStateAttackInfoFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UAbnormalStateAttackInfoFuncLibrary final : public UObject
{
public:
	static ELAbnormalAttackType GetAttackType(const struct FAbnormalStateAttackInfo& Info);
	static ELAbnormalACalcType GetCalculateType(const struct FAbnormalStateAttackInfo& Info);
	static const class FName GetCodeName(const struct FAbnormalStateAttackInfo& Info);
	static ELSecondStat GetMulBaseStatCodeName(const struct FAbnormalStateAttackInfo& Info);
	static int32 GetNGPDetailIndex(const struct FAbnormalStateAttackInfo& Info);
	static int32 GetValue(const struct FAbnormalStateAttackInfo& Info);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbnormalStateAttackInfoFuncLibrary">();
	}
	static class UAbnormalStateAttackInfoFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbnormalStateAttackInfoFuncLibrary>();
	}
};
static_assert(alignof(UAbnormalStateAttackInfoFuncLibrary) == 0x000008, "Wrong alignment on UAbnormalStateAttackInfoFuncLibrary");
static_assert(sizeof(UAbnormalStateAttackInfoFuncLibrary) == 0x000028, "Wrong size on UAbnormalStateAttackInfoFuncLibrary");

// Class ProjectPContentInfo.AbnormalStateAttackInfoPtrFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UAbnormalStateAttackInfoPtrFuncLibrary final : public UObject
{
public:
	static ELAbnormalAttackType GetAttackType(const struct FAbnormalStateAttackInfoPtr& Ptr);
	static ELAbnormalACalcType GetCalculateType(const struct FAbnormalStateAttackInfoPtr& Ptr);
	static const class FName GetCodeName(const struct FAbnormalStateAttackInfoPtr& Ptr);
	static ELSecondStat GetMulBaseStatCodeName(const struct FAbnormalStateAttackInfoPtr& Ptr);
	static int32 GetNGPDetailIndex(const struct FAbnormalStateAttackInfoPtr& Ptr);
	static int32 GetValue(const struct FAbnormalStateAttackInfoPtr& Ptr);
	static bool IsValid(const struct FAbnormalStateAttackInfoPtr& Ptr);
	static void IsValidBranch(const struct FAbnormalStateAttackInfoPtr& Ptr, EContentInfoExecutePin* Branches);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbnormalStateAttackInfoPtrFuncLibrary">();
	}
	static class UAbnormalStateAttackInfoPtrFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbnormalStateAttackInfoPtrFuncLibrary>();
	}
};
static_assert(alignof(UAbnormalStateAttackInfoPtrFuncLibrary) == 0x000008, "Wrong alignment on UAbnormalStateAttackInfoPtrFuncLibrary");
static_assert(sizeof(UAbnormalStateAttackInfoPtrFuncLibrary) == 0x000028, "Wrong size on UAbnormalStateAttackInfoPtrFuncLibrary");

// Class ProjectPContentInfo.ImageResourceInfoAsset
// 0x00A8 (0x0120 - 0x0078)
class alignas(0x10) UImageResourceInfoAsset final : public UContentInfoAsset
{
public:
	struct FImageResourceInfoDB                   ContentInfoDB;                                     // 0x0078(0x00A0)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static struct FImageResourceInfoPtr FindImageResourceInfoByNameBP(class FName CodeName);
	static const TArray<struct FImageResourceInfo> GetImageResourceInfoArrayBP();
	static void StaticParseInfo();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ImageResourceInfoAsset">();
	}
	static class UImageResourceInfoAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UImageResourceInfoAsset>();
	}
};
static_assert(alignof(UImageResourceInfoAsset) == 0x000010, "Wrong alignment on UImageResourceInfoAsset");
static_assert(sizeof(UImageResourceInfoAsset) == 0x000120, "Wrong size on UImageResourceInfoAsset");
static_assert(offsetof(UImageResourceInfoAsset, ContentInfoDB) == 0x000078, "Member 'UImageResourceInfoAsset::ContentInfoDB' has a wrong offset!");

// Class ProjectPContentInfo.AbnormalStateChainInfoFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UAbnormalStateChainInfoFuncLibrary final : public UObject
{
public:
	static const class FName GetAbnormalStateCodeName1(const struct FAbnormalStateChainInfo& Info);
	static const class FName GetAbnormalStateCodeName2(const struct FAbnormalStateChainInfo& Info);
	static const class FName GetAbnormalStateCodeNameResult(const struct FAbnormalStateChainInfo& Info);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbnormalStateChainInfoFuncLibrary">();
	}
	static class UAbnormalStateChainInfoFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbnormalStateChainInfoFuncLibrary>();
	}
};
static_assert(alignof(UAbnormalStateChainInfoFuncLibrary) == 0x000008, "Wrong alignment on UAbnormalStateChainInfoFuncLibrary");
static_assert(sizeof(UAbnormalStateChainInfoFuncLibrary) == 0x000028, "Wrong size on UAbnormalStateChainInfoFuncLibrary");

// Class ProjectPContentInfo.AbnormalStateChainInfoPtrFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UAbnormalStateChainInfoPtrFuncLibrary final : public UObject
{
public:
	static const class FName GetAbnormalStateCodeName1(const struct FAbnormalStateChainInfoPtr& Ptr);
	static const class FName GetAbnormalStateCodeName2(const struct FAbnormalStateChainInfoPtr& Ptr);
	static const class FName GetAbnormalStateCodeNameResult(const struct FAbnormalStateChainInfoPtr& Ptr);
	static bool IsValid(const struct FAbnormalStateChainInfoPtr& Ptr);
	static void IsValidBranch(const struct FAbnormalStateChainInfoPtr& Ptr, EContentInfoExecutePin* Branches);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbnormalStateChainInfoPtrFuncLibrary">();
	}
	static class UAbnormalStateChainInfoPtrFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbnormalStateChainInfoPtrFuncLibrary>();
	}
};
static_assert(alignof(UAbnormalStateChainInfoPtrFuncLibrary) == 0x000008, "Wrong alignment on UAbnormalStateChainInfoPtrFuncLibrary");
static_assert(sizeof(UAbnormalStateChainInfoPtrFuncLibrary) == 0x000028, "Wrong size on UAbnormalStateChainInfoPtrFuncLibrary");

// Class ProjectPContentInfo.LoadingScreenInfoFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class ULoadingScreenInfoFuncLibrary final : public UObject
{
public:
	static const class FName GetCodeName(const struct FLoadingScreenInfo& Info);
	static ELConditionLoadingType GetConditionLoadingType(const struct FLoadingScreenInfo& Info);
	static class FString GetConditionNextChapter(const struct FLoadingScreenInfo& Info);
	static const class FName GetConditionQuest(const struct FLoadingScreenInfo& Info);
	static const TArray<class FName> GetFirstDrawChainTip(const struct FLoadingScreenInfo& Info);
	static bool GetFirstDrawPriority(const struct FLoadingScreenInfo& Info);
	static const class FName GetImageCodeName(const struct FLoadingScreenInfo& Info);
	static bool GetResetConditionNewGamePlus(const struct FLoadingScreenInfo& Info);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LoadingScreenInfoFuncLibrary">();
	}
	static class ULoadingScreenInfoFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoadingScreenInfoFuncLibrary>();
	}
};
static_assert(alignof(ULoadingScreenInfoFuncLibrary) == 0x000008, "Wrong alignment on ULoadingScreenInfoFuncLibrary");
static_assert(sizeof(ULoadingScreenInfoFuncLibrary) == 0x000028, "Wrong size on ULoadingScreenInfoFuncLibrary");

// Class ProjectPContentInfo.AbnormalStateExecInfoFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UAbnormalStateExecInfoFuncLibrary final : public UObject
{
public:
	static const class FName GetCodeName(const struct FAbnormalStateExecInfo& Info);
	static ELAbnormalExecType GetExecType(const struct FAbnormalStateExecInfo& Info);
	static class FString GetParam1(const struct FAbnormalStateExecInfo& Info);
	static class FString GetParam2(const struct FAbnormalStateExecInfo& Info);
	static class FString GetParam3(const struct FAbnormalStateExecInfo& Info);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbnormalStateExecInfoFuncLibrary">();
	}
	static class UAbnormalStateExecInfoFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbnormalStateExecInfoFuncLibrary>();
	}
};
static_assert(alignof(UAbnormalStateExecInfoFuncLibrary) == 0x000008, "Wrong alignment on UAbnormalStateExecInfoFuncLibrary");
static_assert(sizeof(UAbnormalStateExecInfoFuncLibrary) == 0x000028, "Wrong size on UAbnormalStateExecInfoFuncLibrary");

// Class ProjectPContentInfo.AbnormalStateExecInfoPtrFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UAbnormalStateExecInfoPtrFuncLibrary final : public UObject
{
public:
	static const class FName GetCodeName(const struct FAbnormalStateExecInfoPtr& Ptr);
	static ELAbnormalExecType GetExecType(const struct FAbnormalStateExecInfoPtr& Ptr);
	static class FString GetParam1(const struct FAbnormalStateExecInfoPtr& Ptr);
	static class FString GetParam2(const struct FAbnormalStateExecInfoPtr& Ptr);
	static class FString GetParam3(const struct FAbnormalStateExecInfoPtr& Ptr);
	static bool IsValid(const struct FAbnormalStateExecInfoPtr& Ptr);
	static void IsValidBranch(const struct FAbnormalStateExecInfoPtr& Ptr, EContentInfoExecutePin* Branches);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbnormalStateExecInfoPtrFuncLibrary">();
	}
	static class UAbnormalStateExecInfoPtrFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbnormalStateExecInfoPtrFuncLibrary>();
	}
};
static_assert(alignof(UAbnormalStateExecInfoPtrFuncLibrary) == 0x000008, "Wrong alignment on UAbnormalStateExecInfoPtrFuncLibrary");
static_assert(sizeof(UAbnormalStateExecInfoPtrFuncLibrary) == 0x000028, "Wrong size on UAbnormalStateExecInfoPtrFuncLibrary");

// Class ProjectPContentInfo.ItemPackageInfoFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UItemPackageInfoFuncLibrary final : public UObject
{
public:
	static const class FName GetCodeName(const struct FItemPackageInfo& Info);
	static bool GetIsExist(const struct FItemPackageInfo& Info);
	static const class FName GetItem1CodeName(const struct FItemPackageInfo& Info);
	static int32 GetItem1Count(const struct FItemPackageInfo& Info);
	static const class FName GetItem2CodeName(const struct FItemPackageInfo& Info);
	static int32 GetItem2Count(const struct FItemPackageInfo& Info);
	static const class FName GetItem3CodeName(const struct FItemPackageInfo& Info);
	static int32 GetItem3Count(const struct FItemPackageInfo& Info);
	static const class FName GetItem4CodeName(const struct FItemPackageInfo& Info);
	static int32 GetItem4Count(const struct FItemPackageInfo& Info);
	static const class FName GetItem5CodeName(const struct FItemPackageInfo& Info);
	static int32 GetItem5Count(const struct FItemPackageInfo& Info);
	static const class FName GetItem6CodeName(const struct FItemPackageInfo& Info);
	static int32 GetItem6Count(const struct FItemPackageInfo& Info);
	static const class FName GetNGPLink1(const struct FItemPackageInfo& Info);
	static const class FName GetNGPLink2(const struct FItemPackageInfo& Info);
	static const class FName GetNGPLink3(const struct FItemPackageInfo& Info);
	static const class FName GetNGPLink4(const struct FItemPackageInfo& Info);
	static int32 GetNGPRoundForLink1(const struct FItemPackageInfo& Info);
	static int32 GetNGPRoundForLink2(const struct FItemPackageInfo& Info);
	static int32 GetNGPRoundForLink3(const struct FItemPackageInfo& Info);
	static int32 GetNGPRoundForLink4(const struct FItemPackageInfo& Info);
	static const class FName GetSpotCodeName(const struct FItemPackageInfo& Info);
	static const class FName GetWeaponItem1Blade(const struct FItemPackageInfo& Info);
	static const class FName GetWeaponItem1Handle(const struct FItemPackageInfo& Info);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ItemPackageInfoFuncLibrary">();
	}
	static class UItemPackageInfoFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UItemPackageInfoFuncLibrary>();
	}
};
static_assert(alignof(UItemPackageInfoFuncLibrary) == 0x000008, "Wrong alignment on UItemPackageInfoFuncLibrary");
static_assert(sizeof(UItemPackageInfoFuncLibrary) == 0x000028, "Wrong size on UItemPackageInfoFuncLibrary");

// Class ProjectPContentInfo.AbnormalStateReplaceEffectInfoFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UAbnormalStateReplaceEffectInfoFuncLibrary final : public UObject
{
public:
	static int32 GetChkStackNum(const struct FAbnormalStateReplaceEffectInfo& Info);
	static const class FName GetCodeName(const struct FAbnormalStateReplaceEffectInfo& Info);
	static const class FName GetLoopFxCodeName(const struct FAbnormalStateReplaceEffectInfo& Info);
	static const TSoftObjectPtr<class UObject> GetLoopMotion(const struct FAbnormalStateReplaceEffectInfo& Info);
	static class FString GetMaterialFxCodeName(const struct FAbnormalStateReplaceEffectInfo& Info);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbnormalStateReplaceEffectInfoFuncLibrary">();
	}
	static class UAbnormalStateReplaceEffectInfoFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbnormalStateReplaceEffectInfoFuncLibrary>();
	}
};
static_assert(alignof(UAbnormalStateReplaceEffectInfoFuncLibrary) == 0x000008, "Wrong alignment on UAbnormalStateReplaceEffectInfoFuncLibrary");
static_assert(sizeof(UAbnormalStateReplaceEffectInfoFuncLibrary) == 0x000028, "Wrong size on UAbnormalStateReplaceEffectInfoFuncLibrary");

// Class ProjectPContentInfo.AbnormalStateReplaceEffectInfoPtrFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UAbnormalStateReplaceEffectInfoPtrFuncLibrary final : public UObject
{
public:
	static int32 GetChkStackNum(const struct FAbnormalStateReplaceEffectInfoPtr& Ptr);
	static const class FName GetCodeName(const struct FAbnormalStateReplaceEffectInfoPtr& Ptr);
	static const class FName GetLoopFxCodeName(const struct FAbnormalStateReplaceEffectInfoPtr& Ptr);
	static const TSoftObjectPtr<class UObject> GetLoopMotion(const struct FAbnormalStateReplaceEffectInfoPtr& Ptr);
	static class FString GetMaterialFxCodeName(const struct FAbnormalStateReplaceEffectInfoPtr& Ptr);
	static bool IsValid(const struct FAbnormalStateReplaceEffectInfoPtr& Ptr);
	static void IsValidBranch(const struct FAbnormalStateReplaceEffectInfoPtr& Ptr, EContentInfoExecutePin* Branches);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbnormalStateReplaceEffectInfoPtrFuncLibrary">();
	}
	static class UAbnormalStateReplaceEffectInfoPtrFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbnormalStateReplaceEffectInfoPtrFuncLibrary>();
	}
};
static_assert(alignof(UAbnormalStateReplaceEffectInfoPtrFuncLibrary) == 0x000008, "Wrong alignment on UAbnormalStateReplaceEffectInfoPtrFuncLibrary");
static_assert(sizeof(UAbnormalStateReplaceEffectInfoPtrFuncLibrary) == 0x000028, "Wrong size on UAbnormalStateReplaceEffectInfoPtrFuncLibrary");

// Class ProjectPContentInfo.ImageResourceInfoFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UImageResourceInfoFuncLibrary final : public UObject
{
public:
	static const class FName GetCodeName(const struct FImageResourceInfo& Info);
	static const TSoftObjectPtr<class UObject> GetImageResource(const struct FImageResourceInfo& Info);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ImageResourceInfoFuncLibrary">();
	}
	static class UImageResourceInfoFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UImageResourceInfoFuncLibrary>();
	}
};
static_assert(alignof(UImageResourceInfoFuncLibrary) == 0x000008, "Wrong alignment on UImageResourceInfoFuncLibrary");
static_assert(sizeof(UImageResourceInfoFuncLibrary) == 0x000028, "Wrong size on UImageResourceInfoFuncLibrary");

// Class ProjectPContentInfo.AbnormalStateInfoAsset
// 0x0108 (0x0180 - 0x0078)
class alignas(0x10) UAbnormalStateInfoAsset final : public UContentInfoAsset
{
public:
	struct FAbnormalStateInfoDB                   ContentInfoDB;                                     // 0x0078(0x0100)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static struct FAbnormalStateCommonInfoPtr FindAbnormalStateCommonInfoByNameBP(class FName CodeName);
	static const TArray<struct FAbnormalStateAttackInfo> GetAbnormalStateAttackInfoArrayBP();
	static const TArray<struct FAbnormalStateChainInfo> GetAbnormalStateChainInfoArrayBP();
	static const TArray<struct FAbnormalStateChangeStatusInfo> GetAbnormalStateChangeStatusInfoArrayBP();
	static const TArray<struct FAbnormalStateCommonInfo> GetAbnormalStateCommonInfoArrayBP();
	static const TArray<struct FAbnormalStateDamageHealInfo> GetAbnormalStateDamageHealInfoArrayBP();
	static const TArray<struct FAbnormalStateExecInfo> GetAbnormalStateExecInfoArrayBP();
	static const TArray<struct FAbnormalStateReplaceEffectInfo> GetAbnormalStateReplaceEffectInfoArrayBP();
	static void StaticParseInfo();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AbnormalStateInfoAsset">();
	}
	static class UAbnormalStateInfoAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbnormalStateInfoAsset>();
	}
};
static_assert(alignof(UAbnormalStateInfoAsset) == 0x000010, "Wrong alignment on UAbnormalStateInfoAsset");
static_assert(sizeof(UAbnormalStateInfoAsset) == 0x000180, "Wrong size on UAbnormalStateInfoAsset");
static_assert(offsetof(UAbnormalStateInfoAsset, ContentInfoDB) == 0x000078, "Member 'UAbnormalStateInfoAsset::ContentInfoDB' has a wrong offset!");

// Class ProjectPContentInfo.GeneralConditionInfoFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UGeneralConditionInfoFuncLibrary final : public UObject
{
public:
	static ELConditionCompareType GetConditionType(const struct FGeneralConditionInfo& Info);
	static class FString GetParam1(const struct FGeneralConditionInfo& Info);
	static class FString GetParam2(const struct FGeneralConditionInfo& Info);
	static class FString GetParam3(const struct FGeneralConditionInfo& Info);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"GeneralConditionInfoFuncLibrary">();
	}
	static class UGeneralConditionInfoFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGeneralConditionInfoFuncLibrary>();
	}
};
static_assert(alignof(UGeneralConditionInfoFuncLibrary) == 0x000008, "Wrong alignment on UGeneralConditionInfoFuncLibrary");
static_assert(sizeof(UGeneralConditionInfoFuncLibrary) == 0x000028, "Wrong size on UGeneralConditionInfoFuncLibrary");

// Class ProjectPContentInfo.AchievementListInfoFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UAchievementListInfoFuncLibrary final : public UObject
{
public:
	static ELAchieveGradeType GetAchieveGrade(const struct FAchievementListInfo& Info);
	static int32 GetActivityIndex(const struct FAchievementListInfo& Info);
	static const class FName GetCodeName(const struct FAchievementListInfo& Info);
	static int32 GetDelayTime(const struct FAchievementListInfo& Info);
	static int32 GetGamerScore(const struct FAchievementListInfo& Info);
	static const TSoftObjectPtr<class UObject> GetImageResource(const struct FAchievementListInfo& Info);
	static class FString GetLocalTextAchieveDetails(const struct FAchievementListInfo& Info);
	static const class FName GetLocalTextAchieveDetailsCn(const struct FAchievementListInfo& Info);
	static class FText GetLocalTextAchieveDetailsLocalize(const struct FAchievementListInfo& Info);
	static class FString GetLocalTextAchieveName(const struct FAchievementListInfo& Info);
	static const class FName GetLocalTextAchieveNameCn(const struct FAchievementListInfo& Info);
	static class FText GetLocalTextAchieveNameLocalize(const struct FAchievementListInfo& Info);
	static class FString GetPlatformKey(const struct FAchievementListInfo& Info);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AchievementListInfoFuncLibrary">();
	}
	static class UAchievementListInfoFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAchievementListInfoFuncLibrary>();
	}
};
static_assert(alignof(UAchievementListInfoFuncLibrary) == 0x000008, "Wrong alignment on UAchievementListInfoFuncLibrary");
static_assert(sizeof(UAchievementListInfoFuncLibrary) == 0x000028, "Wrong size on UAchievementListInfoFuncLibrary");

// Class ProjectPContentInfo.AchievementListInfoPtrFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UAchievementListInfoPtrFuncLibrary final : public UObject
{
public:
	static ELAchieveGradeType GetAchieveGrade(const struct FAchievementListInfoPtr& Ptr);
	static int32 GetActivityIndex(const struct FAchievementListInfoPtr& Ptr);
	static const class FName GetCodeName(const struct FAchievementListInfoPtr& Ptr);
	static int32 GetDelayTime(const struct FAchievementListInfoPtr& Ptr);
	static int32 GetGamerScore(const struct FAchievementListInfoPtr& Ptr);
	static const TSoftObjectPtr<class UObject> GetImageResource(const struct FAchievementListInfoPtr& Ptr);
	static class FString GetLocalTextAchieveDetails(const struct FAchievementListInfoPtr& Ptr);
	static const class FName GetLocalTextAchieveDetailsCn(const struct FAchievementListInfoPtr& Ptr);
	static class FText GetLocalTextAchieveDetailsLocalize(const struct FAchievementListInfoPtr& Ptr);
	static class FString GetLocalTextAchieveName(const struct FAchievementListInfoPtr& Ptr);
	static const class FName GetLocalTextAchieveNameCn(const struct FAchievementListInfoPtr& Ptr);
	static class FText GetLocalTextAchieveNameLocalize(const struct FAchievementListInfoPtr& Ptr);
	static class FString GetPlatformKey(const struct FAchievementListInfoPtr& Ptr);
	static bool IsValid(const struct FAchievementListInfoPtr& Ptr);
	static void IsValidBranch(const struct FAchievementListInfoPtr& Ptr, EContentInfoExecutePin* Branches);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AchievementListInfoPtrFuncLibrary">();
	}
	static class UAchievementListInfoPtrFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAchievementListInfoPtrFuncLibrary>();
	}
};
static_assert(alignof(UAchievementListInfoPtrFuncLibrary) == 0x000008, "Wrong alignment on UAchievementListInfoPtrFuncLibrary");
static_assert(sizeof(UAchievementListInfoPtrFuncLibrary) == 0x000028, "Wrong size on UAchievementListInfoPtrFuncLibrary");

// Class ProjectPContentInfo.ImmuneInfoPtrFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UImmuneInfoPtrFuncLibrary final : public UObject
{
public:
	static const class FName GetCodeName(const struct FImmuneInfoPtr& Ptr);
	static float GetCriticalChance(const struct FImmuneInfoPtr& Ptr);
	static int32 GetDamage(const struct FImmuneInfoPtr& Ptr);
	static int32 GetElementalDamage(const struct FImmuneInfoPtr& Ptr);
	static int32 GetGroggyAttack(const struct FImmuneInfoPtr& Ptr);
	static int32 GetHitActionDmgStand(const struct FImmuneInfoPtr& Ptr);
	static int32 GetHitActionDownAwayUp(const struct FImmuneInfoPtr& Ptr);
	static int32 GetHitActionDownDragStamp(const struct FImmuneInfoPtr& Ptr);
	static int32 GetHitActionGrab(const struct FImmuneInfoPtr& Ptr);
	static int32 GetHitActionKnockBack(const struct FImmuneInfoPtr& Ptr);
	static int32 GetIgnoreHit(const struct FImmuneInfoPtr& Ptr);
	static int32 GetSpecialElementalDamage(const struct FImmuneInfoPtr& Ptr);
	static int32 GetToughAttack(const struct FImmuneInfoPtr& Ptr);
	static int32 GetWeaponAttackPeriod(const struct FImmuneInfoPtr& Ptr);
	static bool IsValid(const struct FImmuneInfoPtr& Ptr);
	static void IsValidBranch(const struct FImmuneInfoPtr& Ptr, EContentInfoExecutePin* Branches);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ImmuneInfoPtrFuncLibrary">();
	}
	static class UImmuneInfoPtrFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UImmuneInfoPtrFuncLibrary>();
	}
};
static_assert(alignof(UImmuneInfoPtrFuncLibrary) == 0x000008, "Wrong alignment on UImmuneInfoPtrFuncLibrary");
static_assert(sizeof(UImmuneInfoPtrFuncLibrary) == 0x000028, "Wrong size on UImmuneInfoPtrFuncLibrary");

// Class ProjectPContentInfo.AchievementDetailInfoFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UAchievementDetailInfoFuncLibrary final : public UObject
{
public:
	static class FString GetCallbackEventParam(const struct FAchievementDetailInfo& Info);
	static class FString GetCallbackEventParam2(const struct FAchievementDetailInfo& Info);
	static ELCallBackEventType GetCallbackEventType(const struct FAchievementDetailInfo& Info);
	static const class FName GetCodeName(const struct FAchievementDetailInfo& Info);
	static int32 GetDetailIndex(const struct FAchievementDetailInfo& Info);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AchievementDetailInfoFuncLibrary">();
	}
	static class UAchievementDetailInfoFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAchievementDetailInfoFuncLibrary>();
	}
};
static_assert(alignof(UAchievementDetailInfoFuncLibrary) == 0x000008, "Wrong alignment on UAchievementDetailInfoFuncLibrary");
static_assert(sizeof(UAchievementDetailInfoFuncLibrary) == 0x000028, "Wrong size on UAchievementDetailInfoFuncLibrary");

// Class ProjectPContentInfo.AchievementDetailInfoPtrFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UAchievementDetailInfoPtrFuncLibrary final : public UObject
{
public:
	static class FString GetCallbackEventParam(const struct FAchievementDetailInfoPtr& Ptr);
	static class FString GetCallbackEventParam2(const struct FAchievementDetailInfoPtr& Ptr);
	static ELCallBackEventType GetCallbackEventType(const struct FAchievementDetailInfoPtr& Ptr);
	static const class FName GetCodeName(const struct FAchievementDetailInfoPtr& Ptr);
	static int32 GetDetailIndex(const struct FAchievementDetailInfoPtr& Ptr);
	static bool IsValid(const struct FAchievementDetailInfoPtr& Ptr);
	static void IsValidBranch(const struct FAchievementDetailInfoPtr& Ptr, EContentInfoExecutePin* Branches);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AchievementDetailInfoPtrFuncLibrary">();
	}
	static class UAchievementDetailInfoPtrFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAchievementDetailInfoPtrFuncLibrary>();
	}
};
static_assert(alignof(UAchievementDetailInfoPtrFuncLibrary) == 0x000008, "Wrong alignment on UAchievementDetailInfoPtrFuncLibrary");
static_assert(sizeof(UAchievementDetailInfoPtrFuncLibrary) == 0x000028, "Wrong size on UAchievementDetailInfoPtrFuncLibrary");

// Class ProjectPContentInfo.HumanizationBuffAlterInfoPtrFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UHumanizationBuffAlterInfoPtrFuncLibrary final : public UObject
{
public:
	static const class FName GetAlterAbnormalCodeName(const struct FHumanizationBuffAlterInfoPtr& Ptr);
	static const class FName GetAlterSpecialbuffCodeName(const struct FHumanizationBuffAlterInfoPtr& Ptr);
	static const class FName GetCodeName(const struct FHumanizationBuffAlterInfoPtr& Ptr);
	static int32 GetHumanpointUnder(const struct FHumanizationBuffAlterInfoPtr& Ptr);
	static bool IsValid(const struct FHumanizationBuffAlterInfoPtr& Ptr);
	static void IsValidBranch(const struct FHumanizationBuffAlterInfoPtr& Ptr, EContentInfoExecutePin* Branches);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HumanizationBuffAlterInfoPtrFuncLibrary">();
	}
	static class UHumanizationBuffAlterInfoPtrFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHumanizationBuffAlterInfoPtrFuncLibrary>();
	}
};
static_assert(alignof(UHumanizationBuffAlterInfoPtrFuncLibrary) == 0x000008, "Wrong alignment on UHumanizationBuffAlterInfoPtrFuncLibrary");
static_assert(sizeof(UHumanizationBuffAlterInfoPtrFuncLibrary) == 0x000028, "Wrong size on UHumanizationBuffAlterInfoPtrFuncLibrary");

// Class ProjectPContentInfo.AchievementInfoAsset
// 0x00B8 (0x0130 - 0x0078)
class alignas(0x10) UAchievementInfoAsset final : public UContentInfoAsset
{
public:
	struct FAchievementInfoDB                     ContentInfoDB;                                     // 0x0078(0x00B0)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_128[0x8];                                      // 0x0128(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static struct FAchievementListInfoPtr FindAchievementListInfoByNameBP(class FName CodeName);
	static const TArray<struct FAchievementDetailInfo> GetAchievementDetailInfoArrayBP();
	static const TArray<struct FAchievementListInfo> GetAchievementListInfoArrayBP();
	static void StaticParseInfo();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AchievementInfoAsset">();
	}
	static class UAchievementInfoAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAchievementInfoAsset>();
	}
};
static_assert(alignof(UAchievementInfoAsset) == 0x000010, "Wrong alignment on UAchievementInfoAsset");
static_assert(sizeof(UAchievementInfoAsset) == 0x000130, "Wrong size on UAchievementInfoAsset");
static_assert(offsetof(UAchievementInfoAsset, ContentInfoDB) == 0x000078, "Member 'UAchievementInfoAsset::ContentInfoDB' has a wrong offset!");

// Class ProjectPContentInfo.ActionClassInfoFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UActionClassInfoFuncLibrary final : public UObject
{
public:
	static const TSoftClassPtr<class UClass> GetActionClass(const struct FActionClassInfo& Info);
	static const class FName GetCodeName(const struct FActionClassInfo& Info);
	static bool GetDisableFatalAttack(const struct FActionClassInfo& Info);
	static bool GetImmediatelyCancelByDie(const struct FActionClassInfo& Info);
	static const class FName GetImmuneCodeName(const struct FActionClassInfo& Info);
	static bool GetPreload(const struct FActionClassInfo& Info);
	static ELActionCategory GetSystemCategory(const struct FActionClassInfo& Info);
	static bool GetUseHeadLookAt(const struct FActionClassInfo& Info);
	static bool GetUseUpperbodyLookAt(const struct FActionClassInfo& Info);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActionClassInfoFuncLibrary">();
	}
	static class UActionClassInfoFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActionClassInfoFuncLibrary>();
	}
};
static_assert(alignof(UActionClassInfoFuncLibrary) == 0x000008, "Wrong alignment on UActionClassInfoFuncLibrary");
static_assert(sizeof(UActionClassInfoFuncLibrary) == 0x000028, "Wrong size on UActionClassInfoFuncLibrary");

// Class ProjectPContentInfo.FloatRangeValueFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UFloatRangeValueFuncLibrary final : public UObject
{
public:
	static float GetMax(const struct FFloatRangeValue& Info);
	static float GetMin(const struct FFloatRangeValue& Info);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"FloatRangeValueFuncLibrary">();
	}
	static class UFloatRangeValueFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFloatRangeValueFuncLibrary>();
	}
};
static_assert(alignof(UFloatRangeValueFuncLibrary) == 0x000008, "Wrong alignment on UFloatRangeValueFuncLibrary");
static_assert(sizeof(UFloatRangeValueFuncLibrary) == 0x000028, "Wrong size on UFloatRangeValueFuncLibrary");

// Class ProjectPContentInfo.ActionClassInfoPtrFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UActionClassInfoPtrFuncLibrary final : public UObject
{
public:
	static const TSoftClassPtr<class UClass> GetActionClass(const struct FActionClassInfoPtr& Ptr);
	static const class FName GetCodeName(const struct FActionClassInfoPtr& Ptr);
	static bool GetDisableFatalAttack(const struct FActionClassInfoPtr& Ptr);
	static bool GetImmediatelyCancelByDie(const struct FActionClassInfoPtr& Ptr);
	static const class FName GetImmuneCodeName(const struct FActionClassInfoPtr& Ptr);
	static bool GetPreload(const struct FActionClassInfoPtr& Ptr);
	static ELActionCategory GetSystemCategory(const struct FActionClassInfoPtr& Ptr);
	static bool GetUseHeadLookAt(const struct FActionClassInfoPtr& Ptr);
	static bool GetUseUpperbodyLookAt(const struct FActionClassInfoPtr& Ptr);
	static bool IsValid(const struct FActionClassInfoPtr& Ptr);
	static void IsValidBranch(const struct FActionClassInfoPtr& Ptr, EContentInfoExecutePin* Branches);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActionClassInfoPtrFuncLibrary">();
	}
	static class UActionClassInfoPtrFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActionClassInfoPtrFuncLibrary>();
	}
};
static_assert(alignof(UActionClassInfoPtrFuncLibrary) == 0x000008, "Wrong alignment on UActionClassInfoPtrFuncLibrary");
static_assert(sizeof(UActionClassInfoPtrFuncLibrary) == 0x000028, "Wrong size on UActionClassInfoPtrFuncLibrary");

// Class ProjectPContentInfo.ActionClassInfoAsset
// 0x00A8 (0x0120 - 0x0078)
class alignas(0x10) UActionClassInfoAsset final : public UContentInfoAsset
{
public:
	struct FActionClassInfoDB                     ContentInfoDB;                                     // 0x0078(0x00A0)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static struct FActionClassInfoPtr FindActionClassInfoByNameBP(class FName CodeName);
	static const TArray<struct FActionClassInfo> GetActionClassInfoArrayBP();
	static void StaticParseInfo();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ActionClassInfoAsset">();
	}
	static class UActionClassInfoAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActionClassInfoAsset>();
	}
};
static_assert(alignof(UActionClassInfoAsset) == 0x000010, "Wrong alignment on UActionClassInfoAsset");
static_assert(sizeof(UActionClassInfoAsset) == 0x000120, "Wrong size on UActionClassInfoAsset");
static_assert(offsetof(UActionClassInfoAsset, ContentInfoDB) == 0x000078, "Member 'UActionClassInfoAsset::ContentInfoDB' has a wrong offset!");

// Class ProjectPContentInfo.PackageSettingInfoFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class UPackageSettingInfoFuncLibrary final : public UObject
{
public:
	static int32 GetAcquisitionDelayMs(const struct FPackageSettingInfo& Info);
	static int32 GetAcquisitionPercentage(const struct FPackageSettingInfo& Info);
	static TArray<int32> GetDropOffset(const struct FPackageSettingInfo& Info);
	static class FString GetFirstKillPackageConfigureCodename(const struct FPackageSettingInfo& Info);
	static ELFirstKillRewardType GetFirstKillRewardType(const struct FPackageSettingInfo& Info);
	static bool GetForceAcquisition(const struct FPackageSettingInfo& Info);
	static EPackageOfferMethodType GetOfferMethod(const struct FPackageSettingInfo& Info);
	static EPackageOfferReasonType GetOfferReason(const struct FPackageSettingInfo& Info);
	static const class FName GetOwnerId(const struct FPackageSettingInfo& Info);
	static EPackageOwnerType GetOwnerType(const struct FPackageSettingInfo& Info);
	static const class FName GetPackageConfigureId(const struct FPackageSettingInfo& Info);
	static const class FName GetPropCodeName(const struct FPackageSettingInfo& Info);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PackageSettingInfoFuncLibrary">();
	}
	static class UPackageSettingInfoFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPackageSettingInfoFuncLibrary>();
	}
};
static_assert(alignof(UPackageSettingInfoFuncLibrary) == 0x000008, "Wrong alignment on UPackageSettingInfoFuncLibrary");
