#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProjectP

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ProjectP_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"
#include "NiagaraAnimNotifies_classes.hpp"
#include "UMG_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "ApexDestruction_classes.hpp"
#include "Niagara_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "CinematicCamera_classes.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// Class ProjectP.LActPayloadBase
// 0x0008 (0x0030 - 0x0028)
class ULActPayloadBase : public UObject
{
public:
	class FName                                   CodeName;                                          // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LActPayloadBase">();
	}
	static class ULActPayloadBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULActPayloadBase>();
	}
};
static_assert(alignof(ULActPayloadBase) == 0x000008, "Wrong alignment on ULActPayloadBase");
static_assert(sizeof(ULActPayloadBase) == 0x000030, "Wrong size on ULActPayloadBase");
static_assert(offsetof(ULActPayloadBase, CodeName) == 0x000028, "Member 'ULActPayloadBase::CodeName' has a wrong offset!");

// Class ProjectP.LWeaponAnimInstance
// 0x0000 (0x02C0 - 0x02C0)
class ULWeaponAnimInstance : public UAnimInstance
{
public:
	class FName                                   AnimState;                                         // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void ChangeAnimState(class FName AnimState_0);
	void ClearAnimState();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LWeaponAnimInstance">();
	}
	static class ULWeaponAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULWeaponAnimInstance>();
	}
};
static_assert(alignof(ULWeaponAnimInstance) == 0x000010, "Wrong alignment on ULWeaponAnimInstance");
static_assert(sizeof(ULWeaponAnimInstance) == 0x0002C0, "Wrong size on ULWeaponAnimInstance");
static_assert(offsetof(ULWeaponAnimInstance, AnimState) == 0x0002B8, "Member 'ULWeaponAnimInstance::AnimState' has a wrong offset!");

// Class ProjectP.LSpot
// 0x00E8 (0x02C8 - 0x01E0)
class ALSpot : public AActor
{
public:
	uint8                                         Pad_1E0[0x8];                                      // 0x01E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	ELSpotType                                    SpotType;                                          // 0x01E8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   OwnerLevelName;                                    // 0x01EC(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InstanceId;                                        // 0x01F4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SpotUniqueID;                                      // 0x01F8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SpotCodeName;                                      // 0x0208(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   WorldEventCodeName;                                // 0x0210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ActorSpawnable;                                    // 0x0218(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpawnDistanceScale;                                // 0x021C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpawnDistanceScaleByCode;                          // 0x0220(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bAlwaysSpawnIgnoreCollisions : 1;                  // 0x0224(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SpotVolumeOverlapCount;                            // 0x0228(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bIncludeSpotVolume : 1;                            // 0x022C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bTouchedTalker : 1;                                // 0x022C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_22D[0x3];                                      // 0x022D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TalkerCodeName;                                    // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLSpotOptionInfo                       OptionInfo;                                        // 0x0238(0x0001)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLPreloadBox                           SpawnPreloadInstance;                              // 0x0240(0x0030)(Transient, NativeAccessSpecifierPublic)
	struct FLPreloadBox                           PreloadInstance;                                   // 0x0270(0x0030)(Transient, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A0[0x11];                                     // 0x02A0(0x0011)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          ReserveActorSpawn;                                 // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReserveActorDespawn;                               // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B3[0x5];                                      // 0x02B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpotMatchInfoPtr                      SpotMatchInfo;                                     // 0x02B8(0x0008)(NoDestructor, NativeAccessSpecifierPublic)
	bool                                          CheckedSpotMatchInfo;                              // 0x02C0(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ResultSpotMatchInfo;                               // 0x02C1(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELPreloadSpotSetting                          PreloadSpotSetting;                                // 0x02C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C3[0x5];                                      // 0x02C3(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LSpot">();
	}
	static class ALSpot* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALSpot>();
	}
};
static_assert(alignof(ALSpot) == 0x000008, "Wrong alignment on ALSpot");
static_assert(sizeof(ALSpot) == 0x0002C8, "Wrong size on ALSpot");
static_assert(offsetof(ALSpot, SpotType) == 0x0001E8, "Member 'ALSpot::SpotType' has a wrong offset!");
static_assert(offsetof(ALSpot, OwnerLevelName) == 0x0001EC, "Member 'ALSpot::OwnerLevelName' has a wrong offset!");
static_assert(offsetof(ALSpot, InstanceId) == 0x0001F4, "Member 'ALSpot::InstanceId' has a wrong offset!");
static_assert(offsetof(ALSpot, SpotUniqueID) == 0x0001F8, "Member 'ALSpot::SpotUniqueID' has a wrong offset!");
static_assert(offsetof(ALSpot, SpotCodeName) == 0x000208, "Member 'ALSpot::SpotCodeName' has a wrong offset!");
static_assert(offsetof(ALSpot, WorldEventCodeName) == 0x000210, "Member 'ALSpot::WorldEventCodeName' has a wrong offset!");
static_assert(offsetof(ALSpot, ActorSpawnable) == 0x000218, "Member 'ALSpot::ActorSpawnable' has a wrong offset!");
static_assert(offsetof(ALSpot, SpawnDistanceScale) == 0x00021C, "Member 'ALSpot::SpawnDistanceScale' has a wrong offset!");
static_assert(offsetof(ALSpot, SpawnDistanceScaleByCode) == 0x000220, "Member 'ALSpot::SpawnDistanceScaleByCode' has a wrong offset!");
static_assert(offsetof(ALSpot, SpotVolumeOverlapCount) == 0x000228, "Member 'ALSpot::SpotVolumeOverlapCount' has a wrong offset!");
static_assert(offsetof(ALSpot, TalkerCodeName) == 0x000230, "Member 'ALSpot::TalkerCodeName' has a wrong offset!");
static_assert(offsetof(ALSpot, OptionInfo) == 0x000238, "Member 'ALSpot::OptionInfo' has a wrong offset!");
static_assert(offsetof(ALSpot, SpawnPreloadInstance) == 0x000240, "Member 'ALSpot::SpawnPreloadInstance' has a wrong offset!");
static_assert(offsetof(ALSpot, PreloadInstance) == 0x000270, "Member 'ALSpot::PreloadInstance' has a wrong offset!");
static_assert(offsetof(ALSpot, ReserveActorSpawn) == 0x0002B1, "Member 'ALSpot::ReserveActorSpawn' has a wrong offset!");
static_assert(offsetof(ALSpot, ReserveActorDespawn) == 0x0002B2, "Member 'ALSpot::ReserveActorDespawn' has a wrong offset!");
static_assert(offsetof(ALSpot, SpotMatchInfo) == 0x0002B8, "Member 'ALSpot::SpotMatchInfo' has a wrong offset!");
static_assert(offsetof(ALSpot, CheckedSpotMatchInfo) == 0x0002C0, "Member 'ALSpot::CheckedSpotMatchInfo' has a wrong offset!");
static_assert(offsetof(ALSpot, ResultSpotMatchInfo) == 0x0002C1, "Member 'ALSpot::ResultSpotMatchInfo' has a wrong offset!");
static_assert(offsetof(ALSpot, PreloadSpotSetting) == 0x0002C2, "Member 'ALSpot::PreloadSpotSetting' has a wrong offset!");

// Class ProjectP.LPropSpot
// 0x0088 (0x0350 - 0x02C8)
class ALPropSpot : public ALSpot
{
public:
	int32                                         PropState;                                         // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class AActor>                  SpawnedActor;                                      // 0x02D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SaveFlag;                                          // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RespawnFlag;                                       // 0x02D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2DA[0x6];                                      // 0x02DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLLinkedPropInfo>               LinkedPropInfoList;                                // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	TArray<struct FLLinkedNpcSpot>                LinkedNpcSpotList;                                 // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	class ULPropComponent*                        PropComponent;                                     // 0x0300(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULWorldEventComponent*                  WorldEventComponent;                               // 0x0308(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAudioComponent*                        SpotSoundComponent;                                // 0x0310(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULPropInteractCollisionComponent*       InteractCollisionComponent;                        // 0x0318(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULPropInteractStartComponent*           InteractStartComponent;                            // 0x0320(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULPropSoundLocationComponent*           SoundLocationComponent;                            // 0x0328(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReservedLinkedState;                               // 0x0330(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnSpawnedActor;                                    // 0x0338(0x0010)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnChangePropStateFromLevelObject(int32 TargetState);
	void OnCheckLinkedNpcSpotFromLevelObject(ELLinkedNpcSpotExecuteType ExecuteType);
	void OnCheckNextPropStateFromLevelObject();
	void OnComponentBeginOverlapPropVolume(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnComponentEndOverlapPropVolume(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LPropSpot">();
	}
	static class ALPropSpot* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALPropSpot>();
	}
};
static_assert(alignof(ALPropSpot) == 0x000008, "Wrong alignment on ALPropSpot");
static_assert(sizeof(ALPropSpot) == 0x000350, "Wrong size on ALPropSpot");
static_assert(offsetof(ALPropSpot, PropState) == 0x0002C8, "Member 'ALPropSpot::PropState' has a wrong offset!");
static_assert(offsetof(ALPropSpot, SpawnedActor) == 0x0002D0, "Member 'ALPropSpot::SpawnedActor' has a wrong offset!");
static_assert(offsetof(ALPropSpot, SaveFlag) == 0x0002D8, "Member 'ALPropSpot::SaveFlag' has a wrong offset!");
static_assert(offsetof(ALPropSpot, RespawnFlag) == 0x0002D9, "Member 'ALPropSpot::RespawnFlag' has a wrong offset!");
static_assert(offsetof(ALPropSpot, LinkedPropInfoList) == 0x0002E0, "Member 'ALPropSpot::LinkedPropInfoList' has a wrong offset!");
static_assert(offsetof(ALPropSpot, LinkedNpcSpotList) == 0x0002F0, "Member 'ALPropSpot::LinkedNpcSpotList' has a wrong offset!");
static_assert(offsetof(ALPropSpot, PropComponent) == 0x000300, "Member 'ALPropSpot::PropComponent' has a wrong offset!");
static_assert(offsetof(ALPropSpot, WorldEventComponent) == 0x000308, "Member 'ALPropSpot::WorldEventComponent' has a wrong offset!");
static_assert(offsetof(ALPropSpot, SpotSoundComponent) == 0x000310, "Member 'ALPropSpot::SpotSoundComponent' has a wrong offset!");
static_assert(offsetof(ALPropSpot, InteractCollisionComponent) == 0x000318, "Member 'ALPropSpot::InteractCollisionComponent' has a wrong offset!");
static_assert(offsetof(ALPropSpot, InteractStartComponent) == 0x000320, "Member 'ALPropSpot::InteractStartComponent' has a wrong offset!");
static_assert(offsetof(ALPropSpot, SoundLocationComponent) == 0x000328, "Member 'ALPropSpot::SoundLocationComponent' has a wrong offset!");
static_assert(offsetof(ALPropSpot, ReservedLinkedState) == 0x000330, "Member 'ALPropSpot::ReservedLinkedState' has a wrong offset!");
static_assert(offsetof(ALPropSpot, OnSpawnedActor) == 0x000338, "Member 'ALPropSpot::OnSpawnedActor' has a wrong offset!");

// Class ProjectP.LBossRoomSpot
// 0x00A8 (0x03F8 - 0x0350)
class ALBossRoomSpot : public ALPropSpot
{
public:
	TArray<class ALPropShapeObjectSpot*>          FogGateSpotList;                                   // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class ALPropDoorSpot*                         BossDoorSpot;                                      // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ALPropShapeObjectSpot*                  BossDoorShapeObjectSpot;                           // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ALNPCSpot*>                      BossNpcSpotList;                                   // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class ALNPCSpot*>                      RelationNpcSpotList;                               // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           RelationNpcCodeNameList;                           // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class ALPropHelpMateSpot*                     PropHelpMateSpot;                                  // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ALNPCSpot*                              NPCHelpMateSpot;                                   // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULPropVolumeComponent*                  PC_ErgoDrop_Fix_Volume;                            // 0x03B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USceneComponent*                        PC_ErgoDrop_Fix_Pos;                               // 0x03B8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   BossNpcCodeName;                                   // 0x03C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          BossIsDead;                                        // 0x03C8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          IsPlayerInVolume;                                  // 0x03C9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          NpcDefaultState;                                   // 0x03CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          BossRoomActiveState;                               // 0x03CB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class ALPropSpot>              ControlledBossDoor;                                // 0x03CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          CheckDefaultStatus;                                // 0x03D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3D5[0x3];                                      // 0x03D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         DefaultActorSpawnableList;                         // 0x03D8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class ALNPCCharacter*>                 StoppedNPCs;                                       // 0x03E8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)

public:
	void OnDeadSpawnNpc(class ALNPCSpot* TargetNpcSpot);
	void OnSpawnedActor(class ALPropSpot* TargetPropSpot);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LBossRoomSpot">();
	}
	static class ALBossRoomSpot* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALBossRoomSpot>();
	}
};
static_assert(alignof(ALBossRoomSpot) == 0x000008, "Wrong alignment on ALBossRoomSpot");
static_assert(sizeof(ALBossRoomSpot) == 0x0003F8, "Wrong size on ALBossRoomSpot");
static_assert(offsetof(ALBossRoomSpot, FogGateSpotList) == 0x000350, "Member 'ALBossRoomSpot::FogGateSpotList' has a wrong offset!");
static_assert(offsetof(ALBossRoomSpot, BossDoorSpot) == 0x000360, "Member 'ALBossRoomSpot::BossDoorSpot' has a wrong offset!");
static_assert(offsetof(ALBossRoomSpot, BossDoorShapeObjectSpot) == 0x000368, "Member 'ALBossRoomSpot::BossDoorShapeObjectSpot' has a wrong offset!");
static_assert(offsetof(ALBossRoomSpot, BossNpcSpotList) == 0x000370, "Member 'ALBossRoomSpot::BossNpcSpotList' has a wrong offset!");
static_assert(offsetof(ALBossRoomSpot, RelationNpcSpotList) == 0x000380, "Member 'ALBossRoomSpot::RelationNpcSpotList' has a wrong offset!");
static_assert(offsetof(ALBossRoomSpot, RelationNpcCodeNameList) == 0x000390, "Member 'ALBossRoomSpot::RelationNpcCodeNameList' has a wrong offset!");
static_assert(offsetof(ALBossRoomSpot, PropHelpMateSpot) == 0x0003A0, "Member 'ALBossRoomSpot::PropHelpMateSpot' has a wrong offset!");
static_assert(offsetof(ALBossRoomSpot, NPCHelpMateSpot) == 0x0003A8, "Member 'ALBossRoomSpot::NPCHelpMateSpot' has a wrong offset!");
static_assert(offsetof(ALBossRoomSpot, PC_ErgoDrop_Fix_Volume) == 0x0003B0, "Member 'ALBossRoomSpot::PC_ErgoDrop_Fix_Volume' has a wrong offset!");
static_assert(offsetof(ALBossRoomSpot, PC_ErgoDrop_Fix_Pos) == 0x0003B8, "Member 'ALBossRoomSpot::PC_ErgoDrop_Fix_Pos' has a wrong offset!");
static_assert(offsetof(ALBossRoomSpot, BossNpcCodeName) == 0x0003C0, "Member 'ALBossRoomSpot::BossNpcCodeName' has a wrong offset!");
static_assert(offsetof(ALBossRoomSpot, BossIsDead) == 0x0003C8, "Member 'ALBossRoomSpot::BossIsDead' has a wrong offset!");
static_assert(offsetof(ALBossRoomSpot, IsPlayerInVolume) == 0x0003C9, "Member 'ALBossRoomSpot::IsPlayerInVolume' has a wrong offset!");
static_assert(offsetof(ALBossRoomSpot, NpcDefaultState) == 0x0003CA, "Member 'ALBossRoomSpot::NpcDefaultState' has a wrong offset!");
static_assert(offsetof(ALBossRoomSpot, BossRoomActiveState) == 0x0003CB, "Member 'ALBossRoomSpot::BossRoomActiveState' has a wrong offset!");
static_assert(offsetof(ALBossRoomSpot, ControlledBossDoor) == 0x0003CC, "Member 'ALBossRoomSpot::ControlledBossDoor' has a wrong offset!");
static_assert(offsetof(ALBossRoomSpot, CheckDefaultStatus) == 0x0003D4, "Member 'ALBossRoomSpot::CheckDefaultStatus' has a wrong offset!");
static_assert(offsetof(ALBossRoomSpot, DefaultActorSpawnableList) == 0x0003D8, "Member 'ALBossRoomSpot::DefaultActorSpawnableList' has a wrong offset!");
static_assert(offsetof(ALBossRoomSpot, StoppedNPCs) == 0x0003E8, "Member 'ALBossRoomSpot::StoppedNPCs' has a wrong offset!");

// Class ProjectP.LDurableAbnormalBPFuncLibrary
// 0x0000 (0x0028 - 0x0028)
class ULDurableAbnormalBPFuncLibrary final : public UObject
{
public:
	static struct FAbnormalStateCommonInfoPtr GetInfo(const struct FLDurableAbnormalBPPtr& In);
	static int64 GetUniqueId(const struct FLDurableAbnormalBPPtr& In);

	int32 GetRemainDuration(const struct FLDurableAbnormalBPPtr& In);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LDurableAbnormalBPFuncLibrary">();
	}
	static class ULDurableAbnormalBPFuncLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULDurableAbnormalBPFuncLibrary>();
	}
};
static_assert(alignof(ULDurableAbnormalBPFuncLibrary) == 0x000008, "Wrong alignment on ULDurableAbnormalBPFuncLibrary");
static_assert(sizeof(ULDurableAbnormalBPFuncLibrary) == 0x000028, "Wrong size on ULDurableAbnormalBPFuncLibrary");

// Class ProjectP.LAnimNotifyStateBase
// 0x0010 (0x0040 - 0x0030)
class ULAnimNotifyStateBase : public UAnimNotifyState
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          Enabled;                                           // 0x0038(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LAnimNotifyStateBase">();
	}
	static class ULAnimNotifyStateBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULAnimNotifyStateBase>();
	}
};
static_assert(alignof(ULAnimNotifyStateBase) == 0x000008, "Wrong alignment on ULAnimNotifyStateBase");
static_assert(sizeof(ULAnimNotifyStateBase) == 0x000040, "Wrong size on ULAnimNotifyStateBase");
static_assert(offsetof(ULAnimNotifyStateBase, Enabled) == 0x000038, "Member 'ULAnimNotifyStateBase::Enabled' has a wrong offset!");

// Class ProjectP.LAnimNotify_RunNotiEnd_SendNPCWorldTrigger
// 0x0028 (0x0068 - 0x0040)
class ULAnimNotify_RunNotiEnd_SendNPCWorldTrigger final : public ULAnimNotifyStateBase
{
public:
	ELAISendWorldTriggerType                      TriggerType;                                       // 0x0040(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TriggerString;                                     // 0x0048(0x0010)(Edit, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SendRadius;                                        // 0x0058(0x0004)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NPCCodeName;                                       // 0x005C(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LAnimNotify_RunNotiEnd_SendNPCWorldTrigger">();
	}
	static class ULAnimNotify_RunNotiEnd_SendNPCWorldTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULAnimNotify_RunNotiEnd_SendNPCWorldTrigger>();
	}
};
static_assert(alignof(ULAnimNotify_RunNotiEnd_SendNPCWorldTrigger) == 0x000008, "Wrong alignment on ULAnimNotify_RunNotiEnd_SendNPCWorldTrigger");
static_assert(sizeof(ULAnimNotify_RunNotiEnd_SendNPCWorldTrigger) == 0x000068, "Wrong size on ULAnimNotify_RunNotiEnd_SendNPCWorldTrigger");
static_assert(offsetof(ULAnimNotify_RunNotiEnd_SendNPCWorldTrigger, TriggerType) == 0x000040, "Member 'ULAnimNotify_RunNotiEnd_SendNPCWorldTrigger::TriggerType' has a wrong offset!");
static_assert(offsetof(ULAnimNotify_RunNotiEnd_SendNPCWorldTrigger, TriggerString) == 0x000048, "Member 'ULAnimNotify_RunNotiEnd_SendNPCWorldTrigger::TriggerString' has a wrong offset!");
static_assert(offsetof(ULAnimNotify_RunNotiEnd_SendNPCWorldTrigger, SendRadius) == 0x000058, "Member 'ULAnimNotify_RunNotiEnd_SendNPCWorldTrigger::SendRadius' has a wrong offset!");
static_assert(offsetof(ULAnimNotify_RunNotiEnd_SendNPCWorldTrigger, NPCCodeName) == 0x00005C, "Member 'ULAnimNotify_RunNotiEnd_SendNPCWorldTrigger::NPCCodeName' has a wrong offset!");

// Class ProjectP.LBTComposite_Bool
// 0x0000 (0x0090 - 0x0090)
class ULBTComposite_Bool final : public UBTCompositeNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LBTComposite_Bool">();
	}
	static class ULBTComposite_Bool* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULBTComposite_Bool>();
	}
};
static_assert(alignof(ULBTComposite_Bool) == 0x000008, "Wrong alignment on ULBTComposite_Bool");
static_assert(sizeof(ULBTComposite_Bool) == 0x000090, "Wrong size on ULBTComposite_Bool");

// Class ProjectP.LActPayload_HitAnim
// 0x0160 (0x0190 - 0x0030)
class ULActPayload_HitAnim final : public ULActPayloadBase
{
public:
	class AActor*                                 Attacker;                                          // 0x0030(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLHitInfo                              HitInfo;                                           // 0x0038(0x0150)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, ContainsInstancedReference, ExposeOnSpawn, NativeAccessSpecifierPublic)
	bool                                          Cached_IsBackHit;                                  // 0x0188(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LActPayload_HitAnim">();
	}
	static class ULActPayload_HitAnim* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULActPayload_HitAnim>();
	}
};
static_assert(alignof(ULActPayload_HitAnim) == 0x000008, "Wrong alignment on ULActPayload_HitAnim");
static_assert(sizeof(ULActPayload_HitAnim) == 0x000190, "Wrong size on ULActPayload_HitAnim");
static_assert(offsetof(ULActPayload_HitAnim, Attacker) == 0x000030, "Member 'ULActPayload_HitAnim::Attacker' has a wrong offset!");
static_assert(offsetof(ULActPayload_HitAnim, HitInfo) == 0x000038, "Member 'ULActPayload_HitAnim::HitInfo' has a wrong offset!");
static_assert(offsetof(ULActPayload_HitAnim, Cached_IsBackHit) == 0x000188, "Member 'ULActPayload_HitAnim::Cached_IsBackHit' has a wrong offset!");

// Class ProjectP.LAbnormalCalculator
// 0x0008 (0x0030 - 0x0028)
class ULAbnormalCalculator final : public UObject
{
public:
	TWeakObjectPtr<class ALCharacter>             OwnerCharacter;                                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LAbnormalCalculator">();
	}
	static class ULAbnormalCalculator* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULAbnormalCalculator>();
	}
};
static_assert(alignof(ULAbnormalCalculator) == 0x000008, "Wrong alignment on ULAbnormalCalculator");
static_assert(sizeof(ULAbnormalCalculator) == 0x000030, "Wrong size on ULAbnormalCalculator");
static_assert(offsetof(ULAbnormalCalculator, OwnerCharacter) == 0x000028, "Member 'ULAbnormalCalculator::OwnerCharacter' has a wrong offset!");

// Class ProjectP.LHitCollisionBoxComponent
// 0x0000 (0x0470 - 0x0470)
class ULHitCollisionBoxComponent final : public UBoxComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LHitCollisionBoxComponent">();
	}
	static class ULHitCollisionBoxComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULHitCollisionBoxComponent>();
	}
};
static_assert(alignof(ULHitCollisionBoxComponent) == 0x000010, "Wrong alignment on ULHitCollisionBoxComponent");
static_assert(sizeof(ULHitCollisionBoxComponent) == 0x000470, "Wrong size on ULHitCollisionBoxComponent");

// Class ProjectP.LAbnormalComponent
// 0x0130 (0x01E0 - 0x00B0)
class ULAbnormalComponent final : public UActorComponent
{
public:
	uint8                                         Pad_B0[0x10];                                      // 0x00B0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class ALCharacter>             OwnerCharacter;                                    // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULAbnormalCalculator*                   AbnormalCalculator;                                // 0x00C8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D0[0x10];                                      // 0x00D0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLAbnormalFromOther>            AppliedFromOthers;                                 // 0x00E0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_F0[0x18];                                      // 0x00F0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnApplyRunningAbnormal;                            // 0x0108(0x0010)(Edit, ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_118[0xC8];                                     // 0x0118(0x00C8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BuildupHitBP(const struct FLCalcBuildupData& InBuildupData);
	TArray<struct FLCalcBuildupData> CalcDirectBuildupHitByHit(const struct FLHitInfo& InHitInfo, int32 InSkillBuildupDamage, int32 InFireBuildupDamage, int32 InElectricBuildupDamage, int32 InAcidBuildupDamage);
	int32 GetAppliedAbnormalMaxDurationByUniqueId(int64 InAbnormalUniqueId);
	int32 GetAppliedAbnormalRemainDurationByUniqueId(int64 InAbnormalUniqueId);
	void OnBrokenBlade();
	void OnCaptureMoment(class AActor* Owner, const struct FMomentConditionCaptureInfo& Capture);
	void OnChooseOtherWeapon(const struct FLEquipItemSlot& EquipSlot);
	void OnPlayHideFX(bool IsHide);
	void OnRemoveAbnormalNiagaraFX(class UNiagaraComponent* InNiagaraComp);
	void OnRemoveAbnormalParticleFX(class UParticleSystemComponent* InParticleComp);
	void OnSatisfiedBuffAlter(const struct FHumanizationBuffAlterInfoPtr& InActiveBuffAlterInfo);
	int64 PutOn(const class FName& InAbnormalCodeName, bool ForceNewAbnormal);
	int64 PutOnByPayload(const class FName& InAbnormalCodeName, const struct FLAbnormalPayload& InPayload);
	int64 PutOnWithInstigator(const class FName& InAbnormalCodeName, class UObject* InInstigator);
	int64 PutOnWithReason(const class FName& InAbnormalCodeName, const class FName& InReasonCodeName);
	void RequestBroadcast_NPCElementUI();
	void TakeOff(const class FName& InAbnormalCodeName, bool Immediately);
	void TakeOffAllByInstigator(class UObject* InInstigator, bool Immediately);
	void TakeOffByGroup(const class FName& IGroupCodeName, bool Immediately);
	void TakeOffByInstigator(const class FName& InAbnormalCodeName, class UObject* InInstigator, bool Immediately);
	void TakeOffByUniqueId(int64 InAbnormalUniqueId, bool Immediately);
	bool TakeOffWithRefCount(int64 InAbnormalUniqueId, bool Immediately);

	TArray<struct FLDurableAbnormalBPPtr> GetAppliedAbnormals() const;
	bool IsAppliedAbnormal(const class FName& InAbnormalCodeName) const;
	int32 IsAppliedAbnormalCount(const class FName& InAbnormalCodeName) const;
	bool IsAppliedGroupAbnormal(const class FName& GroupCodename) const;
	bool IsBuildupAbnormal(const class FName& InAbnormalCodeName) const;
	bool IsGaugeAbnormal(const class FName& InAbnormalCodeName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LAbnormalComponent">();
	}
	static class ULAbnormalComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULAbnormalComponent>();
	}
};
static_assert(alignof(ULAbnormalComponent) == 0x000008, "Wrong alignment on ULAbnormalComponent");
static_assert(sizeof(ULAbnormalComponent) == 0x0001E0, "Wrong size on ULAbnormalComponent");
static_assert(offsetof(ULAbnormalComponent, OwnerCharacter) == 0x0000C0, "Member 'ULAbnormalComponent::OwnerCharacter' has a wrong offset!");
static_assert(offsetof(ULAbnormalComponent, AbnormalCalculator) == 0x0000C8, "Member 'ULAbnormalComponent::AbnormalCalculator' has a wrong offset!");
static_assert(offsetof(ULAbnormalComponent, AppliedFromOthers) == 0x0000E0, "Member 'ULAbnormalComponent::AppliedFromOthers' has a wrong offset!");
static_assert(offsetof(ULAbnormalComponent, OnApplyRunningAbnormal) == 0x000108, "Member 'ULAbnormalComponent::OnApplyRunningAbnormal' has a wrong offset!");

// Class ProjectP.LGameSubSystem
// 0x0048 (0x0078 - 0x0030)
class ULGameSubSystem : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x18];                                      // 0x0030(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SpawnedSystemData;                                 // 0x0048(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_50[0x8];                                       // 0x0050(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 SystemLibraryClass;                                // 0x0058(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UClass*                                 SystemDataClass;                                   // 0x0060(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                 DefaultSystemData;                                 // 0x0068(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         InitialPriority;                                   // 0x0070(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LGameSubSystem">();
	}
	static class ULGameSubSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULGameSubSystem>();
	}
};
static_assert(alignof(ULGameSubSystem) == 0x000008, "Wrong alignment on ULGameSubSystem");
static_assert(sizeof(ULGameSubSystem) == 0x000078, "Wrong size on ULGameSubSystem");
static_assert(offsetof(ULGameSubSystem, SpawnedSystemData) == 0x000048, "Member 'ULGameSubSystem::SpawnedSystemData' has a wrong offset!");
static_assert(offsetof(ULGameSubSystem, SystemLibraryClass) == 0x000058, "Member 'ULGameSubSystem::SystemLibraryClass' has a wrong offset!");
static_assert(offsetof(ULGameSubSystem, SystemDataClass) == 0x000060, "Member 'ULGameSubSystem::SystemDataClass' has a wrong offset!");
static_assert(offsetof(ULGameSubSystem, DefaultSystemData) == 0x000068, "Member 'ULGameSubSystem::DefaultSystemData' has a wrong offset!");
static_assert(offsetof(ULGameSubSystem, InitialPriority) == 0x000070, "Member 'ULGameSubSystem::InitialPriority' has a wrong offset!");

// Class ProjectP.LBTask_BlueprintBase
// 0x0008 (0x00B0 - 0x00A8)
class ULBTask_BlueprintBase : public UBTTask_BlueprintBase
{
public:
	class ALAIController*                         LAIOwner;                                          // 0x00A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	class FString GetBehaivorTreeNodeName();
	void OnPostEditChangeProperty();
	void SetBehaivorTreeNodeName(const class FString& Name_0);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LBTask_BlueprintBase">();
	}
	static class ULBTask_BlueprintBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULBTask_BlueprintBase>();
	}
};
static_assert(alignof(ULBTask_BlueprintBase) == 0x000008, "Wrong alignment on ULBTask_BlueprintBase");
static_assert(sizeof(ULBTask_BlueprintBase) == 0x0000B0, "Wrong size on ULBTask_BlueprintBase");
static_assert(offsetof(ULBTask_BlueprintBase, LAIOwner) == 0x0000A8, "Member 'ULBTask_BlueprintBase::LAIOwner' has a wrong offset!");

// Class ProjectP.LDynamicDamageVolumeActor
// 0x0080 (0x0260 - 0x01E0)
class ALDynamicDamageVolumeActor : public AActor
{
public:
	struct FDynamicDamageVolumeInfoPtr            Info;                                              // 0x01E0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E8[0x50];                                     // 0x01E8(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bEnableTick;                                       // 0x0238(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLDynamicDamageVolume_TargetInfo> TargetList;                                        // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bRemoveOverlappedActor_when_EndOverlap;            // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_251[0xF];                                      // 0x0251(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddDamagePerTime(class ALCharacter* TargetActor);
	void ApplyDamage(class AActor* TargetActor, const struct FHitResult& HitResult, class FName Skill_Hit_Override);
	TArray<class AActor*> GetOverlappedActors();
	void OnBeginOverlap(class AActor* Actor, const struct FHitResult& HitResult);
	void OnEndOverlap(class AActor* Actor);
	void RemoveDamagePerTime(class AActor* TargetActor);
	void Reset();
	void ResetDynamicDamageVolumeInfo(class FName InCodeName);
	void SetOverlappedActors(const TArray<class AActor*>& InActorList);
	void Start();
	void Stop();
	void UpdateOverlapEvents();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LDynamicDamageVolumeActor">();
	}
	static class ALDynamicDamageVolumeActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALDynamicDamageVolumeActor>();
	}
};
static_assert(alignof(ALDynamicDamageVolumeActor) == 0x000008, "Wrong alignment on ALDynamicDamageVolumeActor");
static_assert(sizeof(ALDynamicDamageVolumeActor) == 0x000260, "Wrong size on ALDynamicDamageVolumeActor");
static_assert(offsetof(ALDynamicDamageVolumeActor, Info) == 0x0001E0, "Member 'ALDynamicDamageVolumeActor::Info' has a wrong offset!");
static_assert(offsetof(ALDynamicDamageVolumeActor, bEnableTick) == 0x000238, "Member 'ALDynamicDamageVolumeActor::bEnableTick' has a wrong offset!");
static_assert(offsetof(ALDynamicDamageVolumeActor, TargetList) == 0x000240, "Member 'ALDynamicDamageVolumeActor::TargetList' has a wrong offset!");
static_assert(offsetof(ALDynamicDamageVolumeActor, bRemoveOverlappedActor_when_EndOverlap) == 0x000250, "Member 'ALDynamicDamageVolumeActor::bRemoveOverlappedActor_when_EndOverlap' has a wrong offset!");

// Class ProjectP.LAchievementSystem
// 0x0118 (0x0190 - 0x0078)
class ULAchievementSystem final : public ULGameSubSystem
{
public:
	bool                                          bVisibleCompleteUI;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FLAchievementHierarchyInfo> AchievementDB;                                     // 0x0080(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, Protected, NativeAccessSpecifierProtected)
	TMap<ELCallBackEventType, struct FLAchievementDetailInfoList> AutoCompleteAchievementDB;                         // 0x00D0(0x0050)(Protected, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_             OnCompleteAchievement;                             // 0x0120(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnCompleteAchievementDetail;                       // 0x0130(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TMap<ELCallBackEventType, struct FLAchievementDetailInfoList> CompleteAchievementList;                           // 0x0140(0x0050)(Protected, NativeAccessSpecifierProtected)

public:
	class FString MakeAchievementLog(const class FName& AchievementCodeName);
	void OnSendPlatform(class FName AchievementCodeName);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LAchievementSystem">();
	}
	static class ULAchievementSystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULAchievementSystem>();
	}
};
static_assert(alignof(ULAchievementSystem) == 0x000008, "Wrong alignment on ULAchievementSystem");
static_assert(sizeof(ULAchievementSystem) == 0x000190, "Wrong size on ULAchievementSystem");
static_assert(offsetof(ULAchievementSystem, bVisibleCompleteUI) == 0x000078, "Member 'ULAchievementSystem::bVisibleCompleteUI' has a wrong offset!");
static_assert(offsetof(ULAchievementSystem, AchievementDB) == 0x000080, "Member 'ULAchievementSystem::AchievementDB' has a wrong offset!");
static_assert(offsetof(ULAchievementSystem, AutoCompleteAchievementDB) == 0x0000D0, "Member 'ULAchievementSystem::AutoCompleteAchievementDB' has a wrong offset!");
static_assert(offsetof(ULAchievementSystem, OnCompleteAchievement) == 0x000120, "Member 'ULAchievementSystem::OnCompleteAchievement' has a wrong offset!");
static_assert(offsetof(ULAchievementSystem, OnCompleteAchievementDetail) == 0x000130, "Member 'ULAchievementSystem::OnCompleteAchievementDetail' has a wrong offset!");
static_assert(offsetof(ULAchievementSystem, CompleteAchievementList) == 0x000140, "Member 'ULAchievementSystem::CompleteAchievementList' has a wrong offset!");

// Class ProjectP.LAnimNotifyBase
// 0x0010 (0x0048 - 0x0038)
class ULAnimNotifyBase : public UAnimNotify
{
public:
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          Enabled;                                           // 0x0040(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LAnimNotifyBase">();
	}
	static class ULAnimNotifyBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULAnimNotifyBase>();
	}
};
static_assert(alignof(ULAnimNotifyBase) == 0x000008, "Wrong alignment on ULAnimNotifyBase");
static_assert(sizeof(ULAnimNotifyBase) == 0x000048, "Wrong size on ULAnimNotifyBase");
static_assert(offsetof(ULAnimNotifyBase, Enabled) == 0x000040, "Member 'ULAnimNotifyBase::Enabled' has a wrong offset!");

// Class ProjectP.LAnimNotify_LaunchWire
// 0x0010 (0x0058 - 0x0048)
class ULAnimNotify_LaunchWire final : public ULAnimNotifyBase
{
public:
	TSubclassOf<class AActor>                     ActorToSpawn;                                      // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SpawnSocketName;                                   // 0x0050(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LAnimNotify_LaunchWire">();
	}
	static class ULAnimNotify_LaunchWire* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULAnimNotify_LaunchWire>();
	}
};
static_assert(alignof(ULAnimNotify_LaunchWire) == 0x000008, "Wrong alignment on ULAnimNotify_LaunchWire");
static_assert(sizeof(ULAnimNotify_LaunchWire) == 0x000058, "Wrong size on ULAnimNotify_LaunchWire");
static_assert(offsetof(ULAnimNotify_LaunchWire, ActorToSpawn) == 0x000048, "Member 'ULAnimNotify_LaunchWire::ActorToSpawn' has a wrong offset!");
static_assert(offsetof(ULAnimNotify_LaunchWire, SpawnSocketName) == 0x000050, "Member 'ULAnimNotify_LaunchWire::SpawnSocketName' has a wrong offset!");

// Class ProjectP.LBTask_Test
// 0x0018 (0x0088 - 0x0070)
class ULBTask_Test final : public UBTTaskNode
{
public:
	EBTNodeResult                                 ResultType;                                        // 0x0070(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ProgressingTime;                                   // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bVLogToEachTask;                                   // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALAIController*                         LAIOwner;                                          // 0x0080(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LBTask_Test">();
	}
	static class ULBTask_Test* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULBTask_Test>();
	}
};
static_assert(alignof(ULBTask_Test) == 0x000008, "Wrong alignment on ULBTask_Test");
static_assert(sizeof(ULBTask_Test) == 0x000088, "Wrong size on ULBTask_Test");
static_assert(offsetof(ULBTask_Test, ResultType) == 0x000070, "Member 'ULBTask_Test::ResultType' has a wrong offset!");
static_assert(offsetof(ULBTask_Test, ProgressingTime) == 0x000074, "Member 'ULBTask_Test::ProgressingTime' has a wrong offset!");
static_assert(offsetof(ULBTask_Test, bVLogToEachTask) == 0x000078, "Member 'ULBTask_Test::bVLogToEachTask' has a wrong offset!");
static_assert(offsetof(ULBTask_Test, LAIOwner) == 0x000080, "Member 'ULBTask_Test::LAIOwner' has a wrong offset!");

// Class ProjectP.LActionClass
// 0x0000 (0x0028 - 0x0028)
class ULActionClass final : public UObject
{
public:
	static class FName ULActionClass_Climb();
	static class FName ULActionClass_Common();
	static class FName ULActionClass_CommonMontage();
	static class FName ULActionClass_Dialoging();
	static class FName ULActionClass_Die();
	static class FName ULActionClass_DMG_STAND();
	static class FName ULActionClass_Down_Away();
	static class FName ULActionClass_Down_Drag();
	static class FName ULActionClass_Down_Stamp();
	static class FName ULActionClass_Down_Up();
	static class FName ULActionClass_Draw_Weapon();
	static class FName ULActionClass_Falling();
	static class FName ULActionClass_FatalAttack();
	static class FName ULActionClass_FatalAttack_Victim();
	static class FName ULActionClass_FatalAttack_Victim_BeforeHit();
	static class FName ULActionClass_FatalAttack_Victim_End();
	static class FName ULActionClass_FloatingHit();
	static class FName ULActionClass_Game_Start();
	static class FName ULActionClass_GetUpDash();
	static class FName ULActionClass_Grab();
	static class FName ULActionClass_Grabbed();
	static class FName ULActionClass_GrabRelease();
	static class FName ULActionClass_Grinder_Element();
	static class FName ULActionClass_Groggy();
	static class FName ULActionClass_Guard();
	static class FName ULActionClass_Guard_Break();
	static class FName ULActionClass_Guard_Hit_Heavy();
	static class FName ULActionClass_Guard_Hit_Normal();
	static class FName ULActionClass_Guard_Reflect();
	static class FName ULActionClass_Guard_Repulse();
	static class FName ULActionClass_IdleTurn();
	static class FName ULActionClass_IdleTurnEnd();
	static class FName ULActionClass_Interaction();
	static class FName ULActionClass_Jump();
	static class FName ULActionClass_KnockBack();
	static class FName ULActionClass_Landing();
	static class FName ULActionClass_Multiple();
	static class FName ULActionClass_None();
	static class FName ULActionClass_NpcGuard_Break();
	static class FName ULActionClass_NpcGuard_Hit();
	static class FName ULActionClass_NpcGuard_Hit_Repulse();
	static class FName ULActionClass_Object_Repulse();
	static class FName ULActionClass_Paralyzation();
	static class FName ULActionClass_Parry();
	static class FName ULActionClass_Put_Weapon();
	static class FName ULActionClass_SkillFailed();
	static class FName ULActionClass_SlaveArm();
	static class FName ULActionClass_SlaveArm_Visual_Idle();
	static class FName ULActionClass_SpawnIdle();
	static class FName ULActionClass_Sprint();
	static class FName ULActionClass_Sprint_Exhausted();
	static class FName ULActionClass_Sprint_TurnAround();
	static class FName ULActionClass_StopRunning();
	static class FName ULActionClass_StopSprint();
	static class FName ULActionClass_TalkerIdle();
	static class FName ULActionClass_Teleport_End();
	static class FName ULActionClass_Teleport_NewGamePlus();
	static class FName ULActionClass_Teleport_Start();
	static class FName ULActionClass_ToughSpecialHit();
	static class FName ULActionClass_TurnAround();
	static class FName ULActionClass_Use_Item();
	static class FName ULActionClass_Weapon_Change();
	static class FName ULActionClass_Wire_Following();
	static class FName ULActionClass_Wire_Hit();
	static class FName ULActionClass_Wire_Pulling();
	static class FName ULActionClass_WireAction();
	static class FName ULActionClass_WireJumpSmash();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LActionClass">();
	}
	static class ULActionClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULActionClass>();
	}
};
static_assert(alignof(ULActionClass) == 0x000008, "Wrong alignment on ULActionClass");
static_assert(sizeof(ULActionClass) == 0x000028, "Wrong size on ULActionClass");

// Class ProjectP.LBTComposite_ForceSequence
// 0x0000 (0x0090 - 0x0090)
class ULBTComposite_ForceSequence final : public UBTCompositeNode
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"LBTComposite_ForceSequence">();
	}
	static class ULBTComposite_ForceSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULBTComposite_ForceSequence>();
	}
};
static_assert(alignof(ULBTComposite_ForceSequence) == 0x000008, "Wrong alignment on ULBTComposite_ForceSequence");
static_assert(sizeof(ULBTComposite_ForceSequence) == 0x000090, "Wrong size on ULBTComposite_ForceSequence");

// Class ProjectP.LEnvSettings
// 0x08C8 (0x08F0 - 0x0028)
