#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProjectP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectP_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function ProjectP.LWeaponAnimInstance.ChangeAnimState
// 0x0008 (0x0008 - 0x0000)
struct LWeaponAnimInstance_ChangeAnimState final
{
public:
	class FName                                   AnimState_0;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LWeaponAnimInstance_ChangeAnimState) == 0x000004, "Wrong alignment on LWeaponAnimInstance_ChangeAnimState");
static_assert(sizeof(LWeaponAnimInstance_ChangeAnimState) == 0x000008, "Wrong size on LWeaponAnimInstance_ChangeAnimState");
static_assert(offsetof(LWeaponAnimInstance_ChangeAnimState, AnimState_0) == 0x000000, "Member 'LWeaponAnimInstance_ChangeAnimState::AnimState_0' has a wrong offset!");

// Function ProjectP.LPropSpot.OnChangePropStateFromLevelObject
// 0x0004 (0x0004 - 0x0000)
struct LPropSpot_OnChangePropStateFromLevelObject final
{
public:
	int32                                         TargetState;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LPropSpot_OnChangePropStateFromLevelObject) == 0x000004, "Wrong alignment on LPropSpot_OnChangePropStateFromLevelObject");
static_assert(sizeof(LPropSpot_OnChangePropStateFromLevelObject) == 0x000004, "Wrong size on LPropSpot_OnChangePropStateFromLevelObject");
static_assert(offsetof(LPropSpot_OnChangePropStateFromLevelObject, TargetState) == 0x000000, "Member 'LPropSpot_OnChangePropStateFromLevelObject::TargetState' has a wrong offset!");

// Function ProjectP.LPropSpot.OnCheckLinkedNpcSpotFromLevelObject
// 0x0001 (0x0001 - 0x0000)
struct LPropSpot_OnCheckLinkedNpcSpotFromLevelObject final
{
public:
	ELLinkedNpcSpotExecuteType                    ExecuteType;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LPropSpot_OnCheckLinkedNpcSpotFromLevelObject) == 0x000001, "Wrong alignment on LPropSpot_OnCheckLinkedNpcSpotFromLevelObject");
static_assert(sizeof(LPropSpot_OnCheckLinkedNpcSpotFromLevelObject) == 0x000001, "Wrong size on LPropSpot_OnCheckLinkedNpcSpotFromLevelObject");
static_assert(offsetof(LPropSpot_OnCheckLinkedNpcSpotFromLevelObject, ExecuteType) == 0x000000, "Member 'LPropSpot_OnCheckLinkedNpcSpotFromLevelObject::ExecuteType' has a wrong offset!");

// Function ProjectP.LPropSpot.OnComponentBeginOverlapPropVolume
// 0x00A8 (0x00A8 - 0x0000)
struct LPropSpot_OnComponentBeginOverlapPropVolume final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(LPropSpot_OnComponentBeginOverlapPropVolume) == 0x000008, "Wrong alignment on LPropSpot_OnComponentBeginOverlapPropVolume");
static_assert(sizeof(LPropSpot_OnComponentBeginOverlapPropVolume) == 0x0000A8, "Wrong size on LPropSpot_OnComponentBeginOverlapPropVolume");
static_assert(offsetof(LPropSpot_OnComponentBeginOverlapPropVolume, OverlappedComponent) == 0x000000, "Member 'LPropSpot_OnComponentBeginOverlapPropVolume::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(LPropSpot_OnComponentBeginOverlapPropVolume, OtherActor) == 0x000008, "Member 'LPropSpot_OnComponentBeginOverlapPropVolume::OtherActor' has a wrong offset!");
static_assert(offsetof(LPropSpot_OnComponentBeginOverlapPropVolume, OtherComp) == 0x000010, "Member 'LPropSpot_OnComponentBeginOverlapPropVolume::OtherComp' has a wrong offset!");
static_assert(offsetof(LPropSpot_OnComponentBeginOverlapPropVolume, OtherBodyIndex) == 0x000018, "Member 'LPropSpot_OnComponentBeginOverlapPropVolume::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(LPropSpot_OnComponentBeginOverlapPropVolume, bFromSweep) == 0x00001C, "Member 'LPropSpot_OnComponentBeginOverlapPropVolume::bFromSweep' has a wrong offset!");
static_assert(offsetof(LPropSpot_OnComponentBeginOverlapPropVolume, SweepResult) == 0x000020, "Member 'LPropSpot_OnComponentBeginOverlapPropVolume::SweepResult' has a wrong offset!");

// Function ProjectP.LPropSpot.OnComponentEndOverlapPropVolume
// 0x0020 (0x0020 - 0x0000)
struct LPropSpot_OnComponentEndOverlapPropVolume final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LPropSpot_OnComponentEndOverlapPropVolume) == 0x000008, "Wrong alignment on LPropSpot_OnComponentEndOverlapPropVolume");
static_assert(sizeof(LPropSpot_OnComponentEndOverlapPropVolume) == 0x000020, "Wrong size on LPropSpot_OnComponentEndOverlapPropVolume");
static_assert(offsetof(LPropSpot_OnComponentEndOverlapPropVolume, OverlappedComponent) == 0x000000, "Member 'LPropSpot_OnComponentEndOverlapPropVolume::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(LPropSpot_OnComponentEndOverlapPropVolume, OtherActor) == 0x000008, "Member 'LPropSpot_OnComponentEndOverlapPropVolume::OtherActor' has a wrong offset!");
static_assert(offsetof(LPropSpot_OnComponentEndOverlapPropVolume, OtherComp) == 0x000010, "Member 'LPropSpot_OnComponentEndOverlapPropVolume::OtherComp' has a wrong offset!");
static_assert(offsetof(LPropSpot_OnComponentEndOverlapPropVolume, OtherBodyIndex) == 0x000018, "Member 'LPropSpot_OnComponentEndOverlapPropVolume::OtherBodyIndex' has a wrong offset!");

// Function ProjectP.LBossRoomSpot.OnDeadSpawnNpc
// 0x0008 (0x0008 - 0x0000)
struct LBossRoomSpot_OnDeadSpawnNpc final
{
public:
	class ALNPCSpot*                              TargetNpcSpot;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LBossRoomSpot_OnDeadSpawnNpc) == 0x000008, "Wrong alignment on LBossRoomSpot_OnDeadSpawnNpc");
static_assert(sizeof(LBossRoomSpot_OnDeadSpawnNpc) == 0x000008, "Wrong size on LBossRoomSpot_OnDeadSpawnNpc");
static_assert(offsetof(LBossRoomSpot_OnDeadSpawnNpc, TargetNpcSpot) == 0x000000, "Member 'LBossRoomSpot_OnDeadSpawnNpc::TargetNpcSpot' has a wrong offset!");

// Function ProjectP.LBossRoomSpot.OnSpawnedActor
// 0x0008 (0x0008 - 0x0000)
struct LBossRoomSpot_OnSpawnedActor final
{
public:
	class ALPropSpot*                             TargetPropSpot;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LBossRoomSpot_OnSpawnedActor) == 0x000008, "Wrong alignment on LBossRoomSpot_OnSpawnedActor");
static_assert(sizeof(LBossRoomSpot_OnSpawnedActor) == 0x000008, "Wrong size on LBossRoomSpot_OnSpawnedActor");
static_assert(offsetof(LBossRoomSpot_OnSpawnedActor, TargetPropSpot) == 0x000000, "Member 'LBossRoomSpot_OnSpawnedActor::TargetPropSpot' has a wrong offset!");

// Function ProjectP.LDurableAbnormalBPFuncLibrary.GetInfo
// 0x0010 (0x0010 - 0x0000)
struct LDurableAbnormalBPFuncLibrary_GetInfo final
{
public:
	struct FLDurableAbnormalBPPtr                 In;                                                // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FAbnormalStateCommonInfoPtr            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(LDurableAbnormalBPFuncLibrary_GetInfo) == 0x000008, "Wrong alignment on LDurableAbnormalBPFuncLibrary_GetInfo");
static_assert(sizeof(LDurableAbnormalBPFuncLibrary_GetInfo) == 0x000010, "Wrong size on LDurableAbnormalBPFuncLibrary_GetInfo");
static_assert(offsetof(LDurableAbnormalBPFuncLibrary_GetInfo, In) == 0x000000, "Member 'LDurableAbnormalBPFuncLibrary_GetInfo::In' has a wrong offset!");
static_assert(offsetof(LDurableAbnormalBPFuncLibrary_GetInfo, ReturnValue) == 0x000008, "Member 'LDurableAbnormalBPFuncLibrary_GetInfo::ReturnValue' has a wrong offset!");

// Function ProjectP.LDurableAbnormalBPFuncLibrary.GetUniqueId
// 0x0010 (0x0010 - 0x0000)
struct LDurableAbnormalBPFuncLibrary_GetUniqueId final
{
public:
	struct FLDurableAbnormalBPPtr                 In;                                                // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LDurableAbnormalBPFuncLibrary_GetUniqueId) == 0x000008, "Wrong alignment on LDurableAbnormalBPFuncLibrary_GetUniqueId");
static_assert(sizeof(LDurableAbnormalBPFuncLibrary_GetUniqueId) == 0x000010, "Wrong size on LDurableAbnormalBPFuncLibrary_GetUniqueId");
static_assert(offsetof(LDurableAbnormalBPFuncLibrary_GetUniqueId, In) == 0x000000, "Member 'LDurableAbnormalBPFuncLibrary_GetUniqueId::In' has a wrong offset!");
static_assert(offsetof(LDurableAbnormalBPFuncLibrary_GetUniqueId, ReturnValue) == 0x000008, "Member 'LDurableAbnormalBPFuncLibrary_GetUniqueId::ReturnValue' has a wrong offset!");

// Function ProjectP.LDurableAbnormalBPFuncLibrary.GetRemainDuration
// 0x0010 (0x0010 - 0x0000)
struct LDurableAbnormalBPFuncLibrary_GetRemainDuration final
{
public:
	struct FLDurableAbnormalBPPtr                 In;                                                // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LDurableAbnormalBPFuncLibrary_GetRemainDuration) == 0x000008, "Wrong alignment on LDurableAbnormalBPFuncLibrary_GetRemainDuration");
static_assert(sizeof(LDurableAbnormalBPFuncLibrary_GetRemainDuration) == 0x000010, "Wrong size on LDurableAbnormalBPFuncLibrary_GetRemainDuration");
static_assert(offsetof(LDurableAbnormalBPFuncLibrary_GetRemainDuration, In) == 0x000000, "Member 'LDurableAbnormalBPFuncLibrary_GetRemainDuration::In' has a wrong offset!");
static_assert(offsetof(LDurableAbnormalBPFuncLibrary_GetRemainDuration, ReturnValue) == 0x000008, "Member 'LDurableAbnormalBPFuncLibrary_GetRemainDuration::ReturnValue' has a wrong offset!");

// Function ProjectP.LAbnormalComponent.BuildupHitBP
// 0x001C (0x001C - 0x0000)
struct LAbnormalComponent_BuildupHitBP final
{
public:
	struct FLCalcBuildupData                      InBuildupData;                                     // 0x0000(0x001C)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(LAbnormalComponent_BuildupHitBP) == 0x000004, "Wrong alignment on LAbnormalComponent_BuildupHitBP");
static_assert(sizeof(LAbnormalComponent_BuildupHitBP) == 0x00001C, "Wrong size on LAbnormalComponent_BuildupHitBP");
static_assert(offsetof(LAbnormalComponent_BuildupHitBP, InBuildupData) == 0x000000, "Member 'LAbnormalComponent_BuildupHitBP::InBuildupData' has a wrong offset!");

// Function ProjectP.LAbnormalComponent.CalcDirectBuildupHitByHit
// 0x0170 (0x0170 - 0x0000)
struct LAbnormalComponent_CalcDirectBuildupHitByHit final
{
public:
	struct FLHitInfo                              InHitInfo;                                         // 0x0000(0x0150)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                         InSkillBuildupDamage;                              // 0x0150(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InFireBuildupDamage;                               // 0x0154(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InElectricBuildupDamage;                           // 0x0158(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InAcidBuildupDamage;                               // 0x015C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FLCalcBuildupData>              ReturnValue;                                       // 0x0160(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(LAbnormalComponent_CalcDirectBuildupHitByHit) == 0x000008, "Wrong alignment on LAbnormalComponent_CalcDirectBuildupHitByHit");
static_assert(sizeof(LAbnormalComponent_CalcDirectBuildupHitByHit) == 0x000170, "Wrong size on LAbnormalComponent_CalcDirectBuildupHitByHit");
static_assert(offsetof(LAbnormalComponent_CalcDirectBuildupHitByHit, InHitInfo) == 0x000000, "Member 'LAbnormalComponent_CalcDirectBuildupHitByHit::InHitInfo' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_CalcDirectBuildupHitByHit, InSkillBuildupDamage) == 0x000150, "Member 'LAbnormalComponent_CalcDirectBuildupHitByHit::InSkillBuildupDamage' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_CalcDirectBuildupHitByHit, InFireBuildupDamage) == 0x000154, "Member 'LAbnormalComponent_CalcDirectBuildupHitByHit::InFireBuildupDamage' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_CalcDirectBuildupHitByHit, InElectricBuildupDamage) == 0x000158, "Member 'LAbnormalComponent_CalcDirectBuildupHitByHit::InElectricBuildupDamage' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_CalcDirectBuildupHitByHit, InAcidBuildupDamage) == 0x00015C, "Member 'LAbnormalComponent_CalcDirectBuildupHitByHit::InAcidBuildupDamage' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_CalcDirectBuildupHitByHit, ReturnValue) == 0x000160, "Member 'LAbnormalComponent_CalcDirectBuildupHitByHit::ReturnValue' has a wrong offset!");

// Function ProjectP.LAbnormalComponent.GetAppliedAbnormalMaxDurationByUniqueId
// 0x0010 (0x0010 - 0x0000)
struct LAbnormalComponent_GetAppliedAbnormalMaxDurationByUniqueId final
{
public:
	int64                                         InAbnormalUniqueId;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LAbnormalComponent_GetAppliedAbnormalMaxDurationByUniqueId) == 0x000008, "Wrong alignment on LAbnormalComponent_GetAppliedAbnormalMaxDurationByUniqueId");
static_assert(sizeof(LAbnormalComponent_GetAppliedAbnormalMaxDurationByUniqueId) == 0x000010, "Wrong size on LAbnormalComponent_GetAppliedAbnormalMaxDurationByUniqueId");
static_assert(offsetof(LAbnormalComponent_GetAppliedAbnormalMaxDurationByUniqueId, InAbnormalUniqueId) == 0x000000, "Member 'LAbnormalComponent_GetAppliedAbnormalMaxDurationByUniqueId::InAbnormalUniqueId' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_GetAppliedAbnormalMaxDurationByUniqueId, ReturnValue) == 0x000008, "Member 'LAbnormalComponent_GetAppliedAbnormalMaxDurationByUniqueId::ReturnValue' has a wrong offset!");

// Function ProjectP.LAbnormalComponent.GetAppliedAbnormalRemainDurationByUniqueId
// 0x0010 (0x0010 - 0x0000)
struct LAbnormalComponent_GetAppliedAbnormalRemainDurationByUniqueId final
{
public:
	int64                                         InAbnormalUniqueId;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LAbnormalComponent_GetAppliedAbnormalRemainDurationByUniqueId) == 0x000008, "Wrong alignment on LAbnormalComponent_GetAppliedAbnormalRemainDurationByUniqueId");
static_assert(sizeof(LAbnormalComponent_GetAppliedAbnormalRemainDurationByUniqueId) == 0x000010, "Wrong size on LAbnormalComponent_GetAppliedAbnormalRemainDurationByUniqueId");
static_assert(offsetof(LAbnormalComponent_GetAppliedAbnormalRemainDurationByUniqueId, InAbnormalUniqueId) == 0x000000, "Member 'LAbnormalComponent_GetAppliedAbnormalRemainDurationByUniqueId::InAbnormalUniqueId' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_GetAppliedAbnormalRemainDurationByUniqueId, ReturnValue) == 0x000008, "Member 'LAbnormalComponent_GetAppliedAbnormalRemainDurationByUniqueId::ReturnValue' has a wrong offset!");

// Function ProjectP.LAbnormalComponent.OnCaptureMoment
// 0x0030 (0x0030 - 0x0000)
struct LAbnormalComponent_OnCaptureMoment final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMomentConditionCaptureInfo            Capture;                                           // 0x0008(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(LAbnormalComponent_OnCaptureMoment) == 0x000008, "Wrong alignment on LAbnormalComponent_OnCaptureMoment");
static_assert(sizeof(LAbnormalComponent_OnCaptureMoment) == 0x000030, "Wrong size on LAbnormalComponent_OnCaptureMoment");
static_assert(offsetof(LAbnormalComponent_OnCaptureMoment, Owner) == 0x000000, "Member 'LAbnormalComponent_OnCaptureMoment::Owner' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_OnCaptureMoment, Capture) == 0x000008, "Member 'LAbnormalComponent_OnCaptureMoment::Capture' has a wrong offset!");

// Function ProjectP.LAbnormalComponent.OnChooseOtherWeapon
// 0x0018 (0x0018 - 0x0000)
struct LAbnormalComponent_OnChooseOtherWeapon final
{
public:
	struct FLEquipItemSlot                        EquipSlot;                                         // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(LAbnormalComponent_OnChooseOtherWeapon) == 0x000008, "Wrong alignment on LAbnormalComponent_OnChooseOtherWeapon");
static_assert(sizeof(LAbnormalComponent_OnChooseOtherWeapon) == 0x000018, "Wrong size on LAbnormalComponent_OnChooseOtherWeapon");
static_assert(offsetof(LAbnormalComponent_OnChooseOtherWeapon, EquipSlot) == 0x000000, "Member 'LAbnormalComponent_OnChooseOtherWeapon::EquipSlot' has a wrong offset!");

// Function ProjectP.LAbnormalComponent.OnPlayHideFX
// 0x0001 (0x0001 - 0x0000)
struct LAbnormalComponent_OnPlayHideFX final
{
public:
	bool                                          IsHide;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LAbnormalComponent_OnPlayHideFX) == 0x000001, "Wrong alignment on LAbnormalComponent_OnPlayHideFX");
static_assert(sizeof(LAbnormalComponent_OnPlayHideFX) == 0x000001, "Wrong size on LAbnormalComponent_OnPlayHideFX");
static_assert(offsetof(LAbnormalComponent_OnPlayHideFX, IsHide) == 0x000000, "Member 'LAbnormalComponent_OnPlayHideFX::IsHide' has a wrong offset!");

// Function ProjectP.LAbnormalComponent.OnRemoveAbnormalNiagaraFX
// 0x0008 (0x0008 - 0x0000)
struct LAbnormalComponent_OnRemoveAbnormalNiagaraFX final
{
public:
	class UNiagaraComponent*                      InNiagaraComp;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LAbnormalComponent_OnRemoveAbnormalNiagaraFX) == 0x000008, "Wrong alignment on LAbnormalComponent_OnRemoveAbnormalNiagaraFX");
static_assert(sizeof(LAbnormalComponent_OnRemoveAbnormalNiagaraFX) == 0x000008, "Wrong size on LAbnormalComponent_OnRemoveAbnormalNiagaraFX");
static_assert(offsetof(LAbnormalComponent_OnRemoveAbnormalNiagaraFX, InNiagaraComp) == 0x000000, "Member 'LAbnormalComponent_OnRemoveAbnormalNiagaraFX::InNiagaraComp' has a wrong offset!");

// Function ProjectP.LAbnormalComponent.OnRemoveAbnormalParticleFX
// 0x0008 (0x0008 - 0x0000)
struct LAbnormalComponent_OnRemoveAbnormalParticleFX final
{
public:
	class UParticleSystemComponent*               InParticleComp;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LAbnormalComponent_OnRemoveAbnormalParticleFX) == 0x000008, "Wrong alignment on LAbnormalComponent_OnRemoveAbnormalParticleFX");
static_assert(sizeof(LAbnormalComponent_OnRemoveAbnormalParticleFX) == 0x000008, "Wrong size on LAbnormalComponent_OnRemoveAbnormalParticleFX");
static_assert(offsetof(LAbnormalComponent_OnRemoveAbnormalParticleFX, InParticleComp) == 0x000000, "Member 'LAbnormalComponent_OnRemoveAbnormalParticleFX::InParticleComp' has a wrong offset!");

// Function ProjectP.LAbnormalComponent.OnSatisfiedBuffAlter
// 0x0008 (0x0008 - 0x0000)
struct LAbnormalComponent_OnSatisfiedBuffAlter final
{
public:
	struct FHumanizationBuffAlterInfoPtr          InActiveBuffAlterInfo;                             // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(LAbnormalComponent_OnSatisfiedBuffAlter) == 0x000008, "Wrong alignment on LAbnormalComponent_OnSatisfiedBuffAlter");
static_assert(sizeof(LAbnormalComponent_OnSatisfiedBuffAlter) == 0x000008, "Wrong size on LAbnormalComponent_OnSatisfiedBuffAlter");
static_assert(offsetof(LAbnormalComponent_OnSatisfiedBuffAlter, InActiveBuffAlterInfo) == 0x000000, "Member 'LAbnormalComponent_OnSatisfiedBuffAlter::InActiveBuffAlterInfo' has a wrong offset!");

// Function ProjectP.LAbnormalComponent.PutOn
// 0x0018 (0x0018 - 0x0000)
struct LAbnormalComponent_PutOn final
{
public:
	class FName                                   InAbnormalCodeName;                                // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ForceNewAbnormal;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LAbnormalComponent_PutOn) == 0x000008, "Wrong alignment on LAbnormalComponent_PutOn");
static_assert(sizeof(LAbnormalComponent_PutOn) == 0x000018, "Wrong size on LAbnormalComponent_PutOn");
static_assert(offsetof(LAbnormalComponent_PutOn, InAbnormalCodeName) == 0x000000, "Member 'LAbnormalComponent_PutOn::InAbnormalCodeName' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_PutOn, ForceNewAbnormal) == 0x000008, "Member 'LAbnormalComponent_PutOn::ForceNewAbnormal' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_PutOn, ReturnValue) == 0x000010, "Member 'LAbnormalComponent_PutOn::ReturnValue' has a wrong offset!");

// Function ProjectP.LAbnormalComponent.PutOnByPayload
// 0x0038 (0x0038 - 0x0000)
struct LAbnormalComponent_PutOnByPayload final
{
public:
	class FName                                   InAbnormalCodeName;                                // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLAbnormalPayload                      InPayload;                                         // 0x0008(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LAbnormalComponent_PutOnByPayload) == 0x000008, "Wrong alignment on LAbnormalComponent_PutOnByPayload");
static_assert(sizeof(LAbnormalComponent_PutOnByPayload) == 0x000038, "Wrong size on LAbnormalComponent_PutOnByPayload");
static_assert(offsetof(LAbnormalComponent_PutOnByPayload, InAbnormalCodeName) == 0x000000, "Member 'LAbnormalComponent_PutOnByPayload::InAbnormalCodeName' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_PutOnByPayload, InPayload) == 0x000008, "Member 'LAbnormalComponent_PutOnByPayload::InPayload' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_PutOnByPayload, ReturnValue) == 0x000030, "Member 'LAbnormalComponent_PutOnByPayload::ReturnValue' has a wrong offset!");

// Function ProjectP.LAbnormalComponent.PutOnWithInstigator
// 0x0018 (0x0018 - 0x0000)
struct LAbnormalComponent_PutOnWithInstigator final
{
public:
	class FName                                   InAbnormalCodeName;                                // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InInstigator;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LAbnormalComponent_PutOnWithInstigator) == 0x000008, "Wrong alignment on LAbnormalComponent_PutOnWithInstigator");
static_assert(sizeof(LAbnormalComponent_PutOnWithInstigator) == 0x000018, "Wrong size on LAbnormalComponent_PutOnWithInstigator");
static_assert(offsetof(LAbnormalComponent_PutOnWithInstigator, InAbnormalCodeName) == 0x000000, "Member 'LAbnormalComponent_PutOnWithInstigator::InAbnormalCodeName' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_PutOnWithInstigator, InInstigator) == 0x000008, "Member 'LAbnormalComponent_PutOnWithInstigator::InInstigator' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_PutOnWithInstigator, ReturnValue) == 0x000010, "Member 'LAbnormalComponent_PutOnWithInstigator::ReturnValue' has a wrong offset!");

// Function ProjectP.LAbnormalComponent.PutOnWithReason
// 0x0018 (0x0018 - 0x0000)
struct LAbnormalComponent_PutOnWithReason final
{
public:
	class FName                                   InAbnormalCodeName;                                // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InReasonCodeName;                                  // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LAbnormalComponent_PutOnWithReason) == 0x000008, "Wrong alignment on LAbnormalComponent_PutOnWithReason");
static_assert(sizeof(LAbnormalComponent_PutOnWithReason) == 0x000018, "Wrong size on LAbnormalComponent_PutOnWithReason");
static_assert(offsetof(LAbnormalComponent_PutOnWithReason, InAbnormalCodeName) == 0x000000, "Member 'LAbnormalComponent_PutOnWithReason::InAbnormalCodeName' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_PutOnWithReason, InReasonCodeName) == 0x000008, "Member 'LAbnormalComponent_PutOnWithReason::InReasonCodeName' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_PutOnWithReason, ReturnValue) == 0x000010, "Member 'LAbnormalComponent_PutOnWithReason::ReturnValue' has a wrong offset!");

// Function ProjectP.LAbnormalComponent.TakeOff
// 0x000C (0x000C - 0x0000)
struct LAbnormalComponent_TakeOff final
{
public:
	class FName                                   InAbnormalCodeName;                                // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Immediately;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LAbnormalComponent_TakeOff) == 0x000004, "Wrong alignment on LAbnormalComponent_TakeOff");
static_assert(sizeof(LAbnormalComponent_TakeOff) == 0x00000C, "Wrong size on LAbnormalComponent_TakeOff");
static_assert(offsetof(LAbnormalComponent_TakeOff, InAbnormalCodeName) == 0x000000, "Member 'LAbnormalComponent_TakeOff::InAbnormalCodeName' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_TakeOff, Immediately) == 0x000008, "Member 'LAbnormalComponent_TakeOff::Immediately' has a wrong offset!");

// Function ProjectP.LAbnormalComponent.TakeOffAllByInstigator
// 0x0010 (0x0010 - 0x0000)
struct LAbnormalComponent_TakeOffAllByInstigator final
{
public:
	class UObject*                                InInstigator;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Immediately;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LAbnormalComponent_TakeOffAllByInstigator) == 0x000008, "Wrong alignment on LAbnormalComponent_TakeOffAllByInstigator");
static_assert(sizeof(LAbnormalComponent_TakeOffAllByInstigator) == 0x000010, "Wrong size on LAbnormalComponent_TakeOffAllByInstigator");
static_assert(offsetof(LAbnormalComponent_TakeOffAllByInstigator, InInstigator) == 0x000000, "Member 'LAbnormalComponent_TakeOffAllByInstigator::InInstigator' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_TakeOffAllByInstigator, Immediately) == 0x000008, "Member 'LAbnormalComponent_TakeOffAllByInstigator::Immediately' has a wrong offset!");

// Function ProjectP.LAbnormalComponent.TakeOffByGroup
// 0x000C (0x000C - 0x0000)
struct LAbnormalComponent_TakeOffByGroup final
{
public:
	class FName                                   IGroupCodeName;                                    // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Immediately;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LAbnormalComponent_TakeOffByGroup) == 0x000004, "Wrong alignment on LAbnormalComponent_TakeOffByGroup");
static_assert(sizeof(LAbnormalComponent_TakeOffByGroup) == 0x00000C, "Wrong size on LAbnormalComponent_TakeOffByGroup");
static_assert(offsetof(LAbnormalComponent_TakeOffByGroup, IGroupCodeName) == 0x000000, "Member 'LAbnormalComponent_TakeOffByGroup::IGroupCodeName' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_TakeOffByGroup, Immediately) == 0x000008, "Member 'LAbnormalComponent_TakeOffByGroup::Immediately' has a wrong offset!");

// Function ProjectP.LAbnormalComponent.TakeOffByInstigator
// 0x0018 (0x0018 - 0x0000)
struct LAbnormalComponent_TakeOffByInstigator final
{
public:
	class FName                                   InAbnormalCodeName;                                // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InInstigator;                                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Immediately;                                       // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LAbnormalComponent_TakeOffByInstigator) == 0x000008, "Wrong alignment on LAbnormalComponent_TakeOffByInstigator");
static_assert(sizeof(LAbnormalComponent_TakeOffByInstigator) == 0x000018, "Wrong size on LAbnormalComponent_TakeOffByInstigator");
static_assert(offsetof(LAbnormalComponent_TakeOffByInstigator, InAbnormalCodeName) == 0x000000, "Member 'LAbnormalComponent_TakeOffByInstigator::InAbnormalCodeName' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_TakeOffByInstigator, InInstigator) == 0x000008, "Member 'LAbnormalComponent_TakeOffByInstigator::InInstigator' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_TakeOffByInstigator, Immediately) == 0x000010, "Member 'LAbnormalComponent_TakeOffByInstigator::Immediately' has a wrong offset!");

// Function ProjectP.LAbnormalComponent.TakeOffByUniqueId
// 0x0010 (0x0010 - 0x0000)
struct LAbnormalComponent_TakeOffByUniqueId final
{
public:
	int64                                         InAbnormalUniqueId;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Immediately;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LAbnormalComponent_TakeOffByUniqueId) == 0x000008, "Wrong alignment on LAbnormalComponent_TakeOffByUniqueId");
static_assert(sizeof(LAbnormalComponent_TakeOffByUniqueId) == 0x000010, "Wrong size on LAbnormalComponent_TakeOffByUniqueId");
static_assert(offsetof(LAbnormalComponent_TakeOffByUniqueId, InAbnormalUniqueId) == 0x000000, "Member 'LAbnormalComponent_TakeOffByUniqueId::InAbnormalUniqueId' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_TakeOffByUniqueId, Immediately) == 0x000008, "Member 'LAbnormalComponent_TakeOffByUniqueId::Immediately' has a wrong offset!");

// Function ProjectP.LAbnormalComponent.TakeOffWithRefCount
// 0x0010 (0x0010 - 0x0000)
struct LAbnormalComponent_TakeOffWithRefCount final
{
public:
	int64                                         InAbnormalUniqueId;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Immediately;                                       // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LAbnormalComponent_TakeOffWithRefCount) == 0x000008, "Wrong alignment on LAbnormalComponent_TakeOffWithRefCount");
static_assert(sizeof(LAbnormalComponent_TakeOffWithRefCount) == 0x000010, "Wrong size on LAbnormalComponent_TakeOffWithRefCount");
static_assert(offsetof(LAbnormalComponent_TakeOffWithRefCount, InAbnormalUniqueId) == 0x000000, "Member 'LAbnormalComponent_TakeOffWithRefCount::InAbnormalUniqueId' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_TakeOffWithRefCount, Immediately) == 0x000008, "Member 'LAbnormalComponent_TakeOffWithRefCount::Immediately' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_TakeOffWithRefCount, ReturnValue) == 0x000009, "Member 'LAbnormalComponent_TakeOffWithRefCount::ReturnValue' has a wrong offset!");

// Function ProjectP.LAbnormalComponent.GetAppliedAbnormals
// 0x0010 (0x0010 - 0x0000)
struct LAbnormalComponent_GetAppliedAbnormals final
{
public:
	TArray<struct FLDurableAbnormalBPPtr>         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(LAbnormalComponent_GetAppliedAbnormals) == 0x000008, "Wrong alignment on LAbnormalComponent_GetAppliedAbnormals");
static_assert(sizeof(LAbnormalComponent_GetAppliedAbnormals) == 0x000010, "Wrong size on LAbnormalComponent_GetAppliedAbnormals");
static_assert(offsetof(LAbnormalComponent_GetAppliedAbnormals, ReturnValue) == 0x000000, "Member 'LAbnormalComponent_GetAppliedAbnormals::ReturnValue' has a wrong offset!");

// Function ProjectP.LAbnormalComponent.IsAppliedAbnormal
// 0x000C (0x000C - 0x0000)
struct LAbnormalComponent_IsAppliedAbnormal final
{
public:
	class FName                                   InAbnormalCodeName;                                // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LAbnormalComponent_IsAppliedAbnormal) == 0x000004, "Wrong alignment on LAbnormalComponent_IsAppliedAbnormal");
static_assert(sizeof(LAbnormalComponent_IsAppliedAbnormal) == 0x00000C, "Wrong size on LAbnormalComponent_IsAppliedAbnormal");
static_assert(offsetof(LAbnormalComponent_IsAppliedAbnormal, InAbnormalCodeName) == 0x000000, "Member 'LAbnormalComponent_IsAppliedAbnormal::InAbnormalCodeName' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_IsAppliedAbnormal, ReturnValue) == 0x000008, "Member 'LAbnormalComponent_IsAppliedAbnormal::ReturnValue' has a wrong offset!");

// Function ProjectP.LAbnormalComponent.IsAppliedAbnormalCount
// 0x000C (0x000C - 0x0000)
struct LAbnormalComponent_IsAppliedAbnormalCount final
{
public:
	class FName                                   InAbnormalCodeName;                                // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LAbnormalComponent_IsAppliedAbnormalCount) == 0x000004, "Wrong alignment on LAbnormalComponent_IsAppliedAbnormalCount");
static_assert(sizeof(LAbnormalComponent_IsAppliedAbnormalCount) == 0x00000C, "Wrong size on LAbnormalComponent_IsAppliedAbnormalCount");
static_assert(offsetof(LAbnormalComponent_IsAppliedAbnormalCount, InAbnormalCodeName) == 0x000000, "Member 'LAbnormalComponent_IsAppliedAbnormalCount::InAbnormalCodeName' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_IsAppliedAbnormalCount, ReturnValue) == 0x000008, "Member 'LAbnormalComponent_IsAppliedAbnormalCount::ReturnValue' has a wrong offset!");

// Function ProjectP.LAbnormalComponent.IsAppliedGroupAbnormal
// 0x000C (0x000C - 0x0000)
struct LAbnormalComponent_IsAppliedGroupAbnormal final
{
public:
	class FName                                   GroupCodename;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LAbnormalComponent_IsAppliedGroupAbnormal) == 0x000004, "Wrong alignment on LAbnormalComponent_IsAppliedGroupAbnormal");
static_assert(sizeof(LAbnormalComponent_IsAppliedGroupAbnormal) == 0x00000C, "Wrong size on LAbnormalComponent_IsAppliedGroupAbnormal");
static_assert(offsetof(LAbnormalComponent_IsAppliedGroupAbnormal, GroupCodename) == 0x000000, "Member 'LAbnormalComponent_IsAppliedGroupAbnormal::GroupCodename' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_IsAppliedGroupAbnormal, ReturnValue) == 0x000008, "Member 'LAbnormalComponent_IsAppliedGroupAbnormal::ReturnValue' has a wrong offset!");

// Function ProjectP.LAbnormalComponent.IsBuildupAbnormal
// 0x000C (0x000C - 0x0000)
struct LAbnormalComponent_IsBuildupAbnormal final
{
public:
	class FName                                   InAbnormalCodeName;                                // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LAbnormalComponent_IsBuildupAbnormal) == 0x000004, "Wrong alignment on LAbnormalComponent_IsBuildupAbnormal");
static_assert(sizeof(LAbnormalComponent_IsBuildupAbnormal) == 0x00000C, "Wrong size on LAbnormalComponent_IsBuildupAbnormal");
static_assert(offsetof(LAbnormalComponent_IsBuildupAbnormal, InAbnormalCodeName) == 0x000000, "Member 'LAbnormalComponent_IsBuildupAbnormal::InAbnormalCodeName' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_IsBuildupAbnormal, ReturnValue) == 0x000008, "Member 'LAbnormalComponent_IsBuildupAbnormal::ReturnValue' has a wrong offset!");

// Function ProjectP.LAbnormalComponent.IsGaugeAbnormal
// 0x000C (0x000C - 0x0000)
struct LAbnormalComponent_IsGaugeAbnormal final
{
public:
	class FName                                   InAbnormalCodeName;                                // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(LAbnormalComponent_IsGaugeAbnormal) == 0x000004, "Wrong alignment on LAbnormalComponent_IsGaugeAbnormal");
static_assert(sizeof(LAbnormalComponent_IsGaugeAbnormal) == 0x00000C, "Wrong size on LAbnormalComponent_IsGaugeAbnormal");
static_assert(offsetof(LAbnormalComponent_IsGaugeAbnormal, InAbnormalCodeName) == 0x000000, "Member 'LAbnormalComponent_IsGaugeAbnormal::InAbnormalCodeName' has a wrong offset!");
static_assert(offsetof(LAbnormalComponent_IsGaugeAbnormal, ReturnValue) == 0x000008, "Member 'LAbnormalComponent_IsGaugeAbnormal::ReturnValue' has a wrong offset!");

// Function ProjectP.LBTask_BlueprintBase.GetBehaivorTreeNodeName
// 0x0010 (0x0010 - 0x0000)
struct LBTask_BlueprintBase_GetBehaivorTreeNodeName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LBTask_BlueprintBase_GetBehaivorTreeNodeName) == 0x000008, "Wrong alignment on LBTask_BlueprintBase_GetBehaivorTreeNodeName");
static_assert(sizeof(LBTask_BlueprintBase_GetBehaivorTreeNodeName) == 0x000010, "Wrong size on LBTask_BlueprintBase_GetBehaivorTreeNodeName");
static_assert(offsetof(LBTask_BlueprintBase_GetBehaivorTreeNodeName, ReturnValue) == 0x000000, "Member 'LBTask_BlueprintBase_GetBehaivorTreeNodeName::ReturnValue' has a wrong offset!");

// Function ProjectP.LBTask_BlueprintBase.SetBehaivorTreeNodeName
// 0x0010 (0x0010 - 0x0000)
struct LBTask_BlueprintBase_SetBehaivorTreeNodeName final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LBTask_BlueprintBase_SetBehaivorTreeNodeName) == 0x000008, "Wrong alignment on LBTask_BlueprintBase_SetBehaivorTreeNodeName");
static_assert(sizeof(LBTask_BlueprintBase_SetBehaivorTreeNodeName) == 0x000010, "Wrong size on LBTask_BlueprintBase_SetBehaivorTreeNodeName");
static_assert(offsetof(LBTask_BlueprintBase_SetBehaivorTreeNodeName, Name_0) == 0x000000, "Member 'LBTask_BlueprintBase_SetBehaivorTreeNodeName::Name_0' has a wrong offset!");

// Function ProjectP.LDynamicDamageVolumeActor.AddDamagePerTime
// 0x0008 (0x0008 - 0x0000)
struct LDynamicDamageVolumeActor_AddDamagePerTime final
{
public:
	class ALCharacter*                            TargetActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LDynamicDamageVolumeActor_AddDamagePerTime) == 0x000008, "Wrong alignment on LDynamicDamageVolumeActor_AddDamagePerTime");
static_assert(sizeof(LDynamicDamageVolumeActor_AddDamagePerTime) == 0x000008, "Wrong size on LDynamicDamageVolumeActor_AddDamagePerTime");
static_assert(offsetof(LDynamicDamageVolumeActor_AddDamagePerTime, TargetActor) == 0x000000, "Member 'LDynamicDamageVolumeActor_AddDamagePerTime::TargetActor' has a wrong offset!");

// Function ProjectP.LDynamicDamageVolumeActor.ApplyDamage
// 0x0098 (0x0098 - 0x0000)
struct LDynamicDamageVolumeActor_ApplyDamage final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             HitResult;                                         // 0x0008(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class FName                                   Skill_Hit_Override;                                // 0x0090(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LDynamicDamageVolumeActor_ApplyDamage) == 0x000008, "Wrong alignment on LDynamicDamageVolumeActor_ApplyDamage");
static_assert(sizeof(LDynamicDamageVolumeActor_ApplyDamage) == 0x000098, "Wrong size on LDynamicDamageVolumeActor_ApplyDamage");
static_assert(offsetof(LDynamicDamageVolumeActor_ApplyDamage, TargetActor) == 0x000000, "Member 'LDynamicDamageVolumeActor_ApplyDamage::TargetActor' has a wrong offset!");
static_assert(offsetof(LDynamicDamageVolumeActor_ApplyDamage, HitResult) == 0x000008, "Member 'LDynamicDamageVolumeActor_ApplyDamage::HitResult' has a wrong offset!");
static_assert(offsetof(LDynamicDamageVolumeActor_ApplyDamage, Skill_Hit_Override) == 0x000090, "Member 'LDynamicDamageVolumeActor_ApplyDamage::Skill_Hit_Override' has a wrong offset!");

// Function ProjectP.LDynamicDamageVolumeActor.GetOverlappedActors
// 0x0010 (0x0010 - 0x0000)
struct LDynamicDamageVolumeActor_GetOverlappedActors final
{
public:
	TArray<class AActor*>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(LDynamicDamageVolumeActor_GetOverlappedActors) == 0x000008, "Wrong alignment on LDynamicDamageVolumeActor_GetOverlappedActors");
static_assert(sizeof(LDynamicDamageVolumeActor_GetOverlappedActors) == 0x000010, "Wrong size on LDynamicDamageVolumeActor_GetOverlappedActors");
static_assert(offsetof(LDynamicDamageVolumeActor_GetOverlappedActors, ReturnValue) == 0x000000, "Member 'LDynamicDamageVolumeActor_GetOverlappedActors::ReturnValue' has a wrong offset!");

// Function ProjectP.LDynamicDamageVolumeActor.OnBeginOverlap
// 0x0090 (0x0090 - 0x0000)
struct LDynamicDamageVolumeActor_OnBeginOverlap final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             HitResult;                                         // 0x0008(0x0088)(Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
static_assert(alignof(LDynamicDamageVolumeActor_OnBeginOverlap) == 0x000008, "Wrong alignment on LDynamicDamageVolumeActor_OnBeginOverlap");
static_assert(sizeof(LDynamicDamageVolumeActor_OnBeginOverlap) == 0x000090, "Wrong size on LDynamicDamageVolumeActor_OnBeginOverlap");
static_assert(offsetof(LDynamicDamageVolumeActor_OnBeginOverlap, Actor) == 0x000000, "Member 'LDynamicDamageVolumeActor_OnBeginOverlap::Actor' has a wrong offset!");
static_assert(offsetof(LDynamicDamageVolumeActor_OnBeginOverlap, HitResult) == 0x000008, "Member 'LDynamicDamageVolumeActor_OnBeginOverlap::HitResult' has a wrong offset!");

// Function ProjectP.LDynamicDamageVolumeActor.OnEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct LDynamicDamageVolumeActor_OnEndOverlap final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LDynamicDamageVolumeActor_OnEndOverlap) == 0x000008, "Wrong alignment on LDynamicDamageVolumeActor_OnEndOverlap");
static_assert(sizeof(LDynamicDamageVolumeActor_OnEndOverlap) == 0x000008, "Wrong size on LDynamicDamageVolumeActor_OnEndOverlap");
static_assert(offsetof(LDynamicDamageVolumeActor_OnEndOverlap, Actor) == 0x000000, "Member 'LDynamicDamageVolumeActor_OnEndOverlap::Actor' has a wrong offset!");

// Function ProjectP.LDynamicDamageVolumeActor.RemoveDamagePerTime
// 0x0008 (0x0008 - 0x0000)
struct LDynamicDamageVolumeActor_RemoveDamagePerTime final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LDynamicDamageVolumeActor_RemoveDamagePerTime) == 0x000008, "Wrong alignment on LDynamicDamageVolumeActor_RemoveDamagePerTime");
static_assert(sizeof(LDynamicDamageVolumeActor_RemoveDamagePerTime) == 0x000008, "Wrong size on LDynamicDamageVolumeActor_RemoveDamagePerTime");
static_assert(offsetof(LDynamicDamageVolumeActor_RemoveDamagePerTime, TargetActor) == 0x000000, "Member 'LDynamicDamageVolumeActor_RemoveDamagePerTime::TargetActor' has a wrong offset!");

// Function ProjectP.LDynamicDamageVolumeActor.ResetDynamicDamageVolumeInfo
// 0x0008 (0x0008 - 0x0000)
struct LDynamicDamageVolumeActor_ResetDynamicDamageVolumeInfo final
{
public:
	class FName                                   InCodeName;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LDynamicDamageVolumeActor_ResetDynamicDamageVolumeInfo) == 0x000004, "Wrong alignment on LDynamicDamageVolumeActor_ResetDynamicDamageVolumeInfo");
static_assert(sizeof(LDynamicDamageVolumeActor_ResetDynamicDamageVolumeInfo) == 0x000008, "Wrong size on LDynamicDamageVolumeActor_ResetDynamicDamageVolumeInfo");
static_assert(offsetof(LDynamicDamageVolumeActor_ResetDynamicDamageVolumeInfo, InCodeName) == 0x000000, "Member 'LDynamicDamageVolumeActor_ResetDynamicDamageVolumeInfo::InCodeName' has a wrong offset!");

// Function ProjectP.LDynamicDamageVolumeActor.SetOverlappedActors
// 0x0010 (0x0010 - 0x0000)
struct LDynamicDamageVolumeActor_SetOverlappedActors final
{
public:
	TArray<class AActor*>                         InActorList;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(LDynamicDamageVolumeActor_SetOverlappedActors) == 0x000008, "Wrong alignment on LDynamicDamageVolumeActor_SetOverlappedActors");
static_assert(sizeof(LDynamicDamageVolumeActor_SetOverlappedActors) == 0x000010, "Wrong size on LDynamicDamageVolumeActor_SetOverlappedActors");
static_assert(offsetof(LDynamicDamageVolumeActor_SetOverlappedActors, InActorList) == 0x000000, "Member 'LDynamicDamageVolumeActor_SetOverlappedActors::InActorList' has a wrong offset!");

// Function ProjectP.LAchievementSystem.MakeAchievementLog
// 0x0018 (0x0018 - 0x0000)
struct LAchievementSystem_MakeAchievementLog final
{
public:
	class FName                                   AchievementCodeName;                               // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(LAchievementSystem_MakeAchievementLog) == 0x000008, "Wrong alignment on LAchievementSystem_MakeAchievementLog");
static_assert(sizeof(LAchievementSystem_MakeAchievementLog) == 0x000018, "Wrong size on LAchievementSystem_MakeAchievementLog");
static_assert(offsetof(LAchievementSystem_MakeAchievementLog, AchievementCodeName) == 0x000000, "Member 'LAchievementSystem_MakeAchievementLog::AchievementCodeName' has a wrong offset!");
