#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoulDrop_Butterfly_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function SoulDrop_Butterfly_BP.SoulDrop_Butterfly_BP_C.ExecuteUbergraph_SoulDrop_Butterfly_BP
// 0x0030 (0x0030 - 0x0000)
struct SoulDrop_Butterfly_BP_C_ExecuteUbergraph_SoulDrop_Butterfly_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CH_PC_Pino_C*                       K2Node_DynamicCast_AsBP_CH_PC_Pino;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SoulDrop_Butterfly_BP_C_ExecuteUbergraph_SoulDrop_Butterfly_BP) == 0x000008, "Wrong alignment on SoulDrop_Butterfly_BP_C_ExecuteUbergraph_SoulDrop_Butterfly_BP");
static_assert(sizeof(SoulDrop_Butterfly_BP_C_ExecuteUbergraph_SoulDrop_Butterfly_BP) == 0x000030, "Wrong size on SoulDrop_Butterfly_BP_C_ExecuteUbergraph_SoulDrop_Butterfly_BP");
static_assert(offsetof(SoulDrop_Butterfly_BP_C_ExecuteUbergraph_SoulDrop_Butterfly_BP, EntryPoint) == 0x000000, "Member 'SoulDrop_Butterfly_BP_C_ExecuteUbergraph_SoulDrop_Butterfly_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(SoulDrop_Butterfly_BP_C_ExecuteUbergraph_SoulDrop_Butterfly_BP, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'SoulDrop_Butterfly_BP_C_ExecuteUbergraph_SoulDrop_Butterfly_BP::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(SoulDrop_Butterfly_BP_C_ExecuteUbergraph_SoulDrop_Butterfly_BP, K2Node_DynamicCast_AsLPCCharacter) == 0x000010, "Member 'SoulDrop_Butterfly_BP_C_ExecuteUbergraph_SoulDrop_Butterfly_BP::K2Node_DynamicCast_AsLPCCharacter' has a wrong offset!");
static_assert(offsetof(SoulDrop_Butterfly_BP_C_ExecuteUbergraph_SoulDrop_Butterfly_BP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'SoulDrop_Butterfly_BP_C_ExecuteUbergraph_SoulDrop_Butterfly_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SoulDrop_Butterfly_BP_C_ExecuteUbergraph_SoulDrop_Butterfly_BP, K2Node_DynamicCast_AsBP_CH_PC_Pino) == 0x000020, "Member 'SoulDrop_Butterfly_BP_C_ExecuteUbergraph_SoulDrop_Butterfly_BP::K2Node_DynamicCast_AsBP_CH_PC_Pino' has a wrong offset!");
static_assert(offsetof(SoulDrop_Butterfly_BP_C_ExecuteUbergraph_SoulDrop_Butterfly_BP, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'SoulDrop_Butterfly_BP_C_ExecuteUbergraph_SoulDrop_Butterfly_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

