#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SourceControl

#include "Basic.hpp"

#include "SourceControl_structs.hpp"


namespace SDK::Params
{

// Function SourceControl.SourceControlHelpers.CheckInFile
// 0x0028 (0x0028 - 0x0000)
struct SourceControlHelpers_CheckInFile final
{
public:
	class FString                                 InFile;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InDescription;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSilent;                                           // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SourceControlHelpers_CheckInFile) == 0x000008, "Wrong alignment on SourceControlHelpers_CheckInFile");
static_assert(sizeof(SourceControlHelpers_CheckInFile) == 0x000028, "Wrong size on SourceControlHelpers_CheckInFile");
static_assert(offsetof(SourceControlHelpers_CheckInFile, InFile) == 0x000000, "Member 'SourceControlHelpers_CheckInFile::InFile' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_CheckInFile, InDescription) == 0x000010, "Member 'SourceControlHelpers_CheckInFile::InDescription' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_CheckInFile, bSilent) == 0x000020, "Member 'SourceControlHelpers_CheckInFile::bSilent' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_CheckInFile, ReturnValue) == 0x000021, "Member 'SourceControlHelpers_CheckInFile::ReturnValue' has a wrong offset!");

// Function SourceControl.SourceControlHelpers.CheckInFiles
// 0x0028 (0x0028 - 0x0000)
struct SourceControlHelpers_CheckInFiles final
{
public:
	TArray<class FString>                         InFiles;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 InDescription;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSilent;                                           // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SourceControlHelpers_CheckInFiles) == 0x000008, "Wrong alignment on SourceControlHelpers_CheckInFiles");
static_assert(sizeof(SourceControlHelpers_CheckInFiles) == 0x000028, "Wrong size on SourceControlHelpers_CheckInFiles");
static_assert(offsetof(SourceControlHelpers_CheckInFiles, InFiles) == 0x000000, "Member 'SourceControlHelpers_CheckInFiles::InFiles' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_CheckInFiles, InDescription) == 0x000010, "Member 'SourceControlHelpers_CheckInFiles::InDescription' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_CheckInFiles, bSilent) == 0x000020, "Member 'SourceControlHelpers_CheckInFiles::bSilent' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_CheckInFiles, ReturnValue) == 0x000021, "Member 'SourceControlHelpers_CheckInFiles::ReturnValue' has a wrong offset!");

// Function SourceControl.SourceControlHelpers.CheckOutFile
// 0x0018 (0x0018 - 0x0000)
struct SourceControlHelpers_CheckOutFile final
{
public:
	class FString                                 InFile;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSilent;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SourceControlHelpers_CheckOutFile) == 0x000008, "Wrong alignment on SourceControlHelpers_CheckOutFile");
static_assert(sizeof(SourceControlHelpers_CheckOutFile) == 0x000018, "Wrong size on SourceControlHelpers_CheckOutFile");
static_assert(offsetof(SourceControlHelpers_CheckOutFile, InFile) == 0x000000, "Member 'SourceControlHelpers_CheckOutFile::InFile' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_CheckOutFile, bSilent) == 0x000010, "Member 'SourceControlHelpers_CheckOutFile::bSilent' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_CheckOutFile, ReturnValue) == 0x000011, "Member 'SourceControlHelpers_CheckOutFile::ReturnValue' has a wrong offset!");

// Function SourceControl.SourceControlHelpers.CheckOutFiles
// 0x0018 (0x0018 - 0x0000)
struct SourceControlHelpers_CheckOutFiles final
{
public:
	TArray<class FString>                         InFiles;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bSilent;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SourceControlHelpers_CheckOutFiles) == 0x000008, "Wrong alignment on SourceControlHelpers_CheckOutFiles");
static_assert(sizeof(SourceControlHelpers_CheckOutFiles) == 0x000018, "Wrong size on SourceControlHelpers_CheckOutFiles");
static_assert(offsetof(SourceControlHelpers_CheckOutFiles, InFiles) == 0x000000, "Member 'SourceControlHelpers_CheckOutFiles::InFiles' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_CheckOutFiles, bSilent) == 0x000010, "Member 'SourceControlHelpers_CheckOutFiles::bSilent' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_CheckOutFiles, ReturnValue) == 0x000011, "Member 'SourceControlHelpers_CheckOutFiles::ReturnValue' has a wrong offset!");

// Function SourceControl.SourceControlHelpers.CheckOutOrAddFile
// 0x0018 (0x0018 - 0x0000)
struct SourceControlHelpers_CheckOutOrAddFile final
{
public:
	class FString                                 InFile;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSilent;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SourceControlHelpers_CheckOutOrAddFile) == 0x000008, "Wrong alignment on SourceControlHelpers_CheckOutOrAddFile");
static_assert(sizeof(SourceControlHelpers_CheckOutOrAddFile) == 0x000018, "Wrong size on SourceControlHelpers_CheckOutOrAddFile");
static_assert(offsetof(SourceControlHelpers_CheckOutOrAddFile, InFile) == 0x000000, "Member 'SourceControlHelpers_CheckOutOrAddFile::InFile' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_CheckOutOrAddFile, bSilent) == 0x000010, "Member 'SourceControlHelpers_CheckOutOrAddFile::bSilent' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_CheckOutOrAddFile, ReturnValue) == 0x000011, "Member 'SourceControlHelpers_CheckOutOrAddFile::ReturnValue' has a wrong offset!");

// Function SourceControl.SourceControlHelpers.CheckOutOrAddFiles
// 0x0018 (0x0018 - 0x0000)
struct SourceControlHelpers_CheckOutOrAddFiles final
{
public:
	TArray<class FString>                         InFiles;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bSilent;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SourceControlHelpers_CheckOutOrAddFiles) == 0x000008, "Wrong alignment on SourceControlHelpers_CheckOutOrAddFiles");
static_assert(sizeof(SourceControlHelpers_CheckOutOrAddFiles) == 0x000018, "Wrong size on SourceControlHelpers_CheckOutOrAddFiles");
static_assert(offsetof(SourceControlHelpers_CheckOutOrAddFiles, InFiles) == 0x000000, "Member 'SourceControlHelpers_CheckOutOrAddFiles::InFiles' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_CheckOutOrAddFiles, bSilent) == 0x000010, "Member 'SourceControlHelpers_CheckOutOrAddFiles::bSilent' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_CheckOutOrAddFiles, ReturnValue) == 0x000011, "Member 'SourceControlHelpers_CheckOutOrAddFiles::ReturnValue' has a wrong offset!");

// Function SourceControl.SourceControlHelpers.CopyFile
// 0x0028 (0x0028 - 0x0000)
struct SourceControlHelpers_CopyFile final
{
public:
	class FString                                 InSourceFile;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InDestFile;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSilent;                                           // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SourceControlHelpers_CopyFile) == 0x000008, "Wrong alignment on SourceControlHelpers_CopyFile");
static_assert(sizeof(SourceControlHelpers_CopyFile) == 0x000028, "Wrong size on SourceControlHelpers_CopyFile");
static_assert(offsetof(SourceControlHelpers_CopyFile, InSourceFile) == 0x000000, "Member 'SourceControlHelpers_CopyFile::InSourceFile' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_CopyFile, InDestFile) == 0x000010, "Member 'SourceControlHelpers_CopyFile::InDestFile' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_CopyFile, bSilent) == 0x000020, "Member 'SourceControlHelpers_CopyFile::bSilent' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_CopyFile, ReturnValue) == 0x000021, "Member 'SourceControlHelpers_CopyFile::ReturnValue' has a wrong offset!");

// Function SourceControl.SourceControlHelpers.CurrentProvider
// 0x0010 (0x0010 - 0x0000)
struct SourceControlHelpers_CurrentProvider final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SourceControlHelpers_CurrentProvider) == 0x000008, "Wrong alignment on SourceControlHelpers_CurrentProvider");
static_assert(sizeof(SourceControlHelpers_CurrentProvider) == 0x000010, "Wrong size on SourceControlHelpers_CurrentProvider");
static_assert(offsetof(SourceControlHelpers_CurrentProvider, ReturnValue) == 0x000000, "Member 'SourceControlHelpers_CurrentProvider::ReturnValue' has a wrong offset!");

// Function SourceControl.SourceControlHelpers.IsAvailable
// 0x0001 (0x0001 - 0x0000)
struct SourceControlHelpers_IsAvailable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SourceControlHelpers_IsAvailable) == 0x000001, "Wrong alignment on SourceControlHelpers_IsAvailable");
static_assert(sizeof(SourceControlHelpers_IsAvailable) == 0x000001, "Wrong size on SourceControlHelpers_IsAvailable");
static_assert(offsetof(SourceControlHelpers_IsAvailable, ReturnValue) == 0x000000, "Member 'SourceControlHelpers_IsAvailable::ReturnValue' has a wrong offset!");

// Function SourceControl.SourceControlHelpers.IsEnabled
// 0x0001 (0x0001 - 0x0000)
struct SourceControlHelpers_IsEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SourceControlHelpers_IsEnabled) == 0x000001, "Wrong alignment on SourceControlHelpers_IsEnabled");
static_assert(sizeof(SourceControlHelpers_IsEnabled) == 0x000001, "Wrong size on SourceControlHelpers_IsEnabled");
static_assert(offsetof(SourceControlHelpers_IsEnabled, ReturnValue) == 0x000000, "Member 'SourceControlHelpers_IsEnabled::ReturnValue' has a wrong offset!");

// Function SourceControl.SourceControlHelpers.LastErrorMsg
// 0x0018 (0x0018 - 0x0000)
struct SourceControlHelpers_LastErrorMsg final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SourceControlHelpers_LastErrorMsg) == 0x000008, "Wrong alignment on SourceControlHelpers_LastErrorMsg");
static_assert(sizeof(SourceControlHelpers_LastErrorMsg) == 0x000018, "Wrong size on SourceControlHelpers_LastErrorMsg");
static_assert(offsetof(SourceControlHelpers_LastErrorMsg, ReturnValue) == 0x000000, "Member 'SourceControlHelpers_LastErrorMsg::ReturnValue' has a wrong offset!");

// Function SourceControl.SourceControlHelpers.MarkFileForAdd
// 0x0018 (0x0018 - 0x0000)
struct SourceControlHelpers_MarkFileForAdd final
{
public:
	class FString                                 InFile;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSilent;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SourceControlHelpers_MarkFileForAdd) == 0x000008, "Wrong alignment on SourceControlHelpers_MarkFileForAdd");
static_assert(sizeof(SourceControlHelpers_MarkFileForAdd) == 0x000018, "Wrong size on SourceControlHelpers_MarkFileForAdd");
static_assert(offsetof(SourceControlHelpers_MarkFileForAdd, InFile) == 0x000000, "Member 'SourceControlHelpers_MarkFileForAdd::InFile' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_MarkFileForAdd, bSilent) == 0x000010, "Member 'SourceControlHelpers_MarkFileForAdd::bSilent' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_MarkFileForAdd, ReturnValue) == 0x000011, "Member 'SourceControlHelpers_MarkFileForAdd::ReturnValue' has a wrong offset!");

// Function SourceControl.SourceControlHelpers.MarkFileForDelete
// 0x0018 (0x0018 - 0x0000)
struct SourceControlHelpers_MarkFileForDelete final
{
public:
	class FString                                 InFile;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSilent;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SourceControlHelpers_MarkFileForDelete) == 0x000008, "Wrong alignment on SourceControlHelpers_MarkFileForDelete");
static_assert(sizeof(SourceControlHelpers_MarkFileForDelete) == 0x000018, "Wrong size on SourceControlHelpers_MarkFileForDelete");
static_assert(offsetof(SourceControlHelpers_MarkFileForDelete, InFile) == 0x000000, "Member 'SourceControlHelpers_MarkFileForDelete::InFile' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_MarkFileForDelete, bSilent) == 0x000010, "Member 'SourceControlHelpers_MarkFileForDelete::bSilent' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_MarkFileForDelete, ReturnValue) == 0x000011, "Member 'SourceControlHelpers_MarkFileForDelete::ReturnValue' has a wrong offset!");

// Function SourceControl.SourceControlHelpers.MarkFilesForAdd
// 0x0018 (0x0018 - 0x0000)
struct SourceControlHelpers_MarkFilesForAdd final
{
public:
	TArray<class FString>                         InFiles;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bSilent;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SourceControlHelpers_MarkFilesForAdd) == 0x000008, "Wrong alignment on SourceControlHelpers_MarkFilesForAdd");
static_assert(sizeof(SourceControlHelpers_MarkFilesForAdd) == 0x000018, "Wrong size on SourceControlHelpers_MarkFilesForAdd");
static_assert(offsetof(SourceControlHelpers_MarkFilesForAdd, InFiles) == 0x000000, "Member 'SourceControlHelpers_MarkFilesForAdd::InFiles' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_MarkFilesForAdd, bSilent) == 0x000010, "Member 'SourceControlHelpers_MarkFilesForAdd::bSilent' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_MarkFilesForAdd, ReturnValue) == 0x000011, "Member 'SourceControlHelpers_MarkFilesForAdd::ReturnValue' has a wrong offset!");

// Function SourceControl.SourceControlHelpers.MarkFilesForDelete
// 0x0018 (0x0018 - 0x0000)
struct SourceControlHelpers_MarkFilesForDelete final
{
public:
	TArray<class FString>                         InFiles;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bSilent;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SourceControlHelpers_MarkFilesForDelete) == 0x000008, "Wrong alignment on SourceControlHelpers_MarkFilesForDelete");
static_assert(sizeof(SourceControlHelpers_MarkFilesForDelete) == 0x000018, "Wrong size on SourceControlHelpers_MarkFilesForDelete");
static_assert(offsetof(SourceControlHelpers_MarkFilesForDelete, InFiles) == 0x000000, "Member 'SourceControlHelpers_MarkFilesForDelete::InFiles' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_MarkFilesForDelete, bSilent) == 0x000010, "Member 'SourceControlHelpers_MarkFilesForDelete::bSilent' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_MarkFilesForDelete, ReturnValue) == 0x000011, "Member 'SourceControlHelpers_MarkFilesForDelete::ReturnValue' has a wrong offset!");

// Function SourceControl.SourceControlHelpers.QueryFileState
// 0x0050 (0x0050 - 0x0000)
struct SourceControlHelpers_QueryFileState final
{
public:
	class FString                                 InFile;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSilent;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSourceControlState                    ReturnValue;                                       // 0x0018(0x0038)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SourceControlHelpers_QueryFileState) == 0x000008, "Wrong alignment on SourceControlHelpers_QueryFileState");
static_assert(sizeof(SourceControlHelpers_QueryFileState) == 0x000050, "Wrong size on SourceControlHelpers_QueryFileState");
static_assert(offsetof(SourceControlHelpers_QueryFileState, InFile) == 0x000000, "Member 'SourceControlHelpers_QueryFileState::InFile' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_QueryFileState, bSilent) == 0x000010, "Member 'SourceControlHelpers_QueryFileState::bSilent' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_QueryFileState, ReturnValue) == 0x000018, "Member 'SourceControlHelpers_QueryFileState::ReturnValue' has a wrong offset!");

// Function SourceControl.SourceControlHelpers.RevertFile
// 0x0018 (0x0018 - 0x0000)
struct SourceControlHelpers_RevertFile final
{
public:
	class FString                                 InFile;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSilent;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SourceControlHelpers_RevertFile) == 0x000008, "Wrong alignment on SourceControlHelpers_RevertFile");
static_assert(sizeof(SourceControlHelpers_RevertFile) == 0x000018, "Wrong size on SourceControlHelpers_RevertFile");
static_assert(offsetof(SourceControlHelpers_RevertFile, InFile) == 0x000000, "Member 'SourceControlHelpers_RevertFile::InFile' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_RevertFile, bSilent) == 0x000010, "Member 'SourceControlHelpers_RevertFile::bSilent' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_RevertFile, ReturnValue) == 0x000011, "Member 'SourceControlHelpers_RevertFile::ReturnValue' has a wrong offset!");

// Function SourceControl.SourceControlHelpers.RevertFiles
// 0x0018 (0x0018 - 0x0000)
struct SourceControlHelpers_RevertFiles final
{
public:
	TArray<class FString>                         InFiles;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bSilent;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SourceControlHelpers_RevertFiles) == 0x000008, "Wrong alignment on SourceControlHelpers_RevertFiles");
static_assert(sizeof(SourceControlHelpers_RevertFiles) == 0x000018, "Wrong size on SourceControlHelpers_RevertFiles");
static_assert(offsetof(SourceControlHelpers_RevertFiles, InFiles) == 0x000000, "Member 'SourceControlHelpers_RevertFiles::InFiles' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_RevertFiles, bSilent) == 0x000010, "Member 'SourceControlHelpers_RevertFiles::bSilent' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_RevertFiles, ReturnValue) == 0x000011, "Member 'SourceControlHelpers_RevertFiles::ReturnValue' has a wrong offset!");

// Function SourceControl.SourceControlHelpers.RevertUnchangedFile
// 0x0018 (0x0018 - 0x0000)
struct SourceControlHelpers_RevertUnchangedFile final
{
public:
	class FString                                 InFile;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSilent;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SourceControlHelpers_RevertUnchangedFile) == 0x000008, "Wrong alignment on SourceControlHelpers_RevertUnchangedFile");
static_assert(sizeof(SourceControlHelpers_RevertUnchangedFile) == 0x000018, "Wrong size on SourceControlHelpers_RevertUnchangedFile");
static_assert(offsetof(SourceControlHelpers_RevertUnchangedFile, InFile) == 0x000000, "Member 'SourceControlHelpers_RevertUnchangedFile::InFile' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_RevertUnchangedFile, bSilent) == 0x000010, "Member 'SourceControlHelpers_RevertUnchangedFile::bSilent' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_RevertUnchangedFile, ReturnValue) == 0x000011, "Member 'SourceControlHelpers_RevertUnchangedFile::ReturnValue' has a wrong offset!");

// Function SourceControl.SourceControlHelpers.RevertUnchangedFiles
// 0x0018 (0x0018 - 0x0000)
struct SourceControlHelpers_RevertUnchangedFiles final
{
public:
	TArray<class FString>                         InFiles;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bSilent;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SourceControlHelpers_RevertUnchangedFiles) == 0x000008, "Wrong alignment on SourceControlHelpers_RevertUnchangedFiles");
static_assert(sizeof(SourceControlHelpers_RevertUnchangedFiles) == 0x000018, "Wrong size on SourceControlHelpers_RevertUnchangedFiles");
static_assert(offsetof(SourceControlHelpers_RevertUnchangedFiles, InFiles) == 0x000000, "Member 'SourceControlHelpers_RevertUnchangedFiles::InFiles' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_RevertUnchangedFiles, bSilent) == 0x000010, "Member 'SourceControlHelpers_RevertUnchangedFiles::bSilent' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_RevertUnchangedFiles, ReturnValue) == 0x000011, "Member 'SourceControlHelpers_RevertUnchangedFiles::ReturnValue' has a wrong offset!");

// Function SourceControl.SourceControlHelpers.SyncFile
// 0x0018 (0x0018 - 0x0000)
struct SourceControlHelpers_SyncFile final
{
public:
	class FString                                 InFile;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSilent;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SourceControlHelpers_SyncFile) == 0x000008, "Wrong alignment on SourceControlHelpers_SyncFile");
static_assert(sizeof(SourceControlHelpers_SyncFile) == 0x000018, "Wrong size on SourceControlHelpers_SyncFile");
static_assert(offsetof(SourceControlHelpers_SyncFile, InFile) == 0x000000, "Member 'SourceControlHelpers_SyncFile::InFile' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_SyncFile, bSilent) == 0x000010, "Member 'SourceControlHelpers_SyncFile::bSilent' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_SyncFile, ReturnValue) == 0x000011, "Member 'SourceControlHelpers_SyncFile::ReturnValue' has a wrong offset!");

// Function SourceControl.SourceControlHelpers.SyncFiles
// 0x0018 (0x0018 - 0x0000)
struct SourceControlHelpers_SyncFiles final
{
public:
	TArray<class FString>                         InFiles;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          bSilent;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SourceControlHelpers_SyncFiles) == 0x000008, "Wrong alignment on SourceControlHelpers_SyncFiles");
static_assert(sizeof(SourceControlHelpers_SyncFiles) == 0x000018, "Wrong size on SourceControlHelpers_SyncFiles");
static_assert(offsetof(SourceControlHelpers_SyncFiles, InFiles) == 0x000000, "Member 'SourceControlHelpers_SyncFiles::InFiles' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_SyncFiles, bSilent) == 0x000010, "Member 'SourceControlHelpers_SyncFiles::bSilent' has a wrong offset!");
static_assert(offsetof(SourceControlHelpers_SyncFiles, ReturnValue) == 0x000011, "Member 'SourceControlHelpers_SyncFiles::ReturnValue' has a wrong offset!");

}

