#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Steelheart_animBP_V02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Steelheart_AnimType_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass steelheart_animBP_V02.steelheart_animBP_V02_C
// 0x03F0 (0x06B0 - 0x02C0)
class USteelheart_animBP_V02_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x02F8(0x0080)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0378(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0440(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0468(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0490(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0510(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0540(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x05C0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x05F0(0x00B0)()
	ESteelheart_AnimType                          AnimType;                                          // 0x06A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_steelheart_animBP_V02(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_steelheart_animBP_V02_AnimGraphNode_TransitionResult_8E89192746948AA1D5E0EBB85B9820D7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_steelheart_animBP_V02_AnimGraphNode_TransitionResult_7AAE0D044AF7F7BF5806A0B0243375DF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_steelheart_animBP_V02_AnimGraphNode_ApplyAdditive_9D1B4153454C1D9256BDD89E226BB804();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"steelheart_animBP_V02_C">();
	}
	static class USteelheart_animBP_V02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USteelheart_animBP_V02_C>();
	}
};
static_assert(alignof(USteelheart_animBP_V02_C) == 0x000010, "Wrong alignment on USteelheart_animBP_V02_C");
static_assert(sizeof(USteelheart_animBP_V02_C) == 0x0006B0, "Wrong size on USteelheart_animBP_V02_C");
static_assert(offsetof(USteelheart_animBP_V02_C, UberGraphFrame) == 0x0002C0, "Member 'USteelheart_animBP_V02_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USteelheart_animBP_V02_C, AnimGraphNode_Root) == 0x0002C8, "Member 'USteelheart_animBP_V02_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(USteelheart_animBP_V02_C, AnimGraphNode_SequencePlayer_2) == 0x0002F8, "Member 'USteelheart_animBP_V02_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(USteelheart_animBP_V02_C, AnimGraphNode_ApplyAdditive) == 0x000378, "Member 'USteelheart_animBP_V02_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(USteelheart_animBP_V02_C, AnimGraphNode_TransitionResult_1) == 0x000440, "Member 'USteelheart_animBP_V02_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(USteelheart_animBP_V02_C, AnimGraphNode_TransitionResult) == 0x000468, "Member 'USteelheart_animBP_V02_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(USteelheart_animBP_V02_C, AnimGraphNode_SequencePlayer_1) == 0x000490, "Member 'USteelheart_animBP_V02_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(USteelheart_animBP_V02_C, AnimGraphNode_StateResult_1) == 0x000510, "Member 'USteelheart_animBP_V02_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(USteelheart_animBP_V02_C, AnimGraphNode_SequencePlayer) == 0x000540, "Member 'USteelheart_animBP_V02_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(USteelheart_animBP_V02_C, AnimGraphNode_StateResult) == 0x0005C0, "Member 'USteelheart_animBP_V02_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(USteelheart_animBP_V02_C, AnimGraphNode_StateMachine) == 0x0005F0, "Member 'USteelheart_animBP_V02_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(USteelheart_animBP_V02_C, AnimType) == 0x0006A0, "Member 'USteelheart_animBP_V02_C::AnimType' has a wrong offset!");

}

