#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_Ch_UpperBody

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_Ch_UpperBody.Struct_Ch_UpperBody
// 0x00A8 (0x00A8 - 0x0000)
struct FStruct_Ch_UpperBody final
{
public:
	TSoftObjectPtr<class USkeletalMesh>           SkeletalMesh_22_EB6521E84484EDF09F0F0BA619FB908D;  // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UMaterialInstance>       HandBloodMaterial_25_1A32ADE3402AD081FD2186A1E164B3BD; // 0x0028(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture>                FacePixelDepthOffsetMask_24_35F60F7146801DA066213392EAD950A4; // 0x0050(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	float                                         FacePixelDepthOffsetIntensity_10_37949B794BF1CFDB39D676BB31A724AA; // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class USkeletalMesh>           ShrinkMesh_23_0726B5064EF95017622DBEAA38633456;    // 0x0080(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FStruct_Ch_UpperBody) == 0x000008, "Wrong alignment on FStruct_Ch_UpperBody");
static_assert(sizeof(FStruct_Ch_UpperBody) == 0x0000A8, "Wrong size on FStruct_Ch_UpperBody");
static_assert(offsetof(FStruct_Ch_UpperBody, SkeletalMesh_22_EB6521E84484EDF09F0F0BA619FB908D) == 0x000000, "Member 'FStruct_Ch_UpperBody::SkeletalMesh_22_EB6521E84484EDF09F0F0BA619FB908D' has a wrong offset!");
static_assert(offsetof(FStruct_Ch_UpperBody, HandBloodMaterial_25_1A32ADE3402AD081FD2186A1E164B3BD) == 0x000028, "Member 'FStruct_Ch_UpperBody::HandBloodMaterial_25_1A32ADE3402AD081FD2186A1E164B3BD' has a wrong offset!");
static_assert(offsetof(FStruct_Ch_UpperBody, FacePixelDepthOffsetMask_24_35F60F7146801DA066213392EAD950A4) == 0x000050, "Member 'FStruct_Ch_UpperBody::FacePixelDepthOffsetMask_24_35F60F7146801DA066213392EAD950A4' has a wrong offset!");
static_assert(offsetof(FStruct_Ch_UpperBody, FacePixelDepthOffsetIntensity_10_37949B794BF1CFDB39D676BB31A724AA) == 0x000078, "Member 'FStruct_Ch_UpperBody::FacePixelDepthOffsetIntensity_10_37949B794BF1CFDB39D676BB31A724AA' has a wrong offset!");
static_assert(offsetof(FStruct_Ch_UpperBody, ShrinkMesh_23_0726B5064EF95017622DBEAA38633456) == 0x000080, "Member 'FStruct_Ch_UpperBody::ShrinkMesh_23_0726B5064EF95017622DBEAA38633456' has a wrong offset!");

}

