#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIBP_ListData_OneStat

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass UIBP_ListData_OneStat.UIBP_ListData_OneStat_C
// 0x0080 (0x00A8 - 0x0028)
class UUIBP_ListData_OneStat_C final : public UObject
{
public:
	class FName                                   ID;                                                // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   Label;                                             // 0x0030(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0048(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   Value;                                             // 0x0070(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         Diff;                                              // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Divisor;                                           // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Decimal;                                           // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ELFirstStat>                           ChaUpPreviewStat;                                  // 0x0098(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIBP_ListData_OneStat_C">();
	}
	static class UUIBP_ListData_OneStat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIBP_ListData_OneStat_C>();
	}
};
static_assert(alignof(UUIBP_ListData_OneStat_C) == 0x000008, "Wrong alignment on UUIBP_ListData_OneStat_C");
static_assert(sizeof(UUIBP_ListData_OneStat_C) == 0x0000A8, "Wrong size on UUIBP_ListData_OneStat_C");
static_assert(offsetof(UUIBP_ListData_OneStat_C, ID) == 0x000028, "Member 'UUIBP_ListData_OneStat_C::ID' has a wrong offset!");
static_assert(offsetof(UUIBP_ListData_OneStat_C, Label) == 0x000030, "Member 'UUIBP_ListData_OneStat_C::Label' has a wrong offset!");
static_assert(offsetof(UUIBP_ListData_OneStat_C, Icon) == 0x000048, "Member 'UUIBP_ListData_OneStat_C::Icon' has a wrong offset!");
static_assert(offsetof(UUIBP_ListData_OneStat_C, Value) == 0x000070, "Member 'UUIBP_ListData_OneStat_C::Value' has a wrong offset!");
static_assert(offsetof(UUIBP_ListData_OneStat_C, Diff) == 0x000088, "Member 'UUIBP_ListData_OneStat_C::Diff' has a wrong offset!");
static_assert(offsetof(UUIBP_ListData_OneStat_C, Divisor) == 0x00008C, "Member 'UUIBP_ListData_OneStat_C::Divisor' has a wrong offset!");
static_assert(offsetof(UUIBP_ListData_OneStat_C, Decimal) == 0x000090, "Member 'UUIBP_ListData_OneStat_C::Decimal' has a wrong offset!");
static_assert(offsetof(UUIBP_ListData_OneStat_C, ChaUpPreviewStat) == 0x000098, "Member 'UUIBP_ListData_OneStat_C::ChaUpPreviewStat' has a wrong offset!");

}

