#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIBP_LRichKeyTextBlock

#include "Basic.hpp"


namespace SDK::Params
{

// Function UIBP_LRichKeyTextBlock.UIBP_LRichKeyTextBlock_C.SetKeyText
// 0x0048 (0x0048 - 0x0000)
struct UIBP_LRichKeyTextBlock_C_SetKeyText final
{
public:
	class FText                                   Text_0;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_ReplaceKeyText_EditText;                  // 0x0018(0x0018)()
	TDelegate<void(bool bGamePad)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class ULPlayInputSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIBP_LRichKeyTextBlock_C_SetKeyText) == 0x000008, "Wrong alignment on UIBP_LRichKeyTextBlock_C_SetKeyText");
static_assert(sizeof(UIBP_LRichKeyTextBlock_C_SetKeyText) == 0x000048, "Wrong size on UIBP_LRichKeyTextBlock_C_SetKeyText");
static_assert(offsetof(UIBP_LRichKeyTextBlock_C_SetKeyText, Text_0) == 0x000000, "Member 'UIBP_LRichKeyTextBlock_C_SetKeyText::Text_0' has a wrong offset!");
static_assert(offsetof(UIBP_LRichKeyTextBlock_C_SetKeyText, CallFunc_ReplaceKeyText_EditText) == 0x000018, "Member 'UIBP_LRichKeyTextBlock_C_SetKeyText::CallFunc_ReplaceKeyText_EditText' has a wrong offset!");
static_assert(offsetof(UIBP_LRichKeyTextBlock_C_SetKeyText, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'UIBP_LRichKeyTextBlock_C_SetKeyText::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIBP_LRichKeyTextBlock_C_SetKeyText, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000040, "Member 'UIBP_LRichKeyTextBlock_C_SetKeyText::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function UIBP_LRichKeyTextBlock.UIBP_LRichKeyTextBlock_C.UpdateText
// 0x0020 (0x0020 - 0x0000)
struct UIBP_LRichKeyTextBlock_C_UpdateText final
{
public:
	bool                                          bGamePad;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_ReplaceKeyText_EditText;                  // 0x0008(0x0018)()
};
static_assert(alignof(UIBP_LRichKeyTextBlock_C_UpdateText) == 0x000008, "Wrong alignment on UIBP_LRichKeyTextBlock_C_UpdateText");
static_assert(sizeof(UIBP_LRichKeyTextBlock_C_UpdateText) == 0x000020, "Wrong size on UIBP_LRichKeyTextBlock_C_UpdateText");
static_assert(offsetof(UIBP_LRichKeyTextBlock_C_UpdateText, bGamePad) == 0x000000, "Member 'UIBP_LRichKeyTextBlock_C_UpdateText::bGamePad' has a wrong offset!");
static_assert(offsetof(UIBP_LRichKeyTextBlock_C_UpdateText, CallFunc_ReplaceKeyText_EditText) == 0x000008, "Member 'UIBP_LRichKeyTextBlock_C_UpdateText::CallFunc_ReplaceKeyText_EditText' has a wrong offset!");

}

