#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIBP_ListData_IsNew

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass UIBP_ListData_IsNew.UIBP_ListData_IsNew_C
// 0x0028 (0x0050 - 0x0028)
class UUIBP_ListData_IsNew_C final : public UObject
{
public:
	class FName                                   ID;                                                // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   Label;                                             // 0x0030(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          Enabled;                                           // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          IsNew;                                             // 0x0049(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIBP_ListData_IsNew_C">();
	}
	static class UUIBP_ListData_IsNew_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIBP_ListData_IsNew_C>();
	}
};
static_assert(alignof(UUIBP_ListData_IsNew_C) == 0x000008, "Wrong alignment on UUIBP_ListData_IsNew_C");
static_assert(sizeof(UUIBP_ListData_IsNew_C) == 0x000050, "Wrong size on UUIBP_ListData_IsNew_C");
static_assert(offsetof(UUIBP_ListData_IsNew_C, ID) == 0x000028, "Member 'UUIBP_ListData_IsNew_C::ID' has a wrong offset!");
static_assert(offsetof(UUIBP_ListData_IsNew_C, Label) == 0x000030, "Member 'UUIBP_ListData_IsNew_C::Label' has a wrong offset!");
static_assert(offsetof(UUIBP_ListData_IsNew_C, Enabled) == 0x000048, "Member 'UUIBP_ListData_IsNew_C::Enabled' has a wrong offset!");
static_assert(offsetof(UUIBP_ListData_IsNew_C, IsNew) == 0x000049, "Member 'UUIBP_ListData_IsNew_C::IsNew' has a wrong offset!");

}

