#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIBP_FunctionLibrary

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"
#include "UIEN_EquipSlotSize_structs.hpp"
#include "UIST_FirstStatInfo_structs.hpp"
#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "UIST_FirstCategoryInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UIST_Sound_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UIEN_WeaponPart_structs.hpp"
#include "UIST_ForceFeedback_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UIBP_FunctionLibrary.UIBP_FunctionLibrary_C.GetMainWidget
// 0x0030 (0x0030 - 0x0000)
struct UIBP_FunctionLibrary_C_GetMainWidget final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            MainWidget;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULUISystem*                             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULWidget*                               CallFunc_GetMainWidget_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            K2Node_DynamicCast_AsUIW_Main;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIBP_FunctionLibrary_C_GetMainWidget) == 0x000008, "Wrong alignment on UIBP_FunctionLibrary_C_GetMainWidget");
static_assert(sizeof(UIBP_FunctionLibrary_C_GetMainWidget) == 0x000030, "Wrong size on UIBP_FunctionLibrary_C_GetMainWidget");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMainWidget, __WorldContext) == 0x000000, "Member 'UIBP_FunctionLibrary_C_GetMainWidget::__WorldContext' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMainWidget, MainWidget) == 0x000008, "Member 'UIBP_FunctionLibrary_C_GetMainWidget::MainWidget' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMainWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'UIBP_FunctionLibrary_C_GetMainWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMainWidget, CallFunc_GetMainWidget_ReturnValue) == 0x000018, "Member 'UIBP_FunctionLibrary_C_GetMainWidget::CallFunc_GetMainWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMainWidget, K2Node_DynamicCast_AsUIW_Main) == 0x000020, "Member 'UIBP_FunctionLibrary_C_GetMainWidget::K2Node_DynamicCast_AsUIW_Main' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMainWidget, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'UIBP_FunctionLibrary_C_GetMainWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UIBP_FunctionLibrary.UIBP_FunctionLibrary_C.IsTestViewport
// 0x0028 (0x0028 - 0x0000)
struct UIBP_FunctionLibrary_C_IsTestViewport final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTest;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIBP_FunctionLibrary_C_IsTestViewport) == 0x000008, "Wrong alignment on UIBP_FunctionLibrary_C_IsTestViewport");
static_assert(sizeof(UIBP_FunctionLibrary_C_IsTestViewport) == 0x000028, "Wrong size on UIBP_FunctionLibrary_C_IsTestViewport");
static_assert(offsetof(UIBP_FunctionLibrary_C_IsTestViewport, __WorldContext) == 0x000000, "Member 'UIBP_FunctionLibrary_C_IsTestViewport::__WorldContext' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_IsTestViewport, IsTest) == 0x000008, "Member 'UIBP_FunctionLibrary_C_IsTestViewport::IsTest' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_IsTestViewport, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000010, "Member 'UIBP_FunctionLibrary_C_IsTestViewport::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_IsTestViewport, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000020, "Member 'UIBP_FunctionLibrary_C_IsTestViewport::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function UIBP_FunctionLibrary.UIBP_FunctionLibrary_C.GetKeyName
// 0x00D8 (0x00D8 - 0x0000)
struct UIBP_FunctionLibrary_C_GetKeyName final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   KeyName;                                           // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FKey, class FName>                LocalKeyData;                                      // 0x0028(0x0050)(Edit, BlueprintVisible)
	TMap<struct FKey, class FName>                K2Node_MakeVariable_MakeVariableOutput;            // 0x0078(0x0050)()
	class FName                                   CallFunc_Map_Find_Value;                           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIBP_FunctionLibrary_C_GetKeyName) == 0x000008, "Wrong alignment on UIBP_FunctionLibrary_C_GetKeyName");
static_assert(sizeof(UIBP_FunctionLibrary_C_GetKeyName) == 0x0000D8, "Wrong size on UIBP_FunctionLibrary_C_GetKeyName");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyName, Key) == 0x000000, "Member 'UIBP_FunctionLibrary_C_GetKeyName::Key' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyName, __WorldContext) == 0x000018, "Member 'UIBP_FunctionLibrary_C_GetKeyName::__WorldContext' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyName, KeyName) == 0x000020, "Member 'UIBP_FunctionLibrary_C_GetKeyName::KeyName' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyName, LocalKeyData) == 0x000028, "Member 'UIBP_FunctionLibrary_C_GetKeyName::LocalKeyData' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyName, K2Node_MakeVariable_MakeVariableOutput) == 0x000078, "Member 'UIBP_FunctionLibrary_C_GetKeyName::K2Node_MakeVariable_MakeVariableOutput' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyName, CallFunc_Map_Find_Value) == 0x0000C8, "Member 'UIBP_FunctionLibrary_C_GetKeyName::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyName, CallFunc_Map_Find_ReturnValue) == 0x0000D0, "Member 'UIBP_FunctionLibrary_C_GetKeyName::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function UIBP_FunctionLibrary.UIBP_FunctionLibrary_C.GetKeyIcon
// 0x0230 (0x0230 - 0x0000)
struct UIBP_FunctionLibrary_C_GetKeyIcon final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FName                                   AlterKeyName;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Icon;                                              // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LocalKeyName;                                      // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FKey, class FName>                LocalKeyData;                                      // 0x0038(0x0050)(Edit, BlueprintVisible)
	TMap<struct FKey, class FName>                K2Node_MakeVariable_MakeVariableOutput;            // 0x0088(0x0050)()
	class ULPlayInputSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingPlayStationGamePad_ReturnValue;    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULPlayInputSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetInputPlatformName_ReturnValue;         // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ULPlayInputSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingPlayStationGamePad_ReturnValue_1;  // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULPlayInputSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetInputPlatformName_ReturnValue_1;       // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess_1;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Key_IsGamepadKey_ReturnValue;             // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRichImageRow                          CallFunc_GetDataTableRowFromName_OutRow;           // 0x0130(0x0090)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetImage_ReturnValue;                     // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Map_Find_Value;                           // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIBP_FunctionLibrary_C_GetKeyIcon) == 0x000008, "Wrong alignment on UIBP_FunctionLibrary_C_GetKeyIcon");
static_assert(sizeof(UIBP_FunctionLibrary_C_GetKeyIcon) == 0x000230, "Wrong size on UIBP_FunctionLibrary_C_GetKeyIcon");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, Key) == 0x000000, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::Key' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, AlterKeyName) == 0x000018, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::AlterKeyName' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, __WorldContext) == 0x000020, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::__WorldContext' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, Icon) == 0x000028, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::Icon' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, LocalKeyName) == 0x000030, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::LocalKeyName' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, LocalKeyData) == 0x000038, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::LocalKeyData' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, K2Node_MakeVariable_MakeVariableOutput) == 0x000088, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::K2Node_MakeVariable_MakeVariableOutput' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000D8, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, CallFunc_IsUsingPlayStationGamePad_ReturnValue) == 0x0000E0, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::CallFunc_IsUsingPlayStationGamePad_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0000E8, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, CallFunc_GetInputPlatformName_ReturnValue) == 0x0000F0, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::CallFunc_GetInputPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000100, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, K2Node_SwitchString_CmpSuccess) == 0x000108, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, CallFunc_IsUsingPlayStationGamePad_ReturnValue_1) == 0x000109, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::CallFunc_IsUsingPlayStationGamePad_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000110, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, CallFunc_GetInputPlatformName_ReturnValue_1) == 0x000118, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::CallFunc_GetInputPlatformName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, K2Node_SwitchString_CmpSuccess_1) == 0x000128, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::K2Node_SwitchString_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000129, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, CallFunc_Key_IsGamepadKey_ReturnValue) == 0x00012A, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::CallFunc_Key_IsGamepadKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x00012B, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, CallFunc_GetDataTableRowFromName_OutRow) == 0x000130, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0001C0, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, CallFunc_GetImage_ReturnValue) == 0x0001C8, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::CallFunc_GetImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, K2Node_DynamicCast_AsTexture_2D) == 0x0001D0, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, K2Node_DynamicCast_bSuccess) == 0x0001D8, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, CallFunc_Conv_NameToString_ReturnValue) == 0x0001E0, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, CallFunc_Concat_StrStr_ReturnValue) == 0x0001F0, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000200, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, CallFunc_Conv_StringToName_ReturnValue) == 0x000210, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000218, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, CallFunc_Map_Find_Value) == 0x000220, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetKeyIcon, CallFunc_Map_Find_ReturnValue) == 0x000228, "Member 'UIBP_FunctionLibrary_C_GetKeyIcon::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function UIBP_FunctionLibrary.UIBP_FunctionLibrary_C.ReplaceKeyText
// 0x01A8 (0x01A8 - 0x0000)
struct UIBP_FunctionLibrary_C_ReplaceKeyText final
{
public:
	class FText                                   OriginalText;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   EditText;                                          // 0x0020(0x0018)(Parm, OutParm)
	class FString                                 LocalKeyNameString;                                // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 LocalActionNameString;                             // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 LocalReplaceString;                                // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 LocalPlatformName;                                 // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          LocalIsGamePad;                                    // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULPlayInputSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetInputPlatformName_ReturnValue;         // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePadMode_ReturnValue;                // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetActionNames_ActionNames;               // 0x00C8(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BuildString_Name_ReturnValue;             // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetKeyStringFromActionName_KeyString;     // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0110(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_1;           // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetAxisNames_AxisNames;                   // 0x0150(0x0010)(ReferenceParm)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0164(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetKeyStringFromAxisName_KeyString;       // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BuildString_Name_ReturnValue_1;           // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Replace_ReturnValue_1;                    // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIBP_FunctionLibrary_C_ReplaceKeyText) == 0x000008, "Wrong alignment on UIBP_FunctionLibrary_C_ReplaceKeyText");
static_assert(sizeof(UIBP_FunctionLibrary_C_ReplaceKeyText) == 0x0001A8, "Wrong size on UIBP_FunctionLibrary_C_ReplaceKeyText");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, OriginalText) == 0x000000, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::OriginalText' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, __WorldContext) == 0x000018, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::__WorldContext' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, EditText) == 0x000020, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::EditText' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, LocalKeyNameString) == 0x000038, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::LocalKeyNameString' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, LocalActionNameString) == 0x000048, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::LocalActionNameString' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, LocalReplaceString) == 0x000058, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::LocalReplaceString' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, LocalPlatformName) == 0x000068, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::LocalPlatformName' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, LocalIsGamePad) == 0x000078, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::LocalIsGamePad' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000080, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, CallFunc_Conv_TextToString_ReturnValue) == 0x000088, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, CallFunc_GetInputPlatformName_ReturnValue) == 0x000098, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::CallFunc_GetInputPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, CallFunc_IsGamePadMode_ReturnValue) == 0x0000A8, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::CallFunc_IsGamePadMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, Temp_int_Loop_Counter_Variable) == 0x0000AC, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, CallFunc_Add_IntInt_ReturnValue) == 0x0000B0, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, Temp_int_Array_Index_Variable) == 0x0000B4, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, Temp_int_Array_Index_Variable_1) == 0x0000B8, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, CallFunc_GetInputSettings_ReturnValue) == 0x0000C0, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::CallFunc_GetInputSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, CallFunc_GetActionNames_ActionNames) == 0x0000C8, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::CallFunc_GetActionNames_ActionNames' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, CallFunc_Array_Length_ReturnValue) == 0x0000E0, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, CallFunc_BuildString_Name_ReturnValue) == 0x0000E8, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::CallFunc_BuildString_Name_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, CallFunc_GetKeyStringFromActionName_KeyString) == 0x0000F8, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::CallFunc_GetKeyStringFromActionName_KeyString' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, Temp_int_Loop_Counter_Variable_1) == 0x000108, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, CallFunc_Conv_StringToText_ReturnValue) == 0x000110, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, CallFunc_Less_IntInt_ReturnValue) == 0x000128, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, CallFunc_Add_IntInt_ReturnValue_1) == 0x00012C, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, CallFunc_Replace_ReturnValue) == 0x000130, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::CallFunc_Replace_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, CallFunc_Contains_ReturnValue) == 0x000140, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, CallFunc_GetInputSettings_ReturnValue_1) == 0x000148, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::CallFunc_GetInputSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, CallFunc_GetAxisNames_AxisNames) == 0x000150, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::CallFunc_GetAxisNames_AxisNames' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, CallFunc_Contains_ReturnValue_1) == 0x000160, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, CallFunc_Array_Get_Item_1) == 0x000164, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, CallFunc_GetKeyStringFromAxisName_KeyString) == 0x000170, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::CallFunc_GetKeyStringFromAxisName_KeyString' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, CallFunc_BuildString_Name_ReturnValue_1) == 0x000180, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::CallFunc_BuildString_Name_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, CallFunc_Replace_ReturnValue_1) == 0x000190, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::CallFunc_Replace_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, CallFunc_Array_Length_ReturnValue_1) == 0x0001A0, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_ReplaceKeyText, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001A4, "Member 'UIBP_FunctionLibrary_C_ReplaceKeyText::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function UIBP_FunctionLibrary.UIBP_FunctionLibrary_C.PlayUISound
// 0x0078 (0x0078 - 0x0000)
struct UIBP_FunctionLibrary_C_PlayUISound final
{
public:
	class FName                                   RowName;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundConcurrency*                      LocalConcurrencySettings;                          // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUIST_Sound                            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0018(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIBP_FunctionLibrary_C_PlayUISound) == 0x000008, "Wrong alignment on UIBP_FunctionLibrary_C_PlayUISound");
static_assert(sizeof(UIBP_FunctionLibrary_C_PlayUISound) == 0x000078, "Wrong size on UIBP_FunctionLibrary_C_PlayUISound");
static_assert(offsetof(UIBP_FunctionLibrary_C_PlayUISound, RowName) == 0x000000, "Member 'UIBP_FunctionLibrary_C_PlayUISound::RowName' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_PlayUISound, __WorldContext) == 0x000008, "Member 'UIBP_FunctionLibrary_C_PlayUISound::__WorldContext' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_PlayUISound, LocalConcurrencySettings) == 0x000010, "Member 'UIBP_FunctionLibrary_C_PlayUISound::LocalConcurrencySettings' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_PlayUISound, CallFunc_GetDataTableRowFromName_OutRow) == 0x000018, "Member 'UIBP_FunctionLibrary_C_PlayUISound::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_PlayUISound, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000058, "Member 'UIBP_FunctionLibrary_C_PlayUISound::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_PlayUISound, K2Node_SwitchEnum_CmpSuccess) == 0x000059, "Member 'UIBP_FunctionLibrary_C_PlayUISound::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_PlayUISound, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000060, "Member 'UIBP_FunctionLibrary_C_PlayUISound::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_PlayUISound, K2Node_DynamicCast_AsSound_Base) == 0x000068, "Member 'UIBP_FunctionLibrary_C_PlayUISound::K2Node_DynamicCast_AsSound_Base' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_PlayUISound, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'UIBP_FunctionLibrary_C_PlayUISound::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UIBP_FunctionLibrary.UIBP_FunctionLibrary_C.GetMoveKeyboardString
// 0x0158 (0x0158 - 0x0000)
struct UIBP_FunctionLibrary_C_GetMoveKeyboardString final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 String;                                            // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 LocalString;                                       // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputAxisKeyMapping>           CallFunc_GetAxisMappingByName_OutMappings;         // 0x0048(0x0010)(ReferenceParm)
	TArray<struct FInputAxisKeyMapping>           CallFunc_GetAxisMappingByName_OutMappings_1;       // 0x0058(0x0010)(ReferenceParm)
	struct FInputAxisKeyMapping                   CallFunc_Array_Get_Item;                           // 0x0068(0x0028)()
	struct FInputAxisKeyMapping                   CallFunc_Array_Get_Item_1;                         // 0x0090(0x0028)()
	class FName                                   CallFunc_GetKeyName_KeyName;                       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetKeyName_KeyName_1;                     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Key_IsGamepadKey_ReturnValue;             // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Key_IsGamepadKey_ReturnValue_1;           // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIBP_FunctionLibrary_C_GetMoveKeyboardString) == 0x000008, "Wrong alignment on UIBP_FunctionLibrary_C_GetMoveKeyboardString");
static_assert(sizeof(UIBP_FunctionLibrary_C_GetMoveKeyboardString) == 0x000158, "Wrong size on UIBP_FunctionLibrary_C_GetMoveKeyboardString");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, __WorldContext) == 0x000000, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::__WorldContext' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, String) == 0x000008, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::String' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, LocalString) == 0x000018, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::LocalString' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, Temp_int_Array_Index_Variable) == 0x000028, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, Temp_int_Array_Index_Variable_1) == 0x000034, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, Temp_int_Loop_Counter_Variable_1) == 0x000038, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, CallFunc_Add_IntInt_ReturnValue_1) == 0x00003C, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, CallFunc_GetInputSettings_ReturnValue) == 0x000040, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::CallFunc_GetInputSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, CallFunc_GetAxisMappingByName_OutMappings) == 0x000048, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::CallFunc_GetAxisMappingByName_OutMappings' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, CallFunc_GetAxisMappingByName_OutMappings_1) == 0x000058, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::CallFunc_GetAxisMappingByName_OutMappings_1' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, CallFunc_Array_Get_Item) == 0x000068, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, CallFunc_Array_Get_Item_1) == 0x000090, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, CallFunc_GetKeyName_KeyName) == 0x0000B8, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::CallFunc_GetKeyName_KeyName' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, CallFunc_GetKeyName_KeyName_1) == 0x0000C0, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::CallFunc_GetKeyName_KeyName_1' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, CallFunc_Conv_NameToString_ReturnValue) == 0x0000C8, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, CallFunc_Conv_NameToString_ReturnValue_1) == 0x0000D8, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, CallFunc_Concat_StrStr_ReturnValue) == 0x0000E8, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000F8, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000108, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000118, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000128, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000138, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, CallFunc_Key_IsGamepadKey_ReturnValue) == 0x000148, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::CallFunc_Key_IsGamepadKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, CallFunc_Key_IsGamepadKey_ReturnValue_1) == 0x000149, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::CallFunc_Key_IsGamepadKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, CallFunc_Array_Length_ReturnValue) == 0x00014C, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, CallFunc_Array_Length_ReturnValue_1) == 0x000150, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, CallFunc_Less_IntInt_ReturnValue) == 0x000154, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_GetMoveKeyboardString, CallFunc_Less_IntInt_ReturnValue_1) == 0x000155, "Member 'UIBP_FunctionLibrary_C_GetMoveKeyboardString::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function UIBP_FunctionLibrary.UIBP_FunctionLibrary_C.PlayUIForceFeedback
// 0x0040 (0x0040 - 0x0000)
struct UIBP_FunctionLibrary_C_PlayUIForceFeedback final
{
public:
	class FName                                   RowName;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUIST_ForceFeedback                    CallFunc_GetDataTableRowFromName_OutRow;           // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULPlayInputSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePadMode_ReturnValue;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIBP_FunctionLibrary_C_PlayUIForceFeedback) == 0x000008, "Wrong alignment on UIBP_FunctionLibrary_C_PlayUIForceFeedback");
static_assert(sizeof(UIBP_FunctionLibrary_C_PlayUIForceFeedback) == 0x000040, "Wrong size on UIBP_FunctionLibrary_C_PlayUIForceFeedback");
static_assert(offsetof(UIBP_FunctionLibrary_C_PlayUIForceFeedback, RowName) == 0x000000, "Member 'UIBP_FunctionLibrary_C_PlayUIForceFeedback::RowName' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_PlayUIForceFeedback, __WorldContext) == 0x000008, "Member 'UIBP_FunctionLibrary_C_PlayUIForceFeedback::__WorldContext' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_PlayUIForceFeedback, CallFunc_GetDataTableRowFromName_OutRow) == 0x000010, "Member 'UIBP_FunctionLibrary_C_PlayUIForceFeedback::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_PlayUIForceFeedback, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000020, "Member 'UIBP_FunctionLibrary_C_PlayUIForceFeedback::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_PlayUIForceFeedback, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000028, "Member 'UIBP_FunctionLibrary_C_PlayUIForceFeedback::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_PlayUIForceFeedback, CallFunc_IsGamePadMode_ReturnValue) == 0x000030, "Member 'UIBP_FunctionLibrary_C_PlayUIForceFeedback::CallFunc_IsGamePadMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_FunctionLibrary_C_PlayUIForceFeedback, CallFunc_GetPlayerController_ReturnValue) == 0x000038, "Member 'UIBP_FunctionLibrary_C_PlayUIForceFeedback::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

// Function UIBP_FunctionLibrary.UIBP_FunctionLibrary_C.IntToRoman
// 0x0178 (0x0178 - 0x0000)
struct UIBP_FunctionLibrary_C_IntToRoman final
{
public:
	int32                                         Int;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 String;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         LocalInt;                                          // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LocalString;                                       // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
