#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIBP_NPCDialog_GoldenTree

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UIBP_NPCDialog_GoldenTree.UIBP_NPCDialog_GoldenTree_C.RefreshGoldenTreeTime
// 0x0110 (0x0110 - 0x0000)
struct UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime final
{
public:
	int32                                         LocalCount;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   LocalCountText;                                    // 0x0008(0x0018)(Edit, BlueprintVisible)
	class ULObjectManagementSystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULGoldenTree*                           CallFunc_GetGoldenTree_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBoostExcelGoalSec_ReturnValue;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBoostExcelSec_ReturnValue;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBoostExcelSec_ReturnValue_1;           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_FromSeconds_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_AsTimespan_Timespan_ReturnValue;          // 0x0058(0x0018)()
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetHarvestableCount_ReturnValue;          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ULObjectManagementSystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULGoldenTree*                           CallFunc_GetGoldenTree_ReturnValue_1;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHarvestRemainSec_ReturnValue;          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_FromSeconds_ReturnValue_1;                // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D8(0x0018)()
	class FText                                   CallFunc_AsTimespan_Timespan_ReturnValue_1;        // 0x00F0(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime) == 0x000008, "Wrong alignment on UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime");
static_assert(sizeof(UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime) == 0x000110, "Wrong size on UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime, LocalCount) == 0x000000, "Member 'UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime::LocalCount' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime, LocalCountText) == 0x000008, "Member 'UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime::LocalCountText' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime, CallFunc_IsVisible_ReturnValue) == 0x000028, "Member 'UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime, CallFunc_GetGoldenTree_ReturnValue) == 0x000030, "Member 'UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime::CallFunc_GetGoldenTree_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime, CallFunc_GetBoostExcelGoalSec_ReturnValue) == 0x000038, "Member 'UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime::CallFunc_GetBoostExcelGoalSec_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime, CallFunc_GetBoostExcelSec_ReturnValue) == 0x00003C, "Member 'UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime::CallFunc_GetBoostExcelSec_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime, CallFunc_GetBoostExcelSec_ReturnValue_1) == 0x000040, "Member 'UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime::CallFunc_GetBoostExcelSec_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime, CallFunc_FromSeconds_ReturnValue) == 0x000048, "Member 'UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime::CallFunc_FromSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000050, "Member 'UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime, CallFunc_AsTimespan_Timespan_ReturnValue) == 0x000058, "Member 'UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime::CallFunc_AsTimespan_Timespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000070, "Member 'UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime, CallFunc_GetHarvestableCount_ReturnValue) == 0x000074, "Member 'UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime::CallFunc_GetHarvestableCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime, CallFunc_Conv_IntToString_ReturnValue) == 0x000078, "Member 'UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime, CallFunc_Concat_StrStr_ReturnValue) == 0x000088, "Member 'UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000098, "Member 'UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime, CallFunc_GetGoldenTree_ReturnValue_1) == 0x0000A0, "Member 'UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime::CallFunc_GetGoldenTree_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime, CallFunc_Conv_IntToString_ReturnValue_1) == 0x0000A8, "Member 'UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime, CallFunc_GetHarvestRemainSec_ReturnValue) == 0x0000B8, "Member 'UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime::CallFunc_GetHarvestRemainSec_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000C0, "Member 'UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime, CallFunc_FromSeconds_ReturnValue_1) == 0x0000D0, "Member 'UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime::CallFunc_FromSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime, CallFunc_Conv_StringToText_ReturnValue) == 0x0000D8, "Member 'UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime, CallFunc_AsTimespan_Timespan_ReturnValue_1) == 0x0000F0, "Member 'UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime::CallFunc_AsTimespan_Timespan_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000108, "Member 'UIBP_NPCDialog_GoldenTree_C_RefreshGoldenTreeTime::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function UIBP_NPCDialog_GoldenTree.UIBP_NPCDialog_GoldenTree_C.SetGoldenTree
// 0x0090 (0x0090 - 0x0000)
struct UIBP_NPCDialog_GoldenTree_C_SetGoldenTree final
{
public:
	bool                                          LocalIsShow;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULObjectManagementSystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULGoldenTree*                           CallFunc_GetGoldenTree_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGoldStackLimit_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULObjectManagementSystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULInteractSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULGoldenTree*                           CallFunc_GetGoldenTree_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerReached_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTalkerInfoPtr                         CallFunc_GetTalkerInfo_ReturnValue;                // 0x0048(0x0008)(ConstParm, NoDestructor)
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetShowGoldentreeStatus_ReturnValue;      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULCommonConstantValues*                 CallFunc_GetConstantValues_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetHotelTeleportActivateCondition1_ReturnValue; // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULWorldEventSystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidEventConditionBP_ReturnValue;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIBP_NPCDialog_GoldenTree_C_SetGoldenTree) == 0x000008, "Wrong alignment on UIBP_NPCDialog_GoldenTree_C_SetGoldenTree");
static_assert(sizeof(UIBP_NPCDialog_GoldenTree_C_SetGoldenTree) == 0x000090, "Wrong size on UIBP_NPCDialog_GoldenTree_C_SetGoldenTree");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_SetGoldenTree, LocalIsShow) == 0x000000, "Member 'UIBP_NPCDialog_GoldenTree_C_SetGoldenTree::LocalIsShow' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_SetGoldenTree, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UIBP_NPCDialog_GoldenTree_C_SetGoldenTree::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_SetGoldenTree, CallFunc_GetGoldenTree_ReturnValue) == 0x000010, "Member 'UIBP_NPCDialog_GoldenTree_C_SetGoldenTree::CallFunc_GetGoldenTree_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_SetGoldenTree, CallFunc_GetGoldStackLimit_ReturnValue) == 0x000018, "Member 'UIBP_NPCDialog_GoldenTree_C_SetGoldenTree::CallFunc_GetGoldStackLimit_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_SetGoldenTree, CallFunc_GetMainWidget_MainWidget) == 0x000020, "Member 'UIBP_NPCDialog_GoldenTree_C_SetGoldenTree::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_SetGoldenTree, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000028, "Member 'UIBP_NPCDialog_GoldenTree_C_SetGoldenTree::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_SetGoldenTree, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000030, "Member 'UIBP_NPCDialog_GoldenTree_C_SetGoldenTree::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_SetGoldenTree, CallFunc_GetGoldenTree_ReturnValue_1) == 0x000038, "Member 'UIBP_NPCDialog_GoldenTree_C_SetGoldenTree::CallFunc_GetGoldenTree_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_SetGoldenTree, CallFunc_IsPlayerReached_ReturnValue) == 0x000040, "Member 'UIBP_NPCDialog_GoldenTree_C_SetGoldenTree::CallFunc_IsPlayerReached_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_SetGoldenTree, CallFunc_GetTalkerInfo_ReturnValue) == 0x000048, "Member 'UIBP_NPCDialog_GoldenTree_C_SetGoldenTree::CallFunc_GetTalkerInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_SetGoldenTree, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000050, "Member 'UIBP_NPCDialog_GoldenTree_C_SetGoldenTree::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_SetGoldenTree, CallFunc_GetShowGoldentreeStatus_ReturnValue) == 0x000058, "Member 'UIBP_NPCDialog_GoldenTree_C_SetGoldenTree::CallFunc_GetShowGoldentreeStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_SetGoldenTree, CallFunc_GetConstantValues_ReturnValue) == 0x000060, "Member 'UIBP_NPCDialog_GoldenTree_C_SetGoldenTree::CallFunc_GetConstantValues_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_SetGoldenTree, CallFunc_BooleanAND_ReturnValue) == 0x000068, "Member 'UIBP_NPCDialog_GoldenTree_C_SetGoldenTree::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_SetGoldenTree, CallFunc_GetHotelTeleportActivateCondition1_ReturnValue) == 0x00006C, "Member 'UIBP_NPCDialog_GoldenTree_C_SetGoldenTree::CallFunc_GetHotelTeleportActivateCondition1_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_SetGoldenTree, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x000078, "Member 'UIBP_NPCDialog_GoldenTree_C_SetGoldenTree::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_SetGoldenTree, CallFunc_IsValidEventConditionBP_ReturnValue) == 0x000080, "Member 'UIBP_NPCDialog_GoldenTree_C_SetGoldenTree::CallFunc_IsValidEventConditionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_SetGoldenTree, CallFunc_BooleanAND_ReturnValue_1) == 0x000081, "Member 'UIBP_NPCDialog_GoldenTree_C_SetGoldenTree::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_SetGoldenTree, CallFunc_K2_SetTimer_ReturnValue) == 0x000088, "Member 'UIBP_NPCDialog_GoldenTree_C_SetGoldenTree::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function UIBP_NPCDialog_GoldenTree.UIBP_NPCDialog_GoldenTree_C.OnReady
// 0x0018 (0x0018 - 0x0000)
struct UIBP_NPCDialog_GoldenTree_C_OnReady final
{
public:
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_NPCDialog_GoldenTree_C*            K2Node_DynamicCast_AsUIW_NPCDialog_Golden_Tree;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIBP_NPCDialog_GoldenTree_C_OnReady) == 0x000008, "Wrong alignment on UIBP_NPCDialog_GoldenTree_C_OnReady");
static_assert(sizeof(UIBP_NPCDialog_GoldenTree_C_OnReady) == 0x000018, "Wrong size on UIBP_NPCDialog_GoldenTree_C_OnReady");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_OnReady, CallFunc_GetOuterObject_ReturnValue) == 0x000000, "Member 'UIBP_NPCDialog_GoldenTree_C_OnReady::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_OnReady, K2Node_DynamicCast_AsUIW_NPCDialog_Golden_Tree) == 0x000008, "Member 'UIBP_NPCDialog_GoldenTree_C_OnReady::K2Node_DynamicCast_AsUIW_NPCDialog_Golden_Tree' has a wrong offset!");
static_assert(offsetof(UIBP_NPCDialog_GoldenTree_C_OnReady, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'UIBP_NPCDialog_GoldenTree_C_OnReady::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

