#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIBP_ListData_SaveData

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass UIBP_ListData_SaveData.UIBP_ListData_SaveData_C
// 0x00D8 (0x0100 - 0x0028)
class UUIBP_ListData_SaveData_C final : public UObject
{
public:
	int32                                         Index_0;                                           // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLCharacterStorageData                 StorageData;                                       // 0x0030(0x00C8)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          IsEmpty;                                           // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIBP_ListData_SaveData_C">();
	}
	static class UUIBP_ListData_SaveData_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIBP_ListData_SaveData_C>();
	}
};
static_assert(alignof(UUIBP_ListData_SaveData_C) == 0x000008, "Wrong alignment on UUIBP_ListData_SaveData_C");
static_assert(sizeof(UUIBP_ListData_SaveData_C) == 0x000100, "Wrong size on UUIBP_ListData_SaveData_C");
static_assert(offsetof(UUIBP_ListData_SaveData_C, Index_0) == 0x000028, "Member 'UUIBP_ListData_SaveData_C::Index_0' has a wrong offset!");
static_assert(offsetof(UUIBP_ListData_SaveData_C, StorageData) == 0x000030, "Member 'UUIBP_ListData_SaveData_C::StorageData' has a wrong offset!");
static_assert(offsetof(UUIBP_ListData_SaveData_C, IsEmpty) == 0x0000F8, "Member 'UUIBP_ListData_SaveData_C::IsEmpty' has a wrong offset!");

}

