#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIBP_ListData_Item

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass UIBP_ListData_Item.UIBP_ListData_Item_C
// 0x0030 (0x0058 - 0x0028)
class UUIBP_ListData_Item_C final : public UObject
{
public:
	class UUIW_Window_C*                          OwnerWindow;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   ID;                                                // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class ULItem*                                 LItem;                                             // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UUserWidget*                            EntryWidget;                                       // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMouseDown;                                       // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             ParentScrollBox;                                   // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIBP_ListData_Item_C">();
	}
	static class UUIBP_ListData_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIBP_ListData_Item_C>();
	}
};
static_assert(alignof(UUIBP_ListData_Item_C) == 0x000008, "Wrong alignment on UUIBP_ListData_Item_C");
static_assert(sizeof(UUIBP_ListData_Item_C) == 0x000058, "Wrong size on UUIBP_ListData_Item_C");
static_assert(offsetof(UUIBP_ListData_Item_C, OwnerWindow) == 0x000028, "Member 'UUIBP_ListData_Item_C::OwnerWindow' has a wrong offset!");
static_assert(offsetof(UUIBP_ListData_Item_C, ID) == 0x000030, "Member 'UUIBP_ListData_Item_C::ID' has a wrong offset!");
static_assert(offsetof(UUIBP_ListData_Item_C, LItem) == 0x000038, "Member 'UUIBP_ListData_Item_C::LItem' has a wrong offset!");
static_assert(offsetof(UUIBP_ListData_Item_C, EntryWidget) == 0x000040, "Member 'UUIBP_ListData_Item_C::EntryWidget' has a wrong offset!");
static_assert(offsetof(UUIBP_ListData_Item_C, IsMouseDown) == 0x000048, "Member 'UUIBP_ListData_Item_C::IsMouseDown' has a wrong offset!");
static_assert(offsetof(UUIBP_ListData_Item_C, ParentScrollBox) == 0x000050, "Member 'UUIBP_ListData_Item_C::ParentScrollBox' has a wrong offset!");

}

