#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIBP_PreviewQueue

#include "Basic.hpp"

#include "UIEN_PreviewType_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass UIBP_PreviewQueue.UIBP_PreviewQueue_C
// 0x0040 (0x0068 - 0x0028)
class UUIBP_PreviewQueue_C final : public UObject
{
public:
	class ULItem*                                 LItem;                                             // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   Title;                                             // 0x0030(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   Description;                                       // 0x0048(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	EUIEN_PreviewType                             PreviewType;                                       // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIBP_PreviewQueue_C">();
	}
	static class UUIBP_PreviewQueue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIBP_PreviewQueue_C>();
	}
};
static_assert(alignof(UUIBP_PreviewQueue_C) == 0x000008, "Wrong alignment on UUIBP_PreviewQueue_C");
static_assert(sizeof(UUIBP_PreviewQueue_C) == 0x000068, "Wrong size on UUIBP_PreviewQueue_C");
static_assert(offsetof(UUIBP_PreviewQueue_C, LItem) == 0x000028, "Member 'UUIBP_PreviewQueue_C::LItem' has a wrong offset!");
static_assert(offsetof(UUIBP_PreviewQueue_C, Title) == 0x000030, "Member 'UUIBP_PreviewQueue_C::Title' has a wrong offset!");
static_assert(offsetof(UUIBP_PreviewQueue_C, Description) == 0x000048, "Member 'UUIBP_PreviewQueue_C::Description' has a wrong offset!");
static_assert(offsetof(UUIBP_PreviewQueue_C, PreviewType) == 0x000060, "Member 'UUIBP_PreviewQueue_C::PreviewType' has a wrong offset!");

}

