#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIBP_ListData_Controller

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass UIBP_ListData_Controller.UIBP_ListData_Controller_C
// 0x0038 (0x0060 - 0x0028)
class UUIBP_ListData_Controller_C final : public UObject
{
public:
	class FName                                   InputAction;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FKey                                   Key;                                               // 0x0030(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsEnabled;                                         // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnChanging;                                        // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnChanging__DelegateSignature(bool IsChanging);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIBP_ListData_Controller_C">();
	}
	static class UUIBP_ListData_Controller_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIBP_ListData_Controller_C>();
	}
};
static_assert(alignof(UUIBP_ListData_Controller_C) == 0x000008, "Wrong alignment on UUIBP_ListData_Controller_C");
static_assert(sizeof(UUIBP_ListData_Controller_C) == 0x000060, "Wrong size on UUIBP_ListData_Controller_C");
static_assert(offsetof(UUIBP_ListData_Controller_C, InputAction) == 0x000028, "Member 'UUIBP_ListData_Controller_C::InputAction' has a wrong offset!");
static_assert(offsetof(UUIBP_ListData_Controller_C, Key) == 0x000030, "Member 'UUIBP_ListData_Controller_C::Key' has a wrong offset!");
static_assert(offsetof(UUIBP_ListData_Controller_C, IsEnabled) == 0x000048, "Member 'UUIBP_ListData_Controller_C::IsEnabled' has a wrong offset!");
static_assert(offsetof(UUIBP_ListData_Controller_C, OnChanging) == 0x000050, "Member 'UUIBP_ListData_Controller_C::OnChanging' has a wrong offset!");

}

