#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIBP_ListData_Resource

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass UIBP_ListData_Resource.UIBP_ListData_Resource_C
// 0x0048 (0x0070 - 0x0028)
class UUIBP_ListData_Resource_C final : public UObject
{
public:
	class FText                                   ItemName;                                          // 0x0028(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	TSoftObjectPtr<class UObject>                 Icon;                                              // 0x0040(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         HasCount;                                          // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         RequireCount;                                      // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIBP_ListData_Resource_C">();
	}
	static class UUIBP_ListData_Resource_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIBP_ListData_Resource_C>();
	}
};
static_assert(alignof(UUIBP_ListData_Resource_C) == 0x000008, "Wrong alignment on UUIBP_ListData_Resource_C");
static_assert(sizeof(UUIBP_ListData_Resource_C) == 0x000070, "Wrong size on UUIBP_ListData_Resource_C");
static_assert(offsetof(UUIBP_ListData_Resource_C, ItemName) == 0x000028, "Member 'UUIBP_ListData_Resource_C::ItemName' has a wrong offset!");
static_assert(offsetof(UUIBP_ListData_Resource_C, Icon) == 0x000040, "Member 'UUIBP_ListData_Resource_C::Icon' has a wrong offset!");
static_assert(offsetof(UUIBP_ListData_Resource_C, HasCount) == 0x000068, "Member 'UUIBP_ListData_Resource_C::HasCount' has a wrong offset!");
static_assert(offsetof(UUIBP_ListData_Resource_C, RequireCount) == 0x00006C, "Member 'UUIBP_ListData_Resource_C::RequireCount' has a wrong offset!");

}

