#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIST_Popup

#include "Basic.hpp"

#include "UIST_PopupModule_structs.hpp"
#include "UIST_Key_structs.hpp"


namespace SDK
{

// UserDefinedStruct UIST_Popup.UIST_Popup
// 0x0048 (0x0048 - 0x0000)
struct FUIST_Popup final
{
public:
	TArray<struct FUIST_PopupModule>              Module_16_E19EE7564F895128B7DF32AE500D3FE7;        // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<struct FUIST_Key>                      Key_10_110B427841D587BF7A47CA86272830A0;           // 0x0010(0x0010)(Edit, BlueprintVisible)
	TSoftClassPtr<class UClass>                   BG_23_DAC3E895489385A3DA1B359234F48C64;            // 0x0020(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FUIST_Popup) == 0x000008, "Wrong alignment on FUIST_Popup");
static_assert(sizeof(FUIST_Popup) == 0x000048, "Wrong size on FUIST_Popup");
static_assert(offsetof(FUIST_Popup, Module_16_E19EE7564F895128B7DF32AE500D3FE7) == 0x000000, "Member 'FUIST_Popup::Module_16_E19EE7564F895128B7DF32AE500D3FE7' has a wrong offset!");
static_assert(offsetof(FUIST_Popup, Key_10_110B427841D587BF7A47CA86272830A0) == 0x000010, "Member 'FUIST_Popup::Key_10_110B427841D587BF7A47CA86272830A0' has a wrong offset!");
static_assert(offsetof(FUIST_Popup, BG_23_DAC3E895489385A3DA1B359234F48C64) == 0x000020, "Member 'FUIST_Popup::BG_23_DAC3E895489385A3DA1B359234F48C64' has a wrong offset!");

}

