#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIST_SecondCategoryArr

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"


namespace SDK
{

// UserDefinedStruct UIST_SecondCategoryArr.UIST_SecondCategoryArr
// 0x0028 (0x0028 - 0x0000)
struct FUIST_SecondCategoryArr final
{
public:
	ELItemSecondCategory                          SecondCategory_7_EFE0229D4750C33A1D968798007F60E4; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUIBP_ListData_Item_C*>          ItemArr_3_ACD4AB3349F5DDA910731C8A04EB3947;        // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<class UUIBP_ListData_Weapon_C*>        WeaponItemArr_11_E6724B284BDE93C409556C80A97EE287; // 0x0018(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FUIST_SecondCategoryArr) == 0x000008, "Wrong alignment on FUIST_SecondCategoryArr");
static_assert(sizeof(FUIST_SecondCategoryArr) == 0x000028, "Wrong size on FUIST_SecondCategoryArr");
static_assert(offsetof(FUIST_SecondCategoryArr, SecondCategory_7_EFE0229D4750C33A1D968798007F60E4) == 0x000000, "Member 'FUIST_SecondCategoryArr::SecondCategory_7_EFE0229D4750C33A1D968798007F60E4' has a wrong offset!");
static_assert(offsetof(FUIST_SecondCategoryArr, ItemArr_3_ACD4AB3349F5DDA910731C8A04EB3947) == 0x000008, "Member 'FUIST_SecondCategoryArr::ItemArr_3_ACD4AB3349F5DDA910731C8A04EB3947' has a wrong offset!");
static_assert(offsetof(FUIST_SecondCategoryArr, WeaponItemArr_11_E6724B284BDE93C409556C80A97EE287) == 0x000018, "Member 'FUIST_SecondCategoryArr::WeaponItemArr_11_E6724B284BDE93C409556C80A97EE287' has a wrong offset!");

}

