#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIST_Sound

#include "Basic.hpp"

#include "UIEN_SimultaneousPlay_structs.hpp"


namespace SDK
{

// UserDefinedStruct UIST_Sound.UIST_Sound
// 0x0040 (0x0040 - 0x0000)
struct FUIST_Sound final
{
public:
	TSoftObjectPtr<class USoundBase>              SoundBase_29_637A2A8F4671929A1FDF11AC656739D0;     // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	EUIEN_SimultaneousPlay                        SimultaneousPlay_28_4232BCE44F0DA5EE7AFA2F860E78F487; // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Priority_27_C96CE12F4E3DD254C642368D7F78B040;      // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VolumeMultiplier_13_F823C1E74D907EDDB4E3A2A24AA5B17C; // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PitchMultiplier_14_2726BA794CCE6E41461D899438B41327; // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartTime_15_EDFF662E495D72C1A4C73CAB622A9AE7;     // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PreLoading_31_398FA8654679638873C7F786B5C5AF23;    // 0x003C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FUIST_Sound) == 0x000008, "Wrong alignment on FUIST_Sound");
static_assert(sizeof(FUIST_Sound) == 0x000040, "Wrong size on FUIST_Sound");
static_assert(offsetof(FUIST_Sound, SoundBase_29_637A2A8F4671929A1FDF11AC656739D0) == 0x000000, "Member 'FUIST_Sound::SoundBase_29_637A2A8F4671929A1FDF11AC656739D0' has a wrong offset!");
static_assert(offsetof(FUIST_Sound, SimultaneousPlay_28_4232BCE44F0DA5EE7AFA2F860E78F487) == 0x000028, "Member 'FUIST_Sound::SimultaneousPlay_28_4232BCE44F0DA5EE7AFA2F860E78F487' has a wrong offset!");
static_assert(offsetof(FUIST_Sound, Priority_27_C96CE12F4E3DD254C642368D7F78B040) == 0x00002C, "Member 'FUIST_Sound::Priority_27_C96CE12F4E3DD254C642368D7F78B040' has a wrong offset!");
static_assert(offsetof(FUIST_Sound, VolumeMultiplier_13_F823C1E74D907EDDB4E3A2A24AA5B17C) == 0x000030, "Member 'FUIST_Sound::VolumeMultiplier_13_F823C1E74D907EDDB4E3A2A24AA5B17C' has a wrong offset!");
static_assert(offsetof(FUIST_Sound, PitchMultiplier_14_2726BA794CCE6E41461D899438B41327) == 0x000034, "Member 'FUIST_Sound::PitchMultiplier_14_2726BA794CCE6E41461D899438B41327' has a wrong offset!");
static_assert(offsetof(FUIST_Sound, StartTime_15_EDFF662E495D72C1A4C73CAB622A9AE7) == 0x000038, "Member 'FUIST_Sound::StartTime_15_EDFF662E495D72C1A4C73CAB622A9AE7' has a wrong offset!");
static_assert(offsetof(FUIST_Sound, PreLoading_31_398FA8654679638873C7F786B5C5AF23) == 0x00003C, "Member 'FUIST_Sound::PreLoading_31_398FA8654679638873C7F786B5C5AF23' has a wrong offset!");

}

