#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIST_GetItem

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct UIST_GetItem.UIST_GetItem
// 0x0010 (0x0010 - 0x0000)
struct FUIST_GetItem final
{
public:
	class ULItem*                                 LItem_2_8694F6F546074B849CAE4E897EA9FC9B;          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count_5_1181196F44D2F170FE9CBE904D8F9A4C;          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInvenItem_7_715FB78749BC83257F1494A99885087B;    // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FUIST_GetItem) == 0x000008, "Wrong alignment on FUIST_GetItem");
static_assert(sizeof(FUIST_GetItem) == 0x000010, "Wrong size on FUIST_GetItem");
static_assert(offsetof(FUIST_GetItem, LItem_2_8694F6F546074B849CAE4E897EA9FC9B) == 0x000000, "Member 'FUIST_GetItem::LItem_2_8694F6F546074B849CAE4E897EA9FC9B' has a wrong offset!");
static_assert(offsetof(FUIST_GetItem, Count_5_1181196F44D2F170FE9CBE904D8F9A4C) == 0x000008, "Member 'FUIST_GetItem::Count_5_1181196F44D2F170FE9CBE904D8F9A4C' has a wrong offset!");
static_assert(offsetof(FUIST_GetItem, IsInvenItem_7_715FB78749BC83257F1494A99885087B) == 0x00000C, "Member 'FUIST_GetItem::IsInvenItem_7_715FB78749BC83257F1494A99885087B' has a wrong offset!");

}

