#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HUD_ControlGuide

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK::Params
{

// Function UIW_HUD_ControlGuide.UIW_HUD_ControlGuide_C.ExecuteUbergraph_UIW_HUD_ControlGuide
// 0x0038 (0x0038 - 0x0000)
struct UIW_HUD_ControlGuide_C_ExecuteUbergraph_UIW_HUD_ControlGuide final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bGamePad)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class ULPlayInputSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePadMode_ReturnValue;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bGamePad;                       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULPlayInputSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HUD_ControlGuide_C_ExecuteUbergraph_UIW_HUD_ControlGuide) == 0x000008, "Wrong alignment on UIW_HUD_ControlGuide_C_ExecuteUbergraph_UIW_HUD_ControlGuide");
static_assert(sizeof(UIW_HUD_ControlGuide_C_ExecuteUbergraph_UIW_HUD_ControlGuide) == 0x000038, "Wrong size on UIW_HUD_ControlGuide_C_ExecuteUbergraph_UIW_HUD_ControlGuide");
static_assert(offsetof(UIW_HUD_ControlGuide_C_ExecuteUbergraph_UIW_HUD_ControlGuide, EntryPoint) == 0x000000, "Member 'UIW_HUD_ControlGuide_C_ExecuteUbergraph_UIW_HUD_ControlGuide::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_ExecuteUbergraph_UIW_HUD_ControlGuide, CallFunc_GetMainWidget_MainWidget) == 0x000008, "Member 'UIW_HUD_ControlGuide_C_ExecuteUbergraph_UIW_HUD_ControlGuide::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_ExecuteUbergraph_UIW_HUD_ControlGuide, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'UIW_HUD_ControlGuide_C_ExecuteUbergraph_UIW_HUD_ControlGuide::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_ExecuteUbergraph_UIW_HUD_ControlGuide, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'UIW_HUD_ControlGuide_C_ExecuteUbergraph_UIW_HUD_ControlGuide::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_ExecuteUbergraph_UIW_HUD_ControlGuide, CallFunc_IsGamePadMode_ReturnValue) == 0x000028, "Member 'UIW_HUD_ControlGuide_C_ExecuteUbergraph_UIW_HUD_ControlGuide::CallFunc_IsGamePadMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_ExecuteUbergraph_UIW_HUD_ControlGuide, K2Node_CustomEvent_bGamePad) == 0x000029, "Member 'UIW_HUD_ControlGuide_C_ExecuteUbergraph_UIW_HUD_ControlGuide::K2Node_CustomEvent_bGamePad' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_ExecuteUbergraph_UIW_HUD_ControlGuide, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000030, "Member 'UIW_HUD_ControlGuide_C_ExecuteUbergraph_UIW_HUD_ControlGuide::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");

// Function UIW_HUD_ControlGuide.UIW_HUD_ControlGuide_C.OnChangeInput
// 0x0001 (0x0001 - 0x0000)
struct UIW_HUD_ControlGuide_C_OnChangeInput final
{
public:
	bool                                          bGamePad;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_HUD_ControlGuide_C_OnChangeInput) == 0x000001, "Wrong alignment on UIW_HUD_ControlGuide_C_OnChangeInput");
static_assert(sizeof(UIW_HUD_ControlGuide_C_OnChangeInput) == 0x000001, "Wrong size on UIW_HUD_ControlGuide_C_OnChangeInput");
static_assert(offsetof(UIW_HUD_ControlGuide_C_OnChangeInput, bGamePad) == 0x000000, "Member 'UIW_HUD_ControlGuide_C_OnChangeInput::bGamePad' has a wrong offset!");

// Function UIW_HUD_ControlGuide.UIW_HUD_ControlGuide_C.SetEnabledChangeSlaveArm
// 0x0078 (0x0078 - 0x0000)
struct UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm final
{
public:
	bool                                          LocalCanChangeSlaveArm;                            // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue_1;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<ELEquipSlotType>                       CallFunc_GetSlaveArmSlotTypeList_ReturnValue;      // 0x0038(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELEquipSlotType                               CallFunc_Array_Get_Item;                           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetEquipItemSlot_bFound;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLEquipItemSlot                        CallFunc_GetEquipItemSlot_ReturnValue;             // 0x0058(0x0018)(NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm) == 0x000008, "Wrong alignment on UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm");
static_assert(sizeof(UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm) == 0x000078, "Wrong size on UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm, LocalCanChangeSlaveArm) == 0x000000, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm::LocalCanChangeSlaveArm' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm, Temp_bool_True_if_break_was_hit_Variable) == 0x000001, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm, Temp_int_Array_Index_Variable) == 0x000004, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000020, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm, CallFunc_GetPlayerEquipment_ReturnValue) == 0x000028, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm::CallFunc_GetPlayerEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm, CallFunc_GetPlayerEquipment_ReturnValue_1) == 0x000030, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm::CallFunc_GetPlayerEquipment_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm, CallFunc_GetSlaveArmSlotTypeList_ReturnValue) == 0x000038, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm::CallFunc_GetSlaveArmSlotTypeList_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm, CallFunc_Array_Get_Item) == 0x00004C, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm, CallFunc_Less_IntInt_ReturnValue) == 0x00004D, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00004E, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm, CallFunc_BooleanAND_ReturnValue) == 0x00004F, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm, CallFunc_GetEquipItemSlot_bFound) == 0x000050, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm::CallFunc_GetEquipItemSlot_bFound' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm, CallFunc_GetEquipItemSlot_ReturnValue) == 0x000058, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm::CallFunc_GetEquipItemSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm, CallFunc_BooleanAND_ReturnValue_1) == 0x000070, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeSlaveArm::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function UIW_HUD_ControlGuide.UIW_HUD_ControlGuide_C.SetEnabledChangeWeapon
// 0x0078 (0x0078 - 0x0000)
struct UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon final
{
public:
	bool                                          LocalCanChangeWeapon;                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue_1;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<ELEquipSlotType>                       CallFunc_GetWeaponSlotTypeList_ReturnValue;        // 0x0038(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELEquipSlotType                               CallFunc_Array_Get_Item;                           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetEquipItemSlot_bFound;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLEquipItemSlot                        CallFunc_GetEquipItemSlot_ReturnValue;             // 0x0058(0x0018)(NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon) == 0x000008, "Wrong alignment on UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon");
static_assert(sizeof(UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon) == 0x000078, "Wrong size on UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon, LocalCanChangeWeapon) == 0x000000, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon::LocalCanChangeWeapon' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon, Temp_bool_True_if_break_was_hit_Variable) == 0x000001, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon, Temp_int_Array_Index_Variable) == 0x000004, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon, CallFunc_Not_PreBool_ReturnValue) == 0x000008, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000020, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon, CallFunc_GetPlayerEquipment_ReturnValue) == 0x000028, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon::CallFunc_GetPlayerEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon, CallFunc_GetPlayerEquipment_ReturnValue_1) == 0x000030, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon::CallFunc_GetPlayerEquipment_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon, CallFunc_GetWeaponSlotTypeList_ReturnValue) == 0x000038, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon::CallFunc_GetWeaponSlotTypeList_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon, CallFunc_Array_Get_Item) == 0x00004C, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon, CallFunc_Less_IntInt_ReturnValue) == 0x00004D, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00004E, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon, CallFunc_BooleanAND_ReturnValue) == 0x00004F, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon, CallFunc_GetEquipItemSlot_bFound) == 0x000050, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon::CallFunc_GetEquipItemSlot_bFound' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon, CallFunc_GetEquipItemSlot_ReturnValue) == 0x000058, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon::CallFunc_GetEquipItemSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon, CallFunc_BooleanAND_ReturnValue_1) == 0x000070, "Member 'UIW_HUD_ControlGuide_C_SetEnabledChangeWeapon::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function UIW_HUD_ControlGuide.UIW_HUD_ControlGuide_C.SetControlGuide
// 0x0140 (0x0140 - 0x0000)
struct UIW_HUD_ControlGuide_C_SetControlGuide final
{
public:
	bool                                          IsGamePad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   LocalKey;                                          // 0x0008(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           CallFunc_GetInputKeyForAction_ReturnValue;         // 0x0028(0x0010)(ReferenceParm)
	TArray<struct FKey>                           CallFunc_GetInputKeyForAction_ReturnValue_1;       // 0x0038(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           CallFunc_GetInputKeyForAction_ReturnValue_2;       // 0x0050(0x0010)(ReferenceParm)
	TArray<struct FKey>                           CallFunc_GetInputKeyForAction_ReturnValue_3;       // 0x0060(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_2;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_3;         // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           CallFunc_GetInputKeyForAction_ReturnValue_4;       // 0x0078(0x0010)(ReferenceParm)
	TArray<struct FKey>                           CallFunc_GetInputKeyForAction_ReturnValue_5;       // 0x0088(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_4;         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_5;         // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           CallFunc_GetInputKeyForAction_ReturnValue_6;       // 0x00A0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_6;         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULPlayInputSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingPlayStationGamePad_ReturnValue;    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x00DC(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x00E4(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x00F0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings;       // 0x00F8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item;                           // 0x0110(0x0028)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Key_IsGamepadKey_ReturnValue;             // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_HUD_ControlGuide_C_SetControlGuide) == 0x000008, "Wrong alignment on UIW_HUD_ControlGuide_C_SetControlGuide");
static_assert(sizeof(UIW_HUD_ControlGuide_C_SetControlGuide) == 0x000140, "Wrong size on UIW_HUD_ControlGuide_C_SetControlGuide");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetControlGuide, IsGamePad) == 0x000000, "Member 'UIW_HUD_ControlGuide_C_SetControlGuide::IsGamePad' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetControlGuide, LocalKey) == 0x000008, "Member 'UIW_HUD_ControlGuide_C_SetControlGuide::LocalKey' has a wrong offset!");
static_assert(offsetof(UIW_HUD_ControlGuide_C_SetControlGuide, Temp_int_Array_Index_Variable) == 0x000020, "Member 'UIW_HUD_ControlGuide_C_SetControlGuide::Temp_int_Array_Index_Variable' has a wrong offset!");
