#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HUD_Gauge_FrenzyItem

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_HUD_Gauge_FrenzyItem.UIW_HUD_Gauge_FrenzyItem_C
// 0x0048 (0x02F0 - 0x02A8)
class UUIW_HUD_Gauge_FrenzyItem_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Effect;                                        // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Fill;                                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Frame;                                             // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Light_Active;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Use;                                               // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Width;                                             // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Height;                                            // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         PrevValue;                                         // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Width_Fill;                                        // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_HUD_Gauge_FrenzyItem(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Destruct();
	void Construct();
	void RefreshPoint(float Value, bool IsUsed);
	void CompleteTween(class FName CategoryName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_HUD_Gauge_FrenzyItem_C">();
	}
	static class UUIW_HUD_Gauge_FrenzyItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_HUD_Gauge_FrenzyItem_C>();
	}
};
static_assert(alignof(UUIW_HUD_Gauge_FrenzyItem_C) == 0x000008, "Wrong alignment on UUIW_HUD_Gauge_FrenzyItem_C");
static_assert(sizeof(UUIW_HUD_Gauge_FrenzyItem_C) == 0x0002F0, "Wrong size on UUIW_HUD_Gauge_FrenzyItem_C");
static_assert(offsetof(UUIW_HUD_Gauge_FrenzyItem_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_HUD_Gauge_FrenzyItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_FrenzyItem_C, Ani_Effect) == 0x0002B0, "Member 'UUIW_HUD_Gauge_FrenzyItem_C::Ani_Effect' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_FrenzyItem_C, Fill) == 0x0002B8, "Member 'UUIW_HUD_Gauge_FrenzyItem_C::Fill' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_FrenzyItem_C, Frame) == 0x0002C0, "Member 'UUIW_HUD_Gauge_FrenzyItem_C::Frame' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_FrenzyItem_C, Light_Active) == 0x0002C8, "Member 'UUIW_HUD_Gauge_FrenzyItem_C::Light_Active' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_FrenzyItem_C, SizeBox_0) == 0x0002D0, "Member 'UUIW_HUD_Gauge_FrenzyItem_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_FrenzyItem_C, Use) == 0x0002D8, "Member 'UUIW_HUD_Gauge_FrenzyItem_C::Use' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_FrenzyItem_C, Width) == 0x0002E0, "Member 'UUIW_HUD_Gauge_FrenzyItem_C::Width' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_FrenzyItem_C, Height) == 0x0002E4, "Member 'UUIW_HUD_Gauge_FrenzyItem_C::Height' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_FrenzyItem_C, PrevValue) == 0x0002E8, "Member 'UUIW_HUD_Gauge_FrenzyItem_C::PrevValue' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_FrenzyItem_C, Width_Fill) == 0x0002EC, "Member 'UUIW_HUD_Gauge_FrenzyItem_C::Width_Fill' has a wrong offset!");

}

