#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ListItem_Answer

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UIW_ListItem_Answer.UIW_ListItem_Answer_C.On Hovered__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_ListItem_Answer_C_On_Hovered__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ListItem_Answer_C_On_Hovered__DelegateSignature) == 0x000004, "Wrong alignment on UIW_ListItem_Answer_C_On_Hovered__DelegateSignature");
static_assert(sizeof(UIW_ListItem_Answer_C_On_Hovered__DelegateSignature) == 0x000004, "Wrong size on UIW_ListItem_Answer_C_On_Hovered__DelegateSignature");
static_assert(offsetof(UIW_ListItem_Answer_C_On_Hovered__DelegateSignature, Index_0) == 0x000000, "Member 'UIW_ListItem_Answer_C_On_Hovered__DelegateSignature::Index_0' has a wrong offset!");

// Function UIW_ListItem_Answer.UIW_ListItem_Answer_C.On Clicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_ListItem_Answer_C_On_Clicked__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ListItem_Answer_C_On_Clicked__DelegateSignature) == 0x000004, "Wrong alignment on UIW_ListItem_Answer_C_On_Clicked__DelegateSignature");
static_assert(sizeof(UIW_ListItem_Answer_C_On_Clicked__DelegateSignature) == 0x000004, "Wrong size on UIW_ListItem_Answer_C_On_Clicked__DelegateSignature");
static_assert(offsetof(UIW_ListItem_Answer_C_On_Clicked__DelegateSignature, Index_0) == 0x000000, "Member 'UIW_ListItem_Answer_C_On_Clicked__DelegateSignature::Index_0' has a wrong offset!");

// Function UIW_ListItem_Answer.UIW_ListItem_Answer_C.ExecuteUbergraph_UIW_ListItem_Answer
// 0x00A8 (0x00A8 - 0x0000)
struct UIW_ListItem_Answer_C_ExecuteUbergraph_UIW_ListItem_Answer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0030(0x0028)()
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_IsNew_C*                 K2Node_DynamicCast_AsUIBP_List_Data_Is_New;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0080(0x0028)()
};
static_assert(alignof(UIW_ListItem_Answer_C_ExecuteUbergraph_UIW_ListItem_Answer) == 0x000008, "Wrong alignment on UIW_ListItem_Answer_C_ExecuteUbergraph_UIW_ListItem_Answer");
static_assert(sizeof(UIW_ListItem_Answer_C_ExecuteUbergraph_UIW_ListItem_Answer) == 0x0000A8, "Wrong size on UIW_ListItem_Answer_C_ExecuteUbergraph_UIW_ListItem_Answer");
static_assert(offsetof(UIW_ListItem_Answer_C_ExecuteUbergraph_UIW_ListItem_Answer, EntryPoint) == 0x000000, "Member 'UIW_ListItem_Answer_C_ExecuteUbergraph_UIW_ListItem_Answer::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Answer_C_ExecuteUbergraph_UIW_ListItem_Answer, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'UIW_ListItem_Answer_C_ExecuteUbergraph_UIW_ListItem_Answer::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Answer_C_ExecuteUbergraph_UIW_ListItem_Answer, K2Node_MakeStruct_SlateColor_1) == 0x000030, "Member 'UIW_ListItem_Answer_C_ExecuteUbergraph_UIW_ListItem_Answer::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Answer_C_ExecuteUbergraph_UIW_ListItem_Answer, K2Node_Event_bIsExpanded) == 0x000058, "Member 'UIW_ListItem_Answer_C_ExecuteUbergraph_UIW_ListItem_Answer::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Answer_C_ExecuteUbergraph_UIW_ListItem_Answer, K2Node_Event_ListItemObject) == 0x000060, "Member 'UIW_ListItem_Answer_C_ExecuteUbergraph_UIW_ListItem_Answer::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Answer_C_ExecuteUbergraph_UIW_ListItem_Answer, K2Node_Event_bIsSelected) == 0x000068, "Member 'UIW_ListItem_Answer_C_ExecuteUbergraph_UIW_ListItem_Answer::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Answer_C_ExecuteUbergraph_UIW_ListItem_Answer, K2Node_DynamicCast_AsUIBP_List_Data_Is_New) == 0x000070, "Member 'UIW_ListItem_Answer_C_ExecuteUbergraph_UIW_ListItem_Answer::K2Node_DynamicCast_AsUIBP_List_Data_Is_New' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Answer_C_ExecuteUbergraph_UIW_ListItem_Answer, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'UIW_ListItem_Answer_C_ExecuteUbergraph_UIW_ListItem_Answer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Answer_C_ExecuteUbergraph_UIW_ListItem_Answer, K2Node_MakeStruct_SlateColor_2) == 0x000080, "Member 'UIW_ListItem_Answer_C_ExecuteUbergraph_UIW_ListItem_Answer::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");

// Function UIW_ListItem_Answer.UIW_ListItem_Answer_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_ListItem_Answer_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Answer_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on UIW_ListItem_Answer_C_BP_OnItemSelectionChanged");
static_assert(sizeof(UIW_ListItem_Answer_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on UIW_ListItem_Answer_C_BP_OnItemSelectionChanged");
static_assert(offsetof(UIW_ListItem_Answer_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'UIW_ListItem_Answer_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function UIW_ListItem_Answer.UIW_ListItem_Answer_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct UIW_ListItem_Answer_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ListItem_Answer_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on UIW_ListItem_Answer_C_OnListItemObjectSet");
static_assert(sizeof(UIW_ListItem_Answer_C_OnListItemObjectSet) == 0x000008, "Wrong size on UIW_ListItem_Answer_C_OnListItemObjectSet");
static_assert(offsetof(UIW_ListItem_Answer_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'UIW_ListItem_Answer_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function UIW_ListItem_Answer.UIW_ListItem_Answer_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_ListItem_Answer_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Answer_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on UIW_ListItem_Answer_C_BP_OnItemExpansionChanged");
static_assert(sizeof(UIW_ListItem_Answer_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on UIW_ListItem_Answer_C_BP_OnItemExpansionChanged");
static_assert(offsetof(UIW_ListItem_Answer_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'UIW_ListItem_Answer_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

}

