#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Module_Item

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"


namespace SDK::Params
{

// Function UIW_Module_Item.UIW_Module_Item_C.SetItem
// 0x0130 (0x0130 - 0x0000)
struct UIW_Module_Item_C_SetItem final
{
public:
	class ULItem*                                 Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWeapon_ReturnValue;                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULWeaponItem*                           K2Node_DynamicCast_AsLWeapon_Item;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetWeaponByname_ItemName;                 // 0x0020(0x0018)()
	struct FItemCommonInfoPtr                     CallFunc_GetHandleCommonInfo_ReturnValue;          // 0x0038(0x0008)(NoDestructor)
	struct FItemCommonInfoPtr                     CallFunc_GetBladeCommonInfo_ReturnValue;           // 0x0040(0x0008)(NoDestructor)
	TSoftObjectPtr<class UObject>                 CallFunc_GetImageResource_ReturnValue;             // 0x0048(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_GetImageResource_ReturnValue_1;           // 0x0070(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_GetHeroicImageResource_ReturnValue;       // 0x0098(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsHeroicWeapon_ReturnValue;               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCount_ReturnValue;                     // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00C8(0x0018)()
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemCommonInfoPtr                     CallFunc_GetCommonInfo_ReturnValue;                // 0x00E8(0x0008)(NoDestructor)
	class FText                                   CallFunc_GetLocalTextItemNameLocalize_ReturnValue; // 0x00F0(0x0018)()
	TSoftObjectPtr<class UObject>                 CallFunc_GetImageResource_ReturnValue_2;           // 0x0108(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Module_Item_C_SetItem) == 0x000008, "Wrong alignment on UIW_Module_Item_C_SetItem");
static_assert(sizeof(UIW_Module_Item_C_SetItem) == 0x000130, "Wrong size on UIW_Module_Item_C_SetItem");
static_assert(offsetof(UIW_Module_Item_C_SetItem, Item) == 0x000000, "Member 'UIW_Module_Item_C_SetItem::Item' has a wrong offset!");
static_assert(offsetof(UIW_Module_Item_C_SetItem, CallFunc_IsWeapon_ReturnValue) == 0x000008, "Member 'UIW_Module_Item_C_SetItem::CallFunc_IsWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_Item_C_SetItem, K2Node_DynamicCast_AsLWeapon_Item) == 0x000010, "Member 'UIW_Module_Item_C_SetItem::K2Node_DynamicCast_AsLWeapon_Item' has a wrong offset!");
static_assert(offsetof(UIW_Module_Item_C_SetItem, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UIW_Module_Item_C_SetItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Module_Item_C_SetItem, CallFunc_GetWeaponByname_ItemName) == 0x000020, "Member 'UIW_Module_Item_C_SetItem::CallFunc_GetWeaponByname_ItemName' has a wrong offset!");
static_assert(offsetof(UIW_Module_Item_C_SetItem, CallFunc_GetHandleCommonInfo_ReturnValue) == 0x000038, "Member 'UIW_Module_Item_C_SetItem::CallFunc_GetHandleCommonInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_Item_C_SetItem, CallFunc_GetBladeCommonInfo_ReturnValue) == 0x000040, "Member 'UIW_Module_Item_C_SetItem::CallFunc_GetBladeCommonInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_Item_C_SetItem, CallFunc_GetImageResource_ReturnValue) == 0x000048, "Member 'UIW_Module_Item_C_SetItem::CallFunc_GetImageResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_Item_C_SetItem, CallFunc_GetImageResource_ReturnValue_1) == 0x000070, "Member 'UIW_Module_Item_C_SetItem::CallFunc_GetImageResource_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Module_Item_C_SetItem, CallFunc_GetHeroicImageResource_ReturnValue) == 0x000098, "Member 'UIW_Module_Item_C_SetItem::CallFunc_GetHeroicImageResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_Item_C_SetItem, CallFunc_IsHeroicWeapon_ReturnValue) == 0x0000C0, "Member 'UIW_Module_Item_C_SetItem::CallFunc_IsHeroicWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_Item_C_SetItem, CallFunc_GetCount_ReturnValue) == 0x0000C4, "Member 'UIW_Module_Item_C_SetItem::CallFunc_GetCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_Item_C_SetItem, CallFunc_Conv_IntToText_ReturnValue) == 0x0000C8, "Member 'UIW_Module_Item_C_SetItem::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_Item_C_SetItem, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000E0, "Member 'UIW_Module_Item_C_SetItem::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_Item_C_SetItem, CallFunc_GetCommonInfo_ReturnValue) == 0x0000E8, "Member 'UIW_Module_Item_C_SetItem::CallFunc_GetCommonInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_Item_C_SetItem, CallFunc_GetLocalTextItemNameLocalize_ReturnValue) == 0x0000F0, "Member 'UIW_Module_Item_C_SetItem::CallFunc_GetLocalTextItemNameLocalize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_Item_C_SetItem, CallFunc_GetImageResource_ReturnValue_2) == 0x000108, "Member 'UIW_Module_Item_C_SetItem::CallFunc_GetImageResource_ReturnValue_2' has a wrong offset!");

}

