#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ListItem_Location

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK::Params
{

// Function UIW_ListItem_Location.UIW_ListItem_Location_C.ExecuteUbergraph_UIW_ListItem_Location
// 0x01E0 (0x01E0 - 0x0000)
struct UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UListViewBase*                          CallFunc_GetOwningListView_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_Teleport_C*              K2Node_DynamicCast_AsUIBP_List_Data_Teleport;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UListView*                              K2Node_DynamicCast_AsList_View;                    // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0044(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0080(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00F0(0x0070)(ConstParm)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0160(0x0008)(NoDestructor)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_Array_Get_Item;                           // 0x0170(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTeleportObjectInfoPtr                 CallFunc_FindTeleportObjectInfoByNameBP_ReturnValue; // 0x01A0(0x0008)(NoDestructor)
	class FText                                   CallFunc_GetLocalTextNameLocalize_ReturnValue;     // 0x01A8(0x0018)()
	class FName                                   CallFunc_GetFocusedTorsionCoilName_TorsionCoilName; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_ListItem_Helper_C*                 CallFunc_SpawnObject_ReturnValue;                  // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location) == 0x000008, "Wrong alignment on UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location");
static_assert(sizeof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location) == 0x0001E0, "Wrong size on UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location");
static_assert(offsetof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location, EntryPoint) == 0x000000, "Member 'UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location, K2Node_Event_bIsExpanded) == 0x000010, "Member 'UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location, K2Node_Event_ListItemObject) == 0x000018, "Member 'UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location, CallFunc_GetOwningListView_ReturnValue) == 0x000020, "Member 'UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location::CallFunc_GetOwningListView_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location, K2Node_DynamicCast_AsUIBP_List_Data_Teleport) == 0x000028, "Member 'UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location::K2Node_DynamicCast_AsUIBP_List_Data_Teleport' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location, K2Node_DynamicCast_AsList_View) == 0x000038, "Member 'UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location::K2Node_DynamicCast_AsList_View' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location, K2Node_Event_bIsSelected) == 0x000041, "Member 'UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location, K2Node_Event_MyGeometry) == 0x000044, "Member 'UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location, K2Node_Event_MouseEvent_1) == 0x000080, "Member 'UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location, K2Node_Event_MouseEvent) == 0x0000F0, "Member 'UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location, K2Node_Event_InFocusEvent) == 0x000160, "Member 'UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location, CallFunc_GetMainWidget_MainWidget) == 0x000168, "Member 'UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location, CallFunc_Array_Get_Item) == 0x000170, "Member 'UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location, CallFunc_Array_Length_ReturnValue) == 0x000198, "Member 'UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location, CallFunc_Less_IntInt_ReturnValue) == 0x00019C, "Member 'UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location, CallFunc_FindTeleportObjectInfoByNameBP_ReturnValue) == 0x0001A0, "Member 'UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location::CallFunc_FindTeleportObjectInfoByNameBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location, CallFunc_GetLocalTextNameLocalize_ReturnValue) == 0x0001A8, "Member 'UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location::CallFunc_GetLocalTextNameLocalize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location, CallFunc_GetFocusedTorsionCoilName_TorsionCoilName) == 0x0001C0, "Member 'UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location::CallFunc_GetFocusedTorsionCoilName_TorsionCoilName' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0001C8, "Member 'UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location, CallFunc_SpawnObject_ReturnValue) == 0x0001D0, "Member 'UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x0001D8, "Member 'UIW_ListItem_Location_C_ExecuteUbergraph_UIW_ListItem_Location::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function UIW_ListItem_Location.UIW_ListItem_Location_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct UIW_ListItem_Location_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Location_C_OnFocusLost) == 0x000004, "Wrong alignment on UIW_ListItem_Location_C_OnFocusLost");
static_assert(sizeof(UIW_ListItem_Location_C_OnFocusLost) == 0x000008, "Wrong size on UIW_ListItem_Location_C_OnFocusLost");
static_assert(offsetof(UIW_ListItem_Location_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'UIW_ListItem_Location_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function UIW_ListItem_Location.UIW_ListItem_Location_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct UIW_ListItem_Location_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIW_ListItem_Location_C_OnMouseLeave) == 0x000008, "Wrong alignment on UIW_ListItem_Location_C_OnMouseLeave");
static_assert(sizeof(UIW_ListItem_Location_C_OnMouseLeave) == 0x000070, "Wrong size on UIW_ListItem_Location_C_OnMouseLeave");
static_assert(offsetof(UIW_ListItem_Location_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'UIW_ListItem_Location_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function UIW_ListItem_Location.UIW_ListItem_Location_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct UIW_ListItem_Location_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIW_ListItem_Location_C_OnMouseEnter) == 0x000008, "Wrong alignment on UIW_ListItem_Location_C_OnMouseEnter");
static_assert(sizeof(UIW_ListItem_Location_C_OnMouseEnter) == 0x0000A8, "Wrong size on UIW_ListItem_Location_C_OnMouseEnter");
static_assert(offsetof(UIW_ListItem_Location_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'UIW_ListItem_Location_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'UIW_ListItem_Location_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function UIW_ListItem_Location.UIW_ListItem_Location_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_ListItem_Location_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Location_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on UIW_ListItem_Location_C_BP_OnItemSelectionChanged");
static_assert(sizeof(UIW_ListItem_Location_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on UIW_ListItem_Location_C_BP_OnItemSelectionChanged");
static_assert(offsetof(UIW_ListItem_Location_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'UIW_ListItem_Location_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function UIW_ListItem_Location.UIW_ListItem_Location_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct UIW_ListItem_Location_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ListItem_Location_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on UIW_ListItem_Location_C_OnListItemObjectSet");
static_assert(sizeof(UIW_ListItem_Location_C_OnListItemObjectSet) == 0x000008, "Wrong size on UIW_ListItem_Location_C_OnListItemObjectSet");
static_assert(offsetof(UIW_ListItem_Location_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'UIW_ListItem_Location_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function UIW_ListItem_Location.UIW_ListItem_Location_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_ListItem_Location_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Location_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on UIW_ListItem_Location_C_BP_OnItemExpansionChanged");
static_assert(sizeof(UIW_ListItem_Location_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on UIW_ListItem_Location_C_BP_OnItemExpansionChanged");
static_assert(offsetof(UIW_ListItem_Location_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'UIW_ListItem_Location_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function UIW_ListItem_Location.UIW_ListItem_Location_C.SetHighlightLabel
// 0x0150 (0x0150 - 0x0000)
struct UIW_ListItem_Location_C_SetHighlightLabel final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0028)()
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0028(0x0058)(HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_1;                 // 0x0080(0x0058)(HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x00D8(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0100(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0128(0x0028)()
};
static_assert(alignof(UIW_ListItem_Location_C_SetHighlightLabel) == 0x000008, "Wrong alignment on UIW_ListItem_Location_C_SetHighlightLabel");
static_assert(sizeof(UIW_ListItem_Location_C_SetHighlightLabel) == 0x000150, "Wrong size on UIW_ListItem_Location_C_SetHighlightLabel");
static_assert(offsetof(UIW_ListItem_Location_C_SetHighlightLabel, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'UIW_ListItem_Location_C_SetHighlightLabel::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_SetHighlightLabel, K2Node_MakeStruct_SlateFontInfo) == 0x000028, "Member 'UIW_ListItem_Location_C_SetHighlightLabel::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_SetHighlightLabel, K2Node_MakeStruct_SlateFontInfo_1) == 0x000080, "Member 'UIW_ListItem_Location_C_SetHighlightLabel::K2Node_MakeStruct_SlateFontInfo_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_SetHighlightLabel, K2Node_MakeStruct_SlateColor_1) == 0x0000D8, "Member 'UIW_ListItem_Location_C_SetHighlightLabel::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_SetHighlightLabel, K2Node_MakeStruct_SlateColor_2) == 0x000100, "Member 'UIW_ListItem_Location_C_SetHighlightLabel::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_SetHighlightLabel, K2Node_MakeStruct_SlateColor_3) == 0x000128, "Member 'UIW_ListItem_Location_C_SetHighlightLabel::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");

// Function UIW_ListItem_Location.UIW_ListItem_Location_C.SetMoveFocusEffect
// 0x0028 (0x0028 - 0x0000)
struct UIW_ListItem_Location_C_SetMoveFocusEffect final
{
public:
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BP_IsItemVisible_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Location_C_SetMoveFocusEffect) == 0x000008, "Wrong alignment on UIW_ListItem_Location_C_SetMoveFocusEffect");
static_assert(sizeof(UIW_ListItem_Location_C_SetMoveFocusEffect) == 0x000028, "Wrong size on UIW_ListItem_Location_C_SetMoveFocusEffect");
static_assert(offsetof(UIW_ListItem_Location_C_SetMoveFocusEffect, CallFunc_GetMainWidget_MainWidget) == 0x000000, "Member 'UIW_ListItem_Location_C_SetMoveFocusEffect::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_SetMoveFocusEffect, CallFunc_GetListItemObject_ReturnValue) == 0x000008, "Member 'UIW_ListItem_Location_C_SetMoveFocusEffect::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_SetMoveFocusEffect, CallFunc_BP_IsItemVisible_ReturnValue) == 0x000010, "Member 'UIW_ListItem_Location_C_SetMoveFocusEffect::CallFunc_BP_IsItemVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_SetMoveFocusEffect, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x000018, "Member 'UIW_ListItem_Location_C_SetMoveFocusEffect::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_SetMoveFocusEffect, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000020, "Member 'UIW_ListItem_Location_C_SetMoveFocusEffect::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_SetMoveFocusEffect, CallFunc_BooleanAND_ReturnValue) == 0x000021, "Member 'UIW_ListItem_Location_C_SetMoveFocusEffect::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function UIW_ListItem_Location.UIW_ListItem_Location_C.OnMouseWheel
// 0x0220 (0x0220 - 0x0000)
struct UIW_ListItem_Location_C_OnMouseWheel final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0160(0x00B8)()
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ListItem_Location_C_OnMouseWheel) == 0x000008, "Wrong alignment on UIW_ListItem_Location_C_OnMouseWheel");
static_assert(sizeof(UIW_ListItem_Location_C_OnMouseWheel) == 0x000220, "Wrong size on UIW_ListItem_Location_C_OnMouseWheel");
static_assert(offsetof(UIW_ListItem_Location_C_OnMouseWheel, MyGeometry) == 0x000000, "Member 'UIW_ListItem_Location_C_OnMouseWheel::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_OnMouseWheel, MouseEvent) == 0x000038, "Member 'UIW_ListItem_Location_C_OnMouseWheel::MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_OnMouseWheel, ReturnValue) == 0x0000A8, "Member 'UIW_ListItem_Location_C_OnMouseWheel::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_OnMouseWheel, K2Node_MakeStruct_EventReply) == 0x000160, "Member 'UIW_ListItem_Location_C_OnMouseWheel::K2Node_MakeStruct_EventReply' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_OnMouseWheel, CallFunc_GetMainWidget_MainWidget) == 0x000218, "Member 'UIW_ListItem_Location_C_OnMouseWheel::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");

// Function UIW_ListItem_Location.UIW_ListItem_Location_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct UIW_ListItem_Location_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(UIW_ListItem_Location_C_OnFocusReceived) == 0x000008, "Wrong alignment on UIW_ListItem_Location_C_OnFocusReceived");
static_assert(sizeof(UIW_ListItem_Location_C_OnFocusReceived) == 0x0001B0, "Wrong size on UIW_ListItem_Location_C_OnFocusReceived");
static_assert(offsetof(UIW_ListItem_Location_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UIW_ListItem_Location_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UIW_ListItem_Location_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UIW_ListItem_Location_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Location_C_OnFocusReceived, K2Node_MakeStruct_EventReply) == 0x0000F8, "Member 'UIW_ListItem_Location_C_OnFocusReceived::K2Node_MakeStruct_EventReply' has a wrong offset!");

}

