#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ProfileItem_Ergo

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "ProjectP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UIST_Color_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK::Params
{

// Function UIW_ProfileItem_Ergo.UIW_ProfileItem_Ergo_C.ExecuteUbergraph_UIW_ProfileItem_Ergo
// 0x00C0 (0x00C0 - 0x0000)
struct UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUIST_Color                            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Int32Data)>              K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	struct FUIST_Color                            CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_1;    // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsValid)>                 K2Node_CreateDelegate_OutputDelegate_4;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentErgo_ReturnValue;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemCommonInfoPtr                     CallFunc_FindItemCommonInfoByNameBP_ReturnValue;   // 0x00A0(0x0008)(NoDestructor)
	class FText                                   CallFunc_GetLocalTextItemNameLocalize_ReturnValue; // 0x00A8(0x0018)()
};
static_assert(alignof(UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo) == 0x000008, "Wrong alignment on UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo");
static_assert(sizeof(UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo) == 0x0000C0, "Wrong size on UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo, EntryPoint) == 0x000000, "Member 'UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo, CallFunc_GetDataTableRowFromName_OutRow) == 0x000004, "Member 'UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000008, "Member 'UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x00000C, "Member 'UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x00003C, "Member 'UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000040, "Member 'UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo, K2Node_CreateDelegate_OutputDelegate_3) == 0x000054, "Member 'UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo, CallFunc_Conv_ColorToLinearColor_ReturnValue_1) == 0x000064, "Member 'UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo::CallFunc_Conv_ColorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo, K2Node_CreateDelegate_OutputDelegate_4) == 0x000074, "Member 'UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000088, "Member 'UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000090, "Member 'UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo, CallFunc_GetCurrentErgo_ReturnValue) == 0x000098, "Member 'UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo::CallFunc_GetCurrentErgo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo, CallFunc_FindItemCommonInfoByNameBP_ReturnValue) == 0x0000A0, "Member 'UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo::CallFunc_FindItemCommonInfoByNameBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo, CallFunc_GetLocalTextItemNameLocalize_ReturnValue) == 0x0000A8, "Member 'UIW_ProfileItem_Ergo_C_ExecuteUbergraph_UIW_ProfileItem_Ergo::CallFunc_GetLocalTextItemNameLocalize_ReturnValue' has a wrong offset!");

// Function UIW_ProfileItem_Ergo.UIW_ProfileItem_Ergo_C.RefreshErgo
// 0x0078 (0x0078 - 0x0000)
struct UIW_ProfileItem_Ergo_C_RefreshErgo final
{
public:
	int32                                         Int32Data;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	struct FTweenEase                             K2Node_MakeStruct_TweenEase;                       // 0x0028(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_1;                     // 0x0034(0x000C)(NoDestructor)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0050(0x0018)()
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ProfileItem_Ergo_C_RefreshErgo) == 0x000008, "Wrong alignment on UIW_ProfileItem_Ergo_C_RefreshErgo");
static_assert(sizeof(UIW_ProfileItem_Ergo_C_RefreshErgo) == 0x000078, "Wrong size on UIW_ProfileItem_Ergo_C_RefreshErgo");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshErgo, Int32Data) == 0x000000, "Member 'UIW_ProfileItem_Ergo_C_RefreshErgo::Int32Data' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshErgo, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'UIW_ProfileItem_Ergo_C_RefreshErgo::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshErgo, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'UIW_ProfileItem_Ergo_C_RefreshErgo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshErgo, K2Node_MakeStruct_TweenEase) == 0x000028, "Member 'UIW_ProfileItem_Ergo_C_RefreshErgo::K2Node_MakeStruct_TweenEase' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshErgo, K2Node_MakeStruct_TweenEase_1) == 0x000034, "Member 'UIW_ProfileItem_Ergo_C_RefreshErgo::K2Node_MakeStruct_TweenEase_1' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshErgo, CallFunc_MakeVector2D_ReturnValue) == 0x000040, "Member 'UIW_ProfileItem_Ergo_C_RefreshErgo::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshErgo, CallFunc_Subtract_IntInt_ReturnValue) == 0x000048, "Member 'UIW_ProfileItem_Ergo_C_RefreshErgo::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshErgo, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000050, "Member 'UIW_ProfileItem_Ergo_C_RefreshErgo::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshErgo, CallFunc_K2_SetTimer_ReturnValue_1) == 0x000068, "Member 'UIW_ProfileItem_Ergo_C_RefreshErgo::CallFunc_K2_SetTimer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshErgo, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000070, "Member 'UIW_ProfileItem_Ergo_C_RefreshErgo::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function UIW_ProfileItem_Ergo.UIW_ProfileItem_Ergo_C.RefreshDropErgo
// 0x0138 (0x0138 - 0x0000)
struct UIW_ProfileItem_Ergo_C_RefreshDropErgo final
{
public:
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDropErgo_ReturnValue;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0018)()
	bool                                          CallFunc_IsProtectErgoDrop_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0048(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0070(0x0028)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0098(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x00B0(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_2;         // 0x00C8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0120(0x0018)()
};
static_assert(alignof(UIW_ProfileItem_Ergo_C_RefreshDropErgo) == 0x000008, "Wrong alignment on UIW_ProfileItem_Ergo_C_RefreshDropErgo");
static_assert(sizeof(UIW_ProfileItem_Ergo_C_RefreshDropErgo) == 0x000138, "Wrong size on UIW_ProfileItem_Ergo_C_RefreshDropErgo");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshDropErgo, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'UIW_ProfileItem_Ergo_C_RefreshDropErgo::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshDropErgo, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'UIW_ProfileItem_Ergo_C_RefreshDropErgo::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshDropErgo, CallFunc_GetDropErgo_ReturnValue) == 0x000010, "Member 'UIW_ProfileItem_Ergo_C_RefreshDropErgo::CallFunc_GetDropErgo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshDropErgo, K2Node_DynamicCast_AsLPCCharacter) == 0x000018, "Member 'UIW_ProfileItem_Ergo_C_RefreshDropErgo::K2Node_DynamicCast_AsLPCCharacter' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshDropErgo, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'UIW_ProfileItem_Ergo_C_RefreshDropErgo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshDropErgo, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'UIW_ProfileItem_Ergo_C_RefreshDropErgo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshDropErgo, CallFunc_IsProtectErgoDrop_ReturnValue) == 0x000040, "Member 'UIW_ProfileItem_Ergo_C_RefreshDropErgo::CallFunc_IsProtectErgoDrop_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshDropErgo, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000041, "Member 'UIW_ProfileItem_Ergo_C_RefreshDropErgo::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshDropErgo, K2Node_MakeStruct_SlateColor) == 0x000048, "Member 'UIW_ProfileItem_Ergo_C_RefreshDropErgo::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshDropErgo, K2Node_MakeStruct_SlateColor_1) == 0x000070, "Member 'UIW_ProfileItem_Ergo_C_RefreshDropErgo::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshDropErgo, CallFunc_GetGameStrWithName_ReturnValue) == 0x000098, "Member 'UIW_ProfileItem_Ergo_C_RefreshDropErgo::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshDropErgo, CallFunc_GetGameStrWithName_ReturnValue_1) == 0x0000B0, "Member 'UIW_ProfileItem_Ergo_C_RefreshDropErgo::CallFunc_GetGameStrWithName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshDropErgo, CallFunc_GetGameStrWithName_ReturnValue_2) == 0x0000C8, "Member 'UIW_ProfileItem_Ergo_C_RefreshDropErgo::CallFunc_GetGameStrWithName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshDropErgo, CallFunc_Conv_TextToString_ReturnValue) == 0x0000E0, "Member 'UIW_ProfileItem_Ergo_C_RefreshDropErgo::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshDropErgo, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0000F0, "Member 'UIW_ProfileItem_Ergo_C_RefreshDropErgo::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshDropErgo, CallFunc_Concat_StrStr_ReturnValue) == 0x000100, "Member 'UIW_ProfileItem_Ergo_C_RefreshDropErgo::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshDropErgo, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000110, "Member 'UIW_ProfileItem_Ergo_C_RefreshDropErgo::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshDropErgo, CallFunc_Conv_StringToText_ReturnValue) == 0x000120, "Member 'UIW_ProfileItem_Ergo_C_RefreshDropErgo::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function UIW_ProfileItem_Ergo.UIW_ProfileItem_Ergo_C.HideEffect
// 0x000C (0x000C - 0x0000)
struct UIW_ProfileItem_Ergo_C_HideEffect final
{
public:
	struct FTweenEase                             K2Node_MakeStruct_TweenEase;                       // 0x0000(0x000C)(NoDestructor)
};
static_assert(alignof(UIW_ProfileItem_Ergo_C_HideEffect) == 0x000004, "Wrong alignment on UIW_ProfileItem_Ergo_C_HideEffect");
static_assert(sizeof(UIW_ProfileItem_Ergo_C_HideEffect) == 0x00000C, "Wrong size on UIW_ProfileItem_Ergo_C_HideEffect");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_HideEffect, K2Node_MakeStruct_TweenEase) == 0x000000, "Member 'UIW_ProfileItem_Ergo_C_HideEffect::K2Node_MakeStruct_TweenEase' has a wrong offset!");

// Function UIW_ProfileItem_Ergo.UIW_ProfileItem_Ergo_C.OnDie
// 0x0010 (0x0010 - 0x0000)
struct UIW_ProfileItem_Ergo_C_OnDie final
{
public:
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ProfileItem_Ergo_C_OnDie) == 0x000008, "Wrong alignment on UIW_ProfileItem_Ergo_C_OnDie");
static_assert(sizeof(UIW_ProfileItem_Ergo_C_OnDie) == 0x000010, "Wrong size on UIW_ProfileItem_Ergo_C_OnDie");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_OnDie, CallFunc_GetMainWidget_MainWidget) == 0x000000, "Member 'UIW_ProfileItem_Ergo_C_OnDie::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_OnDie, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UIW_ProfileItem_Ergo_C_OnDie::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function UIW_ProfileItem_Ergo.UIW_ProfileItem_Ergo_C.RefreshErgoState
// 0x0070 (0x0070 - 0x0000)
struct UIW_ProfileItem_Ergo_C_RefreshErgoState final
{
public:
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentErgo_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0028)()
	int32                                         CallFunc_GetCharacterLevel_ReturnValue;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLevelUpRequireErgo_ReturnValue;        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0048(0x0028)()
};
static_assert(alignof(UIW_ProfileItem_Ergo_C_RefreshErgoState) == 0x000008, "Wrong alignment on UIW_ProfileItem_Ergo_C_RefreshErgoState");
static_assert(sizeof(UIW_ProfileItem_Ergo_C_RefreshErgoState) == 0x000070, "Wrong size on UIW_ProfileItem_Ergo_C_RefreshErgoState");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshErgoState, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'UIW_ProfileItem_Ergo_C_RefreshErgoState::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshErgoState, CallFunc_GetCurrentErgo_ReturnValue) == 0x000008, "Member 'UIW_ProfileItem_Ergo_C_RefreshErgoState::CallFunc_GetCurrentErgo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshErgoState, K2Node_MakeStruct_SlateColor) == 0x000010, "Member 'UIW_ProfileItem_Ergo_C_RefreshErgoState::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshErgoState, CallFunc_GetCharacterLevel_ReturnValue) == 0x000038, "Member 'UIW_ProfileItem_Ergo_C_RefreshErgoState::CallFunc_GetCharacterLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshErgoState, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'UIW_ProfileItem_Ergo_C_RefreshErgoState::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshErgoState, CallFunc_GetLevelUpRequireErgo_ReturnValue) == 0x000040, "Member 'UIW_ProfileItem_Ergo_C_RefreshErgoState::CallFunc_GetLevelUpRequireErgo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshErgoState, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000044, "Member 'UIW_ProfileItem_Ergo_C_RefreshErgoState::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_RefreshErgoState, K2Node_MakeStruct_SlateColor_1) == 0x000048, "Member 'UIW_ProfileItem_Ergo_C_RefreshErgoState::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function UIW_ProfileItem_Ergo.UIW_ProfileItem_Ergo_C.OnProtectErgoDropChange
// 0x0070 (0x0070 - 0x0000)
struct UIW_ProfileItem_Ergo_C_OnProtectErgoDropChange final
{
public:
	bool                                          IsValid;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsProtectErgoDrop_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0020(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0048(0x0028)()
};
static_assert(alignof(UIW_ProfileItem_Ergo_C_OnProtectErgoDropChange) == 0x000008, "Wrong alignment on UIW_ProfileItem_Ergo_C_OnProtectErgoDropChange");
static_assert(sizeof(UIW_ProfileItem_Ergo_C_OnProtectErgoDropChange) == 0x000070, "Wrong size on UIW_ProfileItem_Ergo_C_OnProtectErgoDropChange");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_OnProtectErgoDropChange, IsValid) == 0x000000, "Member 'UIW_ProfileItem_Ergo_C_OnProtectErgoDropChange::IsValid' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_OnProtectErgoDropChange, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'UIW_ProfileItem_Ergo_C_OnProtectErgoDropChange::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Ergo_C_OnProtectErgoDropChange, K2Node_DynamicCast_AsLPCCharacter) == 0x000010, "Member 'UIW_ProfileItem_Ergo_C_OnProtectErgoDropChange::K2Node_DynamicCast_AsLPCCharacter' has a wrong offset!");
