#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ListItem_Achievement

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function UIW_ListItem_Achievement.UIW_ListItem_Achievement_C.ExecuteUbergraph_UIW_ListItem_Achievement
// 0x01A0 (0x01A0 - 0x0000)
struct UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_Achievement_C*           K2Node_CustomEvent_Data;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0038(0x0028)()
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_Achievement_C*           K2Node_DynamicCast_AsUIBP_List_Data_Achievement;   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0084(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x00C0(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0130(0x0070)(ConstParm)
};
static_assert(alignof(UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement) == 0x000008, "Wrong alignment on UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement");
static_assert(sizeof(UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement) == 0x0001A0, "Wrong size on UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement");
static_assert(offsetof(UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement, EntryPoint) == 0x000000, "Member 'UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement, K2Node_CustomEvent_Data) == 0x000008, "Member 'UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement, K2Node_MakeStruct_SlateColor) == 0x000010, "Member 'UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement, K2Node_MakeStruct_SlateColor_1) == 0x000038, "Member 'UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement, K2Node_Event_bIsExpanded) == 0x000060, "Member 'UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement, K2Node_Event_ListItemObject) == 0x000068, "Member 'UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement, K2Node_Event_bIsSelected) == 0x000070, "Member 'UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement, K2Node_DynamicCast_AsUIBP_List_Data_Achievement) == 0x000078, "Member 'UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement::K2Node_DynamicCast_AsUIBP_List_Data_Achievement' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement, K2Node_Event_MyGeometry) == 0x000084, "Member 'UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement, K2Node_Event_MouseEvent_1) == 0x0000C0, "Member 'UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement, K2Node_Event_MouseEvent) == 0x000130, "Member 'UIW_ListItem_Achievement_C_ExecuteUbergraph_UIW_ListItem_Achievement::K2Node_Event_MouseEvent' has a wrong offset!");

// Function UIW_ListItem_Achievement.UIW_ListItem_Achievement_C.OnDataUpdate
// 0x0008 (0x0008 - 0x0000)
struct UIW_ListItem_Achievement_C_OnDataUpdate final
{
public:
	class UUIBP_ListData_Achievement_C*           Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ListItem_Achievement_C_OnDataUpdate) == 0x000008, "Wrong alignment on UIW_ListItem_Achievement_C_OnDataUpdate");
static_assert(sizeof(UIW_ListItem_Achievement_C_OnDataUpdate) == 0x000008, "Wrong size on UIW_ListItem_Achievement_C_OnDataUpdate");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnDataUpdate, Data) == 0x000000, "Member 'UIW_ListItem_Achievement_C_OnDataUpdate::Data' has a wrong offset!");

// Function UIW_ListItem_Achievement.UIW_ListItem_Achievement_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct UIW_ListItem_Achievement_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIW_ListItem_Achievement_C_OnMouseLeave) == 0x000008, "Wrong alignment on UIW_ListItem_Achievement_C_OnMouseLeave");
static_assert(sizeof(UIW_ListItem_Achievement_C_OnMouseLeave) == 0x000070, "Wrong size on UIW_ListItem_Achievement_C_OnMouseLeave");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'UIW_ListItem_Achievement_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function UIW_ListItem_Achievement.UIW_ListItem_Achievement_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct UIW_ListItem_Achievement_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIW_ListItem_Achievement_C_OnMouseEnter) == 0x000008, "Wrong alignment on UIW_ListItem_Achievement_C_OnMouseEnter");
static_assert(sizeof(UIW_ListItem_Achievement_C_OnMouseEnter) == 0x0000A8, "Wrong size on UIW_ListItem_Achievement_C_OnMouseEnter");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'UIW_ListItem_Achievement_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'UIW_ListItem_Achievement_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function UIW_ListItem_Achievement.UIW_ListItem_Achievement_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_ListItem_Achievement_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Achievement_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on UIW_ListItem_Achievement_C_BP_OnItemSelectionChanged");
static_assert(sizeof(UIW_ListItem_Achievement_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on UIW_ListItem_Achievement_C_BP_OnItemSelectionChanged");
static_assert(offsetof(UIW_ListItem_Achievement_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'UIW_ListItem_Achievement_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function UIW_ListItem_Achievement.UIW_ListItem_Achievement_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct UIW_ListItem_Achievement_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ListItem_Achievement_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on UIW_ListItem_Achievement_C_OnListItemObjectSet");
static_assert(sizeof(UIW_ListItem_Achievement_C_OnListItemObjectSet) == 0x000008, "Wrong size on UIW_ListItem_Achievement_C_OnListItemObjectSet");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'UIW_ListItem_Achievement_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function UIW_ListItem_Achievement.UIW_ListItem_Achievement_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_ListItem_Achievement_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Achievement_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on UIW_ListItem_Achievement_C_BP_OnItemExpansionChanged");
static_assert(sizeof(UIW_ListItem_Achievement_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on UIW_ListItem_Achievement_C_BP_OnItemExpansionChanged");
static_assert(offsetof(UIW_ListItem_Achievement_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'UIW_ListItem_Achievement_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function UIW_ListItem_Achievement.UIW_ListItem_Achievement_C.OnMouseButtonDown
// 0x0260 (0x0260 - 0x0000)
struct UIW_ListItem_Achievement_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0168(0x0018)(HasGetValueTypeHash)
	class UUIBP_ListData_Command_C*               K2Node_DynamicCast_AsUIBP_List_Data_Command;       // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18A[0x6];                                      // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x01A0(0x00B8)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Achievement_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on UIW_ListItem_Achievement_C_OnMouseButtonDown");
static_assert(sizeof(UIW_ListItem_Achievement_C_OnMouseButtonDown) == 0x000260, "Wrong size on UIW_ListItem_Achievement_C_OnMouseButtonDown");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'UIW_ListItem_Achievement_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'UIW_ListItem_Achievement_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'UIW_ListItem_Achievement_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnMouseButtonDown, CallFunc_GetListItemObject_ReturnValue) == 0x000160, "Member 'UIW_ListItem_Achievement_C_OnMouseButtonDown::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnMouseButtonDown, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000168, "Member 'UIW_ListItem_Achievement_C_OnMouseButtonDown::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnMouseButtonDown, K2Node_DynamicCast_AsUIBP_List_Data_Command) == 0x000180, "Member 'UIW_ListItem_Achievement_C_OnMouseButtonDown::K2Node_DynamicCast_AsUIBP_List_Data_Command' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnMouseButtonDown, K2Node_DynamicCast_bSuccess) == 0x000188, "Member 'UIW_ListItem_Achievement_C_OnMouseButtonDown::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnMouseButtonDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000189, "Member 'UIW_ListItem_Achievement_C_OnMouseButtonDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnMouseButtonDown, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x000190, "Member 'UIW_ListItem_Achievement_C_OnMouseButtonDown::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnMouseButtonDown, CallFunc_GetIndexForItem_ReturnValue) == 0x000198, "Member 'UIW_ListItem_Achievement_C_OnMouseButtonDown::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnMouseButtonDown, K2Node_MakeStruct_EventReply) == 0x0001A0, "Member 'UIW_ListItem_Achievement_C_OnMouseButtonDown::K2Node_MakeStruct_EventReply' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnMouseButtonDown, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000258, "Member 'UIW_ListItem_Achievement_C_OnMouseButtonDown::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function UIW_ListItem_Achievement.UIW_ListItem_Achievement_C.OnDragDetected
// 0x0108 (0x0108 - 0x0000)
struct UIW_ListItem_Achievement_C_OnDragDetected final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_Drag_CmdLines_C*                  CallFunc_CreateDragDropOperation_ReturnValue;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Drag_CmdLines_C*                   CallFunc_Create_ReturnValue;                       // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_Command_C*               K2Node_DynamicCast_AsUIBP_List_Data_Command;       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00D8(0x0018)()
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Achievement_C_OnDragDetected) == 0x000008, "Wrong alignment on UIW_ListItem_Achievement_C_OnDragDetected");
static_assert(sizeof(UIW_ListItem_Achievement_C_OnDragDetected) == 0x000108, "Wrong size on UIW_ListItem_Achievement_C_OnDragDetected");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnDragDetected, MyGeometry) == 0x000000, "Member 'UIW_ListItem_Achievement_C_OnDragDetected::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnDragDetected, PointerEvent) == 0x000038, "Member 'UIW_ListItem_Achievement_C_OnDragDetected::PointerEvent' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnDragDetected, Operation) == 0x0000A8, "Member 'UIW_ListItem_Achievement_C_OnDragDetected::Operation' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnDragDetected, CallFunc_CreateDragDropOperation_ReturnValue) == 0x0000B0, "Member 'UIW_ListItem_Achievement_C_OnDragDetected::CallFunc_CreateDragDropOperation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnDragDetected, CallFunc_Create_ReturnValue) == 0x0000B8, "Member 'UIW_ListItem_Achievement_C_OnDragDetected::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnDragDetected, CallFunc_GetListItemObject_ReturnValue) == 0x0000C0, "Member 'UIW_ListItem_Achievement_C_OnDragDetected::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnDragDetected, K2Node_DynamicCast_AsUIBP_List_Data_Command) == 0x0000C8, "Member 'UIW_ListItem_Achievement_C_OnDragDetected::K2Node_DynamicCast_AsUIBP_List_Data_Command' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnDragDetected, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'UIW_ListItem_Achievement_C_OnDragDetected::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnDragDetected, CallFunc_Conv_StringToText_ReturnValue) == 0x0000D8, "Member 'UIW_ListItem_Achievement_C_OnDragDetected::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnDragDetected, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000F0, "Member 'UIW_ListItem_Achievement_C_OnDragDetected::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnDragDetected, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x0000F8, "Member 'UIW_ListItem_Achievement_C_OnDragDetected::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnDragDetected, CallFunc_GetIndexForItem_ReturnValue) == 0x000100, "Member 'UIW_ListItem_Achievement_C_OnDragDetected::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnDragDetected, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000104, "Member 'UIW_ListItem_Achievement_C_OnDragDetected::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function UIW_ListItem_Achievement.UIW_ListItem_Achievement_C.OnDrop
// 0x00D0 (0x00D0 - 0x0000)
struct UIW_ListItem_Achievement_C_OnDrop final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00A8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x00B0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_Command_C*               K2Node_DynamicCast_AsUIBP_List_Data_Command;       // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Achievement_C_OnDrop) == 0x000008, "Wrong alignment on UIW_ListItem_Achievement_C_OnDrop");
static_assert(sizeof(UIW_ListItem_Achievement_C_OnDrop) == 0x0000D0, "Wrong size on UIW_ListItem_Achievement_C_OnDrop");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnDrop, MyGeometry) == 0x000000, "Member 'UIW_ListItem_Achievement_C_OnDrop::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnDrop, PointerEvent) == 0x000038, "Member 'UIW_ListItem_Achievement_C_OnDrop::PointerEvent' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnDrop, Operation) == 0x0000A8, "Member 'UIW_ListItem_Achievement_C_OnDrop::Operation' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnDrop, ReturnValue) == 0x0000B0, "Member 'UIW_ListItem_Achievement_C_OnDrop::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnDrop, CallFunc_GetListItemObject_ReturnValue) == 0x0000B8, "Member 'UIW_ListItem_Achievement_C_OnDrop::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnDrop, K2Node_DynamicCast_AsUIBP_List_Data_Command) == 0x0000C0, "Member 'UIW_ListItem_Achievement_C_OnDrop::K2Node_DynamicCast_AsUIBP_List_Data_Command' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_OnDrop, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'UIW_ListItem_Achievement_C_OnDrop::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UIW_ListItem_Achievement.UIW_ListItem_Achievement_C.SetData
// 0x0130 (0x0130 - 0x0000)
struct UIW_ListItem_Achievement_C_SetData final
{
public:
	class UUIBP_ListData_Achievement_C*           ItemData_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable_3;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_4;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalTextAchieveDetailsLocalize_ReturnValue; // 0x0038(0x0018)()
	class FText                                   CallFunc_GetLocalTextAchieveNameLocalize_ReturnValue; // 0x0050(0x0018)()
	ELAchieveGradeType                            CallFunc_GetAchieveGrade_ReturnValue;              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGamerScore_ReturnValue;                // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0078(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_5;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item;                           // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUIBP_ListData_Achievement_C* Data)> K2Node_CreateDelegate_OutputDelegate;              // 0x00C4(0x0010)(ZeroConstructor, NoDestructor)
	ELAchieveGradeType                            Temp_byte_Variable;                                // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default;                             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0118(0x0018)()
};
static_assert(alignof(UIW_ListItem_Achievement_C_SetData) == 0x000008, "Wrong alignment on UIW_ListItem_Achievement_C_SetData");
static_assert(sizeof(UIW_ListItem_Achievement_C_SetData) == 0x000130, "Wrong size on UIW_ListItem_Achievement_C_SetData");
static_assert(offsetof(UIW_ListItem_Achievement_C_SetData, ItemData_0) == 0x000000, "Member 'UIW_ListItem_Achievement_C_SetData::ItemData_0' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_SetData, Temp_object_Variable) == 0x000008, "Member 'UIW_ListItem_Achievement_C_SetData::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_SetData, Temp_object_Variable_1) == 0x000010, "Member 'UIW_ListItem_Achievement_C_SetData::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Achievement_C_SetData, Temp_object_Variable_2) == 0x000018, "Member 'UIW_ListItem_Achievement_C_SetData::Temp_object_Variable_2' has a wrong offset!");
