#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Intro

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UIW_Window_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Intro.UIW_Intro_C
// 0x0020 (0x0370 - 0x0350)
class UUIW_Intro_C final : public UUIW_Window_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UIW_Intro_C;                        // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Construct;                                     // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             Text_04;                                           // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_05;                                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_Intro(int32 EntryPoint);
	void WidgetAnimationEvt_Ani_Construct_K2Node_WidgetAnimationEvent_0();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Intro_C">();
	}
	static class UUIW_Intro_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Intro_C>();
	}
};
static_assert(alignof(UUIW_Intro_C) == 0x000008, "Wrong alignment on UUIW_Intro_C");
static_assert(sizeof(UUIW_Intro_C) == 0x000370, "Wrong size on UUIW_Intro_C");
static_assert(offsetof(UUIW_Intro_C, UberGraphFrame_UIW_Intro_C) == 0x000350, "Member 'UUIW_Intro_C::UberGraphFrame_UIW_Intro_C' has a wrong offset!");
static_assert(offsetof(UUIW_Intro_C, Ani_Construct) == 0x000358, "Member 'UUIW_Intro_C::Ani_Construct' has a wrong offset!");
static_assert(offsetof(UUIW_Intro_C, Text_04) == 0x000360, "Member 'UUIW_Intro_C::Text_04' has a wrong offset!");
static_assert(offsetof(UUIW_Intro_C, Text_05) == 0x000368, "Member 'UUIW_Intro_C::Text_05' has a wrong offset!");

}

