#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ActionType

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_ActionType.UIW_ActionType_C
// 0x00A0 (0x0348 - 0x02A8)
class UUIW_ActionType_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Selected;                                      // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 DecoLine_Selected;                                 // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Group_Info_0;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Group_Info_1;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_ActionType;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Blade;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Hand;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULListView*                             List_Stat_1;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULListView*                             List_Stat_2;                                       // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Desc;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Title;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   TypeName;                                          // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnSelected;                                        // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         CurrentPage;                                       // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnDoubleClicked;                                   // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FDefaultStatInfoPtr                    DefaultStatInfo;                                   // 0x0338(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class ULStatComponent*                        StatComponent;                                     // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnSelected__DelegateSignature(class UUIW_ActionType_C* ActionType);
	void OnDoubleClicked__DelegateSignature();
	void ExecuteUbergraph_UIW_ActionType(int32 EntryPoint);
	void Construct();
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void SetData(class FName TypeName_0);
	void NextPage();
	struct FEventReply OnMouseButtonDoubleClick(const struct FGeometry& InMyGeometry, const struct FPointerEvent& InMouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_ActionType_C">();
	}
	static class UUIW_ActionType_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_ActionType_C>();
	}
};
static_assert(alignof(UUIW_ActionType_C) == 0x000008, "Wrong alignment on UUIW_ActionType_C");
static_assert(sizeof(UUIW_ActionType_C) == 0x000348, "Wrong size on UUIW_ActionType_C");
static_assert(offsetof(UUIW_ActionType_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_ActionType_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_ActionType_C, Ani_Selected) == 0x0002B0, "Member 'UUIW_ActionType_C::Ani_Selected' has a wrong offset!");
static_assert(offsetof(UUIW_ActionType_C, DecoLine_Selected) == 0x0002B8, "Member 'UUIW_ActionType_C::DecoLine_Selected' has a wrong offset!");
static_assert(offsetof(UUIW_ActionType_C, Group_Info_0) == 0x0002C0, "Member 'UUIW_ActionType_C::Group_Info_0' has a wrong offset!");
static_assert(offsetof(UUIW_ActionType_C, Group_Info_1) == 0x0002C8, "Member 'UUIW_ActionType_C::Group_Info_1' has a wrong offset!");
static_assert(offsetof(UUIW_ActionType_C, Img_ActionType) == 0x0002D0, "Member 'UUIW_ActionType_C::Img_ActionType' has a wrong offset!");
static_assert(offsetof(UUIW_ActionType_C, Img_Blade) == 0x0002D8, "Member 'UUIW_ActionType_C::Img_Blade' has a wrong offset!");
static_assert(offsetof(UUIW_ActionType_C, Img_Hand) == 0x0002E0, "Member 'UUIW_ActionType_C::Img_Hand' has a wrong offset!");
static_assert(offsetof(UUIW_ActionType_C, List_Stat_1) == 0x0002E8, "Member 'UUIW_ActionType_C::List_Stat_1' has a wrong offset!");
static_assert(offsetof(UUIW_ActionType_C, List_Stat_2) == 0x0002F0, "Member 'UUIW_ActionType_C::List_Stat_2' has a wrong offset!");
static_assert(offsetof(UUIW_ActionType_C, Text_Desc) == 0x0002F8, "Member 'UUIW_ActionType_C::Text_Desc' has a wrong offset!");
static_assert(offsetof(UUIW_ActionType_C, Text_Title) == 0x000300, "Member 'UUIW_ActionType_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UUIW_ActionType_C, TypeName) == 0x000308, "Member 'UUIW_ActionType_C::TypeName' has a wrong offset!");
static_assert(offsetof(UUIW_ActionType_C, OnSelected) == 0x000310, "Member 'UUIW_ActionType_C::OnSelected' has a wrong offset!");
static_assert(offsetof(UUIW_ActionType_C, CurrentPage) == 0x000320, "Member 'UUIW_ActionType_C::CurrentPage' has a wrong offset!");
static_assert(offsetof(UUIW_ActionType_C, OnDoubleClicked) == 0x000328, "Member 'UUIW_ActionType_C::OnDoubleClicked' has a wrong offset!");
static_assert(offsetof(UUIW_ActionType_C, DefaultStatInfo) == 0x000338, "Member 'UUIW_ActionType_C::DefaultStatInfo' has a wrong offset!");
static_assert(offsetof(UUIW_ActionType_C, StatComponent) == 0x000340, "Member 'UUIW_ActionType_C::StatComponent' has a wrong offset!");

}

