#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ListItem_Stat_Simple

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"
#include "UIST_Color_structs.hpp"
#include "ProjectP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UIW_ListItem_Stat_Simple.UIW_ListItem_Stat_Simple_C.ExecuteUbergraph_UIW_ListItem_Stat_Simple
// 0x0060 (0x0060 - 0x0000)
struct UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_OneStat_C*               K2Node_DynamicCast_AsUIBP_List_Data_One_Stat;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ELFirstStat FirstStat)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsOpenedWidget_IsOpened;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_IsOpenedWidget_UserWidget;                // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IsOpenedWidget_WidgetArrayIndex;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_CharacterUpgrade_C*                K2Node_DynamicCast_AsUIW_Character_Upgrade;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple) == 0x000008, "Wrong alignment on UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple");
static_assert(sizeof(UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple) == 0x000060, "Wrong size on UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple, EntryPoint) == 0x000000, "Member 'UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple, K2Node_Event_bIsExpanded) == 0x000004, "Member 'UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple, K2Node_Event_bIsSelected) == 0x000005, "Member 'UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple, K2Node_Event_ListItemObject) == 0x000008, "Member 'UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple, K2Node_DynamicCast_AsUIBP_List_Data_One_Stat) == 0x000010, "Member 'UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple::K2Node_DynamicCast_AsUIBP_List_Data_One_Stat' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple, CallFunc_GetMainWidget_MainWidget) == 0x000020, "Member 'UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple, CallFunc_IsOpenedWidget_IsOpened) == 0x000038, "Member 'UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple::CallFunc_IsOpenedWidget_IsOpened' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple, CallFunc_IsOpenedWidget_UserWidget) == 0x000040, "Member 'UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple::CallFunc_IsOpenedWidget_UserWidget' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple, CallFunc_IsOpenedWidget_WidgetArrayIndex) == 0x000048, "Member 'UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple::CallFunc_IsOpenedWidget_WidgetArrayIndex' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple, K2Node_DynamicCast_AsUIW_Character_Upgrade) == 0x000050, "Member 'UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple::K2Node_DynamicCast_AsUIW_Character_Upgrade' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'UIW_ListItem_Stat_Simple_C_ExecuteUbergraph_UIW_ListItem_Stat_Simple::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UIW_ListItem_Stat_Simple.UIW_ListItem_Stat_Simple_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct UIW_ListItem_Stat_Simple_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ListItem_Stat_Simple_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on UIW_ListItem_Stat_Simple_C_OnListItemObjectSet");
static_assert(sizeof(UIW_ListItem_Stat_Simple_C_OnListItemObjectSet) == 0x000008, "Wrong size on UIW_ListItem_Stat_Simple_C_OnListItemObjectSet");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'UIW_ListItem_Stat_Simple_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function UIW_ListItem_Stat_Simple.UIW_ListItem_Stat_Simple_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_ListItem_Stat_Simple_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Stat_Simple_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on UIW_ListItem_Stat_Simple_C_BP_OnItemSelectionChanged");
static_assert(sizeof(UIW_ListItem_Stat_Simple_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on UIW_ListItem_Stat_Simple_C_BP_OnItemSelectionChanged");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'UIW_ListItem_Stat_Simple_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function UIW_ListItem_Stat_Simple.UIW_ListItem_Stat_Simple_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_ListItem_Stat_Simple_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Stat_Simple_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on UIW_ListItem_Stat_Simple_C_BP_OnItemExpansionChanged");
static_assert(sizeof(UIW_ListItem_Stat_Simple_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on UIW_ListItem_Stat_Simple_C_BP_OnItemExpansionChanged");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'UIW_ListItem_Stat_Simple_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function UIW_ListItem_Stat_Simple.UIW_ListItem_Stat_Simple_C.SetData
// 0x00F0 (0x00F0 - 0x0000)
struct UIW_ListItem_Stat_Simple_C_SetData final
{
public:
	class UUIBP_ListData_OneStat_C*               ListDataOneStat;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalValue;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0028)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIST_Color                            CallFunc_GetDataTableRowFromName_OutRow;           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0058(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0080(0x0028)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIST_Color                            CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_1;    // 0x00B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x00C8(0x0028)()
};
static_assert(alignof(UIW_ListItem_Stat_Simple_C_SetData) == 0x000008, "Wrong alignment on UIW_ListItem_Stat_Simple_C_SetData");
static_assert(sizeof(UIW_ListItem_Stat_Simple_C_SetData) == 0x0000F0, "Wrong size on UIW_ListItem_Stat_Simple_C_SetData");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetData, ListDataOneStat) == 0x000000, "Member 'UIW_ListItem_Stat_Simple_C_SetData::ListDataOneStat' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetData, LocalValue) == 0x000008, "Member 'UIW_ListItem_Stat_Simple_C_SetData::LocalValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetData, K2Node_MakeStruct_SlateColor) == 0x000010, "Member 'UIW_ListItem_Stat_Simple_C_SetData::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetData, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'UIW_ListItem_Stat_Simple_C_SetData::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetData, CallFunc_Less_IntInt_ReturnValue) == 0x000039, "Member 'UIW_ListItem_Stat_Simple_C_SetData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetData, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x00003A, "Member 'UIW_ListItem_Stat_Simple_C_SetData::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetData, CallFunc_GetDataTableRowFromName_OutRow) == 0x00003C, "Member 'UIW_ListItem_Stat_Simple_C_SetData::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetData, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000040, "Member 'UIW_ListItem_Stat_Simple_C_SetData::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetData, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000044, "Member 'UIW_ListItem_Stat_Simple_C_SetData::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetData, K2Node_MakeStruct_SlateColor_1) == 0x000058, "Member 'UIW_ListItem_Stat_Simple_C_SetData::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetData, K2Node_MakeStruct_SlateColor_2) == 0x000080, "Member 'UIW_ListItem_Stat_Simple_C_SetData::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetData, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'UIW_ListItem_Stat_Simple_C_SetData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetData, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0000AC, "Member 'UIW_ListItem_Stat_Simple_C_SetData::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetData, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0000B0, "Member 'UIW_ListItem_Stat_Simple_C_SetData::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetData, CallFunc_Conv_ColorToLinearColor_ReturnValue_1) == 0x0000B4, "Member 'UIW_ListItem_Stat_Simple_C_SetData::CallFunc_Conv_ColorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetData, K2Node_MakeStruct_SlateColor_3) == 0x0000C8, "Member 'UIW_ListItem_Stat_Simple_C_SetData::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");

// Function UIW_ListItem_Stat_Simple.UIW_ListItem_Stat_Simple_C.OnUpgradePreview
// 0x0002 (0x0002 - 0x0000)
struct UIW_ListItem_Stat_Simple_C_OnUpgradePreview final
{
public:
	ELFirstStat                                   FirstStat;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Stat_Simple_C_OnUpgradePreview) == 0x000001, "Wrong alignment on UIW_ListItem_Stat_Simple_C_OnUpgradePreview");
static_assert(sizeof(UIW_ListItem_Stat_Simple_C_OnUpgradePreview) == 0x000002, "Wrong size on UIW_ListItem_Stat_Simple_C_OnUpgradePreview");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_OnUpgradePreview, FirstStat) == 0x000000, "Member 'UIW_ListItem_Stat_Simple_C_OnUpgradePreview::FirstStat' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_OnUpgradePreview, CallFunc_Array_Contains_ReturnValue) == 0x000001, "Member 'UIW_ListItem_Stat_Simple_C_OnUpgradePreview::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");

// Function UIW_ListItem_Stat_Simple.UIW_ListItem_Stat_Simple_C.SetWeaponCorrection
// 0x00E8 (0x00E8 - 0x0000)
struct UIW_ListItem_Stat_Simple_C_SetWeaponCorrection final
{
public:
	class FText                                   Label;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	ELHandleCorrectResultGrade                    CurrentStat;                                       // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELHandleCorrectResultGrade                    NextStat;                                          // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDiff;                                            // 0x001A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIST_Color                            CallFunc_GetDataTableRowFromName_OutRow;           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetHandleCorrectionGradeText_Text;        // 0x0028(0x0018)()
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0058(0x0028)()
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetHandleCorrectionGradeText_Text_1;      // 0x0088(0x0018)()
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIST_Color                            CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_1;    // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x00C0(0x0028)()
};
static_assert(alignof(UIW_ListItem_Stat_Simple_C_SetWeaponCorrection) == 0x000008, "Wrong alignment on UIW_ListItem_Stat_Simple_C_SetWeaponCorrection");
static_assert(sizeof(UIW_ListItem_Stat_Simple_C_SetWeaponCorrection) == 0x0000E8, "Wrong size on UIW_ListItem_Stat_Simple_C_SetWeaponCorrection");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetWeaponCorrection, Label) == 0x000000, "Member 'UIW_ListItem_Stat_Simple_C_SetWeaponCorrection::Label' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetWeaponCorrection, CurrentStat) == 0x000018, "Member 'UIW_ListItem_Stat_Simple_C_SetWeaponCorrection::CurrentStat' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetWeaponCorrection, NextStat) == 0x000019, "Member 'UIW_ListItem_Stat_Simple_C_SetWeaponCorrection::NextStat' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetWeaponCorrection, IsDiff) == 0x00001A, "Member 'UIW_ListItem_Stat_Simple_C_SetWeaponCorrection::IsDiff' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetWeaponCorrection, CallFunc_GetDataTableRowFromName_OutRow) == 0x00001C, "Member 'UIW_ListItem_Stat_Simple_C_SetWeaponCorrection::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetWeaponCorrection, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000020, "Member 'UIW_ListItem_Stat_Simple_C_SetWeaponCorrection::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetWeaponCorrection, CallFunc_GetHandleCorrectionGradeText_Text) == 0x000028, "Member 'UIW_ListItem_Stat_Simple_C_SetWeaponCorrection::CallFunc_GetHandleCorrectionGradeText_Text' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetWeaponCorrection, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000040, "Member 'UIW_ListItem_Stat_Simple_C_SetWeaponCorrection::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetWeaponCorrection, K2Node_SwitchEnum_CmpSuccess) == 0x000050, "Member 'UIW_ListItem_Stat_Simple_C_SetWeaponCorrection::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetWeaponCorrection, K2Node_MakeStruct_SlateColor) == 0x000058, "Member 'UIW_ListItem_Stat_Simple_C_SetWeaponCorrection::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetWeaponCorrection, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000080, "Member 'UIW_ListItem_Stat_Simple_C_SetWeaponCorrection::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetWeaponCorrection, CallFunc_GetHandleCorrectionGradeText_Text_1) == 0x000088, "Member 'UIW_ListItem_Stat_Simple_C_SetWeaponCorrection::CallFunc_GetHandleCorrectionGradeText_Text_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetWeaponCorrection, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x0000A0, "Member 'UIW_ListItem_Stat_Simple_C_SetWeaponCorrection::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetWeaponCorrection, CallFunc_Greater_IntInt_ReturnValue) == 0x0000A4, "Member 'UIW_ListItem_Stat_Simple_C_SetWeaponCorrection::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetWeaponCorrection, CallFunc_Less_IntInt_ReturnValue) == 0x0000A5, "Member 'UIW_ListItem_Stat_Simple_C_SetWeaponCorrection::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetWeaponCorrection, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0000A8, "Member 'UIW_ListItem_Stat_Simple_C_SetWeaponCorrection::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetWeaponCorrection, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0000AC, "Member 'UIW_ListItem_Stat_Simple_C_SetWeaponCorrection::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetWeaponCorrection, CallFunc_Conv_ColorToLinearColor_ReturnValue_1) == 0x0000B0, "Member 'UIW_ListItem_Stat_Simple_C_SetWeaponCorrection::CallFunc_Conv_ColorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetWeaponCorrection, K2Node_MakeStruct_SlateColor_1) == 0x0000C0, "Member 'UIW_ListItem_Stat_Simple_C_SetWeaponCorrection::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function UIW_ListItem_Stat_Simple.UIW_ListItem_Stat_Simple_C.SetCorrection
// 0x0078 (0x0078 - 0x0000)
struct UIW_ListItem_Stat_Simple_C_SetCorrection final
{
public:
	class FText                                   Label;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	ELWeaponCorrectionPhysicalGrade               CurrentStat;                                       // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetWeaponCorrectionGrade_Text;            // 0x0040(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0060(0x0018)()
};
static_assert(alignof(UIW_ListItem_Stat_Simple_C_SetCorrection) == 0x000008, "Wrong alignment on UIW_ListItem_Stat_Simple_C_SetCorrection");
static_assert(sizeof(UIW_ListItem_Stat_Simple_C_SetCorrection) == 0x000078, "Wrong size on UIW_ListItem_Stat_Simple_C_SetCorrection");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetCorrection, Label) == 0x000000, "Member 'UIW_ListItem_Stat_Simple_C_SetCorrection::Label' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetCorrection, CurrentStat) == 0x000018, "Member 'UIW_ListItem_Stat_Simple_C_SetCorrection::CurrentStat' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Stat_Simple_C_SetCorrection, Temp_text_Variable) == 0x000020, "Member 'UIW_ListItem_Stat_Simple_C_SetCorrection::Temp_text_Variable' has a wrong offset!");
