#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Quartz

#include "Basic.hpp"

#include "UIST_PocketNavi_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ProjectP_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function UIW_Quartz.UIW_Quartz_C.ExecuteUbergraph_UIW_Quartz
// 0x0090 (0x0090 - 0x0000)
struct UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_1;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_2;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_AxisX;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_AxisY;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_AxisXY;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Angle;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_1;      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetMousePositionOnViewport_ReturnValue;   // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_2;      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_2;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_3;                  // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_4;                  // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         K2Node_ComponentBoundEvent_Delta;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUIW_Quartz_Pocket_C*>           K2Node_MakeArray_Array_1;                          // 0x0078(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz) == 0x000008, "Wrong alignment on UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz");
static_assert(sizeof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz) == 0x000090, "Wrong size on UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz");
static_assert(offsetof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz, EntryPoint) == 0x000000, "Member 'UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz, K2Node_ComponentBoundEvent_BtnKey_1) == 0x000008, "Member 'UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz::K2Node_ComponentBoundEvent_BtnKey_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz, K2Node_ComponentBoundEvent_BtnKey_2) == 0x000010, "Member 'UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz::K2Node_ComponentBoundEvent_BtnKey_2' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz, CallFunc_IsVisible_ReturnValue) == 0x000018, "Member 'UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz, K2Node_ComponentBoundEvent_BtnKey) == 0x000020, "Member 'UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz::K2Node_ComponentBoundEvent_BtnKey' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz, K2Node_ComponentBoundEvent_AxisX) == 0x000028, "Member 'UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz::K2Node_ComponentBoundEvent_AxisX' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz, K2Node_ComponentBoundEvent_AxisY) == 0x00002C, "Member 'UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz::K2Node_ComponentBoundEvent_AxisY' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz, K2Node_ComponentBoundEvent_AxisXY) == 0x000030, "Member 'UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz::K2Node_ComponentBoundEvent_AxisXY' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz, K2Node_ComponentBoundEvent_Angle) == 0x000034, "Member 'UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz::K2Node_ComponentBoundEvent_Angle' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000038, "Member 'UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz, CallFunc_EqualEqual_FloatFloat_ReturnValue_1) == 0x000039, "Member 'UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz::CallFunc_EqualEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz, CallFunc_GetMousePositionOnViewport_ReturnValue) == 0x00003C, "Member 'UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz::CallFunc_GetMousePositionOnViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz, CallFunc_K2_SetTimer_ReturnValue) == 0x000048, "Member 'UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000050, "Member 'UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz, CallFunc_EqualEqual_FloatFloat_ReturnValue_2) == 0x000059, "Member 'UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz::CallFunc_EqualEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz, CallFunc_BooleanAND_ReturnValue) == 0x00005A, "Member 'UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz, CallFunc_IsVisible_ReturnValue_1) == 0x00005B, "Member 'UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz, CallFunc_IsVisible_ReturnValue_2) == 0x00005C, "Member 'UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz::CallFunc_IsVisible_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz, CallFunc_IsVisible_ReturnValue_3) == 0x00005D, "Member 'UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz::CallFunc_IsVisible_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz, CallFunc_IsVisible_ReturnValue_4) == 0x00005E, "Member 'UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz::CallFunc_IsVisible_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz, CallFunc_IsValid_ReturnValue_1) == 0x00005F, "Member 'UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz, K2Node_MakeArray_Array) == 0x000060, "Member 'UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz, K2Node_ComponentBoundEvent_Delta) == 0x000070, "Member 'UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz::K2Node_ComponentBoundEvent_Delta' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000074, "Member 'UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz, K2Node_MakeArray_Array_1) == 0x000078, "Member 'UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz, CallFunc_IsValid_ReturnValue_2) == 0x000088, "Member 'UIW_Quartz_C_ExecuteUbergraph_UIW_Quartz::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function UIW_Quartz.UIW_Quartz_C.BndEvt__UIW_Quartz_Btn_Zoom_K2Node_ComponentBoundEvent_5_OnScroll__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_Quartz_C_BndEvt__UIW_Quartz_Btn_Zoom_K2Node_ComponentBoundEvent_5_OnScroll__DelegateSignature final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Quartz_C_BndEvt__UIW_Quartz_Btn_Zoom_K2Node_ComponentBoundEvent_5_OnScroll__DelegateSignature) == 0x000004, "Wrong alignment on UIW_Quartz_C_BndEvt__UIW_Quartz_Btn_Zoom_K2Node_ComponentBoundEvent_5_OnScroll__DelegateSignature");
static_assert(sizeof(UIW_Quartz_C_BndEvt__UIW_Quartz_Btn_Zoom_K2Node_ComponentBoundEvent_5_OnScroll__DelegateSignature) == 0x000004, "Wrong size on UIW_Quartz_C_BndEvt__UIW_Quartz_Btn_Zoom_K2Node_ComponentBoundEvent_5_OnScroll__DelegateSignature");
static_assert(offsetof(UIW_Quartz_C_BndEvt__UIW_Quartz_Btn_Zoom_K2Node_ComponentBoundEvent_5_OnScroll__DelegateSignature, Delta) == 0x000000, "Member 'UIW_Quartz_C_BndEvt__UIW_Quartz_Btn_Zoom_K2Node_ComponentBoundEvent_5_OnScroll__DelegateSignature::Delta' has a wrong offset!");

// Function UIW_Quartz.UIW_Quartz_C.BndEvt__Btn_Move_K2Node_ComponentBoundEvent_2_OnAxis__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UIW_Quartz_C_BndEvt__Btn_Move_K2Node_ComponentBoundEvent_2_OnAxis__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AxisX;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AxisY;                                             // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AxisXY;                                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Angle;                                             // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Quartz_C_BndEvt__Btn_Move_K2Node_ComponentBoundEvent_2_OnAxis__DelegateSignature) == 0x000008, "Wrong alignment on UIW_Quartz_C_BndEvt__Btn_Move_K2Node_ComponentBoundEvent_2_OnAxis__DelegateSignature");
static_assert(sizeof(UIW_Quartz_C_BndEvt__Btn_Move_K2Node_ComponentBoundEvent_2_OnAxis__DelegateSignature) == 0x000018, "Wrong size on UIW_Quartz_C_BndEvt__Btn_Move_K2Node_ComponentBoundEvent_2_OnAxis__DelegateSignature");
static_assert(offsetof(UIW_Quartz_C_BndEvt__Btn_Move_K2Node_ComponentBoundEvent_2_OnAxis__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_Quartz_C_BndEvt__Btn_Move_K2Node_ComponentBoundEvent_2_OnAxis__DelegateSignature::BtnKey' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_BndEvt__Btn_Move_K2Node_ComponentBoundEvent_2_OnAxis__DelegateSignature, AxisX) == 0x000008, "Member 'UIW_Quartz_C_BndEvt__Btn_Move_K2Node_ComponentBoundEvent_2_OnAxis__DelegateSignature::AxisX' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_BndEvt__Btn_Move_K2Node_ComponentBoundEvent_2_OnAxis__DelegateSignature, AxisY) == 0x00000C, "Member 'UIW_Quartz_C_BndEvt__Btn_Move_K2Node_ComponentBoundEvent_2_OnAxis__DelegateSignature::AxisY' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_BndEvt__Btn_Move_K2Node_ComponentBoundEvent_2_OnAxis__DelegateSignature, AxisXY) == 0x000010, "Member 'UIW_Quartz_C_BndEvt__Btn_Move_K2Node_ComponentBoundEvent_2_OnAxis__DelegateSignature::AxisXY' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_BndEvt__Btn_Move_K2Node_ComponentBoundEvent_2_OnAxis__DelegateSignature, Angle) == 0x000014, "Member 'UIW_Quartz_C_BndEvt__Btn_Move_K2Node_ComponentBoundEvent_2_OnAxis__DelegateSignature::Angle' has a wrong offset!");

// Function UIW_Quartz.UIW_Quartz_C.BndEvt__Btn_Select_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Quartz_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Quartz_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_Quartz_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature");
static_assert(sizeof(UIW_Quartz_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_Quartz_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature");
static_assert(offsetof(UIW_Quartz_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_Quartz_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_Quartz.UIW_Quartz_C.BndEvt__Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Quartz_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Quartz_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_Quartz_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature");
static_assert(sizeof(UIW_Quartz_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_Quartz_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature");
static_assert(offsetof(UIW_Quartz_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_Quartz_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_Quartz.UIW_Quartz_C.RefreshQuartzCount
// 0x0028 (0x0028 - 0x0000)
struct UIW_Quartz_C_RefreshQuartzCount final
{
public:
	class ULQuartzSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetQuartzItemCount_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
};
static_assert(alignof(UIW_Quartz_C_RefreshQuartzCount) == 0x000008, "Wrong alignment on UIW_Quartz_C_RefreshQuartzCount");
static_assert(sizeof(UIW_Quartz_C_RefreshQuartzCount) == 0x000028, "Wrong size on UIW_Quartz_C_RefreshQuartzCount");
static_assert(offsetof(UIW_Quartz_C_RefreshQuartzCount, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'UIW_Quartz_C_RefreshQuartzCount::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshQuartzCount, CallFunc_GetQuartzItemCount_ReturnValue) == 0x000008, "Member 'UIW_Quartz_C_RefreshQuartzCount::CallFunc_GetQuartzItemCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshQuartzCount, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'UIW_Quartz_C_RefreshQuartzCount::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function UIW_Quartz.UIW_Quartz_C.RefreshPocketData
// 0x00A8 (0x00A8 - 0x0000)
struct UIW_Quartz_C_RefreshPocketData final
{
public:
	bool                                          NowInstalled;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InstallSlotIndex;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalStep;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULQuartzSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULQuartzSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxLevelLimit_ReturnValue;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxLevelLimit_ReturnValue_1;           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_2;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_3;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULQuartzSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxLevelLimit_ReturnValue_2;           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULQuartzSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaxLevelLimit_ReturnValue_3;           // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_4;                  // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_5;                  // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_6;                  // 0x006F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_7;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_8;                  // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_9;                  // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_10;                 // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_11;                 // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0078(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Quartz_Pocket_C*                   CallFunc_Map_Find_Value;                           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Quartz_C_RefreshPocketData) == 0x000008, "Wrong alignment on UIW_Quartz_C_RefreshPocketData");
static_assert(sizeof(UIW_Quartz_C_RefreshPocketData) == 0x0000A8, "Wrong size on UIW_Quartz_C_RefreshPocketData");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, NowInstalled) == 0x000000, "Member 'UIW_Quartz_C_RefreshPocketData::NowInstalled' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, InstallSlotIndex) == 0x000004, "Member 'UIW_Quartz_C_RefreshPocketData::InstallSlotIndex' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, LocalStep) == 0x000008, "Member 'UIW_Quartz_C_RefreshPocketData::LocalStep' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'UIW_Quartz_C_RefreshPocketData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'UIW_Quartz_C_RefreshPocketData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000020, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_GetMaxLevelLimit_ReturnValue) == 0x000028, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_GetMaxLevelLimit_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_GetMaxLevelLimit_ReturnValue_1) == 0x00002C, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_GetMaxLevelLimit_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_Greater_IntInt_ReturnValue) == 0x000030, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000031, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, Temp_int_Variable) == 0x000034, "Member 'UIW_Quartz_C_RefreshPocketData::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, Temp_int_Variable_1) == 0x000038, "Member 'UIW_Quartz_C_RefreshPocketData::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, K2Node_SwitchInteger_CmpSuccess) == 0x00003C, "Member 'UIW_Quartz_C_RefreshPocketData::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, Temp_bool_Variable) == 0x00003D, "Member 'UIW_Quartz_C_RefreshPocketData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_IsVisible_ReturnValue) == 0x00003E, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_IsVisible_ReturnValue_1) == 0x00003F, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_IsVisible_ReturnValue_2) == 0x000040, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_IsVisible_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_IsVisible_ReturnValue_3) == 0x000041, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_IsVisible_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000048, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_GetMaxLevelLimit_ReturnValue_2) == 0x000050, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_GetMaxLevelLimit_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_Add_IntInt_ReturnValue_1) == 0x000054, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000058, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000060, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_GetMaxLevelLimit_ReturnValue_3) == 0x000068, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_GetMaxLevelLimit_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_Greater_IntInt_ReturnValue_3) == 0x00006C, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_IsVisible_ReturnValue_4) == 0x00006D, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_IsVisible_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_IsVisible_ReturnValue_5) == 0x00006E, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_IsVisible_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_IsVisible_ReturnValue_6) == 0x00006F, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_IsVisible_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_IsVisible_ReturnValue_7) == 0x000070, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_IsVisible_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_IsVisible_ReturnValue_8) == 0x000071, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_IsVisible_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_IsVisible_ReturnValue_9) == 0x000072, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_IsVisible_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_IsVisible_ReturnValue_10) == 0x000073, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_IsVisible_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_IsVisible_ReturnValue_11) == 0x000074, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_IsVisible_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_Map_Keys_Keys) == 0x000078, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_Array_Get_Item) == 0x00008C, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_Less_IntInt_ReturnValue) == 0x000094, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_Map_Find_Value) == 0x000098, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_Map_Find_ReturnValue) == 0x0000A0, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000A1, "Member 'UIW_Quartz_C_RefreshPocketData::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshPocketData, K2Node_Select_Default) == 0x0000A4, "Member 'UIW_Quartz_C_RefreshPocketData::K2Node_Select_Default' has a wrong offset!");

// Function UIW_Quartz.UIW_Quartz_C.RefreshRightData
// 0x0190 (0x0190 - 0x0000)
struct UIW_Quartz_C_RefreshRightData final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULQuartzSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEnabledCoreLevel_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0040(0x0018)()
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Quartz_Slot_C*                     CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Quartz_Listbar_C*                  CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOverlappingSynergy_ReturnValue;  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetSpecialBuffLocalText_OutName;          // 0x0090(0x0018)()
	class FText                                   CallFunc_GetSpecialBuffLocalText_OutTooltip;       // 0x00A8(0x0018)()
	class FText                                   CallFunc_GetSynergyNameWithNumber_ReturnValue;     // 0x00C0(0x0018)()
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue_1;              // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPocketLevel_ReturnValue;               // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPocketLevel_ReturnValue_1;             // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x0110(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0128(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0168(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0178(0x0018)()
};
static_assert(alignof(UIW_Quartz_C_RefreshRightData) == 0x000008, "Wrong alignment on UIW_Quartz_C_RefreshRightData");
static_assert(sizeof(UIW_Quartz_C_RefreshRightData) == 0x000190, "Wrong size on UIW_Quartz_C_RefreshRightData");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'UIW_Quartz_C_RefreshRightData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, Temp_int_Array_Index_Variable) == 0x000008, "Member 'UIW_Quartz_C_RefreshRightData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, Temp_int_Loop_Counter_Variable_1) == 0x00000C, "Member 'UIW_Quartz_C_RefreshRightData::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000020, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_PlayAnimation_ReturnValue_1) == 0x000028, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_GetEnabledCoreLevel_ReturnValue) == 0x000038, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_GetEnabledCoreLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_GetGameStrWithName_ReturnValue) == 0x000040, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, Temp_int_Array_Index_Variable_1) == 0x000058, "Member 'UIW_Quartz_C_RefreshRightData::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_Array_Get_Item) == 0x000060, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_Array_Length_ReturnValue_1) == 0x000078, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_Less_IntInt_ReturnValue_1) == 0x00007C, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_Array_Length_ReturnValue_2) == 0x000080, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_Less_IntInt_ReturnValue_2) == 0x000084, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_GetNumberOverlappingSynergy_ReturnValue) == 0x000088, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_GetNumberOverlappingSynergy_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_Conv_BoolToInt_ReturnValue) == 0x00008C, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_GetSpecialBuffLocalText_OutName) == 0x000090, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_GetSpecialBuffLocalText_OutName' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_GetSpecialBuffLocalText_OutTooltip) == 0x0000A8, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_GetSpecialBuffLocalText_OutTooltip' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_GetSynergyNameWithNumber_ReturnValue) == 0x0000C0, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_GetSynergyNameWithNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_GetVisibility_ReturnValue) == 0x0000D8, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_IsValid_ReturnValue) == 0x0000D9, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000DA, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_GetVisibility_ReturnValue_1) == 0x0000DB, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_GetVisibility_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_GetPocketLevel_ReturnValue) == 0x0000DC, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_GetPocketLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000E0, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_Less_IntInt_ReturnValue_3) == 0x0000E1, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_GetPocketLevel_ReturnValue_1) == 0x0000E4, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_GetPocketLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_Conv_IntToString_ReturnValue) == 0x0000E8, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_Concat_StrStr_ReturnValue) == 0x0000F8, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_Conv_StringToName_ReturnValue) == 0x000108, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_GetGameStrWithName_ReturnValue_1) == 0x000110, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_GetGameStrWithName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, K2Node_MakeStruct_FormatArgumentData) == 0x000128, "Member 'UIW_Quartz_C_RefreshRightData::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, K2Node_MakeArray_Array) == 0x000168, "Member 'UIW_Quartz_C_RefreshRightData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_C_RefreshRightData, CallFunc_Format_ReturnValue) == 0x000178, "Member 'UIW_Quartz_C_RefreshRightData::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function UIW_Quartz.UIW_Quartz_C.SetFocusedPocket
// 0x00E8 (0x00E8 - 0x0000)
struct UIW_Quartz_C_SetFocusedPocket final
{
public:
	class UUIW_Quartz_Pocket_C*                   Pocket;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WithTween;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ForceUpdate;                                       // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             LocalTexutre;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase;                       // 0x0018(0x000C)(NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULQuartzSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEnabledCoreLevel_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Quartz_Pocket_C*                   CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPocketLevel_ReturnValue;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 CallFunc_GetImage_ReturnValue;                     // 0x0058(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_83[0x1];                                       // 0x0083(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue_1;           // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
