#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HotelArena

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_HotelArena.UIW_HotelArena_C
// 0x00B8 (0x0360 - 0x02A8)
class UUIW_HotelArena_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Construct;                                     // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUIW_ListItem_Stat_Normal_C*            Frenzy_B;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_ListItem_Stat_Normal_C*            Frenzy_H;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Group_Attack;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                      Group_Correction;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Group_Frenzy_Blade;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Group_Frenzy_Handle;                               // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Group_Motion;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_ListItem_Stat_Simple_C*            Item_Advance;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_ListItem_Stat_Simple_C*            Item_Motivity;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_ListItem_Stat_Simple_C*            Item_Technique;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_ListItem_Stat_Simple_C*            Motion_Swing;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_ListItem_Stat_Simple_C*            Motion_Thrust;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           ShowHideCanvas;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_SubTitle_C*                        SubTitle_Attack;                                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_SubTitle_C*                        SubTitle_Frenzy_B;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_SubTitle_C*                        SubTitle_Frenzy_H;                                 // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_SubTitle_C*                        SubTitle_Motion;                                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIBP_LRichKeyTextBlock_C*              Text_FrenzyTooltip_B;                              // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIBP_LRichKeyTextBlock_C*              Text_FrenzyTooltip_H;                              // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ItemLabel;                                    // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsShow;                                            // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UIW_HotelArena(int32 EntryPoint);
	void Destruct();
	void WidgetAnimationEvt_Ani_Construct_K2Node_WidgetAnimationEvent_0();
	void Construct();
	void ShowAndHide(bool ShowOrHide);
	void OnChangeEquipItem(ELEquipSlotType EquipSlot, class ULItem* OldItem, class ULItem* NewItem);
	void OnChooseWeapon(const struct FLEquipItemSlot& EquipSlot);
	void Refresh_Frenzy(class FName FrenzySkillCodeName, const class FText& ItemName, class UWidget* GroupWidget, class UUIW_SubTitle_C* SubTitleFrenzy, class UUIW_ListItem_Stat_Normal_C* FrenzyWidget, class UUIBP_LRichKeyTextBlock_C* Tooltip);
	void SetCurrentEquip(bool* IsValid);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_HotelArena_C">();
	}
	static class UUIW_HotelArena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_HotelArena_C>();
	}
};
static_assert(alignof(UUIW_HotelArena_C) == 0x000008, "Wrong alignment on UUIW_HotelArena_C");
static_assert(sizeof(UUIW_HotelArena_C) == 0x000360, "Wrong size on UUIW_HotelArena_C");
static_assert(offsetof(UUIW_HotelArena_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_HotelArena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_HotelArena_C, Ani_Construct) == 0x0002B0, "Member 'UUIW_HotelArena_C::Ani_Construct' has a wrong offset!");
static_assert(offsetof(UUIW_HotelArena_C, Frenzy_B) == 0x0002B8, "Member 'UUIW_HotelArena_C::Frenzy_B' has a wrong offset!");
static_assert(offsetof(UUIW_HotelArena_C, Frenzy_H) == 0x0002C0, "Member 'UUIW_HotelArena_C::Frenzy_H' has a wrong offset!");
static_assert(offsetof(UUIW_HotelArena_C, Group_Attack) == 0x0002C8, "Member 'UUIW_HotelArena_C::Group_Attack' has a wrong offset!");
static_assert(offsetof(UUIW_HotelArena_C, Group_Correction) == 0x0002D0, "Member 'UUIW_HotelArena_C::Group_Correction' has a wrong offset!");
static_assert(offsetof(UUIW_HotelArena_C, Group_Frenzy_Blade) == 0x0002D8, "Member 'UUIW_HotelArena_C::Group_Frenzy_Blade' has a wrong offset!");
static_assert(offsetof(UUIW_HotelArena_C, Group_Frenzy_Handle) == 0x0002E0, "Member 'UUIW_HotelArena_C::Group_Frenzy_Handle' has a wrong offset!");
static_assert(offsetof(UUIW_HotelArena_C, Group_Motion) == 0x0002E8, "Member 'UUIW_HotelArena_C::Group_Motion' has a wrong offset!");
static_assert(offsetof(UUIW_HotelArena_C, Item_Advance) == 0x0002F0, "Member 'UUIW_HotelArena_C::Item_Advance' has a wrong offset!");
static_assert(offsetof(UUIW_HotelArena_C, Item_Motivity) == 0x0002F8, "Member 'UUIW_HotelArena_C::Item_Motivity' has a wrong offset!");
static_assert(offsetof(UUIW_HotelArena_C, Item_Technique) == 0x000300, "Member 'UUIW_HotelArena_C::Item_Technique' has a wrong offset!");
static_assert(offsetof(UUIW_HotelArena_C, Motion_Swing) == 0x000308, "Member 'UUIW_HotelArena_C::Motion_Swing' has a wrong offset!");
static_assert(offsetof(UUIW_HotelArena_C, Motion_Thrust) == 0x000310, "Member 'UUIW_HotelArena_C::Motion_Thrust' has a wrong offset!");
static_assert(offsetof(UUIW_HotelArena_C, ShowHideCanvas) == 0x000318, "Member 'UUIW_HotelArena_C::ShowHideCanvas' has a wrong offset!");
static_assert(offsetof(UUIW_HotelArena_C, SubTitle_Attack) == 0x000320, "Member 'UUIW_HotelArena_C::SubTitle_Attack' has a wrong offset!");
static_assert(offsetof(UUIW_HotelArena_C, SubTitle_Frenzy_B) == 0x000328, "Member 'UUIW_HotelArena_C::SubTitle_Frenzy_B' has a wrong offset!");
static_assert(offsetof(UUIW_HotelArena_C, SubTitle_Frenzy_H) == 0x000330, "Member 'UUIW_HotelArena_C::SubTitle_Frenzy_H' has a wrong offset!");
static_assert(offsetof(UUIW_HotelArena_C, SubTitle_Motion) == 0x000338, "Member 'UUIW_HotelArena_C::SubTitle_Motion' has a wrong offset!");
static_assert(offsetof(UUIW_HotelArena_C, Text_FrenzyTooltip_B) == 0x000340, "Member 'UUIW_HotelArena_C::Text_FrenzyTooltip_B' has a wrong offset!");
static_assert(offsetof(UUIW_HotelArena_C, Text_FrenzyTooltip_H) == 0x000348, "Member 'UUIW_HotelArena_C::Text_FrenzyTooltip_H' has a wrong offset!");
static_assert(offsetof(UUIW_HotelArena_C, Text_ItemLabel) == 0x000350, "Member 'UUIW_HotelArena_C::Text_ItemLabel' has a wrong offset!");
static_assert(offsetof(UUIW_HotelArena_C, IsShow) == 0x000358, "Member 'UUIW_HotelArena_C::IsShow' has a wrong offset!");

}

