#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Quartz_Line_Group

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Quartz_Line_Group.UIW_Quartz_Line_Group_C
// 0x0028 (0x0290 - 0x0268)
class UUIW_Quartz_Line_Group_C final : public UUserWidget
{
public:
	class UImage*                                 Img_Line_Bot;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Line_Circle;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Line_Left;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Line_Right;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Line_Top;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Quartz_Line_Group_C">();
	}
	static class UUIW_Quartz_Line_Group_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Quartz_Line_Group_C>();
	}
};
static_assert(alignof(UUIW_Quartz_Line_Group_C) == 0x000008, "Wrong alignment on UUIW_Quartz_Line_Group_C");
static_assert(sizeof(UUIW_Quartz_Line_Group_C) == 0x000290, "Wrong size on UUIW_Quartz_Line_Group_C");
static_assert(offsetof(UUIW_Quartz_Line_Group_C, Img_Line_Bot) == 0x000268, "Member 'UUIW_Quartz_Line_Group_C::Img_Line_Bot' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Line_Group_C, Img_Line_Circle) == 0x000270, "Member 'UUIW_Quartz_Line_Group_C::Img_Line_Circle' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Line_Group_C, Img_Line_Left) == 0x000278, "Member 'UUIW_Quartz_Line_Group_C::Img_Line_Left' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Line_Group_C, Img_Line_Right) == 0x000280, "Member 'UUIW_Quartz_Line_Group_C::Img_Line_Right' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Line_Group_C, Img_Line_Top) == 0x000288, "Member 'UUIW_Quartz_Line_Group_C::Img_Line_Top' has a wrong offset!");

}

