#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_SlaveArm_Reinforce

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UIW_Window_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_SlaveArm_Reinforce.UIW_SlaveArm_Reinforce_C
// 0x0178 (0x04C8 - 0x0350)
class UUIW_SlaveArm_Reinforce_C final : public UUIW_Window_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UIW_SlaveArm_Reinforce_C;           // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUIW_BG_Tab_C*                          BG_Tab;                                            // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_BG_Window_C*                       BG_Window;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Back;                                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Tab_LeftKey;                                   // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Tab_RightKey;                                  // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Upgrade;                                       // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Deco_Line_1;                                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Group_Complete;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Item;                                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_movie;                                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_SlaveArm_ReinforceLine_C*          Line_0;                                            // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_SlaveArm_ReinforceLine_C*          Line_1;                                            // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_SlaveArm_ReinforceLine_C*          Line_2;                                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULListView*                             List_Tab;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_ListItem_SlaveArm_ReinforceInfo_C* ListItem_0;                                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_ListItem_SlaveArm_ReinforceInfo_C* ListItem_1;                                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_ListItem_SlaveArm_ReinforceInfo_C* ListItem_2;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_ListItem_SlaveArm_ReinforceInfo_C* ListItem_3;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MaterialItem;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Prerequisite;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Right;                                             // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_SlaveArm_ReinforceSlot_C*          Slot_0;                                            // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_SlaveArm_ReinforceSlot_C*          Slot_1;                                            // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_SlaveArm_ReinforceSlot_C*          Slot_2;                                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_SlaveArm_ReinforceSlot_C*          Slot_3;                                            // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Complete;                                     // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Complete_1;                                   // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Has;                                          // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Info;                                         // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ItemName;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Prerequisite;                                 // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Require;                                      // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Skill_Info;                                   // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Skill_Name;                                   // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_SubTitle_0;                                   // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Tree;                                              // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULSlaveArmPage*                         CurrentPage;                                       // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_ListItem_SlaveArm_ReinforceInfo_C* CurrentSlot;                                       // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULSlaveArmTree*                         CurrentSlotData;                                   // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUIW_SlaveArm_ReinforceSlot_C*>  SlotList;                                          // 0x0490(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UUIW_ListItem_SlaveArm_ReinforceInfo_C*> ListItem;                                          // 0x04A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class ULSlaveArmTree*>                 SlaveArmTree;                                      // 0x04B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UBinkMediaPlayer*                       BinkPlayer;                                        // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_SlaveArm_Reinforce(int32 EntryPoint);
	void Destruct();
	void BndEvt__UIW_SlaveArm_Btn_Upgrade_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature(class UUIW_Btn_Key_C* BtnKey);
	void BndEvt__UIW_SlaveArm_Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature(class UUIW_Btn_Key_C* BtnKey);
	void Construct();
	void OnReady();
	void MoveLeftTab(class UUIW_Btn_Key_C* BtnKey);
	void MoveRightTab(class UUIW_Btn_Key_C* BtnKey);
	void ChangeTab(class UObject* Item, bool bIsSelected);
	void RefreshTab();
	void RefreshTree();
	void OnFocusedSlot(class UUIW_ListItem_SlaveArm_ReinforceInfo_C* Slot_0);
	void OnDoubleClickSlot();
	void CallbackUpgrade(class UUIW_Popup_C* Popup, class UUIW_Btn_Key_C* BtnKey);
	struct FEventReply FocusManage(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void RefreshResource(const struct FSlaveArmTreeInfoPtr& Info);
	void SelectTabResetArm(class FName ArmCodeName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_SlaveArm_Reinforce_C">();
	}
	static class UUIW_SlaveArm_Reinforce_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_SlaveArm_Reinforce_C>();
	}
};
static_assert(alignof(UUIW_SlaveArm_Reinforce_C) == 0x000008, "Wrong alignment on UUIW_SlaveArm_Reinforce_C");
static_assert(sizeof(UUIW_SlaveArm_Reinforce_C) == 0x0004C8, "Wrong size on UUIW_SlaveArm_Reinforce_C");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, UberGraphFrame_UIW_SlaveArm_Reinforce_C) == 0x000350, "Member 'UUIW_SlaveArm_Reinforce_C::UberGraphFrame_UIW_SlaveArm_Reinforce_C' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, BG_Tab) == 0x000358, "Member 'UUIW_SlaveArm_Reinforce_C::BG_Tab' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, BG_Window) == 0x000360, "Member 'UUIW_SlaveArm_Reinforce_C::BG_Window' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Btn_Back) == 0x000368, "Member 'UUIW_SlaveArm_Reinforce_C::Btn_Back' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Btn_Tab_LeftKey) == 0x000370, "Member 'UUIW_SlaveArm_Reinforce_C::Btn_Tab_LeftKey' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Btn_Tab_RightKey) == 0x000378, "Member 'UUIW_SlaveArm_Reinforce_C::Btn_Tab_RightKey' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Btn_Upgrade) == 0x000380, "Member 'UUIW_SlaveArm_Reinforce_C::Btn_Upgrade' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Deco_Line_1) == 0x000388, "Member 'UUIW_SlaveArm_Reinforce_C::Deco_Line_1' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Group_Complete) == 0x000390, "Member 'UUIW_SlaveArm_Reinforce_C::Group_Complete' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Img_Item) == 0x000398, "Member 'UUIW_SlaveArm_Reinforce_C::Img_Item' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Img_movie) == 0x0003A0, "Member 'UUIW_SlaveArm_Reinforce_C::Img_movie' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Line_0) == 0x0003A8, "Member 'UUIW_SlaveArm_Reinforce_C::Line_0' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Line_1) == 0x0003B0, "Member 'UUIW_SlaveArm_Reinforce_C::Line_1' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Line_2) == 0x0003B8, "Member 'UUIW_SlaveArm_Reinforce_C::Line_2' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, List_Tab) == 0x0003C0, "Member 'UUIW_SlaveArm_Reinforce_C::List_Tab' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, ListItem_0) == 0x0003C8, "Member 'UUIW_SlaveArm_Reinforce_C::ListItem_0' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, ListItem_1) == 0x0003D0, "Member 'UUIW_SlaveArm_Reinforce_C::ListItem_1' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, ListItem_2) == 0x0003D8, "Member 'UUIW_SlaveArm_Reinforce_C::ListItem_2' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, ListItem_3) == 0x0003E0, "Member 'UUIW_SlaveArm_Reinforce_C::ListItem_3' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, MaterialItem) == 0x0003E8, "Member 'UUIW_SlaveArm_Reinforce_C::MaterialItem' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Prerequisite) == 0x0003F0, "Member 'UUIW_SlaveArm_Reinforce_C::Prerequisite' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Right) == 0x0003F8, "Member 'UUIW_SlaveArm_Reinforce_C::Right' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Slot_0) == 0x000400, "Member 'UUIW_SlaveArm_Reinforce_C::Slot_0' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Slot_1) == 0x000408, "Member 'UUIW_SlaveArm_Reinforce_C::Slot_1' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Slot_2) == 0x000410, "Member 'UUIW_SlaveArm_Reinforce_C::Slot_2' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Slot_3) == 0x000418, "Member 'UUIW_SlaveArm_Reinforce_C::Slot_3' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Text_Complete) == 0x000420, "Member 'UUIW_SlaveArm_Reinforce_C::Text_Complete' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Text_Complete_1) == 0x000428, "Member 'UUIW_SlaveArm_Reinforce_C::Text_Complete_1' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Text_Has) == 0x000430, "Member 'UUIW_SlaveArm_Reinforce_C::Text_Has' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Text_Info) == 0x000438, "Member 'UUIW_SlaveArm_Reinforce_C::Text_Info' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Text_ItemName) == 0x000440, "Member 'UUIW_SlaveArm_Reinforce_C::Text_ItemName' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Text_Prerequisite) == 0x000448, "Member 'UUIW_SlaveArm_Reinforce_C::Text_Prerequisite' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Text_Require) == 0x000450, "Member 'UUIW_SlaveArm_Reinforce_C::Text_Require' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Text_Skill_Info) == 0x000458, "Member 'UUIW_SlaveArm_Reinforce_C::Text_Skill_Info' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Text_Skill_Name) == 0x000460, "Member 'UUIW_SlaveArm_Reinforce_C::Text_Skill_Name' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Text_SubTitle_0) == 0x000468, "Member 'UUIW_SlaveArm_Reinforce_C::Text_SubTitle_0' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, Tree) == 0x000470, "Member 'UUIW_SlaveArm_Reinforce_C::Tree' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, CurrentPage) == 0x000478, "Member 'UUIW_SlaveArm_Reinforce_C::CurrentPage' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, CurrentSlot) == 0x000480, "Member 'UUIW_SlaveArm_Reinforce_C::CurrentSlot' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, CurrentSlotData) == 0x000488, "Member 'UUIW_SlaveArm_Reinforce_C::CurrentSlotData' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, SlotList) == 0x000490, "Member 'UUIW_SlaveArm_Reinforce_C::SlotList' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, ListItem) == 0x0004A0, "Member 'UUIW_SlaveArm_Reinforce_C::ListItem' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, SlaveArmTree) == 0x0004B0, "Member 'UUIW_SlaveArm_Reinforce_C::SlaveArmTree' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_Reinforce_C, BinkPlayer) == 0x0004C0, "Member 'UUIW_SlaveArm_Reinforce_C::BinkPlayer' has a wrong offset!");

}

