#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_NPCDialog

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"
#include "UIST_Sound_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "ProjectP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UIW_NPCDialog.UIW_NPCDialog_C.OnSelectedLie__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_NPCDialog_C_OnSelectedLie__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_NPCDialog_C_OnSelectedLie__DelegateSignature) == 0x000004, "Wrong alignment on UIW_NPCDialog_C_OnSelectedLie__DelegateSignature");
static_assert(sizeof(UIW_NPCDialog_C_OnSelectedLie__DelegateSignature) == 0x000004, "Wrong size on UIW_NPCDialog_C_OnSelectedLie__DelegateSignature");
static_assert(offsetof(UIW_NPCDialog_C_OnSelectedLie__DelegateSignature, Index_0) == 0x000000, "Member 'UIW_NPCDialog_C_OnSelectedLie__DelegateSignature::Index_0' has a wrong offset!");

// Function UIW_NPCDialog.UIW_NPCDialog_C.ExecuteUbergraph_UIW_NPCDialog
// 0x02F8 (0x02F8 - 0x0000)
struct UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnyAnimationPlaying_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue_1;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULSoundSystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnyAnimationPlaying_ReturnValue_1;      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnyAnimationPlaying_ReturnValue_2;      // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37[0x1];                                       // 0x0037(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget_2;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUIW_Popup_C* Popup, class UUIW_Btn_Key_C* BtnKey)> K2Node_CreateDelegate_OutputDelegate;              // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetIsEnabled_ReturnValue_2;               // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULInteractSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_3;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_2;               // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULInteractSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget_3;               // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULOptionSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCodeName_ReturnValue;                  // 0x0098(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMoveSpeedStep_ReturnValue;             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMoveSpeedStep_ReturnValue_1;           // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_1;               // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x00C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULInteractSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EB[0x5];                                       // 0x00EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ULInteractSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELLieType                                     CallFunc_GetLieType_ReturnValue;                   // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey;                 // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_AxisX;                  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_AxisY;                  // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_AxisXY;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Angle;                  // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x0138(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetMousePositionOnViewport_ReturnValue;   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue_1;         // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_Index_7;                // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0160(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         K2Node_ComponentBoundEvent_Index_6;                // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index_5;                // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index_4;                // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_2;                // 0x0180(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index_3;                // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index_2;                // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index_1;                // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_1;               // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIST_Sound                            CallFunc_GetDataTableRowFromName_OutRow;           // 0x01C8(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base;                   // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_2;               // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue_3;               // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget_4;               // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget_5;               // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGiveUpHeart_IsGiveUp;                   // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_IsGiveUpHeart_GiveUpText;                 // 0x0250(0x0018)()
	class UUIW_Popup_C*                           CallFunc_AddPopupWidget_Widget;                    // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Popup_C*                           K2Node_CustomEvent_Popup;                          // 0x0270(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_CustomEvent_BtnKey;                         // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULInteractSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_6;   // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLDialogExecute                        CallFunc_Execute_ReturnValue;                      // 0x028C(0x0010)(NoDestructor)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_AddWidget_Widget;                         // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget_6;               // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULInteractSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_7;   // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x02C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x02C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x02E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog) == 0x000008, "Wrong alignment on UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog");
static_assert(sizeof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog) == 0x0002F8, "Wrong size on UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, EntryPoint) == 0x000000, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetIsEnabled_ReturnValue) == 0x000004, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetMainWidget_MainWidget) == 0x000008, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_IsAnyAnimationPlaying_ReturnValue) == 0x000010, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_IsAnyAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetMainWidget_MainWidget_1) == 0x000018, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetMainWidget_MainWidget_1' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetIsEnabled_ReturnValue_1) == 0x000020, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetIsEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000028, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_BooleanAND_ReturnValue) == 0x000030, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_BooleanAND_ReturnValue_1) == 0x000031, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_IsAnyAnimationPlaying_ReturnValue_1) == 0x000032, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_IsAnyAnimationPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_IsAnyAnimationPlaying_ReturnValue_2) == 0x000033, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_IsAnyAnimationPlaying_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_Not_PreBool_ReturnValue_1) == 0x000034, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_Not_PreBool_ReturnValue_2) == 0x000035, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_BooleanAND_ReturnValue_2) == 0x000036, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetMainWidget_MainWidget_2) == 0x000038, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetMainWidget_MainWidget_2' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_BooleanAND_ReturnValue_3) == 0x000040, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_BooleanAND_ReturnValue_4) == 0x000041, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetIsEnabled_ReturnValue_2) == 0x000054, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetIsEnabled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000058, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_BooleanAND_ReturnValue_5) == 0x000060, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_Not_PreBool_ReturnValue_3) == 0x000061, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_BooleanAND_ReturnValue_6) == 0x000062, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, K2Node_ComponentBoundEvent_BtnKey_3) == 0x000068, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::K2Node_ComponentBoundEvent_BtnKey_3' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, K2Node_ComponentBoundEvent_BtnKey_2) == 0x000070, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::K2Node_ComponentBoundEvent_BtnKey_2' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000080, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetMainWidget_MainWidget_3) == 0x000088, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetMainWidget_MainWidget_3' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000090, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetCodeName_ReturnValue) == 0x000098, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetMoveSpeedStep_ReturnValue) == 0x0000A0, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetMoveSpeedStep_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000A4, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetMoveSpeedStep_ReturnValue_1) == 0x0000A8, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetMoveSpeedStep_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetPlayerController_ReturnValue) == 0x0000B0, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_IsValid_ReturnValue_1) == 0x0000B8, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, K2Node_ComponentBoundEvent_BtnKey_1) == 0x0000C0, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::K2Node_ComponentBoundEvent_BtnKey_1' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_K2_SetTimer_ReturnValue) == 0x0000C8, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_IsValid_ReturnValue_2) == 0x0000D0, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_IsValid_ReturnValue_3) == 0x0000D1, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_PlayAnimation_ReturnValue) == 0x0000D8, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x0000E0, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_IsValid_ReturnValue_4) == 0x0000E8, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_Not_PreBool_ReturnValue_4) == 0x0000E9, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_BooleanAND_ReturnValue_7) == 0x0000EA, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x0000F0, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetLieType_ReturnValue) == 0x0000F8, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetLieType_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, K2Node_SwitchEnum_CmpSuccess) == 0x0000F9, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, K2Node_ComponentBoundEvent_BtnKey) == 0x000100, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::K2Node_ComponentBoundEvent_BtnKey' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, K2Node_ComponentBoundEvent_AxisX) == 0x000108, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::K2Node_ComponentBoundEvent_AxisX' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, K2Node_ComponentBoundEvent_AxisY) == 0x00010C, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::K2Node_ComponentBoundEvent_AxisY' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, K2Node_ComponentBoundEvent_AxisXY) == 0x000110, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::K2Node_ComponentBoundEvent_AxisXY' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, K2Node_ComponentBoundEvent_Angle) == 0x000114, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::K2Node_ComponentBoundEvent_Angle' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetPlayerController_ReturnValue_1) == 0x000118, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetControlRotation_ReturnValue) == 0x000120, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_BreakRotator_Roll) == 0x00012C, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_BreakRotator_Pitch) == 0x000130, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_BreakRotator_Yaw) == 0x000134, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_K2_SetTimer_ReturnValue_1) == 0x000138, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_K2_SetTimer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetMousePositionOnViewport_ReturnValue) == 0x000140, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetMousePositionOnViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetPlayerController_ReturnValue_2) == 0x000148, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetControlRotation_ReturnValue_1) == 0x000150, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetControlRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, K2Node_ComponentBoundEvent_Index_7) == 0x00015C, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::K2Node_ComponentBoundEvent_Index_7' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, K2Node_MakeArray_Array) == 0x000160, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, K2Node_ComponentBoundEvent_Index_6) == 0x000170, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::K2Node_ComponentBoundEvent_Index_6' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, K2Node_ComponentBoundEvent_Index_5) == 0x000174, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::K2Node_ComponentBoundEvent_Index_5' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, K2Node_ComponentBoundEvent_Index_4) == 0x000178, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::K2Node_ComponentBoundEvent_Index_4' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_K2_SetTimer_ReturnValue_2) == 0x000180, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_K2_SetTimer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_PlayAnimation_ReturnValue_1) == 0x000188, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, K2Node_ComponentBoundEvent_Index_3) == 0x000190, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::K2Node_ComponentBoundEvent_Index_3' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, K2Node_ComponentBoundEvent_Index_2) == 0x000194, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::K2Node_ComponentBoundEvent_Index_2' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, K2Node_ComponentBoundEvent_Index_1) == 0x000198, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::K2Node_ComponentBoundEvent_Index_1' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, K2Node_ComponentBoundEvent_Index) == 0x00019C, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::K2Node_ComponentBoundEvent_Index' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_PlayAnimation_ReturnValue_2) == 0x0001A0, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_PlayAnimation_ReturnValue_3) == 0x0001A8, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_SpawnSound2D_ReturnValue) == 0x0001B0, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_SpawnSound2D_ReturnValue_1) == 0x0001B8, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_SpawnSound2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x0001C0, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetDataTableRowFromName_OutRow) == 0x0001C8, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000208, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000210, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, K2Node_DynamicCast_AsSound_Base) == 0x000218, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::K2Node_DynamicCast_AsSound_Base' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, K2Node_DynamicCast_bSuccess) == 0x000220, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_SpawnSound2D_ReturnValue_2) == 0x000228, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_SpawnSound2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_SpawnSound2D_ReturnValue_3) == 0x000230, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_SpawnSound2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetMainWidget_MainWidget_4) == 0x000238, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetMainWidget_MainWidget_4' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetMainWidget_MainWidget_5) == 0x000240, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetMainWidget_MainWidget_5' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_IsGiveUpHeart_IsGiveUp) == 0x000248, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_IsGiveUpHeart_IsGiveUp' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_IsGiveUpHeart_GiveUpText) == 0x000250, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_IsGiveUpHeart_GiveUpText' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_AddPopupWidget_Widget) == 0x000268, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_AddPopupWidget_Widget' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, K2Node_CustomEvent_Popup) == 0x000270, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::K2Node_CustomEvent_Popup' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, K2Node_CustomEvent_BtnKey) == 0x000278, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::K2Node_CustomEvent_BtnKey' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetGameInstanceSubsystem_ReturnValue_6) == 0x000280, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetGameInstanceSubsystem_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, K2Node_SwitchEnum_CmpSuccess_1) == 0x000288, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_Execute_ReturnValue) == 0x00028C, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_Execute_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_AddWidget_Widget) == 0x0002A0, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_AddWidget_Widget' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_NotEqual_NameName_ReturnValue) == 0x0002A8, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetMainWidget_MainWidget_6) == 0x0002B0, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetMainWidget_MainWidget_6' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetGameInstanceSubsystem_ReturnValue_7) == 0x0002B8, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetGameInstanceSubsystem_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_Not_PreBool_ReturnValue_5) == 0x0002C0, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_BooleanAND_ReturnValue_8) == 0x0002C1, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_BooleanAND_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_IsValid_ReturnValue_5) == 0x0002C2, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_IsValid_ReturnValue_6) == 0x0002C3, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0002C4, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0002C8, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0002CC, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0002D0, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0002D4, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x0002D8, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_Multiply_IntFloat_ReturnValue) == 0x0002DC, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_Add_FloatFloat_ReturnValue) == 0x0002E0, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0002E4, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog, CallFunc_MakeRotator_ReturnValue) == 0x0002E8, "Member 'UIW_NPCDialog_C_ExecuteUbergraph_UIW_NPCDialog::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");

// Function UIW_NPCDialog.UIW_NPCDialog_C.OnGiveUpHeart
// 0x0010 (0x0010 - 0x0000)
struct UIW_NPCDialog_C_OnGiveUpHeart final
{
public:
	class UUIW_Popup_C*                           Popup;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_NPCDialog_C_OnGiveUpHeart) == 0x000008, "Wrong alignment on UIW_NPCDialog_C_OnGiveUpHeart");
static_assert(sizeof(UIW_NPCDialog_C_OnGiveUpHeart) == 0x000010, "Wrong size on UIW_NPCDialog_C_OnGiveUpHeart");
static_assert(offsetof(UIW_NPCDialog_C_OnGiveUpHeart, Popup) == 0x000000, "Member 'UIW_NPCDialog_C_OnGiveUpHeart::Popup' has a wrong offset!");
static_assert(offsetof(UIW_NPCDialog_C_OnGiveUpHeart, BtnKey) == 0x000008, "Member 'UIW_NPCDialog_C_OnGiveUpHeart::BtnKey' has a wrong offset!");

// Function UIW_NPCDialog.UIW_NPCDialog_C.BndEvt__UIW_NPCDialog_Answer_High_1_K2Node_ComponentBoundEvent_18_On Focused__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_High_1_K2Node_ComponentBoundEvent_18_On_Focused__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_High_1_K2Node_ComponentBoundEvent_18_On_Focused__DelegateSignature) == 0x000004, "Wrong alignment on UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_High_1_K2Node_ComponentBoundEvent_18_On_Focused__DelegateSignature");
static_assert(sizeof(UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_High_1_K2Node_ComponentBoundEvent_18_On_Focused__DelegateSignature) == 0x000004, "Wrong size on UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_High_1_K2Node_ComponentBoundEvent_18_On_Focused__DelegateSignature");
static_assert(offsetof(UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_High_1_K2Node_ComponentBoundEvent_18_On_Focused__DelegateSignature, Index_0) == 0x000000, "Member 'UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_High_1_K2Node_ComponentBoundEvent_18_On_Focused__DelegateSignature::Index_0' has a wrong offset!");

// Function UIW_NPCDialog.UIW_NPCDialog_C.BndEvt__UIW_NPCDialog_Answer_High_0_K2Node_ComponentBoundEvent_17_On Focused__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_High_0_K2Node_ComponentBoundEvent_17_On_Focused__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_High_0_K2Node_ComponentBoundEvent_17_On_Focused__DelegateSignature) == 0x000004, "Wrong alignment on UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_High_0_K2Node_ComponentBoundEvent_17_On_Focused__DelegateSignature");
static_assert(sizeof(UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_High_0_K2Node_ComponentBoundEvent_17_On_Focused__DelegateSignature) == 0x000004, "Wrong size on UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_High_0_K2Node_ComponentBoundEvent_17_On_Focused__DelegateSignature");
static_assert(offsetof(UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_High_0_K2Node_ComponentBoundEvent_17_On_Focused__DelegateSignature, Index_0) == 0x000000, "Member 'UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_High_0_K2Node_ComponentBoundEvent_17_On_Focused__DelegateSignature::Index_0' has a wrong offset!");

// Function UIW_NPCDialog.UIW_NPCDialog_C.BndEvt__UIW_NPCDialog_Answer_Low_1_K2Node_ComponentBoundEvent_16_On Focused__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_Low_1_K2Node_ComponentBoundEvent_16_On_Focused__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_Low_1_K2Node_ComponentBoundEvent_16_On_Focused__DelegateSignature) == 0x000004, "Wrong alignment on UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_Low_1_K2Node_ComponentBoundEvent_16_On_Focused__DelegateSignature");
static_assert(sizeof(UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_Low_1_K2Node_ComponentBoundEvent_16_On_Focused__DelegateSignature) == 0x000004, "Wrong size on UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_Low_1_K2Node_ComponentBoundEvent_16_On_Focused__DelegateSignature");
static_assert(offsetof(UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_Low_1_K2Node_ComponentBoundEvent_16_On_Focused__DelegateSignature, Index_0) == 0x000000, "Member 'UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_Low_1_K2Node_ComponentBoundEvent_16_On_Focused__DelegateSignature::Index_0' has a wrong offset!");

// Function UIW_NPCDialog.UIW_NPCDialog_C.BndEvt__UIW_NPCDialog_Answer_Low_0_K2Node_ComponentBoundEvent_14_On Focused__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_Low_0_K2Node_ComponentBoundEvent_14_On_Focused__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_Low_0_K2Node_ComponentBoundEvent_14_On_Focused__DelegateSignature) == 0x000004, "Wrong alignment on UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_Low_0_K2Node_ComponentBoundEvent_14_On_Focused__DelegateSignature");
static_assert(sizeof(UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_Low_0_K2Node_ComponentBoundEvent_14_On_Focused__DelegateSignature) == 0x000004, "Wrong size on UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_Low_0_K2Node_ComponentBoundEvent_14_On_Focused__DelegateSignature");
static_assert(offsetof(UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_Low_0_K2Node_ComponentBoundEvent_14_On_Focused__DelegateSignature, Index_0) == 0x000000, "Member 'UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_Low_0_K2Node_ComponentBoundEvent_14_On_Focused__DelegateSignature::Index_0' has a wrong offset!");

// Function UIW_NPCDialog.UIW_NPCDialog_C.BndEvt__UIW_NPCDialog_Answer_High_1_K2Node_ComponentBoundEvent_13_On Clicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_High_1_K2Node_ComponentBoundEvent_13_On_Clicked__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_High_1_K2Node_ComponentBoundEvent_13_On_Clicked__DelegateSignature) == 0x000004, "Wrong alignment on UIW_NPCDialog_C_BndEvt__UIW_NPCDialog_Answer_High_1_K2Node_ComponentBoundEvent_13_On_Clicked__DelegateSignature");
