#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_BG_Title

#include "Basic.hpp"

#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function UIW_BG_Title.UIW_BG_Title_C.ExecuteUbergraph_UIW_BG_Title
// 0x001C (0x001C - 0x0000)
struct UIW_BG_Title_C_ExecuteUbergraph_UIW_BG_Title final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase;                       // 0x0004(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_1;                     // 0x0010(0x000C)(NoDestructor)
};
static_assert(alignof(UIW_BG_Title_C_ExecuteUbergraph_UIW_BG_Title) == 0x000004, "Wrong alignment on UIW_BG_Title_C_ExecuteUbergraph_UIW_BG_Title");
static_assert(sizeof(UIW_BG_Title_C_ExecuteUbergraph_UIW_BG_Title) == 0x00001C, "Wrong size on UIW_BG_Title_C_ExecuteUbergraph_UIW_BG_Title");
static_assert(offsetof(UIW_BG_Title_C_ExecuteUbergraph_UIW_BG_Title, EntryPoint) == 0x000000, "Member 'UIW_BG_Title_C_ExecuteUbergraph_UIW_BG_Title::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_BG_Title_C_ExecuteUbergraph_UIW_BG_Title, K2Node_MakeStruct_TweenEase) == 0x000004, "Member 'UIW_BG_Title_C_ExecuteUbergraph_UIW_BG_Title::K2Node_MakeStruct_TweenEase' has a wrong offset!");
static_assert(offsetof(UIW_BG_Title_C_ExecuteUbergraph_UIW_BG_Title, K2Node_MakeStruct_TweenEase_1) == 0x000010, "Member 'UIW_BG_Title_C_ExecuteUbergraph_UIW_BG_Title::K2Node_MakeStruct_TweenEase_1' has a wrong offset!");

}

