#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_DPad_Durability

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_DPad_Durability.UIW_DPad_Durability_C
// 0x00A8 (0x0350 - 0x02A8)
class UUIW_DPad_Durability_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Durability_Warning_Start;                      // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Durability_Normal;                             // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Durability_Broken;                             // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Durability_Full;                               // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Durability_Warning;                            // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Durability_Break;                              // 0x02D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG_Durability_Default;                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Frame_Durability_Default;                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Clipping_Crack;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FX_Break;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FX_Durability;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIParticleEmitter*                     FX_Grinde;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FX_Light;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FX_Recover;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Durability;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_FrameCrack;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Start;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Mask;                                              // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTweenEase                             DurabilityTweenEase;                               // 0x0340(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_UIW_DPad_Durability(int32 EntryPoint);
	void WidgetAnimationEvt_Ani_Durability_Warning_Start_K2Node_WidgetAnimationEvent_2();
	void Destruct();
	void CompleteTween(class FName CategoryName);
	void Construct();
	void SetBroken();
	void SetBreak();
	void SetWarning();
	void SetFine();
	void SetFull();
	void ResetAnim();
	void Show_Grind_Effect();
	void SetEmpty();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_DPad_Durability_C">();
	}
	static class UUIW_DPad_Durability_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_DPad_Durability_C>();
	}
};
static_assert(alignof(UUIW_DPad_Durability_C) == 0x000008, "Wrong alignment on UUIW_DPad_Durability_C");
static_assert(sizeof(UUIW_DPad_Durability_C) == 0x000350, "Wrong size on UUIW_DPad_Durability_C");
static_assert(offsetof(UUIW_DPad_Durability_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_DPad_Durability_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_DPad_Durability_C, Ani_Durability_Warning_Start) == 0x0002B0, "Member 'UUIW_DPad_Durability_C::Ani_Durability_Warning_Start' has a wrong offset!");
static_assert(offsetof(UUIW_DPad_Durability_C, Ani_Durability_Normal) == 0x0002B8, "Member 'UUIW_DPad_Durability_C::Ani_Durability_Normal' has a wrong offset!");
static_assert(offsetof(UUIW_DPad_Durability_C, Ani_Durability_Broken) == 0x0002C0, "Member 'UUIW_DPad_Durability_C::Ani_Durability_Broken' has a wrong offset!");
static_assert(offsetof(UUIW_DPad_Durability_C, Ani_Durability_Full) == 0x0002C8, "Member 'UUIW_DPad_Durability_C::Ani_Durability_Full' has a wrong offset!");
static_assert(offsetof(UUIW_DPad_Durability_C, Ani_Durability_Warning) == 0x0002D0, "Member 'UUIW_DPad_Durability_C::Ani_Durability_Warning' has a wrong offset!");
static_assert(offsetof(UUIW_DPad_Durability_C, Ani_Durability_Break) == 0x0002D8, "Member 'UUIW_DPad_Durability_C::Ani_Durability_Break' has a wrong offset!");
static_assert(offsetof(UUIW_DPad_Durability_C, BG_Durability_Default) == 0x0002E0, "Member 'UUIW_DPad_Durability_C::BG_Durability_Default' has a wrong offset!");
static_assert(offsetof(UUIW_DPad_Durability_C, BG_Frame_Durability_Default) == 0x0002E8, "Member 'UUIW_DPad_Durability_C::BG_Frame_Durability_Default' has a wrong offset!");
static_assert(offsetof(UUIW_DPad_Durability_C, Clipping_Crack) == 0x0002F0, "Member 'UUIW_DPad_Durability_C::Clipping_Crack' has a wrong offset!");
static_assert(offsetof(UUIW_DPad_Durability_C, FX_Break) == 0x0002F8, "Member 'UUIW_DPad_Durability_C::FX_Break' has a wrong offset!");
static_assert(offsetof(UUIW_DPad_Durability_C, FX_Durability) == 0x000300, "Member 'UUIW_DPad_Durability_C::FX_Durability' has a wrong offset!");
static_assert(offsetof(UUIW_DPad_Durability_C, FX_Grinde) == 0x000308, "Member 'UUIW_DPad_Durability_C::FX_Grinde' has a wrong offset!");
static_assert(offsetof(UUIW_DPad_Durability_C, FX_Light) == 0x000310, "Member 'UUIW_DPad_Durability_C::FX_Light' has a wrong offset!");
static_assert(offsetof(UUIW_DPad_Durability_C, FX_Recover) == 0x000318, "Member 'UUIW_DPad_Durability_C::FX_Recover' has a wrong offset!");
static_assert(offsetof(UUIW_DPad_Durability_C, Img_Durability) == 0x000320, "Member 'UUIW_DPad_Durability_C::Img_Durability' has a wrong offset!");
static_assert(offsetof(UUIW_DPad_Durability_C, Img_FrameCrack) == 0x000328, "Member 'UUIW_DPad_Durability_C::Img_FrameCrack' has a wrong offset!");
static_assert(offsetof(UUIW_DPad_Durability_C, Img_Start) == 0x000330, "Member 'UUIW_DPad_Durability_C::Img_Start' has a wrong offset!");
static_assert(offsetof(UUIW_DPad_Durability_C, Mask) == 0x000338, "Member 'UUIW_DPad_Durability_C::Mask' has a wrong offset!");
static_assert(offsetof(UUIW_DPad_Durability_C, DurabilityTweenEase) == 0x000340, "Member 'UUIW_DPad_Durability_C::DurabilityTweenEase' has a wrong offset!");

}

