#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ListItem_ChapterTab

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_ListItem_ChapterTab.UIW_ListItem_ChapterTab_C
// 0x0040 (0x02E8 - 0x02A8)
class UUIW_ListItem_ChapterTab_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_Hover;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Line_Disable;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_New_Dot;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Select_1;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Select_2;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UIW_ListItem_ChapterTab(int32 EntryPoint);
	void Construct();
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_ListItem_ChapterTab_C">();
	}
	static class UUIW_ListItem_ChapterTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_ListItem_ChapterTab_C>();
	}
};
static_assert(alignof(UUIW_ListItem_ChapterTab_C) == 0x000008, "Wrong alignment on UUIW_ListItem_ChapterTab_C");
static_assert(sizeof(UUIW_ListItem_ChapterTab_C) == 0x0002E8, "Wrong size on UUIW_ListItem_ChapterTab_C");
static_assert(offsetof(UUIW_ListItem_ChapterTab_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_ListItem_ChapterTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ChapterTab_C, Img_Hover) == 0x0002B0, "Member 'UUIW_ListItem_ChapterTab_C::Img_Hover' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ChapterTab_C, Img_Line_Disable) == 0x0002B8, "Member 'UUIW_ListItem_ChapterTab_C::Img_Line_Disable' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ChapterTab_C, Img_New_Dot) == 0x0002C0, "Member 'UUIW_ListItem_ChapterTab_C::Img_New_Dot' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ChapterTab_C, Img_Select_1) == 0x0002C8, "Member 'UUIW_ListItem_ChapterTab_C::Img_Select_1' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ChapterTab_C, Img_Select_2) == 0x0002D0, "Member 'UUIW_ListItem_ChapterTab_C::Img_Select_2' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ChapterTab_C, Text) == 0x0002D8, "Member 'UUIW_ListItem_ChapterTab_C::Text' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ChapterTab_C, IsSelected) == 0x0002E0, "Member 'UUIW_ListItem_ChapterTab_C::IsSelected' has a wrong offset!");

}

