#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Alert_Recovery

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Alert_Recovery.UIW_Alert_Recovery_C
// 0x0018 (0x0280 - 0x0268)
class UUIW_Alert_Recovery_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Start;                                         // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Img_Text_Base;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_Alert_Recovery(int32 EntryPoint);
	void Destruct();
	void Construct();
	void Hide();
	void Show(float Delay);
	void Finished_36209D0B4A6B89BD35A996BDDC605A72();
	void SetAlertRecovery();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Alert_Recovery_C">();
	}
	static class UUIW_Alert_Recovery_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Alert_Recovery_C>();
	}
};
static_assert(alignof(UUIW_Alert_Recovery_C) == 0x000008, "Wrong alignment on UUIW_Alert_Recovery_C");
static_assert(sizeof(UUIW_Alert_Recovery_C) == 0x000280, "Wrong size on UUIW_Alert_Recovery_C");
static_assert(offsetof(UUIW_Alert_Recovery_C, UberGraphFrame) == 0x000268, "Member 'UUIW_Alert_Recovery_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_Recovery_C, Ani_Start) == 0x000270, "Member 'UUIW_Alert_Recovery_C::Ani_Start' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_Recovery_C, Img_Text_Base) == 0x000278, "Member 'UUIW_Alert_Recovery_C::Img_Text_Base' has a wrong offset!");

}

