#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Quartz_Slot

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK::Params
{

// Function UIW_Quartz_Slot.UIW_Quartz_Slot_C.SetData
// 0x0014 (0x0014 - 0x0000)
struct UIW_Quartz_Slot_C_SetData final
{
public:
	ELQuartzSlotStatusType                        QuartzSlotStatus;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELQuartzEffectType                            QuartzEffectType;                                  // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NowInstall;                                        // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTweenEase                             K2Node_MakeStruct_TweenEase;                       // 0x0008(0x000C)(NoDestructor)
};
static_assert(alignof(UIW_Quartz_Slot_C_SetData) == 0x000004, "Wrong alignment on UIW_Quartz_Slot_C_SetData");
static_assert(sizeof(UIW_Quartz_Slot_C_SetData) == 0x000014, "Wrong size on UIW_Quartz_Slot_C_SetData");
static_assert(offsetof(UIW_Quartz_Slot_C_SetData, QuartzSlotStatus) == 0x000000, "Member 'UIW_Quartz_Slot_C_SetData::QuartzSlotStatus' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Slot_C_SetData, QuartzEffectType) == 0x000001, "Member 'UIW_Quartz_Slot_C_SetData::QuartzEffectType' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Slot_C_SetData, NowInstall) == 0x000002, "Member 'UIW_Quartz_Slot_C_SetData::NowInstall' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Slot_C_SetData, K2Node_SwitchEnum_CmpSuccess) == 0x000003, "Member 'UIW_Quartz_Slot_C_SetData::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Slot_C_SetData, K2Node_SwitchEnum_CmpSuccess_1) == 0x000004, "Member 'UIW_Quartz_Slot_C_SetData::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Slot_C_SetData, K2Node_MakeStruct_TweenEase) == 0x000008, "Member 'UIW_Quartz_Slot_C_SetData::K2Node_MakeStruct_TweenEase' has a wrong offset!");

}

