#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_CharacterUpgrade_Stat

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UIW_CharacterUpgrade_Stat.UIW_CharacterUpgrade_Stat_C.OnFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_CharacterUpgrade_Stat_C_OnFocused__DelegateSignature final
{
public:
	class UUIW_CharacterUpgrade_Stat_C*           Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_CharacterUpgrade_Stat_C_OnFocused__DelegateSignature) == 0x000008, "Wrong alignment on UIW_CharacterUpgrade_Stat_C_OnFocused__DelegateSignature");
static_assert(sizeof(UIW_CharacterUpgrade_Stat_C_OnFocused__DelegateSignature) == 0x000008, "Wrong size on UIW_CharacterUpgrade_Stat_C_OnFocused__DelegateSignature");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_OnFocused__DelegateSignature, Widget) == 0x000000, "Member 'UIW_CharacterUpgrade_Stat_C_OnFocused__DelegateSignature::Widget' has a wrong offset!");

// Function UIW_CharacterUpgrade_Stat.UIW_CharacterUpgrade_Stat_C.OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_CharacterUpgrade_Stat_C_OnClicked__DelegateSignature final
{
public:
	class UUIW_CharacterUpgrade_Stat_C*           Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_CharacterUpgrade_Stat_C_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on UIW_CharacterUpgrade_Stat_C_OnClicked__DelegateSignature");
static_assert(sizeof(UIW_CharacterUpgrade_Stat_C_OnClicked__DelegateSignature) == 0x000008, "Wrong size on UIW_CharacterUpgrade_Stat_C_OnClicked__DelegateSignature");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_OnClicked__DelegateSignature, Widget) == 0x000000, "Member 'UIW_CharacterUpgrade_Stat_C_OnClicked__DelegateSignature::Widget' has a wrong offset!");

// Function UIW_CharacterUpgrade_Stat.UIW_CharacterUpgrade_Stat_C.ExecuteUbergraph_UIW_CharacterUpgrade_Stat
// 0x0120 (0x0120 - 0x0000)
struct UIW_CharacterUpgrade_Stat_C_ExecuteUbergraph_UIW_CharacterUpgrade_Stat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0040(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00B0(0x0070)(ConstParm)
};
static_assert(alignof(UIW_CharacterUpgrade_Stat_C_ExecuteUbergraph_UIW_CharacterUpgrade_Stat) == 0x000008, "Wrong alignment on UIW_CharacterUpgrade_Stat_C_ExecuteUbergraph_UIW_CharacterUpgrade_Stat");
static_assert(sizeof(UIW_CharacterUpgrade_Stat_C_ExecuteUbergraph_UIW_CharacterUpgrade_Stat) == 0x000120, "Wrong size on UIW_CharacterUpgrade_Stat_C_ExecuteUbergraph_UIW_CharacterUpgrade_Stat");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_ExecuteUbergraph_UIW_CharacterUpgrade_Stat, EntryPoint) == 0x000000, "Member 'UIW_CharacterUpgrade_Stat_C_ExecuteUbergraph_UIW_CharacterUpgrade_Stat::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_ExecuteUbergraph_UIW_CharacterUpgrade_Stat, K2Node_Event_MyGeometry) == 0x000004, "Member 'UIW_CharacterUpgrade_Stat_C_ExecuteUbergraph_UIW_CharacterUpgrade_Stat::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_ExecuteUbergraph_UIW_CharacterUpgrade_Stat, K2Node_Event_MouseEvent_1) == 0x000040, "Member 'UIW_CharacterUpgrade_Stat_C_ExecuteUbergraph_UIW_CharacterUpgrade_Stat::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_ExecuteUbergraph_UIW_CharacterUpgrade_Stat, K2Node_Event_MouseEvent) == 0x0000B0, "Member 'UIW_CharacterUpgrade_Stat_C_ExecuteUbergraph_UIW_CharacterUpgrade_Stat::K2Node_Event_MouseEvent' has a wrong offset!");

// Function UIW_CharacterUpgrade_Stat.UIW_CharacterUpgrade_Stat_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct UIW_CharacterUpgrade_Stat_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIW_CharacterUpgrade_Stat_C_OnMouseLeave) == 0x000008, "Wrong alignment on UIW_CharacterUpgrade_Stat_C_OnMouseLeave");
static_assert(sizeof(UIW_CharacterUpgrade_Stat_C_OnMouseLeave) == 0x000070, "Wrong size on UIW_CharacterUpgrade_Stat_C_OnMouseLeave");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'UIW_CharacterUpgrade_Stat_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function UIW_CharacterUpgrade_Stat.UIW_CharacterUpgrade_Stat_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct UIW_CharacterUpgrade_Stat_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIW_CharacterUpgrade_Stat_C_OnMouseEnter) == 0x000008, "Wrong alignment on UIW_CharacterUpgrade_Stat_C_OnMouseEnter");
static_assert(sizeof(UIW_CharacterUpgrade_Stat_C_OnMouseEnter) == 0x0000A8, "Wrong size on UIW_CharacterUpgrade_Stat_C_OnMouseEnter");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'UIW_CharacterUpgrade_Stat_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'UIW_CharacterUpgrade_Stat_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function UIW_CharacterUpgrade_Stat.UIW_CharacterUpgrade_Stat_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct UIW_CharacterUpgrade_Stat_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x00F8(0x00B8)()
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_CharacterUpgrade_Stat_C_OnFocusReceived) == 0x000008, "Wrong alignment on UIW_CharacterUpgrade_Stat_C_OnFocusReceived");
static_assert(sizeof(UIW_CharacterUpgrade_Stat_C_OnFocusReceived) == 0x0001B8, "Wrong size on UIW_CharacterUpgrade_Stat_C_OnFocusReceived");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UIW_CharacterUpgrade_Stat_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UIW_CharacterUpgrade_Stat_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UIW_CharacterUpgrade_Stat_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_OnFocusReceived, K2Node_MakeStruct_EventReply) == 0x0000F8, "Member 'UIW_CharacterUpgrade_Stat_C_OnFocusReceived::K2Node_MakeStruct_EventReply' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_OnFocusReceived, CallFunc_GetMainWidget_MainWidget) == 0x0001B0, "Member 'UIW_CharacterUpgrade_Stat_C_OnFocusReceived::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");

// Function UIW_CharacterUpgrade_Stat.UIW_CharacterUpgrade_Stat_C.SetSelected
// 0x0058 (0x0058 - 0x0000)
struct UIW_CharacterUpgrade_Stat_C_SetSelected final
{
public:
	bool                                          IsSelected_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0030(0x0028)()
};
static_assert(alignof(UIW_CharacterUpgrade_Stat_C_SetSelected) == 0x000008, "Wrong alignment on UIW_CharacterUpgrade_Stat_C_SetSelected");
static_assert(sizeof(UIW_CharacterUpgrade_Stat_C_SetSelected) == 0x000058, "Wrong size on UIW_CharacterUpgrade_Stat_C_SetSelected");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_SetSelected, IsSelected_0) == 0x000000, "Member 'UIW_CharacterUpgrade_Stat_C_SetSelected::IsSelected_0' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_SetSelected, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'UIW_CharacterUpgrade_Stat_C_SetSelected::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_SetSelected, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'UIW_CharacterUpgrade_Stat_C_SetSelected::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_SetSelected, K2Node_MakeStruct_SlateColor_1) == 0x000030, "Member 'UIW_CharacterUpgrade_Stat_C_SetSelected::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function UIW_CharacterUpgrade_Stat.UIW_CharacterUpgrade_Stat_C.OnMouseButtonUp
// 0x0218 (0x0218 - 0x0000)
struct UIW_CharacterUpgrade_Stat_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UIW_CharacterUpgrade_Stat_C_OnMouseButtonUp) == 0x000008, "Wrong alignment on UIW_CharacterUpgrade_Stat_C_OnMouseButtonUp");
static_assert(sizeof(UIW_CharacterUpgrade_Stat_C_OnMouseButtonUp) == 0x000218, "Wrong size on UIW_CharacterUpgrade_Stat_C_OnMouseButtonUp");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_OnMouseButtonUp, MyGeometry) == 0x000000, "Member 'UIW_CharacterUpgrade_Stat_C_OnMouseButtonUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_OnMouseButtonUp, MouseEvent) == 0x000038, "Member 'UIW_CharacterUpgrade_Stat_C_OnMouseButtonUp::MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_OnMouseButtonUp, ReturnValue) == 0x0000A8, "Member 'UIW_CharacterUpgrade_Stat_C_OnMouseButtonUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_OnMouseButtonUp, K2Node_MakeStruct_EventReply) == 0x000160, "Member 'UIW_CharacterUpgrade_Stat_C_OnMouseButtonUp::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function UIW_CharacterUpgrade_Stat.UIW_CharacterUpgrade_Stat_C.GetSelected
// 0x0001 (0x0001 - 0x0000)
struct UIW_CharacterUpgrade_Stat_C_GetSelected final
{
public:
	bool                                          IsSelected_0;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_CharacterUpgrade_Stat_C_GetSelected) == 0x000001, "Wrong alignment on UIW_CharacterUpgrade_Stat_C_GetSelected");
static_assert(sizeof(UIW_CharacterUpgrade_Stat_C_GetSelected) == 0x000001, "Wrong size on UIW_CharacterUpgrade_Stat_C_GetSelected");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_GetSelected, IsSelected_0) == 0x000000, "Member 'UIW_CharacterUpgrade_Stat_C_GetSelected::IsSelected_0' has a wrong offset!");

// Function UIW_CharacterUpgrade_Stat.UIW_CharacterUpgrade_Stat_C.OnMouseWheel
// 0x0220 (0x0220 - 0x0000)
struct UIW_CharacterUpgrade_Stat_C_OnMouseWheel final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	float                                         CallFunc_PointerEvent_GetWheelDelta_ReturnValue;   // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0168(0x00B8)()
};
static_assert(alignof(UIW_CharacterUpgrade_Stat_C_OnMouseWheel) == 0x000008, "Wrong alignment on UIW_CharacterUpgrade_Stat_C_OnMouseWheel");
static_assert(sizeof(UIW_CharacterUpgrade_Stat_C_OnMouseWheel) == 0x000220, "Wrong size on UIW_CharacterUpgrade_Stat_C_OnMouseWheel");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_OnMouseWheel, MyGeometry) == 0x000000, "Member 'UIW_CharacterUpgrade_Stat_C_OnMouseWheel::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_OnMouseWheel, MouseEvent) == 0x000038, "Member 'UIW_CharacterUpgrade_Stat_C_OnMouseWheel::MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_OnMouseWheel, ReturnValue) == 0x0000A8, "Member 'UIW_CharacterUpgrade_Stat_C_OnMouseWheel::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_OnMouseWheel, CallFunc_PointerEvent_GetWheelDelta_ReturnValue) == 0x000160, "Member 'UIW_CharacterUpgrade_Stat_C_OnMouseWheel::CallFunc_PointerEvent_GetWheelDelta_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_OnMouseWheel, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000164, "Member 'UIW_CharacterUpgrade_Stat_C_OnMouseWheel::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_Stat_C_OnMouseWheel, CallFunc_Handled_ReturnValue) == 0x000168, "Member 'UIW_CharacterUpgrade_Stat_C_OnMouseWheel::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

