#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HUD_Menu_Btn

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UIW_HUD_Menu_Btn.UIW_HUD_Menu_Btn_C.OnSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_HUD_Menu_Btn_C_OnSelected__DelegateSignature final
{
public:
	class UUIW_HUD_Menu_Btn_C*                    MenuBtn;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HUD_Menu_Btn_C_OnSelected__DelegateSignature) == 0x000008, "Wrong alignment on UIW_HUD_Menu_Btn_C_OnSelected__DelegateSignature");
static_assert(sizeof(UIW_HUD_Menu_Btn_C_OnSelected__DelegateSignature) == 0x000008, "Wrong size on UIW_HUD_Menu_Btn_C_OnSelected__DelegateSignature");
static_assert(offsetof(UIW_HUD_Menu_Btn_C_OnSelected__DelegateSignature, MenuBtn) == 0x000000, "Member 'UIW_HUD_Menu_Btn_C_OnSelected__DelegateSignature::MenuBtn' has a wrong offset!");

// Function UIW_HUD_Menu_Btn.UIW_HUD_Menu_Btn_C.ExecuteUbergraph_UIW_HUD_Menu_Btn
// 0x00B8 (0x00B8 - 0x0000)
struct UIW_HUD_Menu_Btn_C_ExecuteUbergraph_UIW_HUD_Menu_Btn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0004(0x0008)(NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0048(0x0070)(ConstParm)
};
static_assert(alignof(UIW_HUD_Menu_Btn_C_ExecuteUbergraph_UIW_HUD_Menu_Btn) == 0x000008, "Wrong alignment on UIW_HUD_Menu_Btn_C_ExecuteUbergraph_UIW_HUD_Menu_Btn");
static_assert(sizeof(UIW_HUD_Menu_Btn_C_ExecuteUbergraph_UIW_HUD_Menu_Btn) == 0x0000B8, "Wrong size on UIW_HUD_Menu_Btn_C_ExecuteUbergraph_UIW_HUD_Menu_Btn");
static_assert(offsetof(UIW_HUD_Menu_Btn_C_ExecuteUbergraph_UIW_HUD_Menu_Btn, EntryPoint) == 0x000000, "Member 'UIW_HUD_Menu_Btn_C_ExecuteUbergraph_UIW_HUD_Menu_Btn::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_Btn_C_ExecuteUbergraph_UIW_HUD_Menu_Btn, K2Node_Event_InFocusEvent) == 0x000004, "Member 'UIW_HUD_Menu_Btn_C_ExecuteUbergraph_UIW_HUD_Menu_Btn::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_Btn_C_ExecuteUbergraph_UIW_HUD_Menu_Btn, K2Node_Event_IsDesignTime) == 0x00000C, "Member 'UIW_HUD_Menu_Btn_C_ExecuteUbergraph_UIW_HUD_Menu_Btn::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_Btn_C_ExecuteUbergraph_UIW_HUD_Menu_Btn, K2Node_Event_MyGeometry) == 0x000010, "Member 'UIW_HUD_Menu_Btn_C_ExecuteUbergraph_UIW_HUD_Menu_Btn::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_Btn_C_ExecuteUbergraph_UIW_HUD_Menu_Btn, K2Node_Event_MouseEvent) == 0x000048, "Member 'UIW_HUD_Menu_Btn_C_ExecuteUbergraph_UIW_HUD_Menu_Btn::K2Node_Event_MouseEvent' has a wrong offset!");

// Function UIW_HUD_Menu_Btn.UIW_HUD_Menu_Btn_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct UIW_HUD_Menu_Btn_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIW_HUD_Menu_Btn_C_OnMouseEnter) == 0x000008, "Wrong alignment on UIW_HUD_Menu_Btn_C_OnMouseEnter");
static_assert(sizeof(UIW_HUD_Menu_Btn_C_OnMouseEnter) == 0x0000A8, "Wrong size on UIW_HUD_Menu_Btn_C_OnMouseEnter");
static_assert(offsetof(UIW_HUD_Menu_Btn_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'UIW_HUD_Menu_Btn_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_Btn_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'UIW_HUD_Menu_Btn_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function UIW_HUD_Menu_Btn.UIW_HUD_Menu_Btn_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UIW_HUD_Menu_Btn_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_HUD_Menu_Btn_C_PreConstruct) == 0x000001, "Wrong alignment on UIW_HUD_Menu_Btn_C_PreConstruct");
static_assert(sizeof(UIW_HUD_Menu_Btn_C_PreConstruct) == 0x000001, "Wrong size on UIW_HUD_Menu_Btn_C_PreConstruct");
static_assert(offsetof(UIW_HUD_Menu_Btn_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UIW_HUD_Menu_Btn_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UIW_HUD_Menu_Btn.UIW_HUD_Menu_Btn_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct UIW_HUD_Menu_Btn_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UIW_HUD_Menu_Btn_C_OnFocusLost) == 0x000004, "Wrong alignment on UIW_HUD_Menu_Btn_C_OnFocusLost");
static_assert(sizeof(UIW_HUD_Menu_Btn_C_OnFocusLost) == 0x000008, "Wrong size on UIW_HUD_Menu_Btn_C_OnFocusLost");
static_assert(offsetof(UIW_HUD_Menu_Btn_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'UIW_HUD_Menu_Btn_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function UIW_HUD_Menu_Btn.UIW_HUD_Menu_Btn_C.SetSelected
// 0x0001 (0x0001 - 0x0000)
struct UIW_HUD_Menu_Btn_C_SetSelected final
{
public:
	bool                                          IsSelected;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_HUD_Menu_Btn_C_SetSelected) == 0x000001, "Wrong alignment on UIW_HUD_Menu_Btn_C_SetSelected");
static_assert(sizeof(UIW_HUD_Menu_Btn_C_SetSelected) == 0x000001, "Wrong size on UIW_HUD_Menu_Btn_C_SetSelected");
static_assert(offsetof(UIW_HUD_Menu_Btn_C_SetSelected, IsSelected) == 0x000000, "Member 'UIW_HUD_Menu_Btn_C_SetSelected::IsSelected' has a wrong offset!");

// Function UIW_HUD_Menu_Btn.UIW_HUD_Menu_Btn_C.OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct UIW_HUD_Menu_Btn_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UIW_HUD_Menu_Btn_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on UIW_HUD_Menu_Btn_C_OnMouseButtonDown");
static_assert(sizeof(UIW_HUD_Menu_Btn_C_OnMouseButtonDown) == 0x000218, "Wrong size on UIW_HUD_Menu_Btn_C_OnMouseButtonDown");
static_assert(offsetof(UIW_HUD_Menu_Btn_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'UIW_HUD_Menu_Btn_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_Btn_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'UIW_HUD_Menu_Btn_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_Btn_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'UIW_HUD_Menu_Btn_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_Btn_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'UIW_HUD_Menu_Btn_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

