#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Spinner_Number

#include "Basic.hpp"

#include "ProjectP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Spinner_Number.UIW_Spinner_Number_C
// 0x0020 (0x02C8 - 0x02A8)
class UUIW_Spinner_Number_C final : public ULWidget
{
public:
	class UCanvasPanel*                           NumberBox;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Number_Down;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Number_Up;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentValue;                                      // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetNumber(int32 Number);
	void SetColor(bool IsEdited);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Spinner_Number_C">();
	}
	static class UUIW_Spinner_Number_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Spinner_Number_C>();
	}
};
static_assert(alignof(UUIW_Spinner_Number_C) == 0x000008, "Wrong alignment on UUIW_Spinner_Number_C");
static_assert(sizeof(UUIW_Spinner_Number_C) == 0x0002C8, "Wrong size on UUIW_Spinner_Number_C");
static_assert(offsetof(UUIW_Spinner_Number_C, NumberBox) == 0x0002A8, "Member 'UUIW_Spinner_Number_C::NumberBox' has a wrong offset!");
static_assert(offsetof(UUIW_Spinner_Number_C, Text_Number_Down) == 0x0002B0, "Member 'UUIW_Spinner_Number_C::Text_Number_Down' has a wrong offset!");
static_assert(offsetof(UUIW_Spinner_Number_C, Text_Number_Up) == 0x0002B8, "Member 'UUIW_Spinner_Number_C::Text_Number_Up' has a wrong offset!");
static_assert(offsetof(UUIW_Spinner_Number_C, CurrentValue) == 0x0002C0, "Member 'UUIW_Spinner_Number_C::CurrentValue' has a wrong offset!");

}

