#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ComboBox_Item

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UIW_ComboBox_Item.UIW_ComboBox_Item_C.ExecuteUbergraph_UIW_ComboBox_Item
// 0x0210 (0x0210 - 0x0000)
struct UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_Default_C*               K2Node_DynamicCast_AsUIBP_List_Data_Default;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0024(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0060(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00D0(0x0070)(ConstParm)
	class UListViewBase*                          CallFunc_GetOwningListView_ReturnValue;            // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UListView*                              K2Node_DynamicCast_AsList_View;                    // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0154(0x0008)(NoDestructor)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0160(0x0058)(HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo_1;                 // 0x01B8(0x0058)(HasGetValueTypeHash)
};
static_assert(alignof(UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item) == 0x000008, "Wrong alignment on UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item");
static_assert(sizeof(UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item) == 0x000210, "Wrong size on UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item");
static_assert(offsetof(UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item, EntryPoint) == 0x000000, "Member 'UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item, K2Node_Event_bIsExpanded) == 0x000004, "Member 'UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item, K2Node_Event_ListItemObject) == 0x000008, "Member 'UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item, K2Node_Event_bIsSelected) == 0x000010, "Member 'UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item, K2Node_DynamicCast_AsUIBP_List_Data_Default) == 0x000018, "Member 'UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item::K2Node_DynamicCast_AsUIBP_List_Data_Default' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000021, "Member 'UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item, K2Node_Event_MyGeometry) == 0x000024, "Member 'UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item, K2Node_Event_MouseEvent_1) == 0x000060, "Member 'UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item, K2Node_Event_MouseEvent) == 0x0000D0, "Member 'UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item, CallFunc_GetOwningListView_ReturnValue) == 0x000140, "Member 'UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item::CallFunc_GetOwningListView_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item, K2Node_DynamicCast_AsList_View) == 0x000148, "Member 'UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item::K2Node_DynamicCast_AsList_View' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item, K2Node_DynamicCast_bSuccess_1) == 0x000150, "Member 'UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item, K2Node_Event_InFocusEvent) == 0x000154, "Member 'UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item, K2Node_MakeStruct_SlateFontInfo) == 0x000160, "Member 'UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item, K2Node_MakeStruct_SlateFontInfo_1) == 0x0001B8, "Member 'UIW_ComboBox_Item_C_ExecuteUbergraph_UIW_ComboBox_Item::K2Node_MakeStruct_SlateFontInfo_1' has a wrong offset!");

// Function UIW_ComboBox_Item.UIW_ComboBox_Item_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct UIW_ComboBox_Item_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UIW_ComboBox_Item_C_OnFocusLost) == 0x000004, "Wrong alignment on UIW_ComboBox_Item_C_OnFocusLost");
static_assert(sizeof(UIW_ComboBox_Item_C_OnFocusLost) == 0x000008, "Wrong size on UIW_ComboBox_Item_C_OnFocusLost");
static_assert(offsetof(UIW_ComboBox_Item_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'UIW_ComboBox_Item_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function UIW_ComboBox_Item.UIW_ComboBox_Item_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct UIW_ComboBox_Item_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIW_ComboBox_Item_C_OnMouseLeave) == 0x000008, "Wrong alignment on UIW_ComboBox_Item_C_OnMouseLeave");
static_assert(sizeof(UIW_ComboBox_Item_C_OnMouseLeave) == 0x000070, "Wrong size on UIW_ComboBox_Item_C_OnMouseLeave");
static_assert(offsetof(UIW_ComboBox_Item_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'UIW_ComboBox_Item_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function UIW_ComboBox_Item.UIW_ComboBox_Item_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct UIW_ComboBox_Item_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIW_ComboBox_Item_C_OnMouseEnter) == 0x000008, "Wrong alignment on UIW_ComboBox_Item_C_OnMouseEnter");
static_assert(sizeof(UIW_ComboBox_Item_C_OnMouseEnter) == 0x0000A8, "Wrong size on UIW_ComboBox_Item_C_OnMouseEnter");
static_assert(offsetof(UIW_ComboBox_Item_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'UIW_ComboBox_Item_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_Item_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'UIW_ComboBox_Item_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function UIW_ComboBox_Item.UIW_ComboBox_Item_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_ComboBox_Item_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ComboBox_Item_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on UIW_ComboBox_Item_C_BP_OnItemSelectionChanged");
static_assert(sizeof(UIW_ComboBox_Item_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on UIW_ComboBox_Item_C_BP_OnItemSelectionChanged");
static_assert(offsetof(UIW_ComboBox_Item_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'UIW_ComboBox_Item_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function UIW_ComboBox_Item.UIW_ComboBox_Item_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct UIW_ComboBox_Item_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ComboBox_Item_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on UIW_ComboBox_Item_C_OnListItemObjectSet");
static_assert(sizeof(UIW_ComboBox_Item_C_OnListItemObjectSet) == 0x000008, "Wrong size on UIW_ComboBox_Item_C_OnListItemObjectSet");
static_assert(offsetof(UIW_ComboBox_Item_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'UIW_ComboBox_Item_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function UIW_ComboBox_Item.UIW_ComboBox_Item_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_ComboBox_Item_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ComboBox_Item_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on UIW_ComboBox_Item_C_BP_OnItemExpansionChanged");
static_assert(sizeof(UIW_ComboBox_Item_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on UIW_ComboBox_Item_C_BP_OnItemExpansionChanged");
static_assert(offsetof(UIW_ComboBox_Item_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'UIW_ComboBox_Item_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function UIW_ComboBox_Item.UIW_ComboBox_Item_C.SetMoveFocusEffect
// 0x0018 (0x0018 - 0x0000)
struct UIW_ComboBox_Item_C_SetMoveFocusEffect final
{
public:
	class UListViewBase*                          CallFunc_GetOwningListView_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_MoveFocusOnList_SelectedWidget;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ComboBox_Item_C_SetMoveFocusEffect) == 0x000008, "Wrong alignment on UIW_ComboBox_Item_C_SetMoveFocusEffect");
static_assert(sizeof(UIW_ComboBox_Item_C_SetMoveFocusEffect) == 0x000018, "Wrong size on UIW_ComboBox_Item_C_SetMoveFocusEffect");
static_assert(offsetof(UIW_ComboBox_Item_C_SetMoveFocusEffect, CallFunc_GetOwningListView_ReturnValue) == 0x000000, "Member 'UIW_ComboBox_Item_C_SetMoveFocusEffect::CallFunc_GetOwningListView_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_Item_C_SetMoveFocusEffect, CallFunc_GetMainWidget_MainWidget) == 0x000008, "Member 'UIW_ComboBox_Item_C_SetMoveFocusEffect::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_Item_C_SetMoveFocusEffect, CallFunc_MoveFocusOnList_SelectedWidget) == 0x000010, "Member 'UIW_ComboBox_Item_C_SetMoveFocusEffect::CallFunc_MoveFocusOnList_SelectedWidget' has a wrong offset!");

// Function UIW_ComboBox_Item.UIW_ComboBox_Item_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct UIW_ComboBox_Item_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(UIW_ComboBox_Item_C_OnFocusReceived) == 0x000008, "Wrong alignment on UIW_ComboBox_Item_C_OnFocusReceived");
static_assert(sizeof(UIW_ComboBox_Item_C_OnFocusReceived) == 0x0001B0, "Wrong size on UIW_ComboBox_Item_C_OnFocusReceived");
static_assert(offsetof(UIW_ComboBox_Item_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UIW_ComboBox_Item_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_Item_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UIW_ComboBox_Item_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_Item_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UIW_ComboBox_Item_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_Item_C_OnFocusReceived, K2Node_MakeStruct_EventReply) == 0x0000F8, "Member 'UIW_ComboBox_Item_C_OnFocusReceived::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function UIW_ComboBox_Item.UIW_ComboBox_Item_C.SetTextColor
// 0x0050 (0x0050 - 0x0000)
struct UIW_ComboBox_Item_C_SetTextColor final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0028(0x0028)()
};
static_assert(alignof(UIW_ComboBox_Item_C_SetTextColor) == 0x000008, "Wrong alignment on UIW_ComboBox_Item_C_SetTextColor");
static_assert(sizeof(UIW_ComboBox_Item_C_SetTextColor) == 0x000050, "Wrong size on UIW_ComboBox_Item_C_SetTextColor");
static_assert(offsetof(UIW_ComboBox_Item_C_SetTextColor, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'UIW_ComboBox_Item_C_SetTextColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_Item_C_SetTextColor, K2Node_MakeStruct_SlateColor_1) == 0x000028, "Member 'UIW_ComboBox_Item_C_SetTextColor::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

}

