#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ListItem_Location

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_ListItem_Location.UIW_ListItem_Location_C
// 0x0048 (0x02F0 - 0x02A8)
class UUIW_ListItem_Location_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_Line_Disable;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_MyLocation;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Label;                                             // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ListBarHelperGroup;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Fx_Btn_Bg_Left_C*                  Select_Bg_Left;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListView*                              OwnerListView;                                     // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_Teleport_C*              ListItemData;                                      // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UIW_ListItem_Location(int32 EntryPoint);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void Destruct();
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void Construct();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();
	void SetHighlightLabel();
	void SetMoveFocusEffect();
	struct FEventReply OnMouseWheel(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_ListItem_Location_C">();
	}
	static class UUIW_ListItem_Location_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_ListItem_Location_C>();
	}
};
static_assert(alignof(UUIW_ListItem_Location_C) == 0x000008, "Wrong alignment on UUIW_ListItem_Location_C");
static_assert(sizeof(UUIW_ListItem_Location_C) == 0x0002F0, "Wrong size on UUIW_ListItem_Location_C");
static_assert(offsetof(UUIW_ListItem_Location_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_ListItem_Location_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Location_C, Img_Line_Disable) == 0x0002B0, "Member 'UUIW_ListItem_Location_C::Img_Line_Disable' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Location_C, Img_MyLocation) == 0x0002B8, "Member 'UUIW_ListItem_Location_C::Img_MyLocation' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Location_C, Label) == 0x0002C0, "Member 'UUIW_ListItem_Location_C::Label' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Location_C, ListBarHelperGroup) == 0x0002C8, "Member 'UUIW_ListItem_Location_C::ListBarHelperGroup' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Location_C, Select_Bg_Left) == 0x0002D0, "Member 'UUIW_ListItem_Location_C::Select_Bg_Left' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Location_C, OwnerListView) == 0x0002D8, "Member 'UUIW_ListItem_Location_C::OwnerListView' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Location_C, ListItemData) == 0x0002E0, "Member 'UUIW_ListItem_Location_C::ListItemData' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Location_C, IsSelected) == 0x0002E8, "Member 'UUIW_ListItem_Location_C::IsSelected' has a wrong offset!");

}

