#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Alert_Kill

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UIW_Alert_Kill.UIW_Alert_Kill_C.ExecuteUbergraph_UIW_Alert_Kill
// 0x0060 (0x0060 - 0x0000)
struct UIW_Alert_Kill_C_ExecuteUbergraph_UIW_Alert_Kill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Delay;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsGameEnd;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NameData)>         K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Alert_Kill_C_ExecuteUbergraph_UIW_Alert_Kill) == 0x000008, "Wrong alignment on UIW_Alert_Kill_C_ExecuteUbergraph_UIW_Alert_Kill");
static_assert(sizeof(UIW_Alert_Kill_C_ExecuteUbergraph_UIW_Alert_Kill) == 0x000060, "Wrong size on UIW_Alert_Kill_C_ExecuteUbergraph_UIW_Alert_Kill");
static_assert(offsetof(UIW_Alert_Kill_C_ExecuteUbergraph_UIW_Alert_Kill, EntryPoint) == 0x000000, "Member 'UIW_Alert_Kill_C_ExecuteUbergraph_UIW_Alert_Kill::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_Alert_Kill_C_ExecuteUbergraph_UIW_Alert_Kill, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'UIW_Alert_Kill_C_ExecuteUbergraph_UIW_Alert_Kill::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_Kill_C_ExecuteUbergraph_UIW_Alert_Kill, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'UIW_Alert_Kill_C_ExecuteUbergraph_UIW_Alert_Kill::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_Kill_C_ExecuteUbergraph_UIW_Alert_Kill, K2Node_CustomEvent_Delay) == 0x000018, "Member 'UIW_Alert_Kill_C_ExecuteUbergraph_UIW_Alert_Kill::K2Node_CustomEvent_Delay' has a wrong offset!");
static_assert(offsetof(UIW_Alert_Kill_C_ExecuteUbergraph_UIW_Alert_Kill, K2Node_CustomEvent_IsGameEnd) == 0x00001C, "Member 'UIW_Alert_Kill_C_ExecuteUbergraph_UIW_Alert_Kill::K2Node_CustomEvent_IsGameEnd' has a wrong offset!");
static_assert(offsetof(UIW_Alert_Kill_C_ExecuteUbergraph_UIW_Alert_Kill, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'UIW_Alert_Kill_C_ExecuteUbergraph_UIW_Alert_Kill::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_Alert_Kill_C_ExecuteUbergraph_UIW_Alert_Kill, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000030, "Member 'UIW_Alert_Kill_C_ExecuteUbergraph_UIW_Alert_Kill::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_Kill_C_ExecuteUbergraph_UIW_Alert_Kill, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'UIW_Alert_Kill_C_ExecuteUbergraph_UIW_Alert_Kill::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UIW_Alert_Kill_C_ExecuteUbergraph_UIW_Alert_Kill, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000048, "Member 'UIW_Alert_Kill_C_ExecuteUbergraph_UIW_Alert_Kill::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(UIW_Alert_Kill_C_ExecuteUbergraph_UIW_Alert_Kill, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000050, "Member 'UIW_Alert_Kill_C_ExecuteUbergraph_UIW_Alert_Kill::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_Kill_C_ExecuteUbergraph_UIW_Alert_Kill, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'UIW_Alert_Kill_C_ExecuteUbergraph_UIW_Alert_Kill::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UIW_Alert_Kill.UIW_Alert_Kill_C.Show
// 0x0008 (0x0008 - 0x0000)
struct UIW_Alert_Kill_C_Show final
{
public:
	float                                         Delay;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGameEnd;                                         // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Alert_Kill_C_Show) == 0x000004, "Wrong alignment on UIW_Alert_Kill_C_Show");
static_assert(sizeof(UIW_Alert_Kill_C_Show) == 0x000008, "Wrong size on UIW_Alert_Kill_C_Show");
static_assert(offsetof(UIW_Alert_Kill_C_Show, Delay) == 0x000000, "Member 'UIW_Alert_Kill_C_Show::Delay' has a wrong offset!");
static_assert(offsetof(UIW_Alert_Kill_C_Show, IsGameEnd) == 0x000004, "Member 'UIW_Alert_Kill_C_Show::IsGameEnd' has a wrong offset!");

// Function UIW_Alert_Kill.UIW_Alert_Kill_C.SetAlertKill
// 0x0028 (0x0028 - 0x0000)
struct UIW_Alert_Kill_C_SetAlertKill final
{
public:
	class FName                                   CodeName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             LocalBgTexture;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             LocalTexture;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FNPCInfoPtr                            CallFunc_FindNpcInfoByNameBP_ReturnValue;          // 0x0018(0x0008)(NoDestructor)
	ELNPCType                                     CallFunc_GetNpcKind_ReturnValue;                   // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Alert_Kill_C_SetAlertKill) == 0x000008, "Wrong alignment on UIW_Alert_Kill_C_SetAlertKill");
static_assert(sizeof(UIW_Alert_Kill_C_SetAlertKill) == 0x000028, "Wrong size on UIW_Alert_Kill_C_SetAlertKill");
static_assert(offsetof(UIW_Alert_Kill_C_SetAlertKill, CodeName) == 0x000000, "Member 'UIW_Alert_Kill_C_SetAlertKill::CodeName' has a wrong offset!");
static_assert(offsetof(UIW_Alert_Kill_C_SetAlertKill, LocalBgTexture) == 0x000008, "Member 'UIW_Alert_Kill_C_SetAlertKill::LocalBgTexture' has a wrong offset!");
static_assert(offsetof(UIW_Alert_Kill_C_SetAlertKill, LocalTexture) == 0x000010, "Member 'UIW_Alert_Kill_C_SetAlertKill::LocalTexture' has a wrong offset!");
static_assert(offsetof(UIW_Alert_Kill_C_SetAlertKill, CallFunc_FindNpcInfoByNameBP_ReturnValue) == 0x000018, "Member 'UIW_Alert_Kill_C_SetAlertKill::CallFunc_FindNpcInfoByNameBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_Kill_C_SetAlertKill, CallFunc_GetNpcKind_ReturnValue) == 0x000020, "Member 'UIW_Alert_Kill_C_SetAlertKill::CallFunc_GetNpcKind_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_Kill_C_SetAlertKill, K2Node_SwitchEnum_CmpSuccess) == 0x000021, "Member 'UIW_Alert_Kill_C_SetAlertKill::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function UIW_Alert_Kill.UIW_Alert_Kill_C.OnAniFinished
// 0x0008 (0x0008 - 0x0000)
struct UIW_Alert_Kill_C_OnAniFinished final
{
public:
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Alert_Kill_C_OnAniFinished) == 0x000008, "Wrong alignment on UIW_Alert_Kill_C_OnAniFinished");
static_assert(sizeof(UIW_Alert_Kill_C_OnAniFinished) == 0x000008, "Wrong size on UIW_Alert_Kill_C_OnAniFinished");
static_assert(offsetof(UIW_Alert_Kill_C_OnAniFinished, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'UIW_Alert_Kill_C_OnAniFinished::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

}

