#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ListItem_Stat_Simple

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_ListItem_Stat_Simple.UIW_ListItem_Stat_Simple_C
// 0x0058 (0x0300 - 0x02A8)
class UUIW_ListItem_Stat_Simple_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUIW_Stat_Diff_C*                       Diff;                                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Img_ChaUpPreview;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Icon;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Motion;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Label;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Value;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIBP_ListData_OneStat_C*               StatListData;                                      // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<ELFirstStat>                           ChaUpPreviewStat;                                  // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UUIW_CharacterUpgrade_C*                ChaUpWidget;                                       // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_ListItem_Stat_Simple(int32 EntryPoint);
	void Destruct();
	void Construct();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();
	void SetData(class UUIBP_ListData_OneStat_C* ListDataOneStat);
	void OnUpgradePreview(ELFirstStat FirstStat);
	void SetWeaponCorrection(const class FText& Label, ELHandleCorrectResultGrade CurrentStat, ELHandleCorrectResultGrade NextStat, bool IsDiff);
	void SetCorrection(const class FText& Label, ELWeaponCorrectionPhysicalGrade CurrentStat);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_ListItem_Stat_Simple_C">();
	}
	static class UUIW_ListItem_Stat_Simple_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_ListItem_Stat_Simple_C>();
	}
};
static_assert(alignof(UUIW_ListItem_Stat_Simple_C) == 0x000008, "Wrong alignment on UUIW_ListItem_Stat_Simple_C");
static_assert(sizeof(UUIW_ListItem_Stat_Simple_C) == 0x000300, "Wrong size on UUIW_ListItem_Stat_Simple_C");
static_assert(offsetof(UUIW_ListItem_Stat_Simple_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_ListItem_Stat_Simple_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Simple_C, Diff) == 0x0002B0, "Member 'UUIW_ListItem_Stat_Simple_C::Diff' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Simple_C, Img_ChaUpPreview) == 0x0002B8, "Member 'UUIW_ListItem_Stat_Simple_C::Img_ChaUpPreview' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Simple_C, Img_Icon) == 0x0002C0, "Member 'UUIW_ListItem_Stat_Simple_C::Img_Icon' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Simple_C, Img_Motion) == 0x0002C8, "Member 'UUIW_ListItem_Stat_Simple_C::Img_Motion' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Simple_C, Text_Label) == 0x0002D0, "Member 'UUIW_ListItem_Stat_Simple_C::Text_Label' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Simple_C, Text_Value) == 0x0002D8, "Member 'UUIW_ListItem_Stat_Simple_C::Text_Value' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Simple_C, StatListData) == 0x0002E0, "Member 'UUIW_ListItem_Stat_Simple_C::StatListData' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Simple_C, ChaUpPreviewStat) == 0x0002E8, "Member 'UUIW_ListItem_Stat_Simple_C::ChaUpPreviewStat' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Simple_C, ChaUpWidget) == 0x0002F8, "Member 'UUIW_ListItem_Stat_Simple_C::ChaUpWidget' has a wrong offset!");

}

