#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ExchangeShop

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UIW_ExchangeShop.UIW_ExchangeShop_C.ExecuteUbergraph_UIW_ExchangeShop
// 0x0040 (0x0040 - 0x0000)
struct UIW_ExchangeShop_C_ExecuteUbergraph_UIW_ExchangeShop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_1;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget_1;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ExchangeShop_C_ExecuteUbergraph_UIW_ExchangeShop) == 0x000008, "Wrong alignment on UIW_ExchangeShop_C_ExecuteUbergraph_UIW_ExchangeShop");
static_assert(sizeof(UIW_ExchangeShop_C_ExecuteUbergraph_UIW_ExchangeShop) == 0x000040, "Wrong size on UIW_ExchangeShop_C_ExecuteUbergraph_UIW_ExchangeShop");
static_assert(offsetof(UIW_ExchangeShop_C_ExecuteUbergraph_UIW_ExchangeShop, EntryPoint) == 0x000000, "Member 'UIW_ExchangeShop_C_ExecuteUbergraph_UIW_ExchangeShop::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ExecuteUbergraph_UIW_ExchangeShop, CallFunc_GetMainWidget_MainWidget) == 0x000008, "Member 'UIW_ExchangeShop_C_ExecuteUbergraph_UIW_ExchangeShop::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ExecuteUbergraph_UIW_ExchangeShop, K2Node_ComponentBoundEvent_BtnKey_1) == 0x000010, "Member 'UIW_ExchangeShop_C_ExecuteUbergraph_UIW_ExchangeShop::K2Node_ComponentBoundEvent_BtnKey_1' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ExecuteUbergraph_UIW_ExchangeShop, K2Node_ComponentBoundEvent_BtnKey) == 0x000018, "Member 'UIW_ExchangeShop_C_ExecuteUbergraph_UIW_ExchangeShop::K2Node_ComponentBoundEvent_BtnKey' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ExecuteUbergraph_UIW_ExchangeShop, K2Node_MakeArray_Array) == 0x000020, "Member 'UIW_ExchangeShop_C_ExecuteUbergraph_UIW_ExchangeShop::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ExecuteUbergraph_UIW_ExchangeShop, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'UIW_ExchangeShop_C_ExecuteUbergraph_UIW_ExchangeShop::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ExecuteUbergraph_UIW_ExchangeShop, CallFunc_GetMainWidget_MainWidget_1) == 0x000038, "Member 'UIW_ExchangeShop_C_ExecuteUbergraph_UIW_ExchangeShop::CallFunc_GetMainWidget_MainWidget_1' has a wrong offset!");

// Function UIW_ExchangeShop.UIW_ExchangeShop_C.BndEvt__UIW_Shop_Btn_Select_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_ExchangeShop_C_BndEvt__UIW_Shop_Btn_Select_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ExchangeShop_C_BndEvt__UIW_Shop_Btn_Select_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_ExchangeShop_C_BndEvt__UIW_Shop_Btn_Select_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature");
static_assert(sizeof(UIW_ExchangeShop_C_BndEvt__UIW_Shop_Btn_Select_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_ExchangeShop_C_BndEvt__UIW_Shop_Btn_Select_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature");
static_assert(offsetof(UIW_ExchangeShop_C_BndEvt__UIW_Shop_Btn_Select_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_ExchangeShop_C_BndEvt__UIW_Shop_Btn_Select_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_ExchangeShop.UIW_ExchangeShop_C.BndEvt__UIW_Shop_Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_ExchangeShop_C_BndEvt__UIW_Shop_Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ExchangeShop_C_BndEvt__UIW_Shop_Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_ExchangeShop_C_BndEvt__UIW_Shop_Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature");
static_assert(sizeof(UIW_ExchangeShop_C_BndEvt__UIW_Shop_Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_ExchangeShop_C_BndEvt__UIW_Shop_Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature");
static_assert(offsetof(UIW_ExchangeShop_C_BndEvt__UIW_Shop_Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_ExchangeShop_C_BndEvt__UIW_Shop_Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_ExchangeShop.UIW_ExchangeShop_C.OnReady
// 0x05A0 (0x05A0 - 0x0000)
struct UIW_ExchangeShop_C_OnReady final
{
public:
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScrollBarStyle                        CallFunc_GetScrollBarStyle_ScrollBarStyle;         // 0x0008(0x04D0)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x04D8(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x04F0(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_2;         // 0x0508(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_3;         // 0x0520(0x0018)()
	TDelegate<void(class UObject* Item)>          K2Node_CreateDelegate_OutputDelegate;              // 0x0538(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Item, bool bIsSelected)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0548(0x0010)(ZeroConstructor, NoDestructor)
	class ULProductSpecialShop*                   CallFunc_GetSpecialShop_ReturnValue;               // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_561[0x3];                                      // 0x0561(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0564(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Item, bool bIsSelected)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x056C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UUIW_Btn_Key_C* BtnKey)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x057C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UUIW_Btn_Key_C* BtnKey)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x058C(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(UIW_ExchangeShop_C_OnReady) == 0x000008, "Wrong alignment on UIW_ExchangeShop_C_OnReady");
static_assert(sizeof(UIW_ExchangeShop_C_OnReady) == 0x0005A0, "Wrong size on UIW_ExchangeShop_C_OnReady");
static_assert(offsetof(UIW_ExchangeShop_C_OnReady, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'UIW_ExchangeShop_C_OnReady::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_OnReady, CallFunc_GetScrollBarStyle_ScrollBarStyle) == 0x000008, "Member 'UIW_ExchangeShop_C_OnReady::CallFunc_GetScrollBarStyle_ScrollBarStyle' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_OnReady, CallFunc_GetGameStrWithName_ReturnValue) == 0x0004D8, "Member 'UIW_ExchangeShop_C_OnReady::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_OnReady, CallFunc_GetGameStrWithName_ReturnValue_1) == 0x0004F0, "Member 'UIW_ExchangeShop_C_OnReady::CallFunc_GetGameStrWithName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_OnReady, CallFunc_GetGameStrWithName_ReturnValue_2) == 0x000508, "Member 'UIW_ExchangeShop_C_OnReady::CallFunc_GetGameStrWithName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_OnReady, CallFunc_GetGameStrWithName_ReturnValue_3) == 0x000520, "Member 'UIW_ExchangeShop_C_OnReady::CallFunc_GetGameStrWithName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_OnReady, K2Node_CreateDelegate_OutputDelegate) == 0x000538, "Member 'UIW_ExchangeShop_C_OnReady::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_OnReady, K2Node_CreateDelegate_OutputDelegate_1) == 0x000548, "Member 'UIW_ExchangeShop_C_OnReady::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_OnReady, CallFunc_GetSpecialShop_ReturnValue) == 0x000558, "Member 'UIW_ExchangeShop_C_OnReady::CallFunc_GetSpecialShop_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_OnReady, CallFunc_NotEqual_NameName_ReturnValue) == 0x000560, "Member 'UIW_ExchangeShop_C_OnReady::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_OnReady, Temp_name_Variable) == 0x000564, "Member 'UIW_ExchangeShop_C_OnReady::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_OnReady, K2Node_CreateDelegate_OutputDelegate_2) == 0x00056C, "Member 'UIW_ExchangeShop_C_OnReady::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_OnReady, K2Node_CreateDelegate_OutputDelegate_3) == 0x00057C, "Member 'UIW_ExchangeShop_C_OnReady::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_OnReady, K2Node_CreateDelegate_OutputDelegate_4) == 0x00058C, "Member 'UIW_ExchangeShop_C_OnReady::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

// Function UIW_ExchangeShop.UIW_ExchangeShop_C.MoveLeftTab
// 0x0008 (0x0008 - 0x0000)
struct UIW_ExchangeShop_C_MoveLeftTab final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ExchangeShop_C_MoveLeftTab) == 0x000008, "Wrong alignment on UIW_ExchangeShop_C_MoveLeftTab");
static_assert(sizeof(UIW_ExchangeShop_C_MoveLeftTab) == 0x000008, "Wrong size on UIW_ExchangeShop_C_MoveLeftTab");
static_assert(offsetof(UIW_ExchangeShop_C_MoveLeftTab, BtnKey) == 0x000000, "Member 'UIW_ExchangeShop_C_MoveLeftTab::BtnKey' has a wrong offset!");

// Function UIW_ExchangeShop.UIW_ExchangeShop_C.MoveRightTab
// 0x0008 (0x0008 - 0x0000)
struct UIW_ExchangeShop_C_MoveRightTab final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ExchangeShop_C_MoveRightTab) == 0x000008, "Wrong alignment on UIW_ExchangeShop_C_MoveRightTab");
static_assert(sizeof(UIW_ExchangeShop_C_MoveRightTab) == 0x000008, "Wrong size on UIW_ExchangeShop_C_MoveRightTab");
static_assert(offsetof(UIW_ExchangeShop_C_MoveRightTab, BtnKey) == 0x000000, "Member 'UIW_ExchangeShop_C_MoveRightTab::BtnKey' has a wrong offset!");

// Function UIW_ExchangeShop.UIW_ExchangeShop_C.RefreshTab
// 0x00F8 (0x00F8 - 0x0000)
struct UIW_ExchangeShop_C_RefreshTab final
{
public:
	TArray<ELItemFirstCategory>                   LocalCategoryList;                                 // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<class UUIBP_ListData_FirstCategory_C*> LocalListData;                                     // 0x0010(0x0010)(Edit, BlueprintVisible)
	class ULUISystem*                             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_FirstCategory_C*         CallFunc_SpawnObject_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_FirstCategory_C*         CallFunc_SpawnObject_ReturnValue_1;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELItemFirstCategory                           CallFunc_Array_Get_Item;                           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0068(0x0018)()
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<ELItemFirstCategory>                     CallFunc_GetBuyCategorys_ReturnValue;              // 0x0088(0x0050)()
	TArray<ELItemFirstCategory>                   CallFunc_Set_ToArray_Result;                       // 0x00D8(0x0010)(ReferenceParm)
	TArray<ELItemFirstCategory>                   CallFunc_SortFirstCategory_CategoryListResult;     // 0x00E8(0x0010)(ReferenceParm)
};
static_assert(alignof(UIW_ExchangeShop_C_RefreshTab) == 0x000008, "Wrong alignment on UIW_ExchangeShop_C_RefreshTab");
static_assert(sizeof(UIW_ExchangeShop_C_RefreshTab) == 0x0000F8, "Wrong size on UIW_ExchangeShop_C_RefreshTab");
static_assert(offsetof(UIW_ExchangeShop_C_RefreshTab, LocalCategoryList) == 0x000000, "Member 'UIW_ExchangeShop_C_RefreshTab::LocalCategoryList' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_RefreshTab, LocalListData) == 0x000010, "Member 'UIW_ExchangeShop_C_RefreshTab::LocalListData' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_RefreshTab, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'UIW_ExchangeShop_C_RefreshTab::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_RefreshTab, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000028, "Member 'UIW_ExchangeShop_C_RefreshTab::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_RefreshTab, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'UIW_ExchangeShop_C_RefreshTab::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_RefreshTab, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'UIW_ExchangeShop_C_RefreshTab::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_RefreshTab, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'UIW_ExchangeShop_C_RefreshTab::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_RefreshTab, CallFunc_SpawnObject_ReturnValue) == 0x000038, "Member 'UIW_ExchangeShop_C_RefreshTab::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_RefreshTab, CallFunc_Array_Add_ReturnValue) == 0x000040, "Member 'UIW_ExchangeShop_C_RefreshTab::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_RefreshTab, CallFunc_SpawnObject_ReturnValue_1) == 0x000048, "Member 'UIW_ExchangeShop_C_RefreshTab::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_RefreshTab, CallFunc_MakeLiteralByte_ReturnValue) == 0x000050, "Member 'UIW_ExchangeShop_C_RefreshTab::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_RefreshTab, CallFunc_Array_Add_ReturnValue_1) == 0x000054, "Member 'UIW_ExchangeShop_C_RefreshTab::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_RefreshTab, CallFunc_Array_Get_Item) == 0x000058, "Member 'UIW_ExchangeShop_C_RefreshTab::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_RefreshTab, CallFunc_Array_Length_ReturnValue) == 0x00005C, "Member 'UIW_ExchangeShop_C_RefreshTab::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_RefreshTab, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'UIW_ExchangeShop_C_RefreshTab::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_RefreshTab, CallFunc_Array_Length_ReturnValue_1) == 0x000064, "Member 'UIW_ExchangeShop_C_RefreshTab::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_RefreshTab, CallFunc_GetGameStrWithName_ReturnValue) == 0x000068, "Member 'UIW_ExchangeShop_C_RefreshTab::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_RefreshTab, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000080, "Member 'UIW_ExchangeShop_C_RefreshTab::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_RefreshTab, CallFunc_GetBuyCategorys_ReturnValue) == 0x000088, "Member 'UIW_ExchangeShop_C_RefreshTab::CallFunc_GetBuyCategorys_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_RefreshTab, CallFunc_Set_ToArray_Result) == 0x0000D8, "Member 'UIW_ExchangeShop_C_RefreshTab::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_RefreshTab, CallFunc_SortFirstCategory_CategoryListResult) == 0x0000E8, "Member 'UIW_ExchangeShop_C_RefreshTab::CallFunc_SortFirstCategory_CategoryListResult' has a wrong offset!");

// Function UIW_ExchangeShop.UIW_ExchangeShop_C.ChangeTab
// 0x00F0 (0x00F0 - 0x0000)
struct UIW_ExchangeShop_C_ChangeTab final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LocalPrevSelectedIndex;                            // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUIBP_ListData_Item_C*>          LocalLItemListData;                                // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<class UUIBP_ListData_ShopItem_C*>      LocalLProductListData;                             // 0x0020(0x0010)(Edit, BlueprintVisible)
	class UUIBP_ListData_FirstCategory_C*         K2Node_DynamicCast_AsUIBP_List_Data_First_Category; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        CallFunc_GetListItems_ReturnValue;                 // 0x0058(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_FirstCategory_C*         K2Node_DynamicCast_AsUIBP_List_Data_First_Category_1; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULProduct*>                      CallFunc_GetBuyList_ReturnValue;                   // 0x0090(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULProduct*>                      CallFunc_GetBuyList_ReturnValue_1;                 // 0x00A8(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULProduct*                              CallFunc_Array_Get_Item_1;                         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_ShopItem_C*              CallFunc_SpawnObject_ReturnValue;                  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ExchangeShop_C_ChangeTab) == 0x000008, "Wrong alignment on UIW_ExchangeShop_C_ChangeTab");
static_assert(sizeof(UIW_ExchangeShop_C_ChangeTab) == 0x0000F0, "Wrong size on UIW_ExchangeShop_C_ChangeTab");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, Item) == 0x000000, "Member 'UIW_ExchangeShop_C_ChangeTab::Item' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, bIsSelected) == 0x000008, "Member 'UIW_ExchangeShop_C_ChangeTab::bIsSelected' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, LocalPrevSelectedIndex) == 0x00000C, "Member 'UIW_ExchangeShop_C_ChangeTab::LocalPrevSelectedIndex' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, LocalLItemListData) == 0x000010, "Member 'UIW_ExchangeShop_C_ChangeTab::LocalLItemListData' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, LocalLProductListData) == 0x000020, "Member 'UIW_ExchangeShop_C_ChangeTab::LocalLProductListData' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, K2Node_DynamicCast_AsUIBP_List_Data_First_Category) == 0x000030, "Member 'UIW_ExchangeShop_C_ChangeTab::K2Node_DynamicCast_AsUIBP_List_Data_First_Category' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'UIW_ExchangeShop_C_ChangeTab::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'UIW_ExchangeShop_C_ChangeTab::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'UIW_ExchangeShop_C_ChangeTab::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000044, "Member 'UIW_ExchangeShop_C_ChangeTab::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, Temp_int_Array_Index_Variable) == 0x000048, "Member 'UIW_ExchangeShop_C_ChangeTab::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, Temp_int_Array_Index_Variable_1) == 0x00004C, "Member 'UIW_ExchangeShop_C_ChangeTab::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, Temp_int_Loop_Counter_Variable_1) == 0x000050, "Member 'UIW_ExchangeShop_C_ChangeTab::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, CallFunc_GetListItems_ReturnValue) == 0x000058, "Member 'UIW_ExchangeShop_C_ChangeTab::CallFunc_GetListItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, CallFunc_Add_IntInt_ReturnValue_1) == 0x000068, "Member 'UIW_ExchangeShop_C_ChangeTab::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, CallFunc_Array_Get_Item) == 0x000070, "Member 'UIW_ExchangeShop_C_ChangeTab::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, K2Node_DynamicCast_AsUIBP_List_Data_First_Category_1) == 0x000078, "Member 'UIW_ExchangeShop_C_ChangeTab::K2Node_DynamicCast_AsUIBP_List_Data_First_Category_1' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'UIW_ExchangeShop_C_ChangeTab::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, CallFunc_Array_Length_ReturnValue) == 0x000084, "Member 'UIW_ExchangeShop_C_ChangeTab::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'UIW_ExchangeShop_C_ChangeTab::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, CallFunc_GetBuyList_ReturnValue) == 0x000090, "Member 'UIW_ExchangeShop_C_ChangeTab::CallFunc_GetBuyList_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000A0, "Member 'UIW_ExchangeShop_C_ChangeTab::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, CallFunc_GetBuyList_ReturnValue_1) == 0x0000A8, "Member 'UIW_ExchangeShop_C_ChangeTab::CallFunc_GetBuyList_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, CallFunc_GetNumItems_ReturnValue) == 0x0000B8, "Member 'UIW_ExchangeShop_C_ChangeTab::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000BC, "Member 'UIW_ExchangeShop_C_ChangeTab::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, CallFunc_Array_Get_Item_1) == 0x0000C0, "Member 'UIW_ExchangeShop_C_ChangeTab::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, CallFunc_Array_Length_ReturnValue_1) == 0x0000C8, "Member 'UIW_ExchangeShop_C_ChangeTab::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000CC, "Member 'UIW_ExchangeShop_C_ChangeTab::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x0000D0, "Member 'UIW_ExchangeShop_C_ChangeTab::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, CallFunc_GetIndexForItem_ReturnValue) == 0x0000D8, "Member 'UIW_ExchangeShop_C_ChangeTab::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, CallFunc_Min_ReturnValue) == 0x0000DC, "Member 'UIW_ExchangeShop_C_ChangeTab::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, CallFunc_SpawnObject_ReturnValue) == 0x0000E0, "Member 'UIW_ExchangeShop_C_ChangeTab::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_ChangeTab, CallFunc_Array_Add_ReturnValue) == 0x0000E8, "Member 'UIW_ExchangeShop_C_ChangeTab::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function UIW_ExchangeShop.UIW_ExchangeShop_C.FocusManage
// 0x02D8 (0x02D8 - 0x0000)
struct UIW_ExchangeShop_C_FocusManage final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_FocusManage_ReturnValue;                  // 0x0160(0x00B8)()
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0220(0x00B8)()
};
static_assert(alignof(UIW_ExchangeShop_C_FocusManage) == 0x000008, "Wrong alignment on UIW_ExchangeShop_C_FocusManage");
static_assert(sizeof(UIW_ExchangeShop_C_FocusManage) == 0x0002D8, "Wrong size on UIW_ExchangeShop_C_FocusManage");
static_assert(offsetof(UIW_ExchangeShop_C_FocusManage, MyGeometry) == 0x000000, "Member 'UIW_ExchangeShop_C_FocusManage::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_FocusManage, MouseEvent) == 0x000038, "Member 'UIW_ExchangeShop_C_FocusManage::MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_FocusManage, ReturnValue) == 0x0000A8, "Member 'UIW_ExchangeShop_C_FocusManage::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_FocusManage, CallFunc_FocusManage_ReturnValue) == 0x000160, "Member 'UIW_ExchangeShop_C_FocusManage::CallFunc_FocusManage_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_FocusManage, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x000218, "Member 'UIW_ExchangeShop_C_FocusManage::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_FocusManage, CallFunc_Handled_ReturnValue) == 0x000220, "Member 'UIW_ExchangeShop_C_FocusManage::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UIW_ExchangeShop.UIW_ExchangeShop_C.SetSelectedItem
// 0x01D8 (0x01D8 - 0x0000)
struct UIW_ExchangeShop_C_SetSelectedItem final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLVariableData>                 LocalVariableData;                                 // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<class UUIBP_ListData_Resource_C*>      LocalListItems;                                    // 0x0020(0x0010)(Edit, BlueprintVisible)
	class ULWeaponItem*                           LocalLWeaponItem;                                  // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 LocalLItem;                                        // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0040(0x0028)()
	class UUIBP_ListData_ShopItem_C*              K2Node_DynamicCast_AsUIBP_List_Data_Shop_Item;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 CallFunc_GetItem_ReturnValue;                      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 CallFunc_GetHeroicImageResource_ReturnValue;       // 0x0090(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsHeroicWeapon_ReturnValue;               // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanBuyInfinity_ReturnValue;               // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUIBP_ListData_Resource_C*>      CallFunc_MakeResourceList_ResourceList;            // 0x00C0(0x0010)(ReferenceParm)
	int32                                         CallFunc_StockCount_ReturnValue;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D6[0x2];                                       // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetWeaponByname_ItemName;                 // 0x00D8(0x0018)()
	struct FItemCommonInfoPtr                     CallFunc_GetCommonInfo_ReturnValue;                // 0x00F0(0x0008)(NoDestructor)
	class FText                                   CallFunc_GetLocalTextItemNameLocalize_ReturnValue; // 0x00F8(0x0018)()
	struct FItemCommonInfoPtr                     CallFunc_GetHandleCommonInfo_ReturnValue;          // 0x0110(0x0008)(NoDestructor)
	TSoftObjectPtr<class UObject>                 CallFunc_GetImageResource_ReturnValue;             // 0x0118(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	struct FItemCommonInfoPtr                     CallFunc_GetBladeCommonInfo_ReturnValue;           // 0x0140(0x0008)(NoDestructor)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0148(0x0028)()
	TSoftObjectPtr<class UObject>                 CallFunc_GetImageResource_ReturnValue_1;           // 0x0170(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	struct FItemCommonInfoPtr                     CallFunc_GetCommonInfo_ReturnValue_1;              // 0x0198(0x0008)(NoDestructor)
	TSoftObjectPtr<class UObject>                 CallFunc_GetImageResource_ReturnValue_2;           // 0x01A0(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class ULWeaponItem*                           K2Node_DynamicCast_AsLWeapon_Item;                 // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ExchangeShop_C_SetSelectedItem) == 0x000008, "Wrong alignment on UIW_ExchangeShop_C_SetSelectedItem");
static_assert(sizeof(UIW_ExchangeShop_C_SetSelectedItem) == 0x0001D8, "Wrong size on UIW_ExchangeShop_C_SetSelectedItem");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, Item) == 0x000000, "Member 'UIW_ExchangeShop_C_SetSelectedItem::Item' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, bIsSelected) == 0x000008, "Member 'UIW_ExchangeShop_C_SetSelectedItem::bIsSelected' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, LocalVariableData) == 0x000010, "Member 'UIW_ExchangeShop_C_SetSelectedItem::LocalVariableData' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, LocalListItems) == 0x000020, "Member 'UIW_ExchangeShop_C_SetSelectedItem::LocalListItems' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, LocalLWeaponItem) == 0x000030, "Member 'UIW_ExchangeShop_C_SetSelectedItem::LocalLWeaponItem' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, LocalLItem) == 0x000038, "Member 'UIW_ExchangeShop_C_SetSelectedItem::LocalLItem' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, K2Node_MakeStruct_SlateColor) == 0x000040, "Member 'UIW_ExchangeShop_C_SetSelectedItem::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, K2Node_DynamicCast_AsUIBP_List_Data_Shop_Item) == 0x000068, "Member 'UIW_ExchangeShop_C_SetSelectedItem::K2Node_DynamicCast_AsUIBP_List_Data_Shop_Item' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'UIW_ExchangeShop_C_SetSelectedItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, CallFunc_GetItem_ReturnValue) == 0x000078, "Member 'UIW_ExchangeShop_C_SetSelectedItem::CallFunc_GetItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, CallFunc_GetMainWidget_MainWidget) == 0x000080, "Member 'UIW_ExchangeShop_C_SetSelectedItem::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, CallFunc_GetIndexForItem_ReturnValue) == 0x000088, "Member 'UIW_ExchangeShop_C_SetSelectedItem::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00008C, "Member 'UIW_ExchangeShop_C_SetSelectedItem::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, CallFunc_GetHeroicImageResource_ReturnValue) == 0x000090, "Member 'UIW_ExchangeShop_C_SetSelectedItem::CallFunc_GetHeroicImageResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, CallFunc_IsHeroicWeapon_ReturnValue) == 0x0000B8, "Member 'UIW_ExchangeShop_C_SetSelectedItem::CallFunc_IsHeroicWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, CallFunc_CanBuyInfinity_ReturnValue) == 0x0000B9, "Member 'UIW_ExchangeShop_C_SetSelectedItem::CallFunc_CanBuyInfinity_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, CallFunc_MakeResourceList_ResourceList) == 0x0000C0, "Member 'UIW_ExchangeShop_C_SetSelectedItem::CallFunc_MakeResourceList_ResourceList' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, CallFunc_StockCount_ReturnValue) == 0x0000D0, "Member 'UIW_ExchangeShop_C_SetSelectedItem::CallFunc_StockCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D4, "Member 'UIW_ExchangeShop_C_SetSelectedItem::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, CallFunc_BooleanOR_ReturnValue) == 0x0000D5, "Member 'UIW_ExchangeShop_C_SetSelectedItem::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, CallFunc_GetWeaponByname_ItemName) == 0x0000D8, "Member 'UIW_ExchangeShop_C_SetSelectedItem::CallFunc_GetWeaponByname_ItemName' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, CallFunc_GetCommonInfo_ReturnValue) == 0x0000F0, "Member 'UIW_ExchangeShop_C_SetSelectedItem::CallFunc_GetCommonInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, CallFunc_GetLocalTextItemNameLocalize_ReturnValue) == 0x0000F8, "Member 'UIW_ExchangeShop_C_SetSelectedItem::CallFunc_GetLocalTextItemNameLocalize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, CallFunc_GetHandleCommonInfo_ReturnValue) == 0x000110, "Member 'UIW_ExchangeShop_C_SetSelectedItem::CallFunc_GetHandleCommonInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, CallFunc_GetImageResource_ReturnValue) == 0x000118, "Member 'UIW_ExchangeShop_C_SetSelectedItem::CallFunc_GetImageResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, CallFunc_GetBladeCommonInfo_ReturnValue) == 0x000140, "Member 'UIW_ExchangeShop_C_SetSelectedItem::CallFunc_GetBladeCommonInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, K2Node_MakeStruct_SlateColor_1) == 0x000148, "Member 'UIW_ExchangeShop_C_SetSelectedItem::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, CallFunc_GetImageResource_ReturnValue_1) == 0x000170, "Member 'UIW_ExchangeShop_C_SetSelectedItem::CallFunc_GetImageResource_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, CallFunc_GetCommonInfo_ReturnValue_1) == 0x000198, "Member 'UIW_ExchangeShop_C_SetSelectedItem::CallFunc_GetCommonInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, CallFunc_GetImageResource_ReturnValue_2) == 0x0001A0, "Member 'UIW_ExchangeShop_C_SetSelectedItem::CallFunc_GetImageResource_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, K2Node_DynamicCast_AsLWeapon_Item) == 0x0001C8, "Member 'UIW_ExchangeShop_C_SetSelectedItem::K2Node_DynamicCast_AsLWeapon_Item' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_SetSelectedItem, K2Node_DynamicCast_bSuccess_1) == 0x0001D0, "Member 'UIW_ExchangeShop_C_SetSelectedItem::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function UIW_ExchangeShop.UIW_ExchangeShop_C.DoubleClickListItem
// 0x0008 (0x0008 - 0x0000)
struct UIW_ExchangeShop_C_DoubleClickListItem final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ExchangeShop_C_DoubleClickListItem) == 0x000008, "Wrong alignment on UIW_ExchangeShop_C_DoubleClickListItem");
static_assert(sizeof(UIW_ExchangeShop_C_DoubleClickListItem) == 0x000008, "Wrong size on UIW_ExchangeShop_C_DoubleClickListItem");
static_assert(offsetof(UIW_ExchangeShop_C_DoubleClickListItem, Item) == 0x000000, "Member 'UIW_ExchangeShop_C_DoubleClickListItem::Item' has a wrong offset!");

// Function UIW_ExchangeShop.UIW_ExchangeShop_C.CallbackExchange
// 0x0028 (0x0028 - 0x0000)
struct UIW_ExchangeShop_C_CallbackExchange final
{
public:
	class UUIW_Popup_C*                           Popup;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Buy_ReturnValue;                          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ExchangeShop_C_CallbackExchange) == 0x000008, "Wrong alignment on UIW_ExchangeShop_C_CallbackExchange");
static_assert(sizeof(UIW_ExchangeShop_C_CallbackExchange) == 0x000028, "Wrong size on UIW_ExchangeShop_C_CallbackExchange");
static_assert(offsetof(UIW_ExchangeShop_C_CallbackExchange, Popup) == 0x000000, "Member 'UIW_ExchangeShop_C_CallbackExchange::Popup' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_CallbackExchange, BtnKey) == 0x000008, "Member 'UIW_ExchangeShop_C_CallbackExchange::BtnKey' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_CallbackExchange, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'UIW_ExchangeShop_C_CallbackExchange::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_CallbackExchange, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x000018, "Member 'UIW_ExchangeShop_C_CallbackExchange::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_CallbackExchange, CallFunc_Buy_ReturnValue) == 0x000020, "Member 'UIW_ExchangeShop_C_CallbackExchange::CallFunc_Buy_ReturnValue' has a wrong offset!");

// Function UIW_ExchangeShop.UIW_ExchangeShop_C.OnSinnperUp
// 0x0028 (0x0028 - 0x0000)
struct UIW_ExchangeShop_C_OnSinnperUp final
{
public:
	class UUIW_Spinner_C*                         Spinner;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_Value;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUIBP_ListData_Resource_C*>      CallFunc_MakeResourceList_ResourceList;            // 0x0010(0x0010)(ReferenceParm)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ExchangeShop_C_OnSinnperUp) == 0x000008, "Wrong alignment on UIW_ExchangeShop_C_OnSinnperUp");
static_assert(sizeof(UIW_ExchangeShop_C_OnSinnperUp) == 0x000028, "Wrong size on UIW_ExchangeShop_C_OnSinnperUp");
static_assert(offsetof(UIW_ExchangeShop_C_OnSinnperUp, Spinner) == 0x000000, "Member 'UIW_ExchangeShop_C_OnSinnperUp::Spinner' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_OnSinnperUp, CallFunc_GetValue_Value) == 0x000008, "Member 'UIW_ExchangeShop_C_OnSinnperUp::CallFunc_GetValue_Value' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_OnSinnperUp, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'UIW_ExchangeShop_C_OnSinnperUp::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_OnSinnperUp, CallFunc_MakeResourceList_ResourceList) == 0x000010, "Member 'UIW_ExchangeShop_C_OnSinnperUp::CallFunc_MakeResourceList_ResourceList' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_OnSinnperUp, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000020, "Member 'UIW_ExchangeShop_C_OnSinnperUp::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function UIW_ExchangeShop.UIW_ExchangeShop_C.OnSpiinerDown
// 0x0028 (0x0028 - 0x0000)
struct UIW_ExchangeShop_C_OnSpiinerDown final
{
public:
	class UUIW_Spinner_C*                         Spinner;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_Value;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUIBP_ListData_Resource_C*>      CallFunc_MakeResourceList_ResourceList;            // 0x0010(0x0010)(ReferenceParm)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ExchangeShop_C_OnSpiinerDown) == 0x000008, "Wrong alignment on UIW_ExchangeShop_C_OnSpiinerDown");
static_assert(sizeof(UIW_ExchangeShop_C_OnSpiinerDown) == 0x000028, "Wrong size on UIW_ExchangeShop_C_OnSpiinerDown");
static_assert(offsetof(UIW_ExchangeShop_C_OnSpiinerDown, Spinner) == 0x000000, "Member 'UIW_ExchangeShop_C_OnSpiinerDown::Spinner' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_OnSpiinerDown, CallFunc_GetValue_Value) == 0x000008, "Member 'UIW_ExchangeShop_C_OnSpiinerDown::CallFunc_GetValue_Value' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_OnSpiinerDown, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'UIW_ExchangeShop_C_OnSpiinerDown::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_OnSpiinerDown, CallFunc_MakeResourceList_ResourceList) == 0x000010, "Member 'UIW_ExchangeShop_C_OnSpiinerDown::CallFunc_MakeResourceList_ResourceList' has a wrong offset!");
static_assert(offsetof(UIW_ExchangeShop_C_OnSpiinerDown, CallFunc_Greater_IntInt_ReturnValue) == 0x000020, "Member 'UIW_ExchangeShop_C_OnSpiinerDown::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

