#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HasItem_Counter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_HasItem_Counter.UIW_HasItem_Counter_C
// 0x0030 (0x0298 - 0x0268)
class UUIW_HasItem_Counter_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Text_InBag;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_InBag_Value;                                  // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_InLocker;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_InLocker_Value;                               // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULStatComponent*                        LStatComponent;                                    // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_HasItem_Counter(int32 EntryPoint);
	void Construct();
	void SetItem(class ULItem* LItem);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_HasItem_Counter_C">();
	}
	static class UUIW_HasItem_Counter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_HasItem_Counter_C>();
	}
};
static_assert(alignof(UUIW_HasItem_Counter_C) == 0x000008, "Wrong alignment on UUIW_HasItem_Counter_C");
static_assert(sizeof(UUIW_HasItem_Counter_C) == 0x000298, "Wrong size on UUIW_HasItem_Counter_C");
static_assert(offsetof(UUIW_HasItem_Counter_C, UberGraphFrame) == 0x000268, "Member 'UUIW_HasItem_Counter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_HasItem_Counter_C, Text_InBag) == 0x000270, "Member 'UUIW_HasItem_Counter_C::Text_InBag' has a wrong offset!");
static_assert(offsetof(UUIW_HasItem_Counter_C, Text_InBag_Value) == 0x000278, "Member 'UUIW_HasItem_Counter_C::Text_InBag_Value' has a wrong offset!");
static_assert(offsetof(UUIW_HasItem_Counter_C, Text_InLocker) == 0x000280, "Member 'UUIW_HasItem_Counter_C::Text_InLocker' has a wrong offset!");
static_assert(offsetof(UUIW_HasItem_Counter_C, Text_InLocker_Value) == 0x000288, "Member 'UUIW_HasItem_Counter_C::Text_InLocker_Value' has a wrong offset!");
static_assert(offsetof(UUIW_HasItem_Counter_C, LStatComponent) == 0x000290, "Member 'UUIW_HasItem_Counter_C::LStatComponent' has a wrong offset!");

}

