#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HasItem_Counter

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"


namespace SDK::Params
{

// Function UIW_HasItem_Counter.UIW_HasItem_Counter_C.ExecuteUbergraph_UIW_HasItem_Counter
// 0x0050 (0x0050 - 0x0000)
struct UIW_HasItem_Counter_C_ExecuteUbergraph_UIW_HasItem_Counter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0008(0x0018)()
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x0038(0x0018)()
};
static_assert(alignof(UIW_HasItem_Counter_C_ExecuteUbergraph_UIW_HasItem_Counter) == 0x000008, "Wrong alignment on UIW_HasItem_Counter_C_ExecuteUbergraph_UIW_HasItem_Counter");
static_assert(sizeof(UIW_HasItem_Counter_C_ExecuteUbergraph_UIW_HasItem_Counter) == 0x000050, "Wrong size on UIW_HasItem_Counter_C_ExecuteUbergraph_UIW_HasItem_Counter");
static_assert(offsetof(UIW_HasItem_Counter_C_ExecuteUbergraph_UIW_HasItem_Counter, EntryPoint) == 0x000000, "Member 'UIW_HasItem_Counter_C_ExecuteUbergraph_UIW_HasItem_Counter::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_ExecuteUbergraph_UIW_HasItem_Counter, CallFunc_GetGameStrWithName_ReturnValue) == 0x000008, "Member 'UIW_HasItem_Counter_C_ExecuteUbergraph_UIW_HasItem_Counter::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_ExecuteUbergraph_UIW_HasItem_Counter, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000020, "Member 'UIW_HasItem_Counter_C_ExecuteUbergraph_UIW_HasItem_Counter::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_ExecuteUbergraph_UIW_HasItem_Counter, K2Node_DynamicCast_AsLPCCharacter) == 0x000028, "Member 'UIW_HasItem_Counter_C_ExecuteUbergraph_UIW_HasItem_Counter::K2Node_DynamicCast_AsLPCCharacter' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_ExecuteUbergraph_UIW_HasItem_Counter, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'UIW_HasItem_Counter_C_ExecuteUbergraph_UIW_HasItem_Counter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_ExecuteUbergraph_UIW_HasItem_Counter, CallFunc_GetGameStrWithName_ReturnValue_1) == 0x000038, "Member 'UIW_HasItem_Counter_C_ExecuteUbergraph_UIW_HasItem_Counter::CallFunc_GetGameStrWithName_ReturnValue_1' has a wrong offset!");

// Function UIW_HasItem_Counter.UIW_HasItem_Counter_C.SetItem
// 0x01C0 (0x01C0 - 0x0000)
struct UIW_HasItem_Counter_C_SetItem final
{
public:
	class ULItem*                                 LItem;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LocalHandleName;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LocalBladeName;                                    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalCount;                                        // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LocalCommonName;                                   // 0x001C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemCommonInfoPtr                     LocalCommonInfo;                                   // 0x0028(0x0008)(Edit, BlueprintVisible, NoDestructor)
	bool                                          CallFunc_IsWeapon_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemCommonInfoPtr                     CallFunc_GetCommonInfo_ReturnValue;                // 0x0038(0x0008)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCanKeep_ReturnValue;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMaxStackCount_ReturnValue;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ULWeaponItem*                           K2Node_DynamicCast_AsLWeapon_Item;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemHandleInfoPtr                     CallFunc_GetHandleInfo_ReturnValue;                // 0x0068(0x0008)(NoDestructor)
	class FName                                   CallFunc_GetCodeName_ReturnValue;                  // 0x0070(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCodeName_ReturnValue_1;                // 0x0078(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemBladeInfoPtr                      CallFunc_GetBladeInfo_ReturnValue;                 // 0x0080(0x0008)(NoDestructor)
	class FName                                   CallFunc_GetCodeName_ReturnValue_2;                // 0x0088(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCanKeep_ReturnValue_1;                 // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULPlayerInventory*                      CallFunc_GetPlayerInventory_ReturnValue;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemTotalCountByCodeName_ReturnValue;  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x00B0(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00C8(0x0018)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0110(0x0018)()
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerItemLocker*                     CallFunc_GetPlayerItemLocker_ReturnValue;          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWeaponTotalCountByCodeName_ReturnValue; // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0140(0x0018)()
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerItemLocker*                     CallFunc_GetPlayerItemLocker_ReturnValue_1;        // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCanStackInventory_ReturnValue;         // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetItemTotalCountByCodeName_ReturnValue_1; // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0170(0x0018)()
	class FName                                   CallFunc_GetCodeName_ReturnValue_3;                // 0x0188(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerInventory*                      CallFunc_GetPlayerInventory_ReturnValue_1;         // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWeaponTotalCountByCodeName_ReturnValue_1; // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x01A8(0x0018)()
};
static_assert(alignof(UIW_HasItem_Counter_C_SetItem) == 0x000008, "Wrong alignment on UIW_HasItem_Counter_C_SetItem");
static_assert(sizeof(UIW_HasItem_Counter_C_SetItem) == 0x0001C0, "Wrong size on UIW_HasItem_Counter_C_SetItem");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, LItem) == 0x000000, "Member 'UIW_HasItem_Counter_C_SetItem::LItem' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, LocalHandleName) == 0x000008, "Member 'UIW_HasItem_Counter_C_SetItem::LocalHandleName' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, LocalBladeName) == 0x000010, "Member 'UIW_HasItem_Counter_C_SetItem::LocalBladeName' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, LocalCount) == 0x000018, "Member 'UIW_HasItem_Counter_C_SetItem::LocalCount' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, LocalCommonName) == 0x00001C, "Member 'UIW_HasItem_Counter_C_SetItem::LocalCommonName' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, LocalCommonInfo) == 0x000028, "Member 'UIW_HasItem_Counter_C_SetItem::LocalCommonInfo' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_IsWeapon_ReturnValue) == 0x000030, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_IsWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_GetCommonInfo_ReturnValue) == 0x000038, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_GetCommonInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_GetCanKeep_ReturnValue) == 0x000041, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_GetCanKeep_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_GetMaxStackCount_ReturnValue) == 0x000044, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_GetMaxStackCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_Conv_IntToString_ReturnValue) == 0x000048, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, K2Node_DynamicCast_AsLWeapon_Item) == 0x000058, "Member 'UIW_HasItem_Counter_C_SetItem::K2Node_DynamicCast_AsLWeapon_Item' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'UIW_HasItem_Counter_C_SetItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_GetHandleInfo_ReturnValue) == 0x000068, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_GetHandleInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_GetCodeName_ReturnValue) == 0x000070, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_GetCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_GetCodeName_ReturnValue_1) == 0x000078, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_GetCodeName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_GetBladeInfo_ReturnValue) == 0x000080, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_GetBladeInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_GetCodeName_ReturnValue_2) == 0x000088, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_GetCodeName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000090, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_GetCanKeep_ReturnValue_1) == 0x000098, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_GetCanKeep_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_GetPlayerInventory_ReturnValue) == 0x0000A0, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_GetPlayerInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_GetItemTotalCountByCodeName_ReturnValue) == 0x0000A8, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_GetItemTotalCountByCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_GetGameStrWithName_ReturnValue) == 0x0000B0, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_Conv_IntToText_ReturnValue) == 0x0000C8, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_Conv_IntToString_ReturnValue_1) == 0x0000E0, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_Concat_StrStr_ReturnValue) == 0x0000F0, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000100, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_Conv_StringToText_ReturnValue) == 0x000110, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000128, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_GetPlayerItemLocker_ReturnValue) == 0x000130, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_GetPlayerItemLocker_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_GetWeaponTotalCountByCodeName_ReturnValue) == 0x000138, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_GetWeaponTotalCountByCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000140, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000158, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_GetPlayerItemLocker_ReturnValue_1) == 0x000160, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_GetPlayerItemLocker_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_GetCanStackInventory_ReturnValue) == 0x000168, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_GetCanStackInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_GetItemTotalCountByCodeName_ReturnValue_1) == 0x00016C, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_GetItemTotalCountByCodeName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000170, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_GetCodeName_ReturnValue_3) == 0x000188, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_GetCodeName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000190, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_GetPlayerInventory_ReturnValue_1) == 0x000198, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_GetPlayerInventory_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_GetWeaponTotalCountByCodeName_ReturnValue_1) == 0x0001A0, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_GetWeaponTotalCountByCodeName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HasItem_Counter_C_SetItem, CallFunc_Conv_IntToText_ReturnValue_3) == 0x0001A8, "Member 'UIW_HasItem_Counter_C_SetItem::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");

}

