#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Loading

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Loading.UIW_Loading_C
// 0x0088 (0x0338 - 0x02B0)
class UUIW_Loading_C final : public ULLoadingWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Bg_Desk;                                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bg_Photo;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Shadow_3;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bg_Tip;                                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Next;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DebugBox;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx;                                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_ChNose;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Loading;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Paper_Center;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIBP_LRichKeyTextBlock_C*              Text;                                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Desc;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Progress;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         LoadingProgress;                                   // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FlowTime;                                          // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULWorldLoadScreenInfo*                  LoadScreenInfo;                                    // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LoadingTipIndex;                                   // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_Loading(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void SetGauge(float Value);
	void ReleaseKey();
	void InitLoadingWidget();
	void PrintTipText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Loading_C">();
	}
	static class UUIW_Loading_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Loading_C>();
	}
};
static_assert(alignof(UUIW_Loading_C) == 0x000008, "Wrong alignment on UUIW_Loading_C");
static_assert(sizeof(UUIW_Loading_C) == 0x000338, "Wrong size on UUIW_Loading_C");
static_assert(offsetof(UUIW_Loading_C, UberGraphFrame) == 0x0002B0, "Member 'UUIW_Loading_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_Loading_C, Bg_Desk) == 0x0002B8, "Member 'UUIW_Loading_C::Bg_Desk' has a wrong offset!");
static_assert(offsetof(UUIW_Loading_C, Bg_Photo) == 0x0002C0, "Member 'UUIW_Loading_C::Bg_Photo' has a wrong offset!");
static_assert(offsetof(UUIW_Loading_C, BG_Shadow_3) == 0x0002C8, "Member 'UUIW_Loading_C::BG_Shadow_3' has a wrong offset!");
static_assert(offsetof(UUIW_Loading_C, Bg_Tip) == 0x0002D0, "Member 'UUIW_Loading_C::Bg_Tip' has a wrong offset!");
static_assert(offsetof(UUIW_Loading_C, Btn_Next) == 0x0002D8, "Member 'UUIW_Loading_C::Btn_Next' has a wrong offset!");
static_assert(offsetof(UUIW_Loading_C, DebugBox) == 0x0002E0, "Member 'UUIW_Loading_C::DebugBox' has a wrong offset!");
static_assert(offsetof(UUIW_Loading_C, Fx) == 0x0002E8, "Member 'UUIW_Loading_C::Fx' has a wrong offset!");
static_assert(offsetof(UUIW_Loading_C, Img_ChNose) == 0x0002F0, "Member 'UUIW_Loading_C::Img_ChNose' has a wrong offset!");
static_assert(offsetof(UUIW_Loading_C, Img_Loading) == 0x0002F8, "Member 'UUIW_Loading_C::Img_Loading' has a wrong offset!");
static_assert(offsetof(UUIW_Loading_C, Img_Paper_Center) == 0x000300, "Member 'UUIW_Loading_C::Img_Paper_Center' has a wrong offset!");
static_assert(offsetof(UUIW_Loading_C, Text) == 0x000308, "Member 'UUIW_Loading_C::Text' has a wrong offset!");
static_assert(offsetof(UUIW_Loading_C, Text_Desc) == 0x000310, "Member 'UUIW_Loading_C::Text_Desc' has a wrong offset!");
static_assert(offsetof(UUIW_Loading_C, Text_Progress) == 0x000318, "Member 'UUIW_Loading_C::Text_Progress' has a wrong offset!");
static_assert(offsetof(UUIW_Loading_C, LoadingProgress) == 0x000320, "Member 'UUIW_Loading_C::LoadingProgress' has a wrong offset!");
static_assert(offsetof(UUIW_Loading_C, FlowTime) == 0x000324, "Member 'UUIW_Loading_C::FlowTime' has a wrong offset!");
static_assert(offsetof(UUIW_Loading_C, LoadScreenInfo) == 0x000328, "Member 'UUIW_Loading_C::LoadScreenInfo' has a wrong offset!");
static_assert(offsetof(UUIW_Loading_C, LoadingTipIndex) == 0x000330, "Member 'UUIW_Loading_C::LoadingTipIndex' has a wrong offset!");

}

