#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HUD_Gauge_FrenzyItem

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UIW_HUD_Gauge_FrenzyItem.UIW_HUD_Gauge_FrenzyItem_C.ExecuteUbergraph_UIW_HUD_Gauge_FrenzyItem
// 0x0040 (0x0040 - 0x0000)
struct UIW_HUD_Gauge_FrenzyItem_C_ExecuteUbergraph_UIW_HUD_Gauge_FrenzyItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName CategoryName)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HUD_Gauge_FrenzyItem_C_ExecuteUbergraph_UIW_HUD_Gauge_FrenzyItem) == 0x000008, "Wrong alignment on UIW_HUD_Gauge_FrenzyItem_C_ExecuteUbergraph_UIW_HUD_Gauge_FrenzyItem");
static_assert(sizeof(UIW_HUD_Gauge_FrenzyItem_C_ExecuteUbergraph_UIW_HUD_Gauge_FrenzyItem) == 0x000040, "Wrong size on UIW_HUD_Gauge_FrenzyItem_C_ExecuteUbergraph_UIW_HUD_Gauge_FrenzyItem");
static_assert(offsetof(UIW_HUD_Gauge_FrenzyItem_C_ExecuteUbergraph_UIW_HUD_Gauge_FrenzyItem, EntryPoint) == 0x000000, "Member 'UIW_HUD_Gauge_FrenzyItem_C_ExecuteUbergraph_UIW_HUD_Gauge_FrenzyItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_FrenzyItem_C_ExecuteUbergraph_UIW_HUD_Gauge_FrenzyItem, CallFunc_MakeVector2D_ReturnValue) == 0x000004, "Member 'UIW_HUD_Gauge_FrenzyItem_C_ExecuteUbergraph_UIW_HUD_Gauge_FrenzyItem::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_FrenzyItem_C_ExecuteUbergraph_UIW_HUD_Gauge_FrenzyItem, CallFunc_MakeVector2D_ReturnValue_1) == 0x00000C, "Member 'UIW_HUD_Gauge_FrenzyItem_C_ExecuteUbergraph_UIW_HUD_Gauge_FrenzyItem::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_FrenzyItem_C_ExecuteUbergraph_UIW_HUD_Gauge_FrenzyItem, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'UIW_HUD_Gauge_FrenzyItem_C_ExecuteUbergraph_UIW_HUD_Gauge_FrenzyItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_FrenzyItem_C_ExecuteUbergraph_UIW_HUD_Gauge_FrenzyItem, K2Node_Event_IsDesignTime) == 0x000024, "Member 'UIW_HUD_Gauge_FrenzyItem_C_ExecuteUbergraph_UIW_HUD_Gauge_FrenzyItem::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_FrenzyItem_C_ExecuteUbergraph_UIW_HUD_Gauge_FrenzyItem, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000028, "Member 'UIW_HUD_Gauge_FrenzyItem_C_ExecuteUbergraph_UIW_HUD_Gauge_FrenzyItem::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_FrenzyItem_C_ExecuteUbergraph_UIW_HUD_Gauge_FrenzyItem, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000030, "Member 'UIW_HUD_Gauge_FrenzyItem_C_ExecuteUbergraph_UIW_HUD_Gauge_FrenzyItem::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_FrenzyItem_C_ExecuteUbergraph_UIW_HUD_Gauge_FrenzyItem, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000038, "Member 'UIW_HUD_Gauge_FrenzyItem_C_ExecuteUbergraph_UIW_HUD_Gauge_FrenzyItem::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function UIW_HUD_Gauge_FrenzyItem.UIW_HUD_Gauge_FrenzyItem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UIW_HUD_Gauge_FrenzyItem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_HUD_Gauge_FrenzyItem_C_PreConstruct) == 0x000001, "Wrong alignment on UIW_HUD_Gauge_FrenzyItem_C_PreConstruct");
static_assert(sizeof(UIW_HUD_Gauge_FrenzyItem_C_PreConstruct) == 0x000001, "Wrong size on UIW_HUD_Gauge_FrenzyItem_C_PreConstruct");
static_assert(offsetof(UIW_HUD_Gauge_FrenzyItem_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UIW_HUD_Gauge_FrenzyItem_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UIW_HUD_Gauge_FrenzyItem.UIW_HUD_Gauge_FrenzyItem_C.RefreshPoint
// 0x0068 (0x0068 - 0x0000)
struct UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUsed;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTweenEase                             K2Node_MakeStruct_TweenEase;                       // 0x0008(0x000C)(NoDestructor)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_1;                     // 0x0020(0x000C)(NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint) == 0x000008, "Wrong alignment on UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint");
static_assert(sizeof(UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint) == 0x000068, "Wrong size on UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint");
static_assert(offsetof(UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint, Value) == 0x000000, "Member 'UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint::Value' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint, IsUsed) == 0x000004, "Member 'UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint::IsUsed' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint, K2Node_MakeStruct_TweenEase) == 0x000008, "Member 'UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint::K2Node_MakeStruct_TweenEase' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint, CallFunc_MakeVector2D_ReturnValue) == 0x000014, "Member 'UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x00001C, "Member 'UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint, K2Node_MakeStruct_TweenEase_1) == 0x000020, "Member 'UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint::K2Node_MakeStruct_TweenEase_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00002C, "Member 'UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000030, "Member 'UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint, CallFunc_MakeVector2D_ReturnValue_1) == 0x000038, "Member 'UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint, CallFunc_Less_FloatFloat_ReturnValue) == 0x000048, "Member 'UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint, CallFunc_BreakVector2D_X) == 0x00004C, "Member 'UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint, CallFunc_BreakVector2D_Y) == 0x000050, "Member 'UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint, CallFunc_MakeVector2D_ReturnValue_2) == 0x000054, "Member 'UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint, CallFunc_MakeVector2D_ReturnValue_3) == 0x00005C, "Member 'UIW_HUD_Gauge_FrenzyItem_C_RefreshPoint::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");

// Function UIW_HUD_Gauge_FrenzyItem.UIW_HUD_Gauge_FrenzyItem_C.CompleteTween
// 0x000C (0x000C - 0x0000)
struct UIW_HUD_Gauge_FrenzyItem_C_CompleteTween final
{
public:
	class FName                                   CategoryName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_HUD_Gauge_FrenzyItem_C_CompleteTween) == 0x000004, "Wrong alignment on UIW_HUD_Gauge_FrenzyItem_C_CompleteTween");
static_assert(sizeof(UIW_HUD_Gauge_FrenzyItem_C_CompleteTween) == 0x00000C, "Wrong size on UIW_HUD_Gauge_FrenzyItem_C_CompleteTween");
static_assert(offsetof(UIW_HUD_Gauge_FrenzyItem_C_CompleteTween, CategoryName) == 0x000000, "Member 'UIW_HUD_Gauge_FrenzyItem_C_CompleteTween::CategoryName' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_FrenzyItem_C_CompleteTween, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000008, "Member 'UIW_HUD_Gauge_FrenzyItem_C_CompleteTween::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

}

