#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Slot_Weapon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function UIW_Slot_Weapon.UIW_Slot_Weapon_C.OnSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Slot_Weapon_C_OnSelected__DelegateSignature final
{
public:
	class ULWeaponItem*                           LWeaponItem;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Slot_Weapon_C_OnSelected__DelegateSignature) == 0x000008, "Wrong alignment on UIW_Slot_Weapon_C_OnSelected__DelegateSignature");
static_assert(sizeof(UIW_Slot_Weapon_C_OnSelected__DelegateSignature) == 0x000008, "Wrong size on UIW_Slot_Weapon_C_OnSelected__DelegateSignature");
static_assert(offsetof(UIW_Slot_Weapon_C_OnSelected__DelegateSignature, LWeaponItem) == 0x000000, "Member 'UIW_Slot_Weapon_C_OnSelected__DelegateSignature::LWeaponItem' has a wrong offset!");

// Function UIW_Slot_Weapon.UIW_Slot_Weapon_C.OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Slot_Weapon_C_OnActive__DelegateSignature final
{
public:
	class ULWeaponItem*                           LWeaponItem;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Slot_Weapon_C_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_Slot_Weapon_C_OnActive__DelegateSignature");
static_assert(sizeof(UIW_Slot_Weapon_C_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_Slot_Weapon_C_OnActive__DelegateSignature");
static_assert(offsetof(UIW_Slot_Weapon_C_OnActive__DelegateSignature, LWeaponItem) == 0x000000, "Member 'UIW_Slot_Weapon_C_OnActive__DelegateSignature::LWeaponItem' has a wrong offset!");

// Function UIW_Slot_Weapon.UIW_Slot_Weapon_C.ExecuteUbergraph_UIW_Slot_Weapon
// 0x0040 (0x0040 - 0x0000)
struct UIW_Slot_Weapon_C_ExecuteUbergraph_UIW_Slot_Weapon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0004(0x0008)(NoDestructor)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListObject;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasKeyboardFocus_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenedWidget_IsOpened;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_IsOpenedWidget_UserWidget;                // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IsOpenedWidget_WidgetArrayIndex;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Slot_Weapon_C_ExecuteUbergraph_UIW_Slot_Weapon) == 0x000008, "Wrong alignment on UIW_Slot_Weapon_C_ExecuteUbergraph_UIW_Slot_Weapon");
static_assert(sizeof(UIW_Slot_Weapon_C_ExecuteUbergraph_UIW_Slot_Weapon) == 0x000040, "Wrong size on UIW_Slot_Weapon_C_ExecuteUbergraph_UIW_Slot_Weapon");
static_assert(offsetof(UIW_Slot_Weapon_C_ExecuteUbergraph_UIW_Slot_Weapon, EntryPoint) == 0x000000, "Member 'UIW_Slot_Weapon_C_ExecuteUbergraph_UIW_Slot_Weapon::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_Slot_Weapon_C_ExecuteUbergraph_UIW_Slot_Weapon, K2Node_Event_InFocusEvent) == 0x000004, "Member 'UIW_Slot_Weapon_C_ExecuteUbergraph_UIW_Slot_Weapon::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(UIW_Slot_Weapon_C_ExecuteUbergraph_UIW_Slot_Weapon, K2Node_Event_ListObject) == 0x000010, "Member 'UIW_Slot_Weapon_C_ExecuteUbergraph_UIW_Slot_Weapon::K2Node_Event_ListObject' has a wrong offset!");
static_assert(offsetof(UIW_Slot_Weapon_C_ExecuteUbergraph_UIW_Slot_Weapon, CallFunc_HasKeyboardFocus_ReturnValue) == 0x000018, "Member 'UIW_Slot_Weapon_C_ExecuteUbergraph_UIW_Slot_Weapon::CallFunc_HasKeyboardFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Slot_Weapon_C_ExecuteUbergraph_UIW_Slot_Weapon, CallFunc_GetMainWidget_MainWidget) == 0x000020, "Member 'UIW_Slot_Weapon_C_ExecuteUbergraph_UIW_Slot_Weapon::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_Slot_Weapon_C_ExecuteUbergraph_UIW_Slot_Weapon, CallFunc_IsOpenedWidget_IsOpened) == 0x000028, "Member 'UIW_Slot_Weapon_C_ExecuteUbergraph_UIW_Slot_Weapon::CallFunc_IsOpenedWidget_IsOpened' has a wrong offset!");
static_assert(offsetof(UIW_Slot_Weapon_C_ExecuteUbergraph_UIW_Slot_Weapon, CallFunc_IsOpenedWidget_UserWidget) == 0x000030, "Member 'UIW_Slot_Weapon_C_ExecuteUbergraph_UIW_Slot_Weapon::CallFunc_IsOpenedWidget_UserWidget' has a wrong offset!");
static_assert(offsetof(UIW_Slot_Weapon_C_ExecuteUbergraph_UIW_Slot_Weapon, CallFunc_IsOpenedWidget_WidgetArrayIndex) == 0x000038, "Member 'UIW_Slot_Weapon_C_ExecuteUbergraph_UIW_Slot_Weapon::CallFunc_IsOpenedWidget_WidgetArrayIndex' has a wrong offset!");

// Function UIW_Slot_Weapon.UIW_Slot_Weapon_C.Set Item
// 0x0008 (0x0008 - 0x0000)
struct UIW_Slot_Weapon_C_Set_Item final
{
public:
	class UObject*                                ListObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Slot_Weapon_C_Set_Item) == 0x000008, "Wrong alignment on UIW_Slot_Weapon_C_Set_Item");
static_assert(sizeof(UIW_Slot_Weapon_C_Set_Item) == 0x000008, "Wrong size on UIW_Slot_Weapon_C_Set_Item");
static_assert(offsetof(UIW_Slot_Weapon_C_Set_Item, ListObject) == 0x000000, "Member 'UIW_Slot_Weapon_C_Set_Item::ListObject' has a wrong offset!");

// Function UIW_Slot_Weapon.UIW_Slot_Weapon_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct UIW_Slot_Weapon_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UIW_Slot_Weapon_C_OnFocusLost) == 0x000004, "Wrong alignment on UIW_Slot_Weapon_C_OnFocusLost");
static_assert(sizeof(UIW_Slot_Weapon_C_OnFocusLost) == 0x000008, "Wrong size on UIW_Slot_Weapon_C_OnFocusLost");
static_assert(offsetof(UIW_Slot_Weapon_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'UIW_Slot_Weapon_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function UIW_Slot_Weapon.UIW_Slot_Weapon_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct UIW_Slot_Weapon_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(UIW_Slot_Weapon_C_OnFocusReceived) == 0x000008, "Wrong alignment on UIW_Slot_Weapon_C_OnFocusReceived");
static_assert(sizeof(UIW_Slot_Weapon_C_OnFocusReceived) == 0x0001B0, "Wrong size on UIW_Slot_Weapon_C_OnFocusReceived");
static_assert(offsetof(UIW_Slot_Weapon_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UIW_Slot_Weapon_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_Slot_Weapon_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UIW_Slot_Weapon_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UIW_Slot_Weapon_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UIW_Slot_Weapon_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Slot_Weapon_C_OnFocusReceived, K2Node_MakeStruct_EventReply) == 0x0000F8, "Member 'UIW_Slot_Weapon_C_OnFocusReceived::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function UIW_Slot_Weapon.UIW_Slot_Weapon_C.OnMouseButtonDown
// 0x0238 (0x0238 - 0x0000)
struct UIW_Slot_Weapon_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0160(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0180(0x00B8)()
};
static_assert(alignof(UIW_Slot_Weapon_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on UIW_Slot_Weapon_C_OnMouseButtonDown");
static_assert(sizeof(UIW_Slot_Weapon_C_OnMouseButtonDown) == 0x000238, "Wrong size on UIW_Slot_Weapon_C_OnMouseButtonDown");
static_assert(offsetof(UIW_Slot_Weapon_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'UIW_Slot_Weapon_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_Slot_Weapon_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'UIW_Slot_Weapon_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_Slot_Weapon_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'UIW_Slot_Weapon_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Slot_Weapon_C_OnMouseButtonDown, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000160, "Member 'UIW_Slot_Weapon_C_OnMouseButtonDown::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Slot_Weapon_C_OnMouseButtonDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000178, "Member 'UIW_Slot_Weapon_C_OnMouseButtonDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Slot_Weapon_C_OnMouseButtonDown, K2Node_MakeStruct_EventReply) == 0x000180, "Member 'UIW_Slot_Weapon_C_OnMouseButtonDown::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function UIW_Slot_Weapon.UIW_Slot_Weapon_C.OnMouseButtonDoubleClick
// 0x0218 (0x0218 - 0x0000)
struct UIW_Slot_Weapon_C_OnMouseButtonDoubleClick final
{
public:
	struct FGeometry                              InMyGeometry;                                      // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InMouseEvent;                                      // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UIW_Slot_Weapon_C_OnMouseButtonDoubleClick) == 0x000008, "Wrong alignment on UIW_Slot_Weapon_C_OnMouseButtonDoubleClick");
static_assert(sizeof(UIW_Slot_Weapon_C_OnMouseButtonDoubleClick) == 0x000218, "Wrong size on UIW_Slot_Weapon_C_OnMouseButtonDoubleClick");
static_assert(offsetof(UIW_Slot_Weapon_C_OnMouseButtonDoubleClick, InMyGeometry) == 0x000000, "Member 'UIW_Slot_Weapon_C_OnMouseButtonDoubleClick::InMyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_Slot_Weapon_C_OnMouseButtonDoubleClick, InMouseEvent) == 0x000038, "Member 'UIW_Slot_Weapon_C_OnMouseButtonDoubleClick::InMouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_Slot_Weapon_C_OnMouseButtonDoubleClick, ReturnValue) == 0x0000A8, "Member 'UIW_Slot_Weapon_C_OnMouseButtonDoubleClick::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Slot_Weapon_C_OnMouseButtonDoubleClick, K2Node_MakeStruct_EventReply) == 0x000160, "Member 'UIW_Slot_Weapon_C_OnMouseButtonDoubleClick::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function UIW_Slot_Weapon.UIW_Slot_Weapon_C.SetMoveFocusEffect
// 0x0010 (0x0010 - 0x0000)
struct UIW_Slot_Weapon_C_SetMoveFocusEffect final
{
public:
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Slot_Weapon_C_SetMoveFocusEffect) == 0x000008, "Wrong alignment on UIW_Slot_Weapon_C_SetMoveFocusEffect");
static_assert(sizeof(UIW_Slot_Weapon_C_SetMoveFocusEffect) == 0x000010, "Wrong size on UIW_Slot_Weapon_C_SetMoveFocusEffect");
static_assert(offsetof(UIW_Slot_Weapon_C_SetMoveFocusEffect, CallFunc_MakeVector2D_ReturnValue) == 0x000000, "Member 'UIW_Slot_Weapon_C_SetMoveFocusEffect::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Slot_Weapon_C_SetMoveFocusEffect, CallFunc_GetMainWidget_MainWidget) == 0x000008, "Member 'UIW_Slot_Weapon_C_SetMoveFocusEffect::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");

}

