#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Quartz_Pocket

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK::Params
{

// Function UIW_Quartz_Pocket.UIW_Quartz_Pocket_C.OnClicked__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UIW_Quartz_Pocket_C_OnClicked__DelegateSignature final
{
public:
	class UUIW_Quartz_Pocket_C*                   Pocket;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WithTween;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ForceUpdate;                                       // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Quartz_Pocket_C_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on UIW_Quartz_Pocket_C_OnClicked__DelegateSignature");
static_assert(sizeof(UIW_Quartz_Pocket_C_OnClicked__DelegateSignature) == 0x000010, "Wrong size on UIW_Quartz_Pocket_C_OnClicked__DelegateSignature");
static_assert(offsetof(UIW_Quartz_Pocket_C_OnClicked__DelegateSignature, Pocket) == 0x000000, "Member 'UIW_Quartz_Pocket_C_OnClicked__DelegateSignature::Pocket' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_OnClicked__DelegateSignature, WithTween) == 0x000008, "Member 'UIW_Quartz_Pocket_C_OnClicked__DelegateSignature::WithTween' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_OnClicked__DelegateSignature, ForceUpdate) == 0x000009, "Member 'UIW_Quartz_Pocket_C_OnClicked__DelegateSignature::ForceUpdate' has a wrong offset!");

// Function UIW_Quartz_Pocket.UIW_Quartz_Pocket_C.OnDoubleClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Quartz_Pocket_C_OnDoubleClicked__DelegateSignature final
{
public:
	class UUIW_Quartz_Pocket_C*                   SelfPocket;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Quartz_Pocket_C_OnDoubleClicked__DelegateSignature) == 0x000008, "Wrong alignment on UIW_Quartz_Pocket_C_OnDoubleClicked__DelegateSignature");
static_assert(sizeof(UIW_Quartz_Pocket_C_OnDoubleClicked__DelegateSignature) == 0x000008, "Wrong size on UIW_Quartz_Pocket_C_OnDoubleClicked__DelegateSignature");
static_assert(offsetof(UIW_Quartz_Pocket_C_OnDoubleClicked__DelegateSignature, SelfPocket) == 0x000000, "Member 'UIW_Quartz_Pocket_C_OnDoubleClicked__DelegateSignature::SelfPocket' has a wrong offset!");

// Function UIW_Quartz_Pocket.UIW_Quartz_Pocket_C.ExecuteUbergraph_UIW_Quartz_Pocket
// 0x0038 (0x0038 - 0x0000)
struct UIW_Quartz_Pocket_C_ExecuteUbergraph_UIW_Quartz_Pocket final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUIW_Quartz_Slot_C*>             K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUIW_Quartz_Slot_C*                     CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Quartz_Pocket_C_ExecuteUbergraph_UIW_Quartz_Pocket) == 0x000008, "Wrong alignment on UIW_Quartz_Pocket_C_ExecuteUbergraph_UIW_Quartz_Pocket");
static_assert(sizeof(UIW_Quartz_Pocket_C_ExecuteUbergraph_UIW_Quartz_Pocket) == 0x000038, "Wrong size on UIW_Quartz_Pocket_C_ExecuteUbergraph_UIW_Quartz_Pocket");
static_assert(offsetof(UIW_Quartz_Pocket_C_ExecuteUbergraph_UIW_Quartz_Pocket, EntryPoint) == 0x000000, "Member 'UIW_Quartz_Pocket_C_ExecuteUbergraph_UIW_Quartz_Pocket::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_ExecuteUbergraph_UIW_Quartz_Pocket, Temp_int_Array_Index_Variable) == 0x000004, "Member 'UIW_Quartz_Pocket_C_ExecuteUbergraph_UIW_Quartz_Pocket::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_ExecuteUbergraph_UIW_Quartz_Pocket, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UIW_Quartz_Pocket_C_ExecuteUbergraph_UIW_Quartz_Pocket::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_ExecuteUbergraph_UIW_Quartz_Pocket, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'UIW_Quartz_Pocket_C_ExecuteUbergraph_UIW_Quartz_Pocket::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_ExecuteUbergraph_UIW_Quartz_Pocket, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'UIW_Quartz_Pocket_C_ExecuteUbergraph_UIW_Quartz_Pocket::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_ExecuteUbergraph_UIW_Quartz_Pocket, K2Node_Event_IsDesignTime) == 0x000014, "Member 'UIW_Quartz_Pocket_C_ExecuteUbergraph_UIW_Quartz_Pocket::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_ExecuteUbergraph_UIW_Quartz_Pocket, K2Node_MakeArray_Array) == 0x000018, "Member 'UIW_Quartz_Pocket_C_ExecuteUbergraph_UIW_Quartz_Pocket::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_ExecuteUbergraph_UIW_Quartz_Pocket, CallFunc_Array_Get_Item) == 0x000028, "Member 'UIW_Quartz_Pocket_C_ExecuteUbergraph_UIW_Quartz_Pocket::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_ExecuteUbergraph_UIW_Quartz_Pocket, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'UIW_Quartz_Pocket_C_ExecuteUbergraph_UIW_Quartz_Pocket::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_ExecuteUbergraph_UIW_Quartz_Pocket, CallFunc_Less_IntInt_ReturnValue) == 0x000034, "Member 'UIW_Quartz_Pocket_C_ExecuteUbergraph_UIW_Quartz_Pocket::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_ExecuteUbergraph_UIW_Quartz_Pocket, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000035, "Member 'UIW_Quartz_Pocket_C_ExecuteUbergraph_UIW_Quartz_Pocket::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function UIW_Quartz_Pocket.UIW_Quartz_Pocket_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UIW_Quartz_Pocket_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Quartz_Pocket_C_PreConstruct) == 0x000001, "Wrong alignment on UIW_Quartz_Pocket_C_PreConstruct");
static_assert(sizeof(UIW_Quartz_Pocket_C_PreConstruct) == 0x000001, "Wrong size on UIW_Quartz_Pocket_C_PreConstruct");
static_assert(offsetof(UIW_Quartz_Pocket_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UIW_Quartz_Pocket_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UIW_Quartz_Pocket.UIW_Quartz_Pocket_C.SetData
// 0x0118 (0x0118 - 0x0000)
struct UIW_Quartz_Pocket_C_SetData final
{
public:
	int32                                         NowInstallIndex;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UTexture2D*>          LocalPocketIcon;                                   // 0x0008(0x0050)(Edit, BlueprintVisible)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Map_Find_Value;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPocketLevel_ReturnValue;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UTexture2D*>          K2Node_MakeVariable_MakeVariableOutput;            // 0x00A8(0x0050)()
	class ULQuartzSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULQuartzSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULQuartzPocket*                         CallFunc_GetPocketData_ReturnValue;                // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEnabledCoreLevel_ReturnValue;          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Quartz_Pocket_C_SetData) == 0x000008, "Wrong alignment on UIW_Quartz_Pocket_C_SetData");
static_assert(sizeof(UIW_Quartz_Pocket_C_SetData) == 0x000118, "Wrong size on UIW_Quartz_Pocket_C_SetData");
static_assert(offsetof(UIW_Quartz_Pocket_C_SetData, NowInstallIndex) == 0x000000, "Member 'UIW_Quartz_Pocket_C_SetData::NowInstallIndex' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_SetData, LocalPocketIcon) == 0x000008, "Member 'UIW_Quartz_Pocket_C_SetData::LocalPocketIcon' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_SetData, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000058, "Member 'UIW_Quartz_Pocket_C_SetData::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_SetData, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000060, "Member 'UIW_Quartz_Pocket_C_SetData::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_SetData, CallFunc_Map_Find_Value) == 0x000068, "Member 'UIW_Quartz_Pocket_C_SetData::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_SetData, CallFunc_Map_Find_ReturnValue) == 0x000070, "Member 'UIW_Quartz_Pocket_C_SetData::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_SetData, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000078, "Member 'UIW_Quartz_Pocket_C_SetData::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_SetData, CallFunc_PlayAnimationForward_ReturnValue) == 0x000080, "Member 'UIW_Quartz_Pocket_C_SetData::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_SetData, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000088, "Member 'UIW_Quartz_Pocket_C_SetData::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_SetData, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000090, "Member 'UIW_Quartz_Pocket_C_SetData::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_SetData, CallFunc_PlayAnimation_ReturnValue) == 0x000098, "Member 'UIW_Quartz_Pocket_C_SetData::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_SetData, CallFunc_GetPocketLevel_ReturnValue) == 0x0000A0, "Member 'UIW_Quartz_Pocket_C_SetData::CallFunc_GetPocketLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_SetData, K2Node_MakeVariable_MakeVariableOutput) == 0x0000A8, "Member 'UIW_Quartz_Pocket_C_SetData::K2Node_MakeVariable_MakeVariableOutput' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_SetData, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000F8, "Member 'UIW_Quartz_Pocket_C_SetData::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_SetData, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000100, "Member 'UIW_Quartz_Pocket_C_SetData::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_SetData, CallFunc_GetPocketData_ReturnValue) == 0x000108, "Member 'UIW_Quartz_Pocket_C_SetData::CallFunc_GetPocketData_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_SetData, CallFunc_GetEnabledCoreLevel_ReturnValue) == 0x000110, "Member 'UIW_Quartz_Pocket_C_SetData::CallFunc_GetEnabledCoreLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_SetData, CallFunc_IsValid_ReturnValue) == 0x000114, "Member 'UIW_Quartz_Pocket_C_SetData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_SetData, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000115, "Member 'UIW_Quartz_Pocket_C_SetData::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function UIW_Quartz_Pocket.UIW_Quartz_Pocket_C.RefreshSlot
// 0x00F0 (0x00F0 - 0x0000)
struct UIW_Quartz_Pocket_C_RefreshSlot final
{
public:
	int32                                         NowInstallIndex;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocalRadialValue;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalActivateCount;                                // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<uint8, class UTexture2D*>                LocalInstalledIcon;                                // 0x0010(0x0050)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_2;                 // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_3;                 // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Quartz_Slot_C*                     CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELQuartzEffectType                            CallFunc_GetEffectType_ReturnValue;                // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0097(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TMap<uint8, class UTexture2D*>                K2Node_MakeVariable_MakeVariableOutput;            // 0x0098(0x0050)()
	int32                                         CallFunc_GetSlotCount_ReturnValue;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Quartz_Pocket_C_RefreshSlot) == 0x000008, "Wrong alignment on UIW_Quartz_Pocket_C_RefreshSlot");
static_assert(sizeof(UIW_Quartz_Pocket_C_RefreshSlot) == 0x0000F0, "Wrong size on UIW_Quartz_Pocket_C_RefreshSlot");
static_assert(offsetof(UIW_Quartz_Pocket_C_RefreshSlot, NowInstallIndex) == 0x000000, "Member 'UIW_Quartz_Pocket_C_RefreshSlot::NowInstallIndex' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_RefreshSlot, LocalRadialValue) == 0x000004, "Member 'UIW_Quartz_Pocket_C_RefreshSlot::LocalRadialValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_RefreshSlot, LocalActivateCount) == 0x000008, "Member 'UIW_Quartz_Pocket_C_RefreshSlot::LocalActivateCount' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_RefreshSlot, LocalInstalledIcon) == 0x000010, "Member 'UIW_Quartz_Pocket_C_RefreshSlot::LocalInstalledIcon' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_RefreshSlot, Temp_int_Array_Index_Variable) == 0x000060, "Member 'UIW_Quartz_Pocket_C_RefreshSlot::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_RefreshSlot, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'UIW_Quartz_Pocket_C_RefreshSlot::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_RefreshSlot, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'UIW_Quartz_Pocket_C_RefreshSlot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_RefreshSlot, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000070, "Member 'UIW_Quartz_Pocket_C_RefreshSlot::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_RefreshSlot, K2Node_SwitchInteger_CmpSuccess) == 0x000078, "Member 'UIW_Quartz_Pocket_C_RefreshSlot::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_RefreshSlot, K2Node_SwitchInteger_CmpSuccess_1) == 0x000079, "Member 'UIW_Quartz_Pocket_C_RefreshSlot::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_RefreshSlot, K2Node_SwitchInteger_CmpSuccess_2) == 0x00007A, "Member 'UIW_Quartz_Pocket_C_RefreshSlot::K2Node_SwitchInteger_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_RefreshSlot, K2Node_SwitchInteger_CmpSuccess_3) == 0x00007B, "Member 'UIW_Quartz_Pocket_C_RefreshSlot::K2Node_SwitchInteger_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_RefreshSlot, Temp_int_Variable) == 0x00007C, "Member 'UIW_Quartz_Pocket_C_RefreshSlot::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_RefreshSlot, CallFunc_Add_IntInt_ReturnValue_1) == 0x000080, "Member 'UIW_Quartz_Pocket_C_RefreshSlot::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_RefreshSlot, CallFunc_Array_Get_Item) == 0x000088, "Member 'UIW_Quartz_Pocket_C_RefreshSlot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_RefreshSlot, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'UIW_Quartz_Pocket_C_RefreshSlot::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_RefreshSlot, CallFunc_GetEffectType_ReturnValue) == 0x000094, "Member 'UIW_Quartz_Pocket_C_RefreshSlot::CallFunc_GetEffectType_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_RefreshSlot, CallFunc_Less_IntInt_ReturnValue) == 0x000095, "Member 'UIW_Quartz_Pocket_C_RefreshSlot::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_RefreshSlot, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000096, "Member 'UIW_Quartz_Pocket_C_RefreshSlot::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_RefreshSlot, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000097, "Member 'UIW_Quartz_Pocket_C_RefreshSlot::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_RefreshSlot, K2Node_MakeVariable_MakeVariableOutput) == 0x000098, "Member 'UIW_Quartz_Pocket_C_RefreshSlot::K2Node_MakeVariable_MakeVariableOutput' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_RefreshSlot, CallFunc_GetSlotCount_ReturnValue) == 0x0000E8, "Member 'UIW_Quartz_Pocket_C_RefreshSlot::CallFunc_GetSlotCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_RefreshSlot, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000EC, "Member 'UIW_Quartz_Pocket_C_RefreshSlot::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function UIW_Quartz_Pocket.UIW_Quartz_Pocket_C.OnMouseButtonDoubleClick
// 0x0218 (0x0218 - 0x0000)
struct UIW_Quartz_Pocket_C_OnMouseButtonDoubleClick final
{
public:
	struct FGeometry                              InMyGeometry;                                      // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InMouseEvent;                                      // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UIW_Quartz_Pocket_C_OnMouseButtonDoubleClick) == 0x000008, "Wrong alignment on UIW_Quartz_Pocket_C_OnMouseButtonDoubleClick");
static_assert(sizeof(UIW_Quartz_Pocket_C_OnMouseButtonDoubleClick) == 0x000218, "Wrong size on UIW_Quartz_Pocket_C_OnMouseButtonDoubleClick");
static_assert(offsetof(UIW_Quartz_Pocket_C_OnMouseButtonDoubleClick, InMyGeometry) == 0x000000, "Member 'UIW_Quartz_Pocket_C_OnMouseButtonDoubleClick::InMyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_OnMouseButtonDoubleClick, InMouseEvent) == 0x000038, "Member 'UIW_Quartz_Pocket_C_OnMouseButtonDoubleClick::InMouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_OnMouseButtonDoubleClick, ReturnValue) == 0x0000A8, "Member 'UIW_Quartz_Pocket_C_OnMouseButtonDoubleClick::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Pocket_C_OnMouseButtonDoubleClick, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'UIW_Quartz_Pocket_C_OnMouseButtonDoubleClick::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UIW_Quartz_Pocket.UIW_Quartz_Pocket_C.SetBtnMode
// 0x0001 (0x0001 - 0x0000)
struct UIW_Quartz_Pocket_C_SetBtnMode final
{
public:
	bool                                          BtnOn;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Quartz_Pocket_C_SetBtnMode) == 0x000001, "Wrong alignment on UIW_Quartz_Pocket_C_SetBtnMode");
static_assert(sizeof(UIW_Quartz_Pocket_C_SetBtnMode) == 0x000001, "Wrong size on UIW_Quartz_Pocket_C_SetBtnMode");
static_assert(offsetof(UIW_Quartz_Pocket_C_SetBtnMode, BtnOn) == 0x000000, "Member 'UIW_Quartz_Pocket_C_SetBtnMode::BtnOn' has a wrong offset!");

}

