#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_SlaveArm_ReinforceLine

#include "Basic.hpp"


namespace SDK::Params
{

// Function UIW_SlaveArm_ReinforceLine.UIW_SlaveArm_ReinforceLine_C.ExecuteUbergraph_UIW_SlaveArm_ReinforceLine
// 0x0004 (0x0004 - 0x0000)
struct UIW_SlaveArm_ReinforceLine_C_ExecuteUbergraph_UIW_SlaveArm_ReinforceLine final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_SlaveArm_ReinforceLine_C_ExecuteUbergraph_UIW_SlaveArm_ReinforceLine) == 0x000004, "Wrong alignment on UIW_SlaveArm_ReinforceLine_C_ExecuteUbergraph_UIW_SlaveArm_ReinforceLine");
static_assert(sizeof(UIW_SlaveArm_ReinforceLine_C_ExecuteUbergraph_UIW_SlaveArm_ReinforceLine) == 0x000004, "Wrong size on UIW_SlaveArm_ReinforceLine_C_ExecuteUbergraph_UIW_SlaveArm_ReinforceLine");
static_assert(offsetof(UIW_SlaveArm_ReinforceLine_C_ExecuteUbergraph_UIW_SlaveArm_ReinforceLine, EntryPoint) == 0x000000, "Member 'UIW_SlaveArm_ReinforceLine_C_ExecuteUbergraph_UIW_SlaveArm_ReinforceLine::EntryPoint' has a wrong offset!");

// Function UIW_SlaveArm_ReinforceLine.UIW_SlaveArm_ReinforceLine_C.SetActive
// 0x0001 (0x0001 - 0x0000)
struct UIW_SlaveArm_ReinforceLine_C_SetActive final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_SlaveArm_ReinforceLine_C_SetActive) == 0x000001, "Wrong alignment on UIW_SlaveArm_ReinforceLine_C_SetActive");
static_assert(sizeof(UIW_SlaveArm_ReinforceLine_C_SetActive) == 0x000001, "Wrong size on UIW_SlaveArm_ReinforceLine_C_SetActive");
static_assert(offsetof(UIW_SlaveArm_ReinforceLine_C_SetActive, IsActive) == 0x000000, "Member 'UIW_SlaveArm_ReinforceLine_C_SetActive::IsActive' has a wrong offset!");

}

