#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Setting_Menu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Setting_Menu.UIW_Setting_Menu_C
// 0x0070 (0x02D8 - 0x0268)
class UUIW_Setting_Menu_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Hover;                                         // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Btn;                                               // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Component;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Group_Hovered;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Label;                                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   LabelName;                                         // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   TooltipName;                                       // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsEnabledPrevNext;                                 // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsSelected;                                        // 0x02A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AA[0x6];                                      // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnFocued;                                          // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsEnabledView;                                     // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void OnFocued__DelegateSignature(class UUIW_Setting_Menu_C* SettingMenu);
	void OnClicked__DelegateSignature();
	void ExecuteUbergraph_UIW_Setting_Menu(int32 EntryPoint);
	void Destruct();
	void BndEvt__Btn_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Btn_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Btn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void PreConstruct(bool IsDesignTime);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void MoveFocusEffect();
	void SetEnabledView(bool IsEnabledView_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Setting_Menu_C">();
	}
	static class UUIW_Setting_Menu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Setting_Menu_C>();
	}
};
static_assert(alignof(UUIW_Setting_Menu_C) == 0x000008, "Wrong alignment on UUIW_Setting_Menu_C");
static_assert(sizeof(UUIW_Setting_Menu_C) == 0x0002D8, "Wrong size on UUIW_Setting_Menu_C");
static_assert(offsetof(UUIW_Setting_Menu_C, UberGraphFrame) == 0x000268, "Member 'UUIW_Setting_Menu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_Setting_Menu_C, Ani_Hover) == 0x000270, "Member 'UUIW_Setting_Menu_C::Ani_Hover' has a wrong offset!");
static_assert(offsetof(UUIW_Setting_Menu_C, Btn) == 0x000278, "Member 'UUIW_Setting_Menu_C::Btn' has a wrong offset!");
static_assert(offsetof(UUIW_Setting_Menu_C, Component) == 0x000280, "Member 'UUIW_Setting_Menu_C::Component' has a wrong offset!");
static_assert(offsetof(UUIW_Setting_Menu_C, Group_Hovered) == 0x000288, "Member 'UUIW_Setting_Menu_C::Group_Hovered' has a wrong offset!");
static_assert(offsetof(UUIW_Setting_Menu_C, Label) == 0x000290, "Member 'UUIW_Setting_Menu_C::Label' has a wrong offset!");
static_assert(offsetof(UUIW_Setting_Menu_C, LabelName) == 0x000298, "Member 'UUIW_Setting_Menu_C::LabelName' has a wrong offset!");
static_assert(offsetof(UUIW_Setting_Menu_C, TooltipName) == 0x0002A0, "Member 'UUIW_Setting_Menu_C::TooltipName' has a wrong offset!");
static_assert(offsetof(UUIW_Setting_Menu_C, IsEnabledPrevNext) == 0x0002A8, "Member 'UUIW_Setting_Menu_C::IsEnabledPrevNext' has a wrong offset!");
static_assert(offsetof(UUIW_Setting_Menu_C, IsSelected) == 0x0002A9, "Member 'UUIW_Setting_Menu_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UUIW_Setting_Menu_C, OnFocued) == 0x0002B0, "Member 'UUIW_Setting_Menu_C::OnFocued' has a wrong offset!");
static_assert(offsetof(UUIW_Setting_Menu_C, OnClicked) == 0x0002C0, "Member 'UUIW_Setting_Menu_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UUIW_Setting_Menu_C, IsEnabledView) == 0x0002D0, "Member 'UUIW_Setting_Menu_C::IsEnabledView' has a wrong offset!");

}

