#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_TitleScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectP_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UIW_TitleScreen.UIW_TitleScreen_C.ExecuteUbergraph_UIW_TitleScreen
// 0x02C0 (0x02C0 - 0x0000)
struct UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULSoundSystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELLobbyMenu                                   K2Node_CustomEvent_LobbyMenu;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ProcessResult;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULWorldSystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0048(0x0018)()
	bool                                          CallFunc_IsValidLastPlayCharacter_ReturnValue;     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUIW_Popup_C* Popup, class UUIW_Btn_Key_C* BtnKey)> K2Node_CreateDelegate_OutputDelegate;              // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLCharacterStorageData>         CallFunc_GetSaveData_outCharacterList;             // 0x0080(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetSaveData_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Popup_C*                           CallFunc_AddPopupWidget_Widget;                    // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x00B8(0x0018)()
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidStarterPackContinueCharacter_ReturnValue; // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_Default_C*               K2Node_DynamicCast_AsUIBP_List_Data_Default;       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget_1;               // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUIW_Popup_C* Popup, class UUIW_Btn_Key_C* BtnKey)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	class UUserWidget*                            CallFunc_AddWidget_Widget;                         // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_AddWidget_Widget_1;                       // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULSoundSystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget_2;               // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Popup_C*                           CallFunc_AddPopupWidget_Widget_1;                  // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlatformSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_6;   // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetPlayerNickName_ReturnValue;            // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0150(0x0018)()
	class UUIW_Popup_C*                           K2Node_CustomEvent_Popup;                          // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_CustomEvent_BtnKey;                         // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoPlayBGM_ReturnValue;                    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_7;   // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsValid)>                 K2Node_CreateDelegate_OutputDelegate_2;            // 0x0190(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class ASkeletalMeshActor*>             CallFunc_GetAllActorsOfClassWithTag_OutActors;     // 0x01A0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASkeletalMeshActor*                     CallFunc_Array_Get_Item;                           // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USteelheart_animBP_V02_C*               K2Node_DynamicCast_AsSteelheart_Anim_BP_V02;       // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULPlatformSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_8;   // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChunkInstallComplete_ReturnValue;       // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULSoundSystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_9;   // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_10;  // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayingNewGamePlusProcess_ReturnValue;  // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ALevelSequenceActor*>            CallFunc_GetAllActorsOfClassWithTag_OutActors_1;   // 0x0208(0x0010)(ReferenceParm)
	class ULSoundSystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_11;  // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    CallFunc_Array_Get_Item_1;                         // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequence*                         CallFunc_GetSequence_ReturnValue;                  // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelSequenceActor*                    CallFunc_CreateLevelSequencePlayer_OutActor;       // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_CreateLevelSequencePlayer_ReturnValue;    // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_12;  // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsValid)>                 K2Node_CreateDelegate_OutputDelegate_3;            // 0x0250(0x0010)(ZeroConstructor, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0260(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x029C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetPlatformDetail_IsXboxPlatform;         // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ULSoundSystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_13;  // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen) == 0x000008, "Wrong alignment on UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen");
static_assert(sizeof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen) == 0x0002C0, "Wrong size on UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, EntryPoint) == 0x000000, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, K2Node_ComponentBoundEvent_Item) == 0x000010, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, K2Node_ComponentBoundEvent_BtnKey) == 0x000018, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::K2Node_ComponentBoundEvent_BtnKey' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, K2Node_MakeArray_Array) == 0x000020, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000030, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, K2Node_CustomEvent_LobbyMenu) == 0x000031, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::K2Node_CustomEvent_LobbyMenu' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, K2Node_CustomEvent_ProcessResult) == 0x000032, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::K2Node_CustomEvent_ProcessResult' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, K2Node_SwitchEnum_CmpSuccess) == 0x000033, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000038, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000040, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GetGameStrWithName_ReturnValue) == 0x000048, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_IsValidLastPlayCharacter_ReturnValue) == 0x000060, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_IsValidLastPlayCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000064, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000078, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GetSaveData_outCharacterList) == 0x000080, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GetSaveData_outCharacterList' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GetSaveData_ReturnValue) == 0x000090, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GetSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GetMainWidget_MainWidget) == 0x000098, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_AddPopupWidget_Widget) == 0x0000A8, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_AddPopupWidget_Widget' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000B0, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GetGameStrWithName_ReturnValue_1) == 0x0000B8, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GetGameStrWithName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x0000D0, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x0000D8, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_IsValidStarterPackContinueCharacter_ReturnValue) == 0x0000E0, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_IsValidStarterPackContinueCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, K2Node_DynamicCast_AsUIBP_List_Data_Default) == 0x0000E8, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::K2Node_DynamicCast_AsUIBP_List_Data_Default' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, K2Node_SwitchName_CmpSuccess) == 0x0000F1, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GetMainWidget_MainWidget_1) == 0x0000F8, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GetMainWidget_MainWidget_1' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, K2Node_CreateDelegate_OutputDelegate_1) == 0x000100, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_AddWidget_Widget) == 0x000110, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_AddWidget_Widget' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_AddWidget_Widget_1) == 0x000118, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_AddWidget_Widget_1' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x000120, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GetMainWidget_MainWidget_2) == 0x000128, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GetMainWidget_MainWidget_2' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_AddPopupWidget_Widget_1) == 0x000130, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_AddPopupWidget_Widget_1' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GetGameInstanceSubsystem_ReturnValue_6) == 0x000138, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GetGameInstanceSubsystem_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GetPlayerNickName_ReturnValue) == 0x000140, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GetPlayerNickName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_Conv_StringToText_ReturnValue) == 0x000150, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, K2Node_CustomEvent_Popup) == 0x000168, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::K2Node_CustomEvent_Popup' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, K2Node_CustomEvent_BtnKey) == 0x000170, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::K2Node_CustomEvent_BtnKey' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_MakeLiteralName_ReturnValue) == 0x000178, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_DoPlayBGM_ReturnValue) == 0x000180, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_DoPlayBGM_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GetGameInstanceSubsystem_ReturnValue_7) == 0x000188, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GetGameInstanceSubsystem_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, K2Node_CreateDelegate_OutputDelegate_2) == 0x000190, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GetAllActorsOfClassWithTag_OutActors) == 0x0001A0, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GetAllActorsOfClassWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_Not_PreBool_ReturnValue) == 0x0001B0, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_Array_Get_Item) == 0x0001B8, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0001C0, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GetAnimInstance_ReturnValue) == 0x0001C8, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, K2Node_DynamicCast_AsSteelheart_Anim_BP_V02) == 0x0001D0, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::K2Node_DynamicCast_AsSteelheart_Anim_BP_V02' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, K2Node_DynamicCast_bSuccess_1) == 0x0001D8, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GetGameInstanceSubsystem_ReturnValue_8) == 0x0001E0, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GetGameInstanceSubsystem_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_IsChunkInstallComplete_ReturnValue) == 0x0001E8, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_IsChunkInstallComplete_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GetGameInstanceSubsystem_ReturnValue_9) == 0x0001F0, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GetGameInstanceSubsystem_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GetGameInstanceSubsystem_ReturnValue_10) == 0x0001F8, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GetGameInstanceSubsystem_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_IsPlayingNewGamePlusProcess_ReturnValue) == 0x000200, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_IsPlayingNewGamePlusProcess_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GetAllActorsOfClassWithTag_OutActors_1) == 0x000208, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GetAllActorsOfClassWithTag_OutActors_1' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GetGameInstanceSubsystem_ReturnValue_11) == 0x000218, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GetGameInstanceSubsystem_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_Array_Get_Item_1) == 0x000220, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GetSequence_ReturnValue) == 0x000228, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GetSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000230, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_CreateLevelSequencePlayer_OutActor) == 0x000238, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_CreateLevelSequencePlayer_OutActor' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_CreateLevelSequencePlayer_ReturnValue) == 0x000240, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_CreateLevelSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GetGameInstanceSubsystem_ReturnValue_12) == 0x000248, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GetGameInstanceSubsystem_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, K2Node_CreateDelegate_OutputDelegate_3) == 0x000250, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, K2Node_Event_MyGeometry) == 0x000260, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, K2Node_Event_InDeltaTime) == 0x000298, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, K2Node_CreateDelegate_OutputDelegate_4) == 0x00029C, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GetPlatformDetail_IsXboxPlatform) == 0x0002AC, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GetPlatformDetail_IsXboxPlatform' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0002B0, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen, CallFunc_GetGameInstanceSubsystem_ReturnValue_13) == 0x0002B8, "Member 'UIW_TitleScreen_C_ExecuteUbergraph_UIW_TitleScreen::CallFunc_GetGameInstanceSubsystem_ReturnValue_13' has a wrong offset!");

// Function UIW_TitleScreen.UIW_TitleScreen_C.Tick
// 0x003C (0x003C - 0x0000)
struct UIW_TitleScreen_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_TitleScreen_C_Tick) == 0x000004, "Wrong alignment on UIW_TitleScreen_C_Tick");
static_assert(sizeof(UIW_TitleScreen_C_Tick) == 0x00003C, "Wrong size on UIW_TitleScreen_C_Tick");
static_assert(offsetof(UIW_TitleScreen_C_Tick, MyGeometry) == 0x000000, "Member 'UIW_TitleScreen_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_Tick, InDeltaTime) == 0x000038, "Member 'UIW_TitleScreen_C_Tick::InDeltaTime' has a wrong offset!");

// Function UIW_TitleScreen.UIW_TitleScreen_C.OnDownloadPackagePopup
// 0x0010 (0x0010 - 0x0000)
struct UIW_TitleScreen_C_OnDownloadPackagePopup final
{
public:
	class UUIW_Popup_C*                           Popup;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_TitleScreen_C_OnDownloadPackagePopup) == 0x000008, "Wrong alignment on UIW_TitleScreen_C_OnDownloadPackagePopup");
static_assert(sizeof(UIW_TitleScreen_C_OnDownloadPackagePopup) == 0x000010, "Wrong size on UIW_TitleScreen_C_OnDownloadPackagePopup");
static_assert(offsetof(UIW_TitleScreen_C_OnDownloadPackagePopup, Popup) == 0x000000, "Member 'UIW_TitleScreen_C_OnDownloadPackagePopup::Popup' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_OnDownloadPackagePopup, BtnKey) == 0x000008, "Member 'UIW_TitleScreen_C_OnDownloadPackagePopup::BtnKey' has a wrong offset!");

// Function UIW_TitleScreen.UIW_TitleScreen_C.LobbyProcessEnd
// 0x0002 (0x0002 - 0x0000)
struct UIW_TitleScreen_C_LobbyProcessEnd final
{
public:
	ELLobbyMenu                                   LobbyMenu;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ProcessResult;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_TitleScreen_C_LobbyProcessEnd) == 0x000001, "Wrong alignment on UIW_TitleScreen_C_LobbyProcessEnd");
static_assert(sizeof(UIW_TitleScreen_C_LobbyProcessEnd) == 0x000002, "Wrong size on UIW_TitleScreen_C_LobbyProcessEnd");
static_assert(offsetof(UIW_TitleScreen_C_LobbyProcessEnd, LobbyMenu) == 0x000000, "Member 'UIW_TitleScreen_C_LobbyProcessEnd::LobbyMenu' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_LobbyProcessEnd, ProcessResult) == 0x000001, "Member 'UIW_TitleScreen_C_LobbyProcessEnd::ProcessResult' has a wrong offset!");

// Function UIW_TitleScreen.UIW_TitleScreen_C.BndEvt__UIW_TitleScreen_Btn_Submit_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_TitleScreen_C_BndEvt__UIW_TitleScreen_Btn_Submit_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_TitleScreen_C_BndEvt__UIW_TitleScreen_Btn_Submit_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_TitleScreen_C_BndEvt__UIW_TitleScreen_Btn_Submit_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature");
static_assert(sizeof(UIW_TitleScreen_C_BndEvt__UIW_TitleScreen_Btn_Submit_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_TitleScreen_C_BndEvt__UIW_TitleScreen_Btn_Submit_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature");
static_assert(offsetof(UIW_TitleScreen_C_BndEvt__UIW_TitleScreen_Btn_Submit_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_TitleScreen_C_BndEvt__UIW_TitleScreen_Btn_Submit_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_TitleScreen.UIW_TitleScreen_C.BndEvt__List_Menu_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_TitleScreen_C_BndEvt__List_Menu_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_TitleScreen_C_BndEvt__List_Menu_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong alignment on UIW_TitleScreen_C_BndEvt__List_Menu_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature");
static_assert(sizeof(UIW_TitleScreen_C_BndEvt__List_Menu_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong size on UIW_TitleScreen_C_BndEvt__List_Menu_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature");
static_assert(offsetof(UIW_TitleScreen_C_BndEvt__List_Menu_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature, Item) == 0x000000, "Member 'UIW_TitleScreen_C_BndEvt__List_Menu_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature::Item' has a wrong offset!");

// Function UIW_TitleScreen.UIW_TitleScreen_C.InitWidget
// 0x0208 (0x0208 - 0x0000)
struct UIW_TitleScreen_C_InitWidget final
{
public:
	TArray<class UUIBP_ListData_Default_C*>       LocalListData;                                     // 0x0000(0x0010)(Edit, BlueprintVisible)
	class ULPlatformSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChunkInstallComplete_ReturnValue;       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidLastPlayCharacter_ReturnValue;     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetPlatformBranchText_Text;               // 0x0030(0x0018)()
	TArray<struct FLCharacterStorageData>         CallFunc_GetSaveData_outCharacterList;             // 0x0048(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetSaveData_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULPlayInputSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetInputPlatformName_ReturnValue;         // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAccountShowEndingCredit_ReturnValue;   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAccountOpenedRecollection_ReturnValue; // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x009C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_Default_C*               CallFunc_SpawnObject_ReturnValue;                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x00B0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x00B8(0x0018)()
	class FName                                   Temp_name_Variable_2;                              // 0x00D0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x00E0(0x0018)()
	class UUIBP_ListData_Default_C*               CallFunc_SpawnObject_ReturnValue_1;                // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_Default_C*               CallFunc_SpawnObject_ReturnValue_2;                // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_Default_C*               CallFunc_SpawnObject_ReturnValue_3;                // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_Default_C*               CallFunc_SpawnObject_ReturnValue_4;                // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_Default_C*               CallFunc_SpawnObject_ReturnValue_5;                // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_Default_C*               CallFunc_SpawnObject_ReturnValue_6;                // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_2;         // 0x0130(0x0018)()
	class UUIBP_ListData_Default_C*               CallFunc_SpawnObject_ReturnValue_7;                // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_3;         // 0x0150(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_4;         // 0x0168(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_5;         // 0x0180(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_6;         // 0x0198(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_7;         // 0x01B0(0x0018)()
	class FName                                   Temp_name_Variable_3;                              // 0x01C8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_4;                              // 0x01D0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_5;                              // 0x01DC(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_6;                              // 0x01E8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_7;                              // 0x01F8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_6;                  // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_7;                  // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_TitleScreen_C_InitWidget) == 0x000008, "Wrong alignment on UIW_TitleScreen_C_InitWidget");
static_assert(sizeof(UIW_TitleScreen_C_InitWidget) == 0x000208, "Wrong size on UIW_TitleScreen_C_InitWidget");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, LocalListData) == 0x000000, "Member 'UIW_TitleScreen_C_InitWidget::LocalListData' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000018, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_IsChunkInstallComplete_ReturnValue) == 0x000020, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_IsChunkInstallComplete_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_IsValidLastPlayCharacter_ReturnValue) == 0x000021, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_IsValidLastPlayCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000028, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_GetPlatformBranchText_Text) == 0x000030, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_GetPlatformBranchText_Text' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_GetSaveData_outCharacterList) == 0x000048, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_GetSaveData_outCharacterList' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_GetSaveData_ReturnValue) == 0x000058, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_GetSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000060, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_GetInputPlatformName_ReturnValue) == 0x000070, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_GetInputPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_Greater_IntInt_ReturnValue) == 0x000080, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000081, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x000088, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x000090, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_GetAccountShowEndingCredit_ReturnValue) == 0x000098, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_GetAccountShowEndingCredit_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_GetAccountOpenedRecollection_ReturnValue) == 0x000099, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_GetAccountOpenedRecollection_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, Temp_name_Variable) == 0x00009C, "Member 'UIW_TitleScreen_C_InitWidget::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_SpawnObject_ReturnValue) == 0x0000A8, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, Temp_name_Variable_1) == 0x0000B0, "Member 'UIW_TitleScreen_C_InitWidget::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_GetGameStrWithName_ReturnValue) == 0x0000B8, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, Temp_name_Variable_2) == 0x0000D0, "Member 'UIW_TitleScreen_C_InitWidget::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_Array_Add_ReturnValue) == 0x0000D8, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_GetGameStrWithName_ReturnValue_1) == 0x0000E0, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_GetGameStrWithName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_SpawnObject_ReturnValue_1) == 0x0000F8, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_Array_Add_ReturnValue_1) == 0x000100, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_SpawnObject_ReturnValue_2) == 0x000108, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_SpawnObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_SpawnObject_ReturnValue_3) == 0x000110, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_SpawnObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_SpawnObject_ReturnValue_4) == 0x000118, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_SpawnObject_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_SpawnObject_ReturnValue_5) == 0x000120, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_SpawnObject_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_SpawnObject_ReturnValue_6) == 0x000128, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_SpawnObject_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_GetGameStrWithName_ReturnValue_2) == 0x000130, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_GetGameStrWithName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_SpawnObject_ReturnValue_7) == 0x000148, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_SpawnObject_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_GetGameStrWithName_ReturnValue_3) == 0x000150, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_GetGameStrWithName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_GetGameStrWithName_ReturnValue_4) == 0x000168, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_GetGameStrWithName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_GetGameStrWithName_ReturnValue_5) == 0x000180, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_GetGameStrWithName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_GetGameStrWithName_ReturnValue_6) == 0x000198, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_GetGameStrWithName_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_GetGameStrWithName_ReturnValue_7) == 0x0001B0, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_GetGameStrWithName_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, Temp_name_Variable_3) == 0x0001C8, "Member 'UIW_TitleScreen_C_InitWidget::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, Temp_name_Variable_4) == 0x0001D0, "Member 'UIW_TitleScreen_C_InitWidget::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_Array_Add_ReturnValue_2) == 0x0001D8, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, Temp_name_Variable_5) == 0x0001DC, "Member 'UIW_TitleScreen_C_InitWidget::Temp_name_Variable_5' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_Array_Add_ReturnValue_3) == 0x0001E4, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, Temp_name_Variable_6) == 0x0001E8, "Member 'UIW_TitleScreen_C_InitWidget::Temp_name_Variable_6' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_Array_Add_ReturnValue_4) == 0x0001F0, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_Array_Add_ReturnValue_5) == 0x0001F4, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_Array_Add_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, Temp_name_Variable_7) == 0x0001F8, "Member 'UIW_TitleScreen_C_InitWidget::Temp_name_Variable_7' has a wrong offset!");
static_assert(offsetof(UIW_TitleScreen_C_InitWidget, CallFunc_Array_Add_ReturnValue_6) == 0x000200, "Member 'UIW_TitleScreen_C_InitWidget::CallFunc_Array_Add_ReturnValue_6' has a wrong offset!");
