#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Fx_Btn_Bg_Left

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Fx_Btn_Bg_Left.UIW_Fx_Btn_Bg_Left_C
// 0x0038 (0x02E0 - 0x02A8)
class UUIW_Fx_Btn_Bg_Left_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Hover_1;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Hover_2;                                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Select_1;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Select_2;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Selected_Group;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ShowCurvedLine;                                    // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_UIW_Fx_Btn_Bg_Left(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Destruct();
	void OnUnhovered();
	void OnHovered();
	void OnUnselected();
	void OnSelected();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Fx_Btn_Bg_Left_C">();
	}
	static class UUIW_Fx_Btn_Bg_Left_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Fx_Btn_Bg_Left_C>();
	}
};
static_assert(alignof(UUIW_Fx_Btn_Bg_Left_C) == 0x000008, "Wrong alignment on UUIW_Fx_Btn_Bg_Left_C");
static_assert(sizeof(UUIW_Fx_Btn_Bg_Left_C) == 0x0002E0, "Wrong size on UUIW_Fx_Btn_Bg_Left_C");
static_assert(offsetof(UUIW_Fx_Btn_Bg_Left_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_Fx_Btn_Bg_Left_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_Fx_Btn_Bg_Left_C, Hover_1) == 0x0002B0, "Member 'UUIW_Fx_Btn_Bg_Left_C::Hover_1' has a wrong offset!");
static_assert(offsetof(UUIW_Fx_Btn_Bg_Left_C, Hover_2) == 0x0002B8, "Member 'UUIW_Fx_Btn_Bg_Left_C::Hover_2' has a wrong offset!");
static_assert(offsetof(UUIW_Fx_Btn_Bg_Left_C, Img_Select_1) == 0x0002C0, "Member 'UUIW_Fx_Btn_Bg_Left_C::Img_Select_1' has a wrong offset!");
static_assert(offsetof(UUIW_Fx_Btn_Bg_Left_C, Img_Select_2) == 0x0002C8, "Member 'UUIW_Fx_Btn_Bg_Left_C::Img_Select_2' has a wrong offset!");
static_assert(offsetof(UUIW_Fx_Btn_Bg_Left_C, Selected_Group) == 0x0002D0, "Member 'UUIW_Fx_Btn_Bg_Left_C::Selected_Group' has a wrong offset!");
static_assert(offsetof(UUIW_Fx_Btn_Bg_Left_C, ShowCurvedLine) == 0x0002D8, "Member 'UUIW_Fx_Btn_Bg_Left_C::ShowCurvedLine' has a wrong offset!");

}

