#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ProfileItem_Weight

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UIW_ProfileItem_Weight.UIW_ProfileItem_Weight_C.ExecuteUbergraph_UIW_ProfileItem_Weight
// 0x0070 (0x0070 - 0x0000)
struct UIW_ProfileItem_Weight_C_ExecuteUbergraph_UIW_ProfileItem_Weight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ELEquipSlotType EquipSlot, class ULItem* OldItem, class ULItem* NewItem)> K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ELSecondStat InStat)>          K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0058(0x0018)()
};
static_assert(alignof(UIW_ProfileItem_Weight_C_ExecuteUbergraph_UIW_ProfileItem_Weight) == 0x000008, "Wrong alignment on UIW_ProfileItem_Weight_C_ExecuteUbergraph_UIW_ProfileItem_Weight");
static_assert(sizeof(UIW_ProfileItem_Weight_C_ExecuteUbergraph_UIW_ProfileItem_Weight) == 0x000070, "Wrong size on UIW_ProfileItem_Weight_C_ExecuteUbergraph_UIW_ProfileItem_Weight");
static_assert(offsetof(UIW_ProfileItem_Weight_C_ExecuteUbergraph_UIW_ProfileItem_Weight, EntryPoint) == 0x000000, "Member 'UIW_ProfileItem_Weight_C_ExecuteUbergraph_UIW_ProfileItem_Weight::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_ExecuteUbergraph_UIW_ProfileItem_Weight, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'UIW_ProfileItem_Weight_C_ExecuteUbergraph_UIW_ProfileItem_Weight::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_ExecuteUbergraph_UIW_ProfileItem_Weight, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'UIW_ProfileItem_Weight_C_ExecuteUbergraph_UIW_ProfileItem_Weight::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_ExecuteUbergraph_UIW_ProfileItem_Weight, K2Node_DynamicCast_AsLCharacter) == 0x000018, "Member 'UIW_ProfileItem_Weight_C_ExecuteUbergraph_UIW_ProfileItem_Weight::K2Node_DynamicCast_AsLCharacter' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_ExecuteUbergraph_UIW_ProfileItem_Weight, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'UIW_ProfileItem_Weight_C_ExecuteUbergraph_UIW_ProfileItem_Weight::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_ExecuteUbergraph_UIW_ProfileItem_Weight, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'UIW_ProfileItem_Weight_C_ExecuteUbergraph_UIW_ProfileItem_Weight::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_ExecuteUbergraph_UIW_ProfileItem_Weight, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000038, "Member 'UIW_ProfileItem_Weight_C_ExecuteUbergraph_UIW_ProfileItem_Weight::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_ExecuteUbergraph_UIW_ProfileItem_Weight, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'UIW_ProfileItem_Weight_C_ExecuteUbergraph_UIW_ProfileItem_Weight::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_ExecuteUbergraph_UIW_ProfileItem_Weight, CallFunc_GetPlayerEquipment_ReturnValue) == 0x000050, "Member 'UIW_ProfileItem_Weight_C_ExecuteUbergraph_UIW_ProfileItem_Weight::CallFunc_GetPlayerEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_ExecuteUbergraph_UIW_ProfileItem_Weight, CallFunc_GetGameStrWithName_ReturnValue) == 0x000058, "Member 'UIW_ProfileItem_Weight_C_ExecuteUbergraph_UIW_ProfileItem_Weight::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");

// Function UIW_ProfileItem_Weight.UIW_ProfileItem_Weight_C.RefreshData
// 0x01E8 (0x01E8 - 0x0000)
struct UIW_ProfileItem_Weight_C_RefreshData final
{
public:
	ELSecondStat                                  InStat;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0038(0x0028)()
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeightPenaltyInfoPtr                  CallFunc_GetWeightPenalty_ReturnValue;             // 0x0078(0x0008)(NoDestructor)
	class FName                                   CallFunc_GetPanaltyAbnormalstate_ReturnValue;      // 0x0080(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetWaringMsg_ReturnValue;                 // 0x0088(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0098(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x00B0(0x0028)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x00E0(0x0028)()
	int32                                         CallFunc_GetCharacterStat_ReturnValue;             // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharacterStat_ReturnValue_1;           // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0118(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_1;           // 0x0130(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0198(0x0018)()
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BuildString_Int_ReturnValue;              // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01D0(0x0018)()
};
static_assert(alignof(UIW_ProfileItem_Weight_C_RefreshData) == 0x000008, "Wrong alignment on UIW_ProfileItem_Weight_C_RefreshData");
static_assert(sizeof(UIW_ProfileItem_Weight_C_RefreshData) == 0x0001E8, "Wrong size on UIW_ProfileItem_Weight_C_RefreshData");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, InStat) == 0x000000, "Member 'UIW_ProfileItem_Weight_C_RefreshData::InStat' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'UIW_ProfileItem_Weight_C_RefreshData::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, K2Node_SwitchEnum_CmpSuccess) == 0x000030, "Member 'UIW_ProfileItem_Weight_C_RefreshData::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, K2Node_MakeStruct_SlateColor_1) == 0x000038, "Member 'UIW_ProfileItem_Weight_C_RefreshData::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000060, "Member 'UIW_ProfileItem_Weight_C_RefreshData::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, K2Node_DynamicCast_AsLPCCharacter) == 0x000068, "Member 'UIW_ProfileItem_Weight_C_RefreshData::K2Node_DynamicCast_AsLPCCharacter' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'UIW_ProfileItem_Weight_C_RefreshData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, CallFunc_GetWeightPenalty_ReturnValue) == 0x000078, "Member 'UIW_ProfileItem_Weight_C_RefreshData::CallFunc_GetWeightPenalty_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, CallFunc_GetPanaltyAbnormalstate_ReturnValue) == 0x000080, "Member 'UIW_ProfileItem_Weight_C_RefreshData::CallFunc_GetPanaltyAbnormalstate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, CallFunc_GetWaringMsg_ReturnValue) == 0x000088, "Member 'UIW_ProfileItem_Weight_C_RefreshData::CallFunc_GetWaringMsg_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, K2Node_SwitchName_CmpSuccess) == 0x000090, "Member 'UIW_ProfileItem_Weight_C_RefreshData::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, CallFunc_GetGameStrWithName_ReturnValue) == 0x000098, "Member 'UIW_ProfileItem_Weight_C_RefreshData::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, K2Node_MakeStruct_SlateColor_2) == 0x0000B0, "Member 'UIW_ProfileItem_Weight_C_RefreshData::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, CallFunc_IsValid_ReturnValue) == 0x0000D8, "Member 'UIW_ProfileItem_Weight_C_RefreshData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, K2Node_MakeStruct_SlateColor_3) == 0x0000E0, "Member 'UIW_ProfileItem_Weight_C_RefreshData::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, CallFunc_GetCharacterStat_ReturnValue) == 0x000108, "Member 'UIW_ProfileItem_Weight_C_RefreshData::CallFunc_GetCharacterStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, CallFunc_GetCharacterStat_ReturnValue_1) == 0x00010C, "Member 'UIW_ProfileItem_Weight_C_RefreshData::CallFunc_GetCharacterStat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000110, "Member 'UIW_ProfileItem_Weight_C_RefreshData::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000114, "Member 'UIW_ProfileItem_Weight_C_RefreshData::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, CallFunc_Conv_FloatToText_ReturnValue) == 0x000118, "Member 'UIW_ProfileItem_Weight_C_RefreshData::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, CallFunc_Conv_FloatToText_ReturnValue_1) == 0x000130, "Member 'UIW_ProfileItem_Weight_C_RefreshData::CallFunc_Conv_FloatToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, CallFunc_Conv_TextToString_ReturnValue) == 0x000148, "Member 'UIW_ProfileItem_Weight_C_RefreshData::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000158, "Member 'UIW_ProfileItem_Weight_C_RefreshData::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, CallFunc_Concat_StrStr_ReturnValue) == 0x000168, "Member 'UIW_ProfileItem_Weight_C_RefreshData::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000178, "Member 'UIW_ProfileItem_Weight_C_RefreshData::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000180, "Member 'UIW_ProfileItem_Weight_C_RefreshData::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000190, "Member 'UIW_ProfileItem_Weight_C_RefreshData::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, CallFunc_Conv_StringToText_ReturnValue) == 0x000198, "Member 'UIW_ProfileItem_Weight_C_RefreshData::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001B0, "Member 'UIW_ProfileItem_Weight_C_RefreshData::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, CallFunc_Multiply_IntFloat_ReturnValue_2) == 0x0001B4, "Member 'UIW_ProfileItem_Weight_C_RefreshData::CallFunc_Multiply_IntFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, CallFunc_FFloor_ReturnValue) == 0x0001B8, "Member 'UIW_ProfileItem_Weight_C_RefreshData::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, CallFunc_BuildString_Int_ReturnValue) == 0x0001C0, "Member 'UIW_ProfileItem_Weight_C_RefreshData::CallFunc_BuildString_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_RefreshData, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0001D0, "Member 'UIW_ProfileItem_Weight_C_RefreshData::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function UIW_ProfileItem_Weight.UIW_ProfileItem_Weight_C.OnChangeEquipItem
// 0x0018 (0x0018 - 0x0000)
struct UIW_ProfileItem_Weight_C_OnChangeEquipItem final
{
public:
	ELEquipSlotType                               EquipSlot;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 OldItem;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 NewItem;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ProfileItem_Weight_C_OnChangeEquipItem) == 0x000008, "Wrong alignment on UIW_ProfileItem_Weight_C_OnChangeEquipItem");
static_assert(sizeof(UIW_ProfileItem_Weight_C_OnChangeEquipItem) == 0x000018, "Wrong size on UIW_ProfileItem_Weight_C_OnChangeEquipItem");
static_assert(offsetof(UIW_ProfileItem_Weight_C_OnChangeEquipItem, EquipSlot) == 0x000000, "Member 'UIW_ProfileItem_Weight_C_OnChangeEquipItem::EquipSlot' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_OnChangeEquipItem, OldItem) == 0x000008, "Member 'UIW_ProfileItem_Weight_C_OnChangeEquipItem::OldItem' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Weight_C_OnChangeEquipItem, NewItem) == 0x000010, "Member 'UIW_ProfileItem_Weight_C_OnChangeEquipItem::NewItem' has a wrong offset!");

}

