#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HUD_Gauge

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UIW_HUD_Gauge.UIW_HUD_Gauge_C.ExecuteUbergraph_UIW_HUD_Gauge
// 0x0004 (0x0004 - 0x0000)
struct UIW_HUD_Gauge_C_ExecuteUbergraph_UIW_HUD_Gauge final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HUD_Gauge_C_ExecuteUbergraph_UIW_HUD_Gauge) == 0x000004, "Wrong alignment on UIW_HUD_Gauge_C_ExecuteUbergraph_UIW_HUD_Gauge");
static_assert(sizeof(UIW_HUD_Gauge_C_ExecuteUbergraph_UIW_HUD_Gauge) == 0x000004, "Wrong size on UIW_HUD_Gauge_C_ExecuteUbergraph_UIW_HUD_Gauge");
static_assert(offsetof(UIW_HUD_Gauge_C_ExecuteUbergraph_UIW_HUD_Gauge, EntryPoint) == 0x000000, "Member 'UIW_HUD_Gauge_C_ExecuteUbergraph_UIW_HUD_Gauge::EntryPoint' has a wrong offset!");

// Function UIW_HUD_Gauge.UIW_HUD_Gauge_C.InitGauge
// 0x0030 (0x0030 - 0x0000)
struct UIW_HUD_Gauge_C_InitGauge final
{
public:
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HUD_Gauge_C_InitGauge) == 0x000008, "Wrong alignment on UIW_HUD_Gauge_C_InitGauge");
static_assert(sizeof(UIW_HUD_Gauge_C_InitGauge) == 0x000030, "Wrong size on UIW_HUD_Gauge_C_InitGauge");
static_assert(offsetof(UIW_HUD_Gauge_C_InitGauge, CallFunc_MakeVector2D_ReturnValue) == 0x000000, "Member 'UIW_HUD_Gauge_C_InitGauge::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_C_InitGauge, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000008, "Member 'UIW_HUD_Gauge_C_InitGauge::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_C_InitGauge, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000010, "Member 'UIW_HUD_Gauge_C_InitGauge::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_C_InitGauge, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x000018, "Member 'UIW_HUD_Gauge_C_InitGauge::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_C_InitGauge, CallFunc_GetSize_ReturnValue) == 0x000020, "Member 'UIW_HUD_Gauge_C_InitGauge::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_C_InitGauge, CallFunc_BreakVector2D_X) == 0x000028, "Member 'UIW_HUD_Gauge_C_InitGauge::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_C_InitGauge, CallFunc_BreakVector2D_Y) == 0x00002C, "Member 'UIW_HUD_Gauge_C_InitGauge::CallFunc_BreakVector2D_Y' has a wrong offset!");

// Function UIW_HUD_Gauge.UIW_HUD_Gauge_C.SetGaugeColor
// 0x0070 (0x0070 - 0x0000)
struct UIW_HUD_Gauge_C_SetGaugeColor final
{
public:
	struct FLinearColor                           HPColor;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           FXGradationColor;                                  // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0020(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0048(0x0028)()
};
static_assert(alignof(UIW_HUD_Gauge_C_SetGaugeColor) == 0x000008, "Wrong alignment on UIW_HUD_Gauge_C_SetGaugeColor");
static_assert(sizeof(UIW_HUD_Gauge_C_SetGaugeColor) == 0x000070, "Wrong size on UIW_HUD_Gauge_C_SetGaugeColor");
static_assert(offsetof(UIW_HUD_Gauge_C_SetGaugeColor, HPColor) == 0x000000, "Member 'UIW_HUD_Gauge_C_SetGaugeColor::HPColor' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_C_SetGaugeColor, FXGradationColor) == 0x000010, "Member 'UIW_HUD_Gauge_C_SetGaugeColor::FXGradationColor' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_C_SetGaugeColor, K2Node_MakeStruct_SlateColor) == 0x000020, "Member 'UIW_HUD_Gauge_C_SetGaugeColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_C_SetGaugeColor, K2Node_MakeStruct_SlateColor_1) == 0x000048, "Member 'UIW_HUD_Gauge_C_SetGaugeColor::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function UIW_HUD_Gauge.UIW_HUD_Gauge_C.SetParalyze
// 0x0010 (0x0010 - 0x0000)
struct UIW_HUD_Gauge_C_SetParalyze final
{
public:
	class ALNPCCharacter*                         NPC;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAbleParalyze;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_HUD_Gauge_C_SetParalyze) == 0x000008, "Wrong alignment on UIW_HUD_Gauge_C_SetParalyze");
static_assert(sizeof(UIW_HUD_Gauge_C_SetParalyze) == 0x000010, "Wrong size on UIW_HUD_Gauge_C_SetParalyze");
static_assert(offsetof(UIW_HUD_Gauge_C_SetParalyze, NPC) == 0x000000, "Member 'UIW_HUD_Gauge_C_SetParalyze::NPC' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_C_SetParalyze, IsAbleParalyze) == 0x000008, "Member 'UIW_HUD_Gauge_C_SetParalyze::IsAbleParalyze' has a wrong offset!");

// Function UIW_HUD_Gauge.UIW_HUD_Gauge_C.RefreshGauge
// 0x0050 (0x0050 - 0x0000)
struct UIW_HUD_Gauge_C_RefreshGauge final
{
public:
	float                                         CurrentPercent;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedTween;                                         // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTweenEase                             K2Node_MakeStruct_TweenEase;                       // 0x0008(0x000C)(NoDestructor)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HUD_Gauge_C_RefreshGauge) == 0x000008, "Wrong alignment on UIW_HUD_Gauge_C_RefreshGauge");
static_assert(sizeof(UIW_HUD_Gauge_C_RefreshGauge) == 0x000050, "Wrong size on UIW_HUD_Gauge_C_RefreshGauge");
static_assert(offsetof(UIW_HUD_Gauge_C_RefreshGauge, CurrentPercent) == 0x000000, "Member 'UIW_HUD_Gauge_C_RefreshGauge::CurrentPercent' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_C_RefreshGauge, NeedTween) == 0x000004, "Member 'UIW_HUD_Gauge_C_RefreshGauge::NeedTween' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_C_RefreshGauge, K2Node_MakeStruct_TweenEase) == 0x000008, "Member 'UIW_HUD_Gauge_C_RefreshGauge::K2Node_MakeStruct_TweenEase' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_C_RefreshGauge, CallFunc_FMax_ReturnValue) == 0x000014, "Member 'UIW_HUD_Gauge_C_RefreshGauge::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_C_RefreshGauge, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000018, "Member 'UIW_HUD_Gauge_C_RefreshGauge::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_C_RefreshGauge, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000020, "Member 'UIW_HUD_Gauge_C_RefreshGauge::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_C_RefreshGauge, CallFunc_GetSize_ReturnValue) == 0x000024, "Member 'UIW_HUD_Gauge_C_RefreshGauge::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_C_RefreshGauge, CallFunc_MakeVector2D_ReturnValue) == 0x00002C, "Member 'UIW_HUD_Gauge_C_RefreshGauge::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_C_RefreshGauge, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000038, "Member 'UIW_HUD_Gauge_C_RefreshGauge::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_C_RefreshGauge, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000040, "Member 'UIW_HUD_Gauge_C_RefreshGauge::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_C_RefreshGauge, CallFunc_MakeVector2D_ReturnValue_1) == 0x000044, "Member 'UIW_HUD_Gauge_C_RefreshGauge::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");

}

