#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_AutoSave

#include "Basic.hpp"


namespace SDK::Params
{

// Function UIW_AutoSave.UIW_AutoSave_C.ExecuteUbergraph_UIW_AutoSave
// 0x0020 (0x0020 - 0x0000)
struct UIW_AutoSave_C_ExecuteUbergraph_UIW_AutoSave final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULOptionSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAutoSaveAlert_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_AutoSave_C_ExecuteUbergraph_UIW_AutoSave) == 0x000008, "Wrong alignment on UIW_AutoSave_C_ExecuteUbergraph_UIW_AutoSave");
static_assert(sizeof(UIW_AutoSave_C_ExecuteUbergraph_UIW_AutoSave) == 0x000020, "Wrong size on UIW_AutoSave_C_ExecuteUbergraph_UIW_AutoSave");
static_assert(offsetof(UIW_AutoSave_C_ExecuteUbergraph_UIW_AutoSave, EntryPoint) == 0x000000, "Member 'UIW_AutoSave_C_ExecuteUbergraph_UIW_AutoSave::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_AutoSave_C_ExecuteUbergraph_UIW_AutoSave, K2Node_ComponentBoundEvent_BtnKey) == 0x000008, "Member 'UIW_AutoSave_C_ExecuteUbergraph_UIW_AutoSave::K2Node_ComponentBoundEvent_BtnKey' has a wrong offset!");
static_assert(offsetof(UIW_AutoSave_C_ExecuteUbergraph_UIW_AutoSave, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'UIW_AutoSave_C_ExecuteUbergraph_UIW_AutoSave::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_AutoSave_C_ExecuteUbergraph_UIW_AutoSave, CallFunc_GetAutoSaveAlert_ReturnValue) == 0x000018, "Member 'UIW_AutoSave_C_ExecuteUbergraph_UIW_AutoSave::CallFunc_GetAutoSaveAlert_ReturnValue' has a wrong offset!");

// Function UIW_AutoSave.UIW_AutoSave_C.BndEvt__UIW_AutoSave_Btn_Confirm_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_AutoSave_C_BndEvt__UIW_AutoSave_Btn_Confirm_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_AutoSave_C_BndEvt__UIW_AutoSave_Btn_Confirm_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_AutoSave_C_BndEvt__UIW_AutoSave_Btn_Confirm_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature");
static_assert(sizeof(UIW_AutoSave_C_BndEvt__UIW_AutoSave_Btn_Confirm_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_AutoSave_C_BndEvt__UIW_AutoSave_Btn_Confirm_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature");
static_assert(offsetof(UIW_AutoSave_C_BndEvt__UIW_AutoSave_Btn_Confirm_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_AutoSave_C_BndEvt__UIW_AutoSave_Btn_Confirm_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_AutoSave.UIW_AutoSave_C.OnReady
// 0x0048 (0x0048 - 0x0000)
struct UIW_AutoSave_C_OnReady final
{
public:
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0000(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x0018(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_2;         // 0x0030(0x0018)()
};
static_assert(alignof(UIW_AutoSave_C_OnReady) == 0x000008, "Wrong alignment on UIW_AutoSave_C_OnReady");
static_assert(sizeof(UIW_AutoSave_C_OnReady) == 0x000048, "Wrong size on UIW_AutoSave_C_OnReady");
static_assert(offsetof(UIW_AutoSave_C_OnReady, CallFunc_GetGameStrWithName_ReturnValue) == 0x000000, "Member 'UIW_AutoSave_C_OnReady::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_AutoSave_C_OnReady, CallFunc_GetGameStrWithName_ReturnValue_1) == 0x000018, "Member 'UIW_AutoSave_C_OnReady::CallFunc_GetGameStrWithName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_AutoSave_C_OnReady, CallFunc_GetGameStrWithName_ReturnValue_2) == 0x000030, "Member 'UIW_AutoSave_C_OnReady::CallFunc_GetGameStrWithName_ReturnValue_2' has a wrong offset!");

}

