#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HUD_Tutorial

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_HUD_Tutorial.UIW_HUD_Tutorial_C
// 0x0040 (0x02A8 - 0x0268)
class UUIW_HUD_Tutorial_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_End;                                           // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Start;                                         // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUIBP_LRichKeyTextBlock_C*              KeyBindText;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ShowAndHide;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           VisibleTimerHandle;                                // 0x0290(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   CodeName;                                          // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IsShowForTick;                                     // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShow;                                            // 0x02A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UIW_HUD_Tutorial(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void WidgetAnimationEvt_Ani_End_K2Node_WidgetAnimationEvent_0();
	void Destruct();
	void Construct();
	void Show();
	void Hide();
	void OnVisibleTutorial(class FName TutorialName, bool VisibleFlag, float VisibleTime);
	void HideTime();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_HUD_Tutorial_C">();
	}
	static class UUIW_HUD_Tutorial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_HUD_Tutorial_C>();
	}
};
static_assert(alignof(UUIW_HUD_Tutorial_C) == 0x000008, "Wrong alignment on UUIW_HUD_Tutorial_C");
static_assert(sizeof(UUIW_HUD_Tutorial_C) == 0x0002A8, "Wrong size on UUIW_HUD_Tutorial_C");
static_assert(offsetof(UUIW_HUD_Tutorial_C, UberGraphFrame) == 0x000268, "Member 'UUIW_HUD_Tutorial_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Tutorial_C, Ani_End) == 0x000270, "Member 'UUIW_HUD_Tutorial_C::Ani_End' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Tutorial_C, Ani_Start) == 0x000278, "Member 'UUIW_HUD_Tutorial_C::Ani_Start' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Tutorial_C, KeyBindText) == 0x000280, "Member 'UUIW_HUD_Tutorial_C::KeyBindText' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Tutorial_C, ShowAndHide) == 0x000288, "Member 'UUIW_HUD_Tutorial_C::ShowAndHide' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Tutorial_C, VisibleTimerHandle) == 0x000290, "Member 'UUIW_HUD_Tutorial_C::VisibleTimerHandle' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Tutorial_C, CodeName) == 0x000298, "Member 'UUIW_HUD_Tutorial_C::CodeName' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Tutorial_C, IsShowForTick) == 0x0002A0, "Member 'UUIW_HUD_Tutorial_C::IsShowForTick' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Tutorial_C, IsShow) == 0x0002A4, "Member 'UUIW_HUD_Tutorial_C::IsShow' has a wrong offset!");

}

