#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HUD_LegionArm_State_Icon

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK::Params
{

// Function UIW_HUD_LegionArm_State_Icon.UIW_HUD_LegionArm_State_Icon_C.ExecuteUbergraph_UIW_HUD_LegionArm_State_Icon
// 0x0058 (0x0058 - 0x0000)
struct UIW_HUD_LegionArm_State_Icon_C_ExecuteUbergraph_UIW_HUD_LegionArm_State_Icon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ELShotGunAmmoType Type)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLEquipItemSlot                        CallFunc_GetChosenSlaveArmItem_ReturnValue;        // 0x0030(0x0018)(NoDestructor)
	class ULSlaveArmItem*                         K2Node_DynamicCast_AsLSlave_Arm_Item;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_HUD_LegionArm_State_Icon_C_ExecuteUbergraph_UIW_HUD_LegionArm_State_Icon) == 0x000008, "Wrong alignment on UIW_HUD_LegionArm_State_Icon_C_ExecuteUbergraph_UIW_HUD_LegionArm_State_Icon");
static_assert(sizeof(UIW_HUD_LegionArm_State_Icon_C_ExecuteUbergraph_UIW_HUD_LegionArm_State_Icon) == 0x000058, "Wrong size on UIW_HUD_LegionArm_State_Icon_C_ExecuteUbergraph_UIW_HUD_LegionArm_State_Icon");
static_assert(offsetof(UIW_HUD_LegionArm_State_Icon_C_ExecuteUbergraph_UIW_HUD_LegionArm_State_Icon, EntryPoint) == 0x000000, "Member 'UIW_HUD_LegionArm_State_Icon_C_ExecuteUbergraph_UIW_HUD_LegionArm_State_Icon::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_HUD_LegionArm_State_Icon_C_ExecuteUbergraph_UIW_HUD_LegionArm_State_Icon, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UIW_HUD_LegionArm_State_Icon_C_ExecuteUbergraph_UIW_HUD_LegionArm_State_Icon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_HUD_LegionArm_State_Icon_C_ExecuteUbergraph_UIW_HUD_LegionArm_State_Icon, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'UIW_HUD_LegionArm_State_Icon_C_ExecuteUbergraph_UIW_HUD_LegionArm_State_Icon::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_LegionArm_State_Icon_C_ExecuteUbergraph_UIW_HUD_LegionArm_State_Icon, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000020, "Member 'UIW_HUD_LegionArm_State_Icon_C_ExecuteUbergraph_UIW_HUD_LegionArm_State_Icon::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_LegionArm_State_Icon_C_ExecuteUbergraph_UIW_HUD_LegionArm_State_Icon, CallFunc_GetPlayerEquipment_ReturnValue) == 0x000028, "Member 'UIW_HUD_LegionArm_State_Icon_C_ExecuteUbergraph_UIW_HUD_LegionArm_State_Icon::CallFunc_GetPlayerEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_LegionArm_State_Icon_C_ExecuteUbergraph_UIW_HUD_LegionArm_State_Icon, CallFunc_GetChosenSlaveArmItem_ReturnValue) == 0x000030, "Member 'UIW_HUD_LegionArm_State_Icon_C_ExecuteUbergraph_UIW_HUD_LegionArm_State_Icon::CallFunc_GetChosenSlaveArmItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_LegionArm_State_Icon_C_ExecuteUbergraph_UIW_HUD_LegionArm_State_Icon, K2Node_DynamicCast_AsLSlave_Arm_Item) == 0x000048, "Member 'UIW_HUD_LegionArm_State_Icon_C_ExecuteUbergraph_UIW_HUD_LegionArm_State_Icon::K2Node_DynamicCast_AsLSlave_Arm_Item' has a wrong offset!");
static_assert(offsetof(UIW_HUD_LegionArm_State_Icon_C_ExecuteUbergraph_UIW_HUD_LegionArm_State_Icon, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'UIW_HUD_LegionArm_State_Icon_C_ExecuteUbergraph_UIW_HUD_LegionArm_State_Icon::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UIW_HUD_LegionArm_State_Icon.UIW_HUD_LegionArm_State_Icon_C.OnChangeShotgunAmmo
// 0x0002 (0x0002 - 0x0000)
struct UIW_HUD_LegionArm_State_Icon_C_OnChangeShotgunAmmo final
{
public:
	ELShotGunAmmoType                             Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_HUD_LegionArm_State_Icon_C_OnChangeShotgunAmmo) == 0x000001, "Wrong alignment on UIW_HUD_LegionArm_State_Icon_C_OnChangeShotgunAmmo");
static_assert(sizeof(UIW_HUD_LegionArm_State_Icon_C_OnChangeShotgunAmmo) == 0x000002, "Wrong size on UIW_HUD_LegionArm_State_Icon_C_OnChangeShotgunAmmo");
static_assert(offsetof(UIW_HUD_LegionArm_State_Icon_C_OnChangeShotgunAmmo, Type) == 0x000000, "Member 'UIW_HUD_LegionArm_State_Icon_C_OnChangeShotgunAmmo::Type' has a wrong offset!");
static_assert(offsetof(UIW_HUD_LegionArm_State_Icon_C_OnChangeShotgunAmmo, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'UIW_HUD_LegionArm_State_Icon_C_OnChangeShotgunAmmo::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function UIW_HUD_LegionArm_State_Icon.UIW_HUD_LegionArm_State_Icon_C.OnChooseSlaveArm
// 0x0028 (0x0028 - 0x0000)
struct UIW_HUD_LegionArm_State_Icon_C_OnChooseSlaveArm final
{
public:
	struct FLEquipItemSlot                        SlaveArmSlot;                                      // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	class ULSlaveArmItem*                         K2Node_DynamicCast_AsLSlave_Arm_Item;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShotGunSlavearm_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_HUD_LegionArm_State_Icon_C_OnChooseSlaveArm) == 0x000008, "Wrong alignment on UIW_HUD_LegionArm_State_Icon_C_OnChooseSlaveArm");
static_assert(sizeof(UIW_HUD_LegionArm_State_Icon_C_OnChooseSlaveArm) == 0x000028, "Wrong size on UIW_HUD_LegionArm_State_Icon_C_OnChooseSlaveArm");
static_assert(offsetof(UIW_HUD_LegionArm_State_Icon_C_OnChooseSlaveArm, SlaveArmSlot) == 0x000000, "Member 'UIW_HUD_LegionArm_State_Icon_C_OnChooseSlaveArm::SlaveArmSlot' has a wrong offset!");
static_assert(offsetof(UIW_HUD_LegionArm_State_Icon_C_OnChooseSlaveArm, K2Node_DynamicCast_AsLSlave_Arm_Item) == 0x000018, "Member 'UIW_HUD_LegionArm_State_Icon_C_OnChooseSlaveArm::K2Node_DynamicCast_AsLSlave_Arm_Item' has a wrong offset!");
static_assert(offsetof(UIW_HUD_LegionArm_State_Icon_C_OnChooseSlaveArm, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'UIW_HUD_LegionArm_State_Icon_C_OnChooseSlaveArm::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_HUD_LegionArm_State_Icon_C_OnChooseSlaveArm, CallFunc_IsShotGunSlavearm_ReturnValue) == 0x000021, "Member 'UIW_HUD_LegionArm_State_Icon_C_OnChooseSlaveArm::CallFunc_IsShotGunSlavearm_ReturnValue' has a wrong offset!");

}

