#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Module_TitleText

#include "Basic.hpp"


namespace SDK::Params
{

// Function UIW_Module_TitleText.UIW_Module_TitleText_C.SetModule
// 0x0018 (0x0018 - 0x0000)
struct UIW_Module_TitleText_C_SetModule final
{
public:
	class UUIW_Popup_C*                           PopupWindow_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Data;                                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Module_TitleText_C_SetModule) == 0x000008, "Wrong alignment on UIW_Module_TitleText_C_SetModule");
static_assert(sizeof(UIW_Module_TitleText_C_SetModule) == 0x000018, "Wrong size on UIW_Module_TitleText_C_SetModule");
static_assert(offsetof(UIW_Module_TitleText_C_SetModule, PopupWindow_0) == 0x000000, "Member 'UIW_Module_TitleText_C_SetModule::PopupWindow_0' has a wrong offset!");
static_assert(offsetof(UIW_Module_TitleText_C_SetModule, Data) == 0x000008, "Member 'UIW_Module_TitleText_C_SetModule::Data' has a wrong offset!");

// Function UIW_Module_TitleText.UIW_Module_TitleText_C.SetGameString
// 0x0070 (0x0070 - 0x0000)
struct UIW_Module_TitleText_C_SetGameString final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStr_ReturnValue;                   // 0x0010(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
};
static_assert(alignof(UIW_Module_TitleText_C_SetGameString) == 0x000008, "Wrong alignment on UIW_Module_TitleText_C_SetGameString");
static_assert(sizeof(UIW_Module_TitleText_C_SetGameString) == 0x000070, "Wrong size on UIW_Module_TitleText_C_SetGameString");
static_assert(offsetof(UIW_Module_TitleText_C_SetGameString, String) == 0x000000, "Member 'UIW_Module_TitleText_C_SetGameString::String' has a wrong offset!");
static_assert(offsetof(UIW_Module_TitleText_C_SetGameString, CallFunc_GetGameStr_ReturnValue) == 0x000010, "Member 'UIW_Module_TitleText_C_SetGameString::CallFunc_GetGameStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_TitleText_C_SetGameString, CallFunc_Conv_TextToString_ReturnValue) == 0x000028, "Member 'UIW_Module_TitleText_C_SetGameString::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_TitleText_C_SetGameString, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'UIW_Module_TitleText_C_SetGameString::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_TitleText_C_SetGameString, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000048, "Member 'UIW_Module_TitleText_C_SetGameString::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Module_TitleText_C_SetGameString, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'UIW_Module_TitleText_C_SetGameString::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function UIW_Module_TitleText.UIW_Module_TitleText_C.SetText
// 0x0060 (0x0060 - 0x0000)
struct UIW_Module_TitleText_C_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
};
static_assert(alignof(UIW_Module_TitleText_C_SetText) == 0x000008, "Wrong alignment on UIW_Module_TitleText_C_SetText");
static_assert(sizeof(UIW_Module_TitleText_C_SetText) == 0x000060, "Wrong size on UIW_Module_TitleText_C_SetText");
static_assert(offsetof(UIW_Module_TitleText_C_SetText, Text) == 0x000000, "Member 'UIW_Module_TitleText_C_SetText::Text' has a wrong offset!");
static_assert(offsetof(UIW_Module_TitleText_C_SetText, CallFunc_Conv_TextToString_ReturnValue) == 0x000018, "Member 'UIW_Module_TitleText_C_SetText::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_TitleText_C_SetText, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'UIW_Module_TitleText_C_SetText::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_TitleText_C_SetText, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000038, "Member 'UIW_Module_TitleText_C_SetText::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Module_TitleText_C_SetText, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'UIW_Module_TitleText_C_SetText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

