#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_SecondTitle_Icon

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_SecondTitle_Icon.UIW_SecondTitle_Icon_C
// 0x0030 (0x02D8 - 0x02A8)
class UUIW_SecondTitle_Icon_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Icon;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_New_Dot;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Title;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UIW_SecondTitle_Icon(int32 EntryPoint);
	void Construct();
	void SetData(class UTexture2D* Icon, class FName Label);
	void SetSelected(bool IsSelected_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_SecondTitle_Icon_C">();
	}
	static class UUIW_SecondTitle_Icon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_SecondTitle_Icon_C>();
	}
};
static_assert(alignof(UUIW_SecondTitle_Icon_C) == 0x000008, "Wrong alignment on UUIW_SecondTitle_Icon_C");
static_assert(sizeof(UUIW_SecondTitle_Icon_C) == 0x0002D8, "Wrong size on UUIW_SecondTitle_Icon_C");
static_assert(offsetof(UUIW_SecondTitle_Icon_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_SecondTitle_Icon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_SecondTitle_Icon_C, CanvasPanel_0) == 0x0002B0, "Member 'UUIW_SecondTitle_Icon_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UUIW_SecondTitle_Icon_C, Img_Icon) == 0x0002B8, "Member 'UUIW_SecondTitle_Icon_C::Img_Icon' has a wrong offset!");
static_assert(offsetof(UUIW_SecondTitle_Icon_C, Img_New_Dot) == 0x0002C0, "Member 'UUIW_SecondTitle_Icon_C::Img_New_Dot' has a wrong offset!");
static_assert(offsetof(UUIW_SecondTitle_Icon_C, Text_Title) == 0x0002C8, "Member 'UUIW_SecondTitle_Icon_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UUIW_SecondTitle_Icon_C, IsSelected) == 0x0002D0, "Member 'UUIW_SecondTitle_Icon_C::IsSelected' has a wrong offset!");

}

