#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HUD_Gauge_Frenzy

#include "Basic.hpp"

#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function UIW_HUD_Gauge_Frenzy.UIW_HUD_Gauge_Frenzy_C.ExecuteUbergraph_UIW_HUD_Gauge_Frenzy
// 0x0030 (0x0030 - 0x0000)
struct UIW_HUD_Gauge_Frenzy_C_ExecuteUbergraph_UIW_HUD_Gauge_Frenzy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 Current, int32 Max, int32 UnitCount, int32 ConsumeUnitCount, ELFrenzyConsumeReason FrenzyPointConsumeReason)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class UUIW_HUD_Gauge_FrenzyItem_C*>    K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(UIW_HUD_Gauge_Frenzy_C_ExecuteUbergraph_UIW_HUD_Gauge_Frenzy) == 0x000008, "Wrong alignment on UIW_HUD_Gauge_Frenzy_C_ExecuteUbergraph_UIW_HUD_Gauge_Frenzy");
static_assert(sizeof(UIW_HUD_Gauge_Frenzy_C_ExecuteUbergraph_UIW_HUD_Gauge_Frenzy) == 0x000030, "Wrong size on UIW_HUD_Gauge_Frenzy_C_ExecuteUbergraph_UIW_HUD_Gauge_Frenzy");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_ExecuteUbergraph_UIW_HUD_Gauge_Frenzy, EntryPoint) == 0x000000, "Member 'UIW_HUD_Gauge_Frenzy_C_ExecuteUbergraph_UIW_HUD_Gauge_Frenzy::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_ExecuteUbergraph_UIW_HUD_Gauge_Frenzy, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UIW_HUD_Gauge_Frenzy_C_ExecuteUbergraph_UIW_HUD_Gauge_Frenzy::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_ExecuteUbergraph_UIW_HUD_Gauge_Frenzy, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'UIW_HUD_Gauge_Frenzy_C_ExecuteUbergraph_UIW_HUD_Gauge_Frenzy::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_ExecuteUbergraph_UIW_HUD_Gauge_Frenzy, K2Node_MakeArray_Array) == 0x000020, "Member 'UIW_HUD_Gauge_Frenzy_C_ExecuteUbergraph_UIW_HUD_Gauge_Frenzy::K2Node_MakeArray_Array' has a wrong offset!");

// Function UIW_HUD_Gauge_Frenzy.UIW_HUD_Gauge_Frenzy_C.UpdateFrenzyPoint
// 0x0078 (0x0078 - 0x0000)
struct UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint final
{
public:
	int32                                         Current;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Max;                                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UnitCount;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ConsumeUnitCount;                                  // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELFrenzyConsumeReason                         FrenzyPointConsumeReason;                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalIsChangedUnitCount;                           // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_HUD_Gauge_FrenzyItem_C*            CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_HUD_Gauge_FrenzyItem_C*            CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint) == 0x000008, "Wrong alignment on UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint");
static_assert(sizeof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint) == 0x000078, "Wrong size on UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint, Current) == 0x000000, "Member 'UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint::Current' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint, Max) == 0x000004, "Member 'UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint::Max' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint, UnitCount) == 0x000008, "Member 'UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint::UnitCount' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint, ConsumeUnitCount) == 0x00000C, "Member 'UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint::ConsumeUnitCount' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint, FrenzyPointConsumeReason) == 0x000010, "Member 'UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint::FrenzyPointConsumeReason' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint, LocalIsChangedUnitCount) == 0x000011, "Member 'UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint::LocalIsChangedUnitCount' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint, CallFunc_Subtract_IntInt_ReturnValue) == 0x000014, "Member 'UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint, CallFunc_Divide_IntInt_ReturnValue) == 0x000018, "Member 'UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00001C, "Member 'UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint, Temp_int_Variable) == 0x000020, "Member 'UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint, CallFunc_Multiply_IntInt_ReturnValue) == 0x000028, "Member 'UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00002C, "Member 'UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000030, "Member 'UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000034, "Member 'UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000038, "Member 'UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint, CallFunc_FClamp_ReturnValue) == 0x000040, "Member 'UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint, Temp_int_Array_Index_Variable) == 0x000044, "Member 'UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint, CallFunc_Array_Get_Item) == 0x000050, "Member 'UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint, CallFunc_Less_IntInt_ReturnValue_1) == 0x000060, "Member 'UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint, CallFunc_Add_IntInt_ReturnValue_1) == 0x000064, "Member 'UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000070, "Member 'UIW_HUD_Gauge_Frenzy_C_UpdateFrenzyPoint::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

}

