#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_MOV_Subtitle

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_MOV_Subtitle.UIW_MOV_Subtitle_C
// 0x0030 (0x02D8 - 0x02A8)
class UUIW_MOV_Subtitle_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                BorderText;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_1;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              Script_Scale;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIBP_LRichKeyTextBlock_C*              Text;                                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           HideTimer;                                         // 0x02D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_MOV_Subtitle(int32 EntryPoint);
	void Destruct();
	void Construct();
	void OnShowSubtitle(class FName CodeName, float Duration);
	void Hide();
	void CompleteTween(class FName CategoryName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_MOV_Subtitle_C">();
	}
	static class UUIW_MOV_Subtitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_MOV_Subtitle_C>();
	}
};
static_assert(alignof(UUIW_MOV_Subtitle_C) == 0x000008, "Wrong alignment on UUIW_MOV_Subtitle_C");
static_assert(sizeof(UUIW_MOV_Subtitle_C) == 0x0002D8, "Wrong size on UUIW_MOV_Subtitle_C");
static_assert(offsetof(UUIW_MOV_Subtitle_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_MOV_Subtitle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_MOV_Subtitle_C, BorderText) == 0x0002B0, "Member 'UUIW_MOV_Subtitle_C::BorderText' has a wrong offset!");
static_assert(offsetof(UUIW_MOV_Subtitle_C, CanvasPanel_1) == 0x0002B8, "Member 'UUIW_MOV_Subtitle_C::CanvasPanel_1' has a wrong offset!");
static_assert(offsetof(UUIW_MOV_Subtitle_C, Script_Scale) == 0x0002C0, "Member 'UUIW_MOV_Subtitle_C::Script_Scale' has a wrong offset!");
static_assert(offsetof(UUIW_MOV_Subtitle_C, Text) == 0x0002C8, "Member 'UUIW_MOV_Subtitle_C::Text' has a wrong offset!");
static_assert(offsetof(UUIW_MOV_Subtitle_C, HideTimer) == 0x0002D0, "Member 'UUIW_MOV_Subtitle_C::HideTimer' has a wrong offset!");

}

