#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Alert_BGM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Alert_BGM.UIW_Alert_BGM_C
// 0x0040 (0x02A8 - 0x0268)
class UUIW_Alert_BGM_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Construct;                                     // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Img_Record;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Title;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           VisibleEffect;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           EffectTimer;                                       // 0x0290(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           HideTimer;                                         // 0x0298(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         VisibleEffectValue;                                // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VisibleEffectProgress;                             // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_Alert_BGM(int32 EntryPoint);
	void Construct();
	void Destruct();
	void ShowBGM(class FName RowName);
	void HideBGM();
	void VisibleEffectShow();
	void VisibleEffectHide();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Alert_BGM_C">();
	}
	static class UUIW_Alert_BGM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Alert_BGM_C>();
	}
};
static_assert(alignof(UUIW_Alert_BGM_C) == 0x000008, "Wrong alignment on UUIW_Alert_BGM_C");
static_assert(sizeof(UUIW_Alert_BGM_C) == 0x0002A8, "Wrong size on UUIW_Alert_BGM_C");
static_assert(offsetof(UUIW_Alert_BGM_C, UberGraphFrame) == 0x000268, "Member 'UUIW_Alert_BGM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_BGM_C, Ani_Construct) == 0x000270, "Member 'UUIW_Alert_BGM_C::Ani_Construct' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_BGM_C, Img_Record) == 0x000278, "Member 'UUIW_Alert_BGM_C::Img_Record' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_BGM_C, Text_Title) == 0x000280, "Member 'UUIW_Alert_BGM_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_BGM_C, VisibleEffect) == 0x000288, "Member 'UUIW_Alert_BGM_C::VisibleEffect' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_BGM_C, EffectTimer) == 0x000290, "Member 'UUIW_Alert_BGM_C::EffectTimer' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_BGM_C, HideTimer) == 0x000298, "Member 'UUIW_Alert_BGM_C::HideTimer' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_BGM_C, VisibleEffectValue) == 0x0002A0, "Member 'UUIW_Alert_BGM_C::VisibleEffectValue' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_BGM_C, VisibleEffectProgress) == 0x0002A4, "Member 'UUIW_Alert_BGM_C::VisibleEffectProgress' has a wrong offset!");

}

