#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_SelectQuantity

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UIW_SelectQuantity.UIW_SelectQuantity_C.OnSelectedValue__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_SelectQuantity_C_OnSelectedValue__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_SelectQuantity_C_OnSelectedValue__DelegateSignature) == 0x000004, "Wrong alignment on UIW_SelectQuantity_C_OnSelectedValue__DelegateSignature");
static_assert(sizeof(UIW_SelectQuantity_C_OnSelectedValue__DelegateSignature) == 0x000004, "Wrong size on UIW_SelectQuantity_C_OnSelectedValue__DelegateSignature");
static_assert(offsetof(UIW_SelectQuantity_C_OnSelectedValue__DelegateSignature, Value) == 0x000000, "Member 'UIW_SelectQuantity_C_OnSelectedValue__DelegateSignature::Value' has a wrong offset!");

// Function UIW_SelectQuantity.UIW_SelectQuantity_C.ExecuteUbergraph_UIW_SelectQuantity
// 0x0088 (0x0088 - 0x0000)
struct UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0008(0x0018)()
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_3;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_2;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Spinner_C*                         K2Node_ComponentBoundEvent_Spinner_1;              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Spinner_C*                         K2Node_ComponentBoundEvent_Spinner;                // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget_1;               // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_Value;                           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_1;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_Value_1;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetValue_Value_2;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_Value_3;                         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity) == 0x000008, "Wrong alignment on UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity");
static_assert(sizeof(UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity) == 0x000088, "Wrong size on UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity");
static_assert(offsetof(UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity, EntryPoint) == 0x000000, "Member 'UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity, CallFunc_GetGameStrWithName_ReturnValue) == 0x000008, "Member 'UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity, K2Node_ComponentBoundEvent_BtnKey_3) == 0x000020, "Member 'UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity::K2Node_ComponentBoundEvent_BtnKey_3' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity, K2Node_ComponentBoundEvent_BtnKey_2) == 0x000028, "Member 'UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity::K2Node_ComponentBoundEvent_BtnKey_2' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity, CallFunc_GetMainWidget_MainWidget) == 0x000030, "Member 'UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity, K2Node_ComponentBoundEvent_Spinner_1) == 0x000038, "Member 'UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity::K2Node_ComponentBoundEvent_Spinner_1' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity, K2Node_ComponentBoundEvent_Spinner) == 0x000040, "Member 'UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity::K2Node_ComponentBoundEvent_Spinner' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity, CallFunc_GetMainWidget_MainWidget_1) == 0x000048, "Member 'UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity::CallFunc_GetMainWidget_MainWidget_1' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity, CallFunc_GetValue_Value) == 0x000050, "Member 'UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity::CallFunc_GetValue_Value' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity, K2Node_ComponentBoundEvent_BtnKey_1) == 0x000058, "Member 'UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity::K2Node_ComponentBoundEvent_BtnKey_1' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity, K2Node_ComponentBoundEvent_BtnKey) == 0x000060, "Member 'UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity::K2Node_ComponentBoundEvent_BtnKey' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity, CallFunc_GetValue_Value_1) == 0x000068, "Member 'UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity::CallFunc_GetValue_Value_1' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00006C, "Member 'UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity, CallFunc_GetValue_Value_2) == 0x000070, "Member 'UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity::CallFunc_GetValue_Value_2' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000074, "Member 'UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity, CallFunc_Subtract_IntInt_ReturnValue) == 0x000078, "Member 'UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity, CallFunc_GetValue_Value_3) == 0x000080, "Member 'UIW_SelectQuantity_C_ExecuteUbergraph_UIW_SelectQuantity::CallFunc_GetValue_Value_3' has a wrong offset!");

// Function UIW_SelectQuantity.UIW_SelectQuantity_C.BndEvt__Btn_Down_K2Node_ComponentBoundEvent_5_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_SelectQuantity_C_BndEvt__Btn_Down_K2Node_ComponentBoundEvent_5_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_SelectQuantity_C_BndEvt__Btn_Down_K2Node_ComponentBoundEvent_5_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_SelectQuantity_C_BndEvt__Btn_Down_K2Node_ComponentBoundEvent_5_OnActive__DelegateSignature");
static_assert(sizeof(UIW_SelectQuantity_C_BndEvt__Btn_Down_K2Node_ComponentBoundEvent_5_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_SelectQuantity_C_BndEvt__Btn_Down_K2Node_ComponentBoundEvent_5_OnActive__DelegateSignature");
static_assert(offsetof(UIW_SelectQuantity_C_BndEvt__Btn_Down_K2Node_ComponentBoundEvent_5_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_SelectQuantity_C_BndEvt__Btn_Down_K2Node_ComponentBoundEvent_5_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_SelectQuantity.UIW_SelectQuantity_C.BndEvt__Btn_Up_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_SelectQuantity_C_BndEvt__Btn_Up_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_SelectQuantity_C_BndEvt__Btn_Up_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_SelectQuantity_C_BndEvt__Btn_Up_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature");
static_assert(sizeof(UIW_SelectQuantity_C_BndEvt__Btn_Up_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_SelectQuantity_C_BndEvt__Btn_Up_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature");
static_assert(offsetof(UIW_SelectQuantity_C_BndEvt__Btn_Up_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_SelectQuantity_C_BndEvt__Btn_Up_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_SelectQuantity.UIW_SelectQuantity_C.BndEvt__UIW_Spinner_K2Node_ComponentBoundEvent_3_OnReleaseDown__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_SelectQuantity_C_BndEvt__UIW_Spinner_K2Node_ComponentBoundEvent_3_OnReleaseDown__DelegateSignature final
{
public:
	class UUIW_Spinner_C*                         Spinner;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_SelectQuantity_C_BndEvt__UIW_Spinner_K2Node_ComponentBoundEvent_3_OnReleaseDown__DelegateSignature) == 0x000008, "Wrong alignment on UIW_SelectQuantity_C_BndEvt__UIW_Spinner_K2Node_ComponentBoundEvent_3_OnReleaseDown__DelegateSignature");
static_assert(sizeof(UIW_SelectQuantity_C_BndEvt__UIW_Spinner_K2Node_ComponentBoundEvent_3_OnReleaseDown__DelegateSignature) == 0x000008, "Wrong size on UIW_SelectQuantity_C_BndEvt__UIW_Spinner_K2Node_ComponentBoundEvent_3_OnReleaseDown__DelegateSignature");
static_assert(offsetof(UIW_SelectQuantity_C_BndEvt__UIW_Spinner_K2Node_ComponentBoundEvent_3_OnReleaseDown__DelegateSignature, Spinner) == 0x000000, "Member 'UIW_SelectQuantity_C_BndEvt__UIW_Spinner_K2Node_ComponentBoundEvent_3_OnReleaseDown__DelegateSignature::Spinner' has a wrong offset!");

// Function UIW_SelectQuantity.UIW_SelectQuantity_C.BndEvt__UIW_Spinner_K2Node_ComponentBoundEvent_2_OnReleaseUp__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_SelectQuantity_C_BndEvt__UIW_Spinner_K2Node_ComponentBoundEvent_2_OnReleaseUp__DelegateSignature final
{
public:
	class UUIW_Spinner_C*                         Spinner;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_SelectQuantity_C_BndEvt__UIW_Spinner_K2Node_ComponentBoundEvent_2_OnReleaseUp__DelegateSignature) == 0x000008, "Wrong alignment on UIW_SelectQuantity_C_BndEvt__UIW_Spinner_K2Node_ComponentBoundEvent_2_OnReleaseUp__DelegateSignature");
static_assert(sizeof(UIW_SelectQuantity_C_BndEvt__UIW_Spinner_K2Node_ComponentBoundEvent_2_OnReleaseUp__DelegateSignature) == 0x000008, "Wrong size on UIW_SelectQuantity_C_BndEvt__UIW_Spinner_K2Node_ComponentBoundEvent_2_OnReleaseUp__DelegateSignature");
static_assert(offsetof(UIW_SelectQuantity_C_BndEvt__UIW_Spinner_K2Node_ComponentBoundEvent_2_OnReleaseUp__DelegateSignature, Spinner) == 0x000000, "Member 'UIW_SelectQuantity_C_BndEvt__UIW_Spinner_K2Node_ComponentBoundEvent_2_OnReleaseUp__DelegateSignature::Spinner' has a wrong offset!");

// Function UIW_SelectQuantity.UIW_SelectQuantity_C.BndEvt__Btn_Cancel_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_SelectQuantity_C_BndEvt__Btn_Cancel_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_SelectQuantity_C_BndEvt__Btn_Cancel_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_SelectQuantity_C_BndEvt__Btn_Cancel_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature");
static_assert(sizeof(UIW_SelectQuantity_C_BndEvt__Btn_Cancel_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_SelectQuantity_C_BndEvt__Btn_Cancel_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature");
static_assert(offsetof(UIW_SelectQuantity_C_BndEvt__Btn_Cancel_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_SelectQuantity_C_BndEvt__Btn_Cancel_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_SelectQuantity.UIW_SelectQuantity_C.BndEvt__Btn_ConfIrm_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_SelectQuantity_C_BndEvt__Btn_ConfIrm_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_SelectQuantity_C_BndEvt__Btn_ConfIrm_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_SelectQuantity_C_BndEvt__Btn_ConfIrm_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature");
static_assert(sizeof(UIW_SelectQuantity_C_BndEvt__Btn_ConfIrm_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_SelectQuantity_C_BndEvt__Btn_ConfIrm_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature");
static_assert(offsetof(UIW_SelectQuantity_C_BndEvt__Btn_ConfIrm_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_SelectQuantity_C_BndEvt__Btn_ConfIrm_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_SelectQuantity.UIW_SelectQuantity_C.SetData
// 0x0130 (0x0130 - 0x0000)
struct UIW_SelectQuantity_C_SetData final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         MinValue_0;                                        // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxValue_0;                                        // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InitValue_0;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0028(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0078(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x0090(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B8(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0110(0x0018)()
	int32                                         CallFunc_GetValue_Value;                           // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_SelectQuantity_C_SetData) == 0x000008, "Wrong alignment on UIW_SelectQuantity_C_SetData");
static_assert(sizeof(UIW_SelectQuantity_C_SetData) == 0x000130, "Wrong size on UIW_SelectQuantity_C_SetData");
static_assert(offsetof(UIW_SelectQuantity_C_SetData, Title) == 0x000000, "Member 'UIW_SelectQuantity_C_SetData::Title' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_SetData, MinValue_0) == 0x000018, "Member 'UIW_SelectQuantity_C_SetData::MinValue_0' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_SetData, MaxValue_0) == 0x00001C, "Member 'UIW_SelectQuantity_C_SetData::MaxValue_0' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_SetData, InitValue_0) == 0x000020, "Member 'UIW_SelectQuantity_C_SetData::InitValue_0' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_SetData, K2Node_MakeStruct_FormatArgumentData) == 0x000028, "Member 'UIW_SelectQuantity_C_SetData::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_SetData, K2Node_MakeArray_Array) == 0x000068, "Member 'UIW_SelectQuantity_C_SetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_SetData, CallFunc_GetGameStrWithName_ReturnValue) == 0x000078, "Member 'UIW_SelectQuantity_C_SetData::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_SetData, CallFunc_GetGameStrWithName_ReturnValue_1) == 0x000090, "Member 'UIW_SelectQuantity_C_SetData::CallFunc_GetGameStrWithName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_SetData, CallFunc_Conv_TextToString_ReturnValue) == 0x0000A8, "Member 'UIW_SelectQuantity_C_SetData::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_SetData, CallFunc_Format_ReturnValue) == 0x0000B8, "Member 'UIW_SelectQuantity_C_SetData::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_SetData, CallFunc_Concat_StrStr_ReturnValue) == 0x0000D0, "Member 'UIW_SelectQuantity_C_SetData::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_SetData, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0000E0, "Member 'UIW_SelectQuantity_C_SetData::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_SetData, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000F0, "Member 'UIW_SelectQuantity_C_SetData::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_SetData, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000100, "Member 'UIW_SelectQuantity_C_SetData::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_SetData, CallFunc_Conv_StringToText_ReturnValue) == 0x000110, "Member 'UIW_SelectQuantity_C_SetData::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_SetData, CallFunc_GetValue_Value) == 0x000128, "Member 'UIW_SelectQuantity_C_SetData::CallFunc_GetValue_Value' has a wrong offset!");

// Function UIW_SelectQuantity.UIW_SelectQuantity_C.OnMouseWheel
// 0x0220 (0x0220 - 0x0000)
struct UIW_SelectQuantity_C_OnMouseWheel final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	float                                         CallFunc_PointerEvent_GetWheelDelta_ReturnValue;   // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0168(0x00B8)()
};
static_assert(alignof(UIW_SelectQuantity_C_OnMouseWheel) == 0x000008, "Wrong alignment on UIW_SelectQuantity_C_OnMouseWheel");
static_assert(sizeof(UIW_SelectQuantity_C_OnMouseWheel) == 0x000220, "Wrong size on UIW_SelectQuantity_C_OnMouseWheel");
static_assert(offsetof(UIW_SelectQuantity_C_OnMouseWheel, MyGeometry) == 0x000000, "Member 'UIW_SelectQuantity_C_OnMouseWheel::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_OnMouseWheel, MouseEvent) == 0x000038, "Member 'UIW_SelectQuantity_C_OnMouseWheel::MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_OnMouseWheel, ReturnValue) == 0x0000A8, "Member 'UIW_SelectQuantity_C_OnMouseWheel::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_OnMouseWheel, CallFunc_PointerEvent_GetWheelDelta_ReturnValue) == 0x000160, "Member 'UIW_SelectQuantity_C_OnMouseWheel::CallFunc_PointerEvent_GetWheelDelta_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_OnMouseWheel, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000164, "Member 'UIW_SelectQuantity_C_OnMouseWheel::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_OnMouseWheel, CallFunc_Handled_ReturnValue) == 0x000168, "Member 'UIW_SelectQuantity_C_OnMouseWheel::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UIW_SelectQuantity.UIW_SelectQuantity_C.SetErgoType
// 0x0004 (0x0004 - 0x0000)
struct UIW_SelectQuantity_C_SetErgoType final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_SelectQuantity_C_SetErgoType) == 0x000004, "Wrong alignment on UIW_SelectQuantity_C_SetErgoType");
static_assert(sizeof(UIW_SelectQuantity_C_SetErgoType) == 0x000004, "Wrong size on UIW_SelectQuantity_C_SetErgoType");
static_assert(offsetof(UIW_SelectQuantity_C_SetErgoType, Value) == 0x000000, "Member 'UIW_SelectQuantity_C_SetErgoType::Value' has a wrong offset!");

// Function UIW_SelectQuantity.UIW_SelectQuantity_C.RefreshErgo
// 0x0028 (0x0028 - 0x0000)
struct UIW_SelectQuantity_C_RefreshErgo final
{
public:
	int32                                         Count;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
};
static_assert(alignof(UIW_SelectQuantity_C_RefreshErgo) == 0x000008, "Wrong alignment on UIW_SelectQuantity_C_RefreshErgo");
static_assert(sizeof(UIW_SelectQuantity_C_RefreshErgo) == 0x000028, "Wrong size on UIW_SelectQuantity_C_RefreshErgo");
static_assert(offsetof(UIW_SelectQuantity_C_RefreshErgo, Count) == 0x000000, "Member 'UIW_SelectQuantity_C_RefreshErgo::Count' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_RefreshErgo, CallFunc_IsVisible_ReturnValue) == 0x000004, "Member 'UIW_SelectQuantity_C_RefreshErgo::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_RefreshErgo, CallFunc_Multiply_IntInt_ReturnValue) == 0x000008, "Member 'UIW_SelectQuantity_C_RefreshErgo::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SelectQuantity_C_RefreshErgo, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'UIW_SelectQuantity_C_RefreshErgo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

}

