#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Weapon_Custom

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectP_structs.hpp"
#include "UIEN_WeaponPart_structs.hpp"
#include "UIW_Window_classes.hpp"
#include "SlateCore_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Weapon_Custom.UIW_Weapon_Custom_C
// 0x0158 (0x04A8 - 0x0350)
class UUIW_Weapon_Custom_C final : public UUIW_Window_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UIW_Weapon_Custom_C;                // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_SelectHandle;                                  // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_SelectBlade;                                   // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUIW_BG_Tab_C*                          BG_Tab;                                            // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Back;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Combine;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Divide;                                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Equip;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_ItemInfo;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Scroll;                                        // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Select;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Tab_LeftKey;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Tab_RightKey;                                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Group_Depth_0;                                     // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Group_Depth_1;                                     // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Blade;                                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Handle;                                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_HoverB;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_HoverH;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Plus_Name;                                     // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_ItemInfo_Compare_C*                ItemInfo_Compare;                                  // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_ItemInfo_C*                        ItemInfo_Original;                                 // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LeftBG_Group;                                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULTileView*                             List_Item;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULListView*                             List_Tab;                                          // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULTileView*                             List_Weapon;                                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_NoContents_C*                      NoContents;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Plus_Group;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Blade;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Error;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Handle;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_NoContents_C*                      UIW_NoContents;                                    // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentDepth;                                      // 0x0450(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUIEN_WeaponPart                              WeaponPart;                                        // 0x0454(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_455[0x3];                                      // 0x0455(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULWeaponItem*                           SelectedWeapon;                                    // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLWeaponPartInfoForCombine             SelectedBlade;                                     // 0x0460(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FLWeaponPartInfoForCombine             SelectedHandle;                                    // 0x0470(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TArray<class UUIBP_ListData_Resource_C*>      ResourceListData;                                  // 0x0480(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          EnoughResource;                                    // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_491[0x3];                                      // 0x0491(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectedWeaponIndex;                               // 0x0494(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WeaponPrevListSelectedIndex;                       // 0x0498(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WeaponColumnCount;                                 // 0x049C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemPrevListSelectedIndex;                         // 0x04A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemColumnCount;                                   // 0x04A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_Weapon_Custom(int32 EntryPoint);
	void BndEvt__UIW_Weapon_Custom_Btn_Combine_K2Node_ComponentBoundEvent_5_OnActive__DelegateSignature(class UUIW_Btn_Key_C* BtnKey);
	void BndEvt__UIW_Weapon_Custom_ItemInfo_Compare_K2Node_ComponentBoundEvent_4_OnVisibilityChangedEvent__DelegateSignature(ESlateVisibility InVisibility);
	void Destruct();
	void BndEvt__UIW_Weapon_Custom_Btn_Equip_K2Node_ComponentBoundEvent_3_OnActive__DelegateSignature(class UUIW_Btn_Key_C* BtnKey);
	void BndEvt__UIW_Weapon_Custom_Btn_Select_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature(class UUIW_Btn_Key_C* BtnKey);
	void BndEvt__UIW_Weapon_Custom_Btn_Back_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature(class UUIW_Btn_Key_C* BtnKey);
	void BndEvt__UIW_Weapon_Custom_Btn_Divide_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature(class UUIW_Btn_Key_C* BtnKey);
	void Construct();
	void OnReady();
	void MoveLeftTab(class UUIW_Btn_Key_C* BtnKey);
	void MoveRightTab(class UUIW_Btn_Key_C* BtnKey);
	void ChangeTab(class UObject* Item, bool bIsSelected);
	void RefreshWeapon();
	void RefreshBlade_Handle();
	void ItemDoubleClick(class UObject* Item);
	void OnSelectedWeapon(class UObject* Item, bool bIsSelected);
	void OnSelectedBlade_Handle(class UObject* Item, bool bIsSelected);
	void SetDepth(int32 Depth);
	void CallbackDivide(class UUIW_Popup_C* Popup, class UUIW_Btn_Key_C* BtnKey);
	struct FEventReply FocusManage(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void CallbackCombine(class UUIW_Popup_C* Popup, class UUIW_Btn_Key_C* BtnKey);
	void CallbackContextMenu(class FName EventName);
	void MakeCombinePopupText(class FText* Text);
	void AddEventBinding();
	void ClearEventBinding();
	void OnChangeEquipItem(ELEquipSlotType EquipSlot, class ULItem* OldItem, class ULItem* NewItem);
	class UWidget* NavToBottomWeapon(EUINavigation Navigation_0);
	class UWidget* NavToBottomItem(EUINavigation Navigation_0);
	class UWidget* NavToTopWeapon(EUINavigation Navigation_0);
	class UWidget* NavToTopItem(EUINavigation Navigation_0);
	class UWidget* NavToLRLoopWeapon(EUINavigation Navigation_0);
	class UWidget* NavToLRLoopItem(EUINavigation Navigation_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Weapon_Custom_C">();
	}
	static class UUIW_Weapon_Custom_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Weapon_Custom_C>();
	}
};
static_assert(alignof(UUIW_Weapon_Custom_C) == 0x000008, "Wrong alignment on UUIW_Weapon_Custom_C");
static_assert(sizeof(UUIW_Weapon_Custom_C) == 0x0004A8, "Wrong size on UUIW_Weapon_Custom_C");
static_assert(offsetof(UUIW_Weapon_Custom_C, UberGraphFrame_UIW_Weapon_Custom_C) == 0x000350, "Member 'UUIW_Weapon_Custom_C::UberGraphFrame_UIW_Weapon_Custom_C' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, Ani_SelectHandle) == 0x000358, "Member 'UUIW_Weapon_Custom_C::Ani_SelectHandle' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, Ani_SelectBlade) == 0x000360, "Member 'UUIW_Weapon_Custom_C::Ani_SelectBlade' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, BG_Tab) == 0x000368, "Member 'UUIW_Weapon_Custom_C::BG_Tab' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, Btn_Back) == 0x000370, "Member 'UUIW_Weapon_Custom_C::Btn_Back' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, Btn_Combine) == 0x000378, "Member 'UUIW_Weapon_Custom_C::Btn_Combine' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, Btn_Divide) == 0x000380, "Member 'UUIW_Weapon_Custom_C::Btn_Divide' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, Btn_Equip) == 0x000388, "Member 'UUIW_Weapon_Custom_C::Btn_Equip' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, Btn_ItemInfo) == 0x000390, "Member 'UUIW_Weapon_Custom_C::Btn_ItemInfo' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, Btn_Scroll) == 0x000398, "Member 'UUIW_Weapon_Custom_C::Btn_Scroll' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, Btn_Select) == 0x0003A0, "Member 'UUIW_Weapon_Custom_C::Btn_Select' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, Btn_Tab_LeftKey) == 0x0003A8, "Member 'UUIW_Weapon_Custom_C::Btn_Tab_LeftKey' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, Btn_Tab_RightKey) == 0x0003B0, "Member 'UUIW_Weapon_Custom_C::Btn_Tab_RightKey' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, Group_Depth_0) == 0x0003B8, "Member 'UUIW_Weapon_Custom_C::Group_Depth_0' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, Group_Depth_1) == 0x0003C0, "Member 'UUIW_Weapon_Custom_C::Group_Depth_1' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, Img_Blade) == 0x0003C8, "Member 'UUIW_Weapon_Custom_C::Img_Blade' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, Img_Handle) == 0x0003D0, "Member 'UUIW_Weapon_Custom_C::Img_Handle' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, Img_HoverB) == 0x0003D8, "Member 'UUIW_Weapon_Custom_C::Img_HoverB' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, Img_HoverH) == 0x0003E0, "Member 'UUIW_Weapon_Custom_C::Img_HoverH' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, Img_Plus_Name) == 0x0003E8, "Member 'UUIW_Weapon_Custom_C::Img_Plus_Name' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, ItemInfo_Compare) == 0x0003F0, "Member 'UUIW_Weapon_Custom_C::ItemInfo_Compare' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, ItemInfo_Original) == 0x0003F8, "Member 'UUIW_Weapon_Custom_C::ItemInfo_Original' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, LeftBG_Group) == 0x000400, "Member 'UUIW_Weapon_Custom_C::LeftBG_Group' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, List_Item) == 0x000408, "Member 'UUIW_Weapon_Custom_C::List_Item' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, List_Tab) == 0x000410, "Member 'UUIW_Weapon_Custom_C::List_Tab' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, List_Weapon) == 0x000418, "Member 'UUIW_Weapon_Custom_C::List_Weapon' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, NoContents) == 0x000420, "Member 'UUIW_Weapon_Custom_C::NoContents' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, Plus_Group) == 0x000428, "Member 'UUIW_Weapon_Custom_C::Plus_Group' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, Text_Blade) == 0x000430, "Member 'UUIW_Weapon_Custom_C::Text_Blade' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, Text_Error) == 0x000438, "Member 'UUIW_Weapon_Custom_C::Text_Error' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, Text_Handle) == 0x000440, "Member 'UUIW_Weapon_Custom_C::Text_Handle' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, UIW_NoContents) == 0x000448, "Member 'UUIW_Weapon_Custom_C::UIW_NoContents' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, CurrentDepth) == 0x000450, "Member 'UUIW_Weapon_Custom_C::CurrentDepth' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, WeaponPart) == 0x000454, "Member 'UUIW_Weapon_Custom_C::WeaponPart' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, SelectedWeapon) == 0x000458, "Member 'UUIW_Weapon_Custom_C::SelectedWeapon' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, SelectedBlade) == 0x000460, "Member 'UUIW_Weapon_Custom_C::SelectedBlade' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, SelectedHandle) == 0x000470, "Member 'UUIW_Weapon_Custom_C::SelectedHandle' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, ResourceListData) == 0x000480, "Member 'UUIW_Weapon_Custom_C::ResourceListData' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, EnoughResource) == 0x000490, "Member 'UUIW_Weapon_Custom_C::EnoughResource' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, SelectedWeaponIndex) == 0x000494, "Member 'UUIW_Weapon_Custom_C::SelectedWeaponIndex' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, WeaponPrevListSelectedIndex) == 0x000498, "Member 'UUIW_Weapon_Custom_C::WeaponPrevListSelectedIndex' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, WeaponColumnCount) == 0x00049C, "Member 'UUIW_Weapon_Custom_C::WeaponColumnCount' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, ItemPrevListSelectedIndex) == 0x0004A0, "Member 'UUIW_Weapon_Custom_C::ItemPrevListSelectedIndex' has a wrong offset!");
static_assert(offsetof(UUIW_Weapon_Custom_C, ItemColumnCount) == 0x0004A4, "Member 'UUIW_Weapon_Custom_C::ItemColumnCount' has a wrong offset!");

}

