#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Module_ResourceList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UIW_Popup_Module_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Module_ResourceList.UIW_Module_ResourceList_C
// 0x0018 (0x02C8 - 0x02B0)
class UUIW_Module_ResourceList_C final : public UUIW_Popup_Module_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UListView*                              List;                                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Cost;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_Module_ResourceList(int32 EntryPoint);
	void Construct();
	void SetData(const class FString& Title, TArray<class UObject*>& ListItems);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Module_ResourceList_C">();
	}
	static class UUIW_Module_ResourceList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Module_ResourceList_C>();
	}
};
static_assert(alignof(UUIW_Module_ResourceList_C) == 0x000008, "Wrong alignment on UUIW_Module_ResourceList_C");
static_assert(sizeof(UUIW_Module_ResourceList_C) == 0x0002C8, "Wrong size on UUIW_Module_ResourceList_C");
static_assert(offsetof(UUIW_Module_ResourceList_C, UberGraphFrame) == 0x0002B0, "Member 'UUIW_Module_ResourceList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_Module_ResourceList_C, List) == 0x0002B8, "Member 'UUIW_Module_ResourceList_C::List' has a wrong offset!");
static_assert(offsetof(UUIW_Module_ResourceList_C, Text_Cost) == 0x0002C0, "Member 'UUIW_Module_ResourceList_C::Text_Cost' has a wrong offset!");

}

