#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_SlaveArm_ReinforceSlot

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_SlaveArm_ReinforceSlot.UIW_SlaveArm_ReinforceSlot_C
// 0x0048 (0x02F0 - 0x02A8)
class UUIW_SlaveArm_ReinforceSlot_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Bg_Line;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULSlaveArmTree*                         SlotData;                                          // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Type;                                              // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Depth;                                             // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           IconColorOpacity;                                  // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BgLineColorOpacity;                                // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_SlaveArm_ReinforceSlot(int32 EntryPoint);
	void Construct();
	void SetData(class ULSlaveArmTree* SlotData_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_SlaveArm_ReinforceSlot_C">();
	}
	static class UUIW_SlaveArm_ReinforceSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_SlaveArm_ReinforceSlot_C>();
	}
};
static_assert(alignof(UUIW_SlaveArm_ReinforceSlot_C) == 0x000008, "Wrong alignment on UUIW_SlaveArm_ReinforceSlot_C");
static_assert(sizeof(UUIW_SlaveArm_ReinforceSlot_C) == 0x0002F0, "Wrong size on UUIW_SlaveArm_ReinforceSlot_C");
static_assert(offsetof(UUIW_SlaveArm_ReinforceSlot_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_SlaveArm_ReinforceSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_ReinforceSlot_C, Bg_Line) == 0x0002B0, "Member 'UUIW_SlaveArm_ReinforceSlot_C::Bg_Line' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_ReinforceSlot_C, Icon) == 0x0002B8, "Member 'UUIW_SlaveArm_ReinforceSlot_C::Icon' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_ReinforceSlot_C, SlotData) == 0x0002C0, "Member 'UUIW_SlaveArm_ReinforceSlot_C::SlotData' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_ReinforceSlot_C, Type) == 0x0002C8, "Member 'UUIW_SlaveArm_ReinforceSlot_C::Type' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_ReinforceSlot_C, Depth) == 0x0002CC, "Member 'UUIW_SlaveArm_ReinforceSlot_C::Depth' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_ReinforceSlot_C, IconColorOpacity) == 0x0002D0, "Member 'UUIW_SlaveArm_ReinforceSlot_C::IconColorOpacity' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_ReinforceSlot_C, BgLineColorOpacity) == 0x0002E0, "Member 'UUIW_SlaveArm_ReinforceSlot_C::BgLineColorOpacity' has a wrong offset!");

}

