#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_CharacterUpgrade

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"
#include "Engine_structs.hpp"
#include "ProjectP_structs.hpp"
#include "UIST_FirstStatInfo_structs.hpp"
#include "UIST_Color_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UIW_CharacterUpgrade.UIW_CharacterUpgrade_C.OnUpgradePreview__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UIW_CharacterUpgrade_C_OnUpgradePreview__DelegateSignature final
{
public:
	ELFirstStat                                   FirstStat;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_CharacterUpgrade_C_OnUpgradePreview__DelegateSignature) == 0x000001, "Wrong alignment on UIW_CharacterUpgrade_C_OnUpgradePreview__DelegateSignature");
static_assert(sizeof(UIW_CharacterUpgrade_C_OnUpgradePreview__DelegateSignature) == 0x000001, "Wrong size on UIW_CharacterUpgrade_C_OnUpgradePreview__DelegateSignature");
static_assert(offsetof(UIW_CharacterUpgrade_C_OnUpgradePreview__DelegateSignature, FirstStat) == 0x000000, "Member 'UIW_CharacterUpgrade_C_OnUpgradePreview__DelegateSignature::FirstStat' has a wrong offset!");

// Function UIW_CharacterUpgrade.UIW_CharacterUpgrade_C.ExecuteUbergraph_UIW_CharacterUpgrade
// 0x0098 (0x0098 - 0x0000)
struct UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_1;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUIW_Popup_C* Popup, class UUIW_Btn_Key_C* BtnKey)> K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UUIW_Popup_C*                           CallFunc_AddPopupWidget_Widget;                    // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0050(0x0018)()
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm, ContainsInstancedReference)
	class FName                                   K2Node_CustomEvent_CategoryName;                   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName CategoryName)>     K2Node_CreateDelegate_OutputDelegate_1;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade) == 0x000008, "Wrong alignment on UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade");
static_assert(sizeof(UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade) == 0x000098, "Wrong size on UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade");
static_assert(offsetof(UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade, EntryPoint) == 0x000000, "Member 'UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade, K2Node_ComponentBoundEvent_BtnKey_1) == 0x000020, "Member 'UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade::K2Node_ComponentBoundEvent_BtnKey_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade, CallFunc_GetMainWidget_MainWidget) == 0x000028, "Member 'UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade, CallFunc_AddPopupWidget_Widget) == 0x000040, "Member 'UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade::CallFunc_AddPopupWidget_Widget' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade, K2Node_ComponentBoundEvent_BtnKey) == 0x000048, "Member 'UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade::K2Node_ComponentBoundEvent_BtnKey' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade, CallFunc_GetGameStrWithName_ReturnValue) == 0x000050, "Member 'UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade, CallFunc_IsVisible_ReturnValue) == 0x000068, "Member 'UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade, K2Node_MakeArray_Array) == 0x000070, "Member 'UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade, K2Node_CustomEvent_CategoryName) == 0x000080, "Member 'UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade::K2Node_CustomEvent_CategoryName' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade, K2Node_CreateDelegate_OutputDelegate_1) == 0x000088, "Member 'UIW_CharacterUpgrade_C_ExecuteUbergraph_UIW_CharacterUpgrade::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function UIW_CharacterUpgrade.UIW_CharacterUpgrade_C.OnOpenTweenComplete
// 0x0008 (0x0008 - 0x0000)
struct UIW_CharacterUpgrade_C_OnOpenTweenComplete final
{
public:
	class FName                                   CategoryName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_CharacterUpgrade_C_OnOpenTweenComplete) == 0x000004, "Wrong alignment on UIW_CharacterUpgrade_C_OnOpenTweenComplete");
static_assert(sizeof(UIW_CharacterUpgrade_C_OnOpenTweenComplete) == 0x000008, "Wrong size on UIW_CharacterUpgrade_C_OnOpenTweenComplete");
static_assert(offsetof(UIW_CharacterUpgrade_C_OnOpenTweenComplete, CategoryName) == 0x000000, "Member 'UIW_CharacterUpgrade_C_OnOpenTweenComplete::CategoryName' has a wrong offset!");

// Function UIW_CharacterUpgrade.UIW_CharacterUpgrade_C.BndEvt__Btn_Select_K2Node_ComponentBoundEvent_8_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_CharacterUpgrade_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_8_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_CharacterUpgrade_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_8_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_CharacterUpgrade_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_8_OnActive__DelegateSignature");
static_assert(sizeof(UIW_CharacterUpgrade_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_8_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_CharacterUpgrade_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_8_OnActive__DelegateSignature");
static_assert(offsetof(UIW_CharacterUpgrade_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_8_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_CharacterUpgrade_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_8_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_CharacterUpgrade.UIW_CharacterUpgrade_C.BndEvt__Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_CharacterUpgrade_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_CharacterUpgrade_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_CharacterUpgrade_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature");
static_assert(sizeof(UIW_CharacterUpgrade_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_CharacterUpgrade_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature");
static_assert(offsetof(UIW_CharacterUpgrade_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_CharacterUpgrade_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_CharacterUpgrade.UIW_CharacterUpgrade_C.RefreshRequireErgo
// 0x00B0 (0x00B0 - 0x0000)
struct UIW_CharacterUpgrade_C_RefreshRequireErgo final
{
public:
	int32                                         LocalLvUpAll;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLevelUpRequireErgo_ReturnValue;        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
	int32                                         CallFunc_GetCharacterLevel_ReturnValue;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0038(0x0028)()
	int32                                         CallFunc_GetLevelUpRequireErgo_ReturnValue_1;      // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUIST_Color                            CallFunc_GetDataTableRowFromName_OutRow;           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0074(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0088(0x0028)()
};
static_assert(alignof(UIW_CharacterUpgrade_C_RefreshRequireErgo) == 0x000008, "Wrong alignment on UIW_CharacterUpgrade_C_RefreshRequireErgo");
static_assert(sizeof(UIW_CharacterUpgrade_C_RefreshRequireErgo) == 0x0000B0, "Wrong size on UIW_CharacterUpgrade_C_RefreshRequireErgo");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshRequireErgo, LocalLvUpAll) == 0x000000, "Member 'UIW_CharacterUpgrade_C_RefreshRequireErgo::LocalLvUpAll' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshRequireErgo, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UIW_CharacterUpgrade_C_RefreshRequireErgo::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshRequireErgo, CallFunc_GetLevelUpRequireErgo_ReturnValue) == 0x000010, "Member 'UIW_CharacterUpgrade_C_RefreshRequireErgo::CallFunc_GetLevelUpRequireErgo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshRequireErgo, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'UIW_CharacterUpgrade_C_RefreshRequireErgo::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshRequireErgo, CallFunc_GetCharacterLevel_ReturnValue) == 0x000030, "Member 'UIW_CharacterUpgrade_C_RefreshRequireErgo::CallFunc_GetCharacterLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshRequireErgo, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'UIW_CharacterUpgrade_C_RefreshRequireErgo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshRequireErgo, K2Node_MakeStruct_SlateColor) == 0x000038, "Member 'UIW_CharacterUpgrade_C_RefreshRequireErgo::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshRequireErgo, CallFunc_GetLevelUpRequireErgo_ReturnValue_1) == 0x000060, "Member 'UIW_CharacterUpgrade_C_RefreshRequireErgo::CallFunc_GetLevelUpRequireErgo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshRequireErgo, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000064, "Member 'UIW_CharacterUpgrade_C_RefreshRequireErgo::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshRequireErgo, CallFunc_Add_IntInt_ReturnValue_1) == 0x000068, "Member 'UIW_CharacterUpgrade_C_RefreshRequireErgo::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshRequireErgo, CallFunc_GetDataTableRowFromName_OutRow) == 0x00006C, "Member 'UIW_CharacterUpgrade_C_RefreshRequireErgo::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshRequireErgo, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000070, "Member 'UIW_CharacterUpgrade_C_RefreshRequireErgo::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshRequireErgo, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000074, "Member 'UIW_CharacterUpgrade_C_RefreshRequireErgo::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshRequireErgo, K2Node_MakeStruct_SlateColor_1) == 0x000088, "Member 'UIW_CharacterUpgrade_C_RefreshRequireErgo::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function UIW_CharacterUpgrade.UIW_CharacterUpgrade_C.RefreshBaseStat
// 0x01C0 (0x01C0 - 0x0000)
struct UIW_CharacterUpgrade_C_RefreshBaseStat final
{
public:
	bool                                          LocalIsDiff;                                       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUIBP_ListData_OneStat_C*>       LocalDetailListData;                               // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<class UUIBP_ListData_OneStat_C*>       LocalNormalListData;                               // 0x0018(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ELFirstStat, struct FUIST_FirstStatInfo> CallFunc_GetFirstStatInfo_FirstStatInfo;           // 0x0038(0x0050)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0088(0x0018)()
	TMap<ELFirstStat, struct FUIST_FirstStatInfo> CallFunc_GetFirstStatInfo_FirstStatInfo_1;         // 0x00A0(0x0050)()
	TArray<ELFirstStat>                           CallFunc_Map_Keys_Keys;                            // 0x00F0(0x0010)(ReferenceParm)
	ELFirstStat                                   CallFunc_Array_Get_Item;                           // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUIST_FirstStatInfo                    CallFunc_Map_Find_Value;                           // 0x0108(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0120(0x0018)()
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0140(0x0028)()
	class UUIW_CharacterUpgrade_Stat_C*           CallFunc_Array_Get_Item_1;                         // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUIST_Color                            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetFirstStat_ReturnValue;                 // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFirstStat_ReturnValue_1;               // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0184(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0198(0x0028)()
};
static_assert(alignof(UIW_CharacterUpgrade_C_RefreshBaseStat) == 0x000008, "Wrong alignment on UIW_CharacterUpgrade_C_RefreshBaseStat");
static_assert(sizeof(UIW_CharacterUpgrade_C_RefreshBaseStat) == 0x0001C0, "Wrong size on UIW_CharacterUpgrade_C_RefreshBaseStat");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshBaseStat, LocalIsDiff) == 0x000000, "Member 'UIW_CharacterUpgrade_C_RefreshBaseStat::LocalIsDiff' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshBaseStat, LocalDetailListData) == 0x000008, "Member 'UIW_CharacterUpgrade_C_RefreshBaseStat::LocalDetailListData' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshBaseStat, LocalNormalListData) == 0x000018, "Member 'UIW_CharacterUpgrade_C_RefreshBaseStat::LocalNormalListData' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshBaseStat, Temp_int_Array_Index_Variable) == 0x000028, "Member 'UIW_CharacterUpgrade_C_RefreshBaseStat::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshBaseStat, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'UIW_CharacterUpgrade_C_RefreshBaseStat::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshBaseStat, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'UIW_CharacterUpgrade_C_RefreshBaseStat::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshBaseStat, CallFunc_GetFirstStatInfo_FirstStatInfo) == 0x000038, "Member 'UIW_CharacterUpgrade_C_RefreshBaseStat::CallFunc_GetFirstStatInfo_FirstStatInfo' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshBaseStat, CallFunc_Conv_IntToText_ReturnValue) == 0x000088, "Member 'UIW_CharacterUpgrade_C_RefreshBaseStat::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshBaseStat, CallFunc_GetFirstStatInfo_FirstStatInfo_1) == 0x0000A0, "Member 'UIW_CharacterUpgrade_C_RefreshBaseStat::CallFunc_GetFirstStatInfo_FirstStatInfo_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshBaseStat, CallFunc_Map_Keys_Keys) == 0x0000F0, "Member 'UIW_CharacterUpgrade_C_RefreshBaseStat::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshBaseStat, CallFunc_Array_Get_Item) == 0x000100, "Member 'UIW_CharacterUpgrade_C_RefreshBaseStat::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshBaseStat, CallFunc_Array_Length_ReturnValue) == 0x000104, "Member 'UIW_CharacterUpgrade_C_RefreshBaseStat::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshBaseStat, CallFunc_Map_Find_Value) == 0x000108, "Member 'UIW_CharacterUpgrade_C_RefreshBaseStat::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshBaseStat, CallFunc_Map_Find_ReturnValue) == 0x000118, "Member 'UIW_CharacterUpgrade_C_RefreshBaseStat::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshBaseStat, CallFunc_Less_IntInt_ReturnValue) == 0x000119, "Member 'UIW_CharacterUpgrade_C_RefreshBaseStat::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshBaseStat, CallFunc_GetGameStrWithName_ReturnValue) == 0x000120, "Member 'UIW_CharacterUpgrade_C_RefreshBaseStat::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshBaseStat, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000138, "Member 'UIW_CharacterUpgrade_C_RefreshBaseStat::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshBaseStat, K2Node_MakeStruct_SlateColor) == 0x000140, "Member 'UIW_CharacterUpgrade_C_RefreshBaseStat::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshBaseStat, CallFunc_Array_Get_Item_1) == 0x000168, "Member 'UIW_CharacterUpgrade_C_RefreshBaseStat::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshBaseStat, CallFunc_GetDataTableRowFromName_OutRow) == 0x000170, "Member 'UIW_CharacterUpgrade_C_RefreshBaseStat::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshBaseStat, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000174, "Member 'UIW_CharacterUpgrade_C_RefreshBaseStat::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshBaseStat, CallFunc_GetFirstStat_ReturnValue) == 0x000178, "Member 'UIW_CharacterUpgrade_C_RefreshBaseStat::CallFunc_GetFirstStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshBaseStat, CallFunc_GetFirstStat_ReturnValue_1) == 0x00017C, "Member 'UIW_CharacterUpgrade_C_RefreshBaseStat::CallFunc_GetFirstStat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshBaseStat, CallFunc_Add_IntInt_ReturnValue_1) == 0x000180, "Member 'UIW_CharacterUpgrade_C_RefreshBaseStat::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshBaseStat, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000184, "Member 'UIW_CharacterUpgrade_C_RefreshBaseStat::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_RefreshBaseStat, K2Node_MakeStruct_SlateColor_1) == 0x000198, "Member 'UIW_CharacterUpgrade_C_RefreshBaseStat::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function UIW_CharacterUpgrade.UIW_CharacterUpgrade_C.FocusManage
// 0x02F8 (0x02F8 - 0x0000)
struct UIW_CharacterUpgrade_C_FocusManage final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_FocusManage_ReturnValue;                  // 0x0168(0x00B8)()
	class UUIW_Window_C*                          CallFunc_GetTopWindow_Window;                      // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0230(0x00B8)()
	class UUIW_CharacterUpgrade_Stat_C*           K2Node_DynamicCast_AsUIW_Character_Upgrade_Stat;   // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_CharacterUpgrade_C_FocusManage) == 0x000008, "Wrong alignment on UIW_CharacterUpgrade_C_FocusManage");
static_assert(sizeof(UIW_CharacterUpgrade_C_FocusManage) == 0x0002F8, "Wrong size on UIW_CharacterUpgrade_C_FocusManage");
static_assert(offsetof(UIW_CharacterUpgrade_C_FocusManage, MyGeometry) == 0x000000, "Member 'UIW_CharacterUpgrade_C_FocusManage::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_FocusManage, MouseEvent) == 0x000038, "Member 'UIW_CharacterUpgrade_C_FocusManage::MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_FocusManage, ReturnValue) == 0x0000A8, "Member 'UIW_CharacterUpgrade_C_FocusManage::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_FocusManage, CallFunc_GetMainWidget_MainWidget) == 0x000160, "Member 'UIW_CharacterUpgrade_C_FocusManage::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_FocusManage, CallFunc_FocusManage_ReturnValue) == 0x000168, "Member 'UIW_CharacterUpgrade_C_FocusManage::CallFunc_FocusManage_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_FocusManage, CallFunc_GetTopWindow_Window) == 0x000220, "Member 'UIW_CharacterUpgrade_C_FocusManage::CallFunc_GetTopWindow_Window' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_FocusManage, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000228, "Member 'UIW_CharacterUpgrade_C_FocusManage::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_FocusManage, CallFunc_Handled_ReturnValue) == 0x000230, "Member 'UIW_CharacterUpgrade_C_FocusManage::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_FocusManage, K2Node_DynamicCast_AsUIW_Character_Upgrade_Stat) == 0x0002E8, "Member 'UIW_CharacterUpgrade_C_FocusManage::K2Node_DynamicCast_AsUIW_Character_Upgrade_Stat' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_FocusManage, K2Node_DynamicCast_bSuccess) == 0x0002F0, "Member 'UIW_CharacterUpgrade_C_FocusManage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_FocusManage, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0002F1, "Member 'UIW_CharacterUpgrade_C_FocusManage::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");

// Function UIW_CharacterUpgrade.UIW_CharacterUpgrade_C.SetFocusedBaseStat
// 0x0010 (0x0010 - 0x0000)
struct UIW_CharacterUpgrade_C_SetFocusedBaseStat final
{
public:
	class UUIW_CharacterUpgrade_Stat_C*           Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_CharacterUpgrade_C_SetFocusedBaseStat) == 0x000008, "Wrong alignment on UIW_CharacterUpgrade_C_SetFocusedBaseStat");
static_assert(sizeof(UIW_CharacterUpgrade_C_SetFocusedBaseStat) == 0x000010, "Wrong size on UIW_CharacterUpgrade_C_SetFocusedBaseStat");
static_assert(offsetof(UIW_CharacterUpgrade_C_SetFocusedBaseStat, Widget) == 0x000000, "Member 'UIW_CharacterUpgrade_C_SetFocusedBaseStat::Widget' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_SetFocusedBaseStat, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'UIW_CharacterUpgrade_C_SetFocusedBaseStat::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UIW_CharacterUpgrade.UIW_CharacterUpgrade_C.SetSelectedBaseStat
// 0x0028 (0x0028 - 0x0000)
struct UIW_CharacterUpgrade_C_SetSelectedBaseStat final
{
public:
	class UUIW_CharacterUpgrade_Stat_C*           Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_CharacterUpgrade_Stat_C*           CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_CharacterUpgrade_C_SetSelectedBaseStat) == 0x000008, "Wrong alignment on UIW_CharacterUpgrade_C_SetSelectedBaseStat");
static_assert(sizeof(UIW_CharacterUpgrade_C_SetSelectedBaseStat) == 0x000028, "Wrong size on UIW_CharacterUpgrade_C_SetSelectedBaseStat");
static_assert(offsetof(UIW_CharacterUpgrade_C_SetSelectedBaseStat, Widget) == 0x000000, "Member 'UIW_CharacterUpgrade_C_SetSelectedBaseStat::Widget' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_SetSelectedBaseStat, Temp_int_Array_Index_Variable) == 0x000008, "Member 'UIW_CharacterUpgrade_C_SetSelectedBaseStat::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_SetSelectedBaseStat, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'UIW_CharacterUpgrade_C_SetSelectedBaseStat::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_SetSelectedBaseStat, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'UIW_CharacterUpgrade_C_SetSelectedBaseStat::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_SetSelectedBaseStat, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'UIW_CharacterUpgrade_C_SetSelectedBaseStat::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_SetSelectedBaseStat, CallFunc_Array_Get_Item) == 0x000018, "Member 'UIW_CharacterUpgrade_C_SetSelectedBaseStat::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_SetSelectedBaseStat, CallFunc_Less_IntInt_ReturnValue) == 0x000020, "Member 'UIW_CharacterUpgrade_C_SetSelectedBaseStat::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_SetSelectedBaseStat, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000021, "Member 'UIW_CharacterUpgrade_C_SetSelectedBaseStat::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function UIW_CharacterUpgrade.UIW_CharacterUpgrade_C.SetSelectedSpinner
// 0x0038 (0x0038 - 0x0000)
struct UIW_CharacterUpgrade_C_SetSelectedSpinner final
{
public:
	class UUIW_Spinner_C*                         Spinner;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_Value;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckCanLevelUp_CanLevelUp;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetInitValue_Value;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Window_C*                          CallFunc_GetTopWindow_Window;                      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_CharacterUpgrade_Stat_C*           CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_CharacterUpgrade_C_SetSelectedSpinner) == 0x000008, "Wrong alignment on UIW_CharacterUpgrade_C_SetSelectedSpinner");
static_assert(sizeof(UIW_CharacterUpgrade_C_SetSelectedSpinner) == 0x000038, "Wrong size on UIW_CharacterUpgrade_C_SetSelectedSpinner");
static_assert(offsetof(UIW_CharacterUpgrade_C_SetSelectedSpinner, Spinner) == 0x000000, "Member 'UIW_CharacterUpgrade_C_SetSelectedSpinner::Spinner' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_SetSelectedSpinner, CallFunc_GetValue_Value) == 0x000008, "Member 'UIW_CharacterUpgrade_C_SetSelectedSpinner::CallFunc_GetValue_Value' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_SetSelectedSpinner, CallFunc_CheckCanLevelUp_CanLevelUp) == 0x00000C, "Member 'UIW_CharacterUpgrade_C_SetSelectedSpinner::CallFunc_CheckCanLevelUp_CanLevelUp' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_SetSelectedSpinner, CallFunc_GetInitValue_Value) == 0x000010, "Member 'UIW_CharacterUpgrade_C_SetSelectedSpinner::CallFunc_GetInitValue_Value' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_SetSelectedSpinner, CallFunc_Less_IntInt_ReturnValue) == 0x000014, "Member 'UIW_CharacterUpgrade_C_SetSelectedSpinner::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_SetSelectedSpinner, CallFunc_GetMainWidget_MainWidget) == 0x000018, "Member 'UIW_CharacterUpgrade_C_SetSelectedSpinner::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_SetSelectedSpinner, CallFunc_GetTopWindow_Window) == 0x000020, "Member 'UIW_CharacterUpgrade_C_SetSelectedSpinner::CallFunc_GetTopWindow_Window' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_SetSelectedSpinner, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000028, "Member 'UIW_CharacterUpgrade_C_SetSelectedSpinner::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_SetSelectedSpinner, CallFunc_Array_Find_ReturnValue) == 0x00002C, "Member 'UIW_CharacterUpgrade_C_SetSelectedSpinner::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_SetSelectedSpinner, CallFunc_Array_Get_Item) == 0x000030, "Member 'UIW_CharacterUpgrade_C_SetSelectedSpinner::CallFunc_Array_Get_Item' has a wrong offset!");

// Function UIW_CharacterUpgrade.UIW_CharacterUpgrade_C.ReleaseUpSpinner
// 0x0020 (0x0020 - 0x0000)
struct UIW_CharacterUpgrade_C_ReleaseUpSpinner final
{
public:
	class UUIW_Spinner_C*                         Spinner;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_Value;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckCanLevelUp_CanLevelUp;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_CharacterUpgrade_C_ReleaseUpSpinner) == 0x000008, "Wrong alignment on UIW_CharacterUpgrade_C_ReleaseUpSpinner");
static_assert(sizeof(UIW_CharacterUpgrade_C_ReleaseUpSpinner) == 0x000020, "Wrong size on UIW_CharacterUpgrade_C_ReleaseUpSpinner");
static_assert(offsetof(UIW_CharacterUpgrade_C_ReleaseUpSpinner, Spinner) == 0x000000, "Member 'UIW_CharacterUpgrade_C_ReleaseUpSpinner::Spinner' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ReleaseUpSpinner, CallFunc_GetValue_Value) == 0x000008, "Member 'UIW_CharacterUpgrade_C_ReleaseUpSpinner::CallFunc_GetValue_Value' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ReleaseUpSpinner, CallFunc_CheckCanLevelUp_CanLevelUp) == 0x00000C, "Member 'UIW_CharacterUpgrade_C_ReleaseUpSpinner::CallFunc_CheckCanLevelUp_CanLevelUp' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ReleaseUpSpinner, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'UIW_CharacterUpgrade_C_ReleaseUpSpinner::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ReleaseUpSpinner, Temp_int_Variable) == 0x000014, "Member 'UIW_CharacterUpgrade_C_ReleaseUpSpinner::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ReleaseUpSpinner, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'UIW_CharacterUpgrade_C_ReleaseUpSpinner::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function UIW_CharacterUpgrade.UIW_CharacterUpgrade_C.ReleaseDownSpinner
// 0x0030 (0x0030 - 0x0000)
struct UIW_CharacterUpgrade_C_ReleaseDownSpinner final
{
public:
	class UUIW_Spinner_C*                         Spinner;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetInitValue_Value;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetValue_Value;                           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetValue_Value_1;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetInitValue_Value_1;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCanLevelUp_CanLevelUp;               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_CharacterUpgrade_C_ReleaseDownSpinner) == 0x000008, "Wrong alignment on UIW_CharacterUpgrade_C_ReleaseDownSpinner");
static_assert(sizeof(UIW_CharacterUpgrade_C_ReleaseDownSpinner) == 0x000030, "Wrong size on UIW_CharacterUpgrade_C_ReleaseDownSpinner");
static_assert(offsetof(UIW_CharacterUpgrade_C_ReleaseDownSpinner, Spinner) == 0x000000, "Member 'UIW_CharacterUpgrade_C_ReleaseDownSpinner::Spinner' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ReleaseDownSpinner, CallFunc_GetInitValue_Value) == 0x000008, "Member 'UIW_CharacterUpgrade_C_ReleaseDownSpinner::CallFunc_GetInitValue_Value' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ReleaseDownSpinner, CallFunc_GetValue_Value) == 0x00000C, "Member 'UIW_CharacterUpgrade_C_ReleaseDownSpinner::CallFunc_GetValue_Value' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ReleaseDownSpinner, CallFunc_Less_IntInt_ReturnValue) == 0x000010, "Member 'UIW_CharacterUpgrade_C_ReleaseDownSpinner::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ReleaseDownSpinner, CallFunc_GetValue_Value_1) == 0x000014, "Member 'UIW_CharacterUpgrade_C_ReleaseDownSpinner::CallFunc_GetValue_Value_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ReleaseDownSpinner, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'UIW_CharacterUpgrade_C_ReleaseDownSpinner::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ReleaseDownSpinner, CallFunc_GetInitValue_Value_1) == 0x00001C, "Member 'UIW_CharacterUpgrade_C_ReleaseDownSpinner::CallFunc_GetInitValue_Value_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ReleaseDownSpinner, CallFunc_Less_IntInt_ReturnValue_1) == 0x000020, "Member 'UIW_CharacterUpgrade_C_ReleaseDownSpinner::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ReleaseDownSpinner, CallFunc_CheckCanLevelUp_CanLevelUp) == 0x000021, "Member 'UIW_CharacterUpgrade_C_ReleaseDownSpinner::CallFunc_CheckCanLevelUp_CanLevelUp' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ReleaseDownSpinner, Temp_int_Variable) == 0x000024, "Member 'UIW_CharacterUpgrade_C_ReleaseDownSpinner::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ReleaseDownSpinner, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'UIW_CharacterUpgrade_C_ReleaseDownSpinner::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_ReleaseDownSpinner, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x00002C, "Member 'UIW_CharacterUpgrade_C_ReleaseDownSpinner::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");

// Function UIW_CharacterUpgrade.UIW_CharacterUpgrade_C.CallbackCancelAbillity
// 0x0018 (0x0018 - 0x0000)
struct UIW_CharacterUpgrade_C_CallbackCancelAbillity final
{
public:
	class UUIW_Popup_C*                           Popup;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_CharacterUpgrade_C_CallbackCancelAbillity) == 0x000008, "Wrong alignment on UIW_CharacterUpgrade_C_CallbackCancelAbillity");
static_assert(sizeof(UIW_CharacterUpgrade_C_CallbackCancelAbillity) == 0x000018, "Wrong size on UIW_CharacterUpgrade_C_CallbackCancelAbillity");
static_assert(offsetof(UIW_CharacterUpgrade_C_CallbackCancelAbillity, Popup) == 0x000000, "Member 'UIW_CharacterUpgrade_C_CallbackCancelAbillity::Popup' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_CallbackCancelAbillity, BtnKey) == 0x000008, "Member 'UIW_CharacterUpgrade_C_CallbackCancelAbillity::BtnKey' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_C_CallbackCancelAbillity, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'UIW_CharacterUpgrade_C_CallbackCancelAbillity::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function UIW_CharacterUpgrade.UIW_CharacterUpgrade_C.CheckEdited
// 0x0001 (0x0001 - 0x0000)
struct UIW_CharacterUpgrade_C_CheckEdited final
{
public:
	bool                                          CallFunc_CanLevelUp_Output_Get;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_CharacterUpgrade_C_CheckEdited) == 0x000001, "Wrong alignment on UIW_CharacterUpgrade_C_CheckEdited");
static_assert(sizeof(UIW_CharacterUpgrade_C_CheckEdited) == 0x000001, "Wrong size on UIW_CharacterUpgrade_C_CheckEdited");
static_assert(offsetof(UIW_CharacterUpgrade_C_CheckEdited, CallFunc_CanLevelUp_Output_Get) == 0x000000, "Member 'UIW_CharacterUpgrade_C_CheckEdited::CallFunc_CanLevelUp_Output_Get' has a wrong offset!");

// Function UIW_CharacterUpgrade.UIW_CharacterUpgrade_C.RefreshStatDiff
// 0x0150 (0x0150 - 0x0000)
struct UIW_CharacterUpgrade_C_RefreshStatDiff final
{
public:
	int32                                         RemainSoul;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0008(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue_1;                    // 0x0020(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ALStatRoomPCCharacter*                  CallFunc_GetStatRoomPC_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLSecondStatDiffData>           CallFunc_GetDiffStat_ByFirstStat_Common_SecondStatDiff; // 0x0048(0x0010)(ReferenceParm)
	TArray<struct FLSecondStatDiffData>           CallFunc_GetDiffStat_ByFirstStat_Weapon1_SecondStatDiff; // 0x0058(0x0010)(ReferenceParm)
	TArray<struct FLSecondStatDiffData>           CallFunc_GetDiffStat_ByFirstStat_Weapon2_SecondStatDiff; // 0x0068(0x0010)(ReferenceParm)
	TArray<struct FLSecondStatDiffData>           CallFunc_GetDiffStat_ByFirstStat_Weapon3_SecondStatDiff; // 0x0078(0x0010)(ReferenceParm)
	TArray<struct FLSecondStatDiffData>           CallFunc_GetDiffStat_ByFirstStat_SlaveArm1_SecondStatDiff; // 0x0088(0x0010)(ReferenceParm)
	TArray<struct FLSecondStatDiffData>           CallFunc_GetDiffStat_ByFirstStat_SlaveArm2_SecondStatDiff; // 0x0098(0x0010)(ReferenceParm)
	TArray<struct FLSecondStatDiffData>           CallFunc_GetDiffStat_ByFirstStat_SlaveArm3_SecondStatDiff; // 0x00A8(0x0010)(ReferenceParm)
	TArray<struct FLSecondStatDiffData>           K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	struct FUIST_Color                            CallFunc_GetDataTableRowFromName_OutRow;           // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00E0(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0108(0x0028)()
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
