#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_LoadLevel

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"
#include "UIW_Window_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_LoadLevel.UIW_LoadLevel_C
// 0x0060 (0x03B0 - 0x0350)
class UUIW_LoadLevel_C final : public UUIW_Window_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UIW_LoadLevel_C;                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUIW_Btn_Key_C*                         Btn_Back;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Delete;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Select;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULListView*                             List;                                              // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_SlotCount;                                    // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Title;                                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         SelectedIndex;                                     // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLCharacterStorageData>         StorageDataList;                                   // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsRequesting;                                      // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           RequestingTimer;                                   // 0x03A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_LoadLevel(int32 EntryPoint);
	void Destruct();
	void OnDownloadPackagePopup(class UUIW_Popup_C* Popup, class UUIW_Btn_Key_C* BtnKey);
	void BndEvt__List_K2Node_ComponentBoundEvent_5_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void BndEvt__List_K2Node_ComponentBoundEvent_3_OnListItemSelectionChangedDynamic__DelegateSignature(class UObject* Item, bool bIsSelected);
	void BndEvt__Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature(class UUIW_Btn_Key_C* BtnKey);
	void BndEvt__Btn_Delete_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature(class UUIW_Btn_Key_C* BtnKey);
	void BndEvt__Btn_Select_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature(class UUIW_Btn_Key_C* BtnKey);
	void Construct();
	void RefreshSaveData();
	struct FEventReply FocusManage(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void CallbackDeleteSaveData(class UUIW_Popup_C* Popup, class UUIW_Btn_Key_C* BtnKey);
	void AddEventBinding();
	void ClearEventBinding();
	void OnLobbyProcessEnd(ELLobbyMenu LobbyMenu, bool ProcessResult);
	void ShowDownloadingPopup();
	class UWidget* NavToEnd(EUINavigation Navigation_0);
	class UWidget* NavToStart(EUINavigation Navigation_0);
	void SetRequesting(bool IsRequesting_0);
	void FailRequest();
	void SetEnabledWindow(bool IsEnabled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_LoadLevel_C">();
	}
	static class UUIW_LoadLevel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_LoadLevel_C>();
	}
};
static_assert(alignof(UUIW_LoadLevel_C) == 0x000008, "Wrong alignment on UUIW_LoadLevel_C");
static_assert(sizeof(UUIW_LoadLevel_C) == 0x0003B0, "Wrong size on UUIW_LoadLevel_C");
static_assert(offsetof(UUIW_LoadLevel_C, UberGraphFrame_UIW_LoadLevel_C) == 0x000350, "Member 'UUIW_LoadLevel_C::UberGraphFrame_UIW_LoadLevel_C' has a wrong offset!");
static_assert(offsetof(UUIW_LoadLevel_C, Btn_Back) == 0x000358, "Member 'UUIW_LoadLevel_C::Btn_Back' has a wrong offset!");
static_assert(offsetof(UUIW_LoadLevel_C, Btn_Delete) == 0x000360, "Member 'UUIW_LoadLevel_C::Btn_Delete' has a wrong offset!");
static_assert(offsetof(UUIW_LoadLevel_C, Btn_Select) == 0x000368, "Member 'UUIW_LoadLevel_C::Btn_Select' has a wrong offset!");
static_assert(offsetof(UUIW_LoadLevel_C, List) == 0x000370, "Member 'UUIW_LoadLevel_C::List' has a wrong offset!");
static_assert(offsetof(UUIW_LoadLevel_C, Text_SlotCount) == 0x000378, "Member 'UUIW_LoadLevel_C::Text_SlotCount' has a wrong offset!");
static_assert(offsetof(UUIW_LoadLevel_C, Text_Title) == 0x000380, "Member 'UUIW_LoadLevel_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UUIW_LoadLevel_C, SelectedIndex) == 0x000388, "Member 'UUIW_LoadLevel_C::SelectedIndex' has a wrong offset!");
static_assert(offsetof(UUIW_LoadLevel_C, StorageDataList) == 0x000390, "Member 'UUIW_LoadLevel_C::StorageDataList' has a wrong offset!");
static_assert(offsetof(UUIW_LoadLevel_C, IsRequesting) == 0x0003A0, "Member 'UUIW_LoadLevel_C::IsRequesting' has a wrong offset!");
static_assert(offsetof(UUIW_LoadLevel_C, RequestingTimer) == 0x0003A8, "Member 'UUIW_LoadLevel_C::RequestingTimer' has a wrong offset!");

}

