#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Spinner_Number

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ProjectP_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UIW_Spinner_Number.UIW_Spinner_Number_C.SetNumber
// 0x0098 (0x0098 - 0x0000)
struct UIW_Spinner_Number_C_SetNumber final
{
public:
	int32                                         Number;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocalEndY;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocalStartY;                                       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase;                       // 0x000C(0x000C)(NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0038(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0050(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x0068(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Spinner_Number_C_SetNumber) == 0x000008, "Wrong alignment on UIW_Spinner_Number_C_SetNumber");
static_assert(sizeof(UIW_Spinner_Number_C_SetNumber) == 0x000098, "Wrong size on UIW_Spinner_Number_C_SetNumber");
static_assert(offsetof(UIW_Spinner_Number_C_SetNumber, Number) == 0x000000, "Member 'UIW_Spinner_Number_C_SetNumber::Number' has a wrong offset!");
static_assert(offsetof(UIW_Spinner_Number_C_SetNumber, LocalEndY) == 0x000004, "Member 'UIW_Spinner_Number_C_SetNumber::LocalEndY' has a wrong offset!");
static_assert(offsetof(UIW_Spinner_Number_C_SetNumber, LocalStartY) == 0x000008, "Member 'UIW_Spinner_Number_C_SetNumber::LocalStartY' has a wrong offset!");
static_assert(offsetof(UIW_Spinner_Number_C_SetNumber, K2Node_MakeStruct_TweenEase) == 0x00000C, "Member 'UIW_Spinner_Number_C_SetNumber::K2Node_MakeStruct_TweenEase' has a wrong offset!");
static_assert(offsetof(UIW_Spinner_Number_C_SetNumber, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'UIW_Spinner_Number_C_SetNumber::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Spinner_Number_C_SetNumber, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000019, "Member 'UIW_Spinner_Number_C_SetNumber::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Spinner_Number_C_SetNumber, CallFunc_BooleanAND_ReturnValue) == 0x00001A, "Member 'UIW_Spinner_Number_C_SetNumber::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Spinner_Number_C_SetNumber, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x00001B, "Member 'UIW_Spinner_Number_C_SetNumber::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Spinner_Number_C_SetNumber, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x00001C, "Member 'UIW_Spinner_Number_C_SetNumber::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_Spinner_Number_C_SetNumber, CallFunc_BooleanAND_ReturnValue_1) == 0x00001D, "Member 'UIW_Spinner_Number_C_SetNumber::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Spinner_Number_C_SetNumber, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'UIW_Spinner_Number_C_SetNumber::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Spinner_Number_C_SetNumber, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000038, "Member 'UIW_Spinner_Number_C_SetNumber::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Spinner_Number_C_SetNumber, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000050, "Member 'UIW_Spinner_Number_C_SetNumber::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Spinner_Number_C_SetNumber, CallFunc_Conv_IntToText_ReturnValue_3) == 0x000068, "Member 'UIW_Spinner_Number_C_SetNumber::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_Spinner_Number_C_SetNumber, CallFunc_Greater_IntInt_ReturnValue) == 0x000080, "Member 'UIW_Spinner_Number_C_SetNumber::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Spinner_Number_C_SetNumber, CallFunc_MakeVector2D_ReturnValue) == 0x000084, "Member 'UIW_Spinner_Number_C_SetNumber::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Spinner_Number_C_SetNumber, CallFunc_MakeVector2D_ReturnValue_1) == 0x00008C, "Member 'UIW_Spinner_Number_C_SetNumber::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Spinner_Number_C_SetNumber, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000094, "Member 'UIW_Spinner_Number_C_SetNumber::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function UIW_Spinner_Number.UIW_Spinner_Number_C.SetColor
// 0x00A8 (0x00A8 - 0x0000)
struct UIW_Spinner_Number_C_SetColor final
{
public:
	bool                                          IsEdited;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0030(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0058(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0080(0x0028)()
};
static_assert(alignof(UIW_Spinner_Number_C_SetColor) == 0x000008, "Wrong alignment on UIW_Spinner_Number_C_SetColor");
static_assert(sizeof(UIW_Spinner_Number_C_SetColor) == 0x0000A8, "Wrong size on UIW_Spinner_Number_C_SetColor");
static_assert(offsetof(UIW_Spinner_Number_C_SetColor, IsEdited) == 0x000000, "Member 'UIW_Spinner_Number_C_SetColor::IsEdited' has a wrong offset!");
static_assert(offsetof(UIW_Spinner_Number_C_SetColor, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'UIW_Spinner_Number_C_SetColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_Spinner_Number_C_SetColor, K2Node_MakeStruct_SlateColor_1) == 0x000030, "Member 'UIW_Spinner_Number_C_SetColor::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UIW_Spinner_Number_C_SetColor, K2Node_MakeStruct_SlateColor_2) == 0x000058, "Member 'UIW_Spinner_Number_C_SetColor::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(UIW_Spinner_Number_C_SetColor, K2Node_MakeStruct_SlateColor_3) == 0x000080, "Member 'UIW_Spinner_Number_C_SetColor::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");

}

