#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_BG_Title

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_BG_Title.UIW_BG_Title_C
// 0x0020 (0x02C8 - 0x02A8)
class UUIW_BG_Title_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           Group_Line;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Group_TitleBG;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_60;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_BG_Title(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_BG_Title_C">();
	}
	static class UUIW_BG_Title_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_BG_Title_C>();
	}
};
static_assert(alignof(UUIW_BG_Title_C) == 0x000008, "Wrong alignment on UUIW_BG_Title_C");
static_assert(sizeof(UUIW_BG_Title_C) == 0x0002C8, "Wrong size on UUIW_BG_Title_C");
static_assert(offsetof(UUIW_BG_Title_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_BG_Title_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_BG_Title_C, Group_Line) == 0x0002B0, "Member 'UUIW_BG_Title_C::Group_Line' has a wrong offset!");
static_assert(offsetof(UUIW_BG_Title_C, Group_TitleBG) == 0x0002B8, "Member 'UUIW_BG_Title_C::Group_TitleBG' has a wrong offset!");
static_assert(offsetof(UUIW_BG_Title_C, Image_60) == 0x0002C0, "Member 'UUIW_BG_Title_C::Image_60' has a wrong offset!");

}

