#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_InvenSlotChangeTab

#include "Basic.hpp"


namespace SDK::Params
{

// Function UIW_InvenSlotChangeTab.UIW_InvenSlotChangeTab_C.ExecuteUbergraph_UIW_InvenSlotChangeTab
// 0x0020 (0x0020 - 0x0000)
struct UIW_InvenSlotChangeTab_C_ExecuteUbergraph_UIW_InvenSlotChangeTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_InvenSlotChangeTab_C_ExecuteUbergraph_UIW_InvenSlotChangeTab) == 0x000008, "Wrong alignment on UIW_InvenSlotChangeTab_C_ExecuteUbergraph_UIW_InvenSlotChangeTab");
static_assert(sizeof(UIW_InvenSlotChangeTab_C_ExecuteUbergraph_UIW_InvenSlotChangeTab) == 0x000020, "Wrong size on UIW_InvenSlotChangeTab_C_ExecuteUbergraph_UIW_InvenSlotChangeTab");
static_assert(offsetof(UIW_InvenSlotChangeTab_C_ExecuteUbergraph_UIW_InvenSlotChangeTab, EntryPoint) == 0x000000, "Member 'UIW_InvenSlotChangeTab_C_ExecuteUbergraph_UIW_InvenSlotChangeTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_InvenSlotChangeTab_C_ExecuteUbergraph_UIW_InvenSlotChangeTab, K2Node_Event_bIsExpanded) == 0x000004, "Member 'UIW_InvenSlotChangeTab_C_ExecuteUbergraph_UIW_InvenSlotChangeTab::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(UIW_InvenSlotChangeTab_C_ExecuteUbergraph_UIW_InvenSlotChangeTab, K2Node_Event_ListItemObject) == 0x000008, "Member 'UIW_InvenSlotChangeTab_C_ExecuteUbergraph_UIW_InvenSlotChangeTab::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(UIW_InvenSlotChangeTab_C_ExecuteUbergraph_UIW_InvenSlotChangeTab, K2Node_Event_bIsSelected) == 0x000010, "Member 'UIW_InvenSlotChangeTab_C_ExecuteUbergraph_UIW_InvenSlotChangeTab::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(UIW_InvenSlotChangeTab_C_ExecuteUbergraph_UIW_InvenSlotChangeTab, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'UIW_InvenSlotChangeTab_C_ExecuteUbergraph_UIW_InvenSlotChangeTab::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function UIW_InvenSlotChangeTab.UIW_InvenSlotChangeTab_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_InvenSlotChangeTab_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_InvenSlotChangeTab_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on UIW_InvenSlotChangeTab_C_BP_OnItemSelectionChanged");
static_assert(sizeof(UIW_InvenSlotChangeTab_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on UIW_InvenSlotChangeTab_C_BP_OnItemSelectionChanged");
static_assert(offsetof(UIW_InvenSlotChangeTab_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'UIW_InvenSlotChangeTab_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function UIW_InvenSlotChangeTab.UIW_InvenSlotChangeTab_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct UIW_InvenSlotChangeTab_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_InvenSlotChangeTab_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on UIW_InvenSlotChangeTab_C_OnListItemObjectSet");
static_assert(sizeof(UIW_InvenSlotChangeTab_C_OnListItemObjectSet) == 0x000008, "Wrong size on UIW_InvenSlotChangeTab_C_OnListItemObjectSet");
static_assert(offsetof(UIW_InvenSlotChangeTab_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'UIW_InvenSlotChangeTab_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function UIW_InvenSlotChangeTab.UIW_InvenSlotChangeTab_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_InvenSlotChangeTab_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_InvenSlotChangeTab_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on UIW_InvenSlotChangeTab_C_BP_OnItemExpansionChanged");
static_assert(sizeof(UIW_InvenSlotChangeTab_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on UIW_InvenSlotChangeTab_C_BP_OnItemExpansionChanged");
static_assert(offsetof(UIW_InvenSlotChangeTab_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'UIW_InvenSlotChangeTab_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

}

