#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Alert_GetHumanity

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"


namespace SDK::Params
{

// Function UIW_Alert_GetHumanity.UIW_Alert_GetHumanity_C.ExecuteUbergraph_UIW_Alert_GetHumanity
// 0x0048 (0x0048 - 0x0000)
struct UIW_Alert_GetHumanity_C_ExecuteUbergraph_UIW_Alert_GetHumanity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULSoundSystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NameData)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Alert_GetHumanity_C_ExecuteUbergraph_UIW_Alert_GetHumanity) == 0x000008, "Wrong alignment on UIW_Alert_GetHumanity_C_ExecuteUbergraph_UIW_Alert_GetHumanity");
static_assert(sizeof(UIW_Alert_GetHumanity_C_ExecuteUbergraph_UIW_Alert_GetHumanity) == 0x000048, "Wrong size on UIW_Alert_GetHumanity_C_ExecuteUbergraph_UIW_Alert_GetHumanity");
static_assert(offsetof(UIW_Alert_GetHumanity_C_ExecuteUbergraph_UIW_Alert_GetHumanity, EntryPoint) == 0x000000, "Member 'UIW_Alert_GetHumanity_C_ExecuteUbergraph_UIW_Alert_GetHumanity::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetHumanity_C_ExecuteUbergraph_UIW_Alert_GetHumanity, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UIW_Alert_GetHumanity_C_ExecuteUbergraph_UIW_Alert_GetHumanity::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetHumanity_C_ExecuteUbergraph_UIW_Alert_GetHumanity, CallFunc_SpawnSound2D_ReturnValue) == 0x000010, "Member 'UIW_Alert_GetHumanity_C_ExecuteUbergraph_UIW_Alert_GetHumanity::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetHumanity_C_ExecuteUbergraph_UIW_Alert_GetHumanity, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000018, "Member 'UIW_Alert_GetHumanity_C_ExecuteUbergraph_UIW_Alert_GetHumanity::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetHumanity_C_ExecuteUbergraph_UIW_Alert_GetHumanity, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'UIW_Alert_GetHumanity_C_ExecuteUbergraph_UIW_Alert_GetHumanity::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetHumanity_C_ExecuteUbergraph_UIW_Alert_GetHumanity, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000030, "Member 'UIW_Alert_GetHumanity_C_ExecuteUbergraph_UIW_Alert_GetHumanity::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetHumanity_C_ExecuteUbergraph_UIW_Alert_GetHumanity, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'UIW_Alert_GetHumanity_C_ExecuteUbergraph_UIW_Alert_GetHumanity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetHumanity_C_ExecuteUbergraph_UIW_Alert_GetHumanity, CallFunc_IsValid_ReturnValue_1) == 0x000039, "Member 'UIW_Alert_GetHumanity_C_ExecuteUbergraph_UIW_Alert_GetHumanity::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetHumanity_C_ExecuteUbergraph_UIW_Alert_GetHumanity, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000040, "Member 'UIW_Alert_GetHumanity_C_ExecuteUbergraph_UIW_Alert_GetHumanity::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");

// Function UIW_Alert_GetHumanity.UIW_Alert_GetHumanity_C.Show
// 0x0060 (0x0060 - 0x0000)
struct UIW_Alert_GetHumanity_C_Show final
{
public:
	class FName                                   CodeName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLevelHumanityInfoPtr                  CallFunc_FindLevelHumanityInfoByNameBP_ReturnValue; // 0x0008(0x0008)(NoDestructor)
	class FName                                   CallFunc_GetAcquisitionTextCodeName_ReturnValue;   // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0018(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
};
static_assert(alignof(UIW_Alert_GetHumanity_C_Show) == 0x000008, "Wrong alignment on UIW_Alert_GetHumanity_C_Show");
static_assert(sizeof(UIW_Alert_GetHumanity_C_Show) == 0x000060, "Wrong size on UIW_Alert_GetHumanity_C_Show");
static_assert(offsetof(UIW_Alert_GetHumanity_C_Show, CodeName) == 0x000000, "Member 'UIW_Alert_GetHumanity_C_Show::CodeName' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetHumanity_C_Show, CallFunc_FindLevelHumanityInfoByNameBP_ReturnValue) == 0x000008, "Member 'UIW_Alert_GetHumanity_C_Show::CallFunc_FindLevelHumanityInfoByNameBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetHumanity_C_Show, CallFunc_GetAcquisitionTextCodeName_ReturnValue) == 0x000010, "Member 'UIW_Alert_GetHumanity_C_Show::CallFunc_GetAcquisitionTextCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetHumanity_C_Show, CallFunc_GetGameStrWithName_ReturnValue) == 0x000018, "Member 'UIW_Alert_GetHumanity_C_Show::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetHumanity_C_Show, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'UIW_Alert_GetHumanity_C_Show::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetHumanity_C_Show, CallFunc_Conv_TextToString_ReturnValue) == 0x000038, "Member 'UIW_Alert_GetHumanity_C_Show::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetHumanity_C_Show, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'UIW_Alert_GetHumanity_C_Show::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

