#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_SubTitle

#include "Basic.hpp"

#include "ProjectP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_SubTitle.UIW_SubTitle_C
// 0x0018 (0x02C0 - 0x02A8)
class UUIW_SubTitle_C final : public ULWidget
{
public:
	class UHorizontalBox*                         Group_Headline;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Icon;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_SubTitle;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetHeadlineVisibility(bool Visible, const class FText& Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_SubTitle_C">();
	}
	static class UUIW_SubTitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_SubTitle_C>();
	}
};
static_assert(alignof(UUIW_SubTitle_C) == 0x000008, "Wrong alignment on UUIW_SubTitle_C");
static_assert(sizeof(UUIW_SubTitle_C) == 0x0002C0, "Wrong size on UUIW_SubTitle_C");
static_assert(offsetof(UUIW_SubTitle_C, Group_Headline) == 0x0002A8, "Member 'UUIW_SubTitle_C::Group_Headline' has a wrong offset!");
static_assert(offsetof(UUIW_SubTitle_C, Img_Icon) == 0x0002B0, "Member 'UUIW_SubTitle_C::Img_Icon' has a wrong offset!");
static_assert(offsetof(UUIW_SubTitle_C, Text_SubTitle) == 0x0002B8, "Member 'UUIW_SubTitle_C::Text_SubTitle' has a wrong offset!");

}

