#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_CharacterUpgrade_Button

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UIW_CharacterUpgrade_Button.UIW_CharacterUpgrade_Button_C.ExecuteUbergraph_UIW_CharacterUpgrade_Button
// 0x000C (0x000C - 0x0000)
struct UIW_CharacterUpgrade_Button_C_ExecuteUbergraph_UIW_CharacterUpgrade_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0004(0x0008)(NoDestructor)
};
static_assert(alignof(UIW_CharacterUpgrade_Button_C_ExecuteUbergraph_UIW_CharacterUpgrade_Button) == 0x000004, "Wrong alignment on UIW_CharacterUpgrade_Button_C_ExecuteUbergraph_UIW_CharacterUpgrade_Button");
static_assert(sizeof(UIW_CharacterUpgrade_Button_C_ExecuteUbergraph_UIW_CharacterUpgrade_Button) == 0x00000C, "Wrong size on UIW_CharacterUpgrade_Button_C_ExecuteUbergraph_UIW_CharacterUpgrade_Button");
static_assert(offsetof(UIW_CharacterUpgrade_Button_C_ExecuteUbergraph_UIW_CharacterUpgrade_Button, EntryPoint) == 0x000000, "Member 'UIW_CharacterUpgrade_Button_C_ExecuteUbergraph_UIW_CharacterUpgrade_Button::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_Button_C_ExecuteUbergraph_UIW_CharacterUpgrade_Button, K2Node_Event_InFocusEvent) == 0x000004, "Member 'UIW_CharacterUpgrade_Button_C_ExecuteUbergraph_UIW_CharacterUpgrade_Button::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function UIW_CharacterUpgrade_Button.UIW_CharacterUpgrade_Button_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct UIW_CharacterUpgrade_Button_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UIW_CharacterUpgrade_Button_C_OnFocusLost) == 0x000004, "Wrong alignment on UIW_CharacterUpgrade_Button_C_OnFocusLost");
static_assert(sizeof(UIW_CharacterUpgrade_Button_C_OnFocusLost) == 0x000008, "Wrong size on UIW_CharacterUpgrade_Button_C_OnFocusLost");
static_assert(offsetof(UIW_CharacterUpgrade_Button_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'UIW_CharacterUpgrade_Button_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function UIW_CharacterUpgrade_Button.UIW_CharacterUpgrade_Button_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct UIW_CharacterUpgrade_Button_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x00F8(0x00B8)()
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_CharacterUpgrade_Button_C_OnFocusReceived) == 0x000008, "Wrong alignment on UIW_CharacterUpgrade_Button_C_OnFocusReceived");
static_assert(sizeof(UIW_CharacterUpgrade_Button_C_OnFocusReceived) == 0x0001B8, "Wrong size on UIW_CharacterUpgrade_Button_C_OnFocusReceived");
static_assert(offsetof(UIW_CharacterUpgrade_Button_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UIW_CharacterUpgrade_Button_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_Button_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UIW_CharacterUpgrade_Button_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_Button_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UIW_CharacterUpgrade_Button_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_Button_C_OnFocusReceived, K2Node_MakeStruct_EventReply) == 0x0000F8, "Member 'UIW_CharacterUpgrade_Button_C_OnFocusReceived::K2Node_MakeStruct_EventReply' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_Button_C_OnFocusReceived, CallFunc_GetMainWidget_MainWidget) == 0x0001B0, "Member 'UIW_CharacterUpgrade_Button_C_OnFocusReceived::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");

// Function UIW_CharacterUpgrade_Button.UIW_CharacterUpgrade_Button_C.OnEnabled
// 0x0001 (0x0001 - 0x0000)
struct UIW_CharacterUpgrade_Button_C_OnEnabled final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_CharacterUpgrade_Button_C_OnEnabled) == 0x000001, "Wrong alignment on UIW_CharacterUpgrade_Button_C_OnEnabled");
static_assert(sizeof(UIW_CharacterUpgrade_Button_C_OnEnabled) == 0x000001, "Wrong size on UIW_CharacterUpgrade_Button_C_OnEnabled");
static_assert(offsetof(UIW_CharacterUpgrade_Button_C_OnEnabled, IsEnabled) == 0x000000, "Member 'UIW_CharacterUpgrade_Button_C_OnEnabled::IsEnabled' has a wrong offset!");

// Function UIW_CharacterUpgrade_Button.UIW_CharacterUpgrade_Button_C.SetLabel
// 0x0020 (0x0020 - 0x0000)
struct UIW_CharacterUpgrade_Button_C_SetLabel final
{
public:
	class FName                                   CodeName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0008(0x0018)()
};
static_assert(alignof(UIW_CharacterUpgrade_Button_C_SetLabel) == 0x000008, "Wrong alignment on UIW_CharacterUpgrade_Button_C_SetLabel");
static_assert(sizeof(UIW_CharacterUpgrade_Button_C_SetLabel) == 0x000020, "Wrong size on UIW_CharacterUpgrade_Button_C_SetLabel");
static_assert(offsetof(UIW_CharacterUpgrade_Button_C_SetLabel, CodeName) == 0x000000, "Member 'UIW_CharacterUpgrade_Button_C_SetLabel::CodeName' has a wrong offset!");
static_assert(offsetof(UIW_CharacterUpgrade_Button_C_SetLabel, CallFunc_GetGameStrWithName_ReturnValue) == 0x000008, "Member 'UIW_CharacterUpgrade_Button_C_SetLabel::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");

}

