#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HUD_Menu_PouchSlot

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UIW_HUD_Menu_PouchSlot.UIW_HUD_Menu_PouchSlot_C.OnHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_HUD_Menu_PouchSlot_C_OnHovered__DelegateSignature final
{
public:
	class UUIW_HUD_Menu_PouchSlot_C*              PouchSlot;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HUD_Menu_PouchSlot_C_OnHovered__DelegateSignature) == 0x000008, "Wrong alignment on UIW_HUD_Menu_PouchSlot_C_OnHovered__DelegateSignature");
static_assert(sizeof(UIW_HUD_Menu_PouchSlot_C_OnHovered__DelegateSignature) == 0x000008, "Wrong size on UIW_HUD_Menu_PouchSlot_C_OnHovered__DelegateSignature");
static_assert(offsetof(UIW_HUD_Menu_PouchSlot_C_OnHovered__DelegateSignature, PouchSlot) == 0x000000, "Member 'UIW_HUD_Menu_PouchSlot_C_OnHovered__DelegateSignature::PouchSlot' has a wrong offset!");

// Function UIW_HUD_Menu_PouchSlot.UIW_HUD_Menu_PouchSlot_C.OnPressed__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_HUD_Menu_PouchSlot_C_OnPressed__DelegateSignature final
{
public:
	class UUIW_HUD_Menu_PouchSlot_C*              PouchSlot;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HUD_Menu_PouchSlot_C_OnPressed__DelegateSignature) == 0x000008, "Wrong alignment on UIW_HUD_Menu_PouchSlot_C_OnPressed__DelegateSignature");
static_assert(sizeof(UIW_HUD_Menu_PouchSlot_C_OnPressed__DelegateSignature) == 0x000008, "Wrong size on UIW_HUD_Menu_PouchSlot_C_OnPressed__DelegateSignature");
static_assert(offsetof(UIW_HUD_Menu_PouchSlot_C_OnPressed__DelegateSignature, PouchSlot) == 0x000000, "Member 'UIW_HUD_Menu_PouchSlot_C_OnPressed__DelegateSignature::PouchSlot' has a wrong offset!");

// Function UIW_HUD_Menu_PouchSlot.UIW_HUD_Menu_PouchSlot_C.ExecuteUbergraph_UIW_HUD_Menu_PouchSlot
// 0x00B0 (0x00B0 - 0x0000)
struct UIW_HUD_Menu_PouchSlot_C_ExecuteUbergraph_UIW_HUD_Menu_PouchSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0040(0x0070)(ConstParm)
};
static_assert(alignof(UIW_HUD_Menu_PouchSlot_C_ExecuteUbergraph_UIW_HUD_Menu_PouchSlot) == 0x000008, "Wrong alignment on UIW_HUD_Menu_PouchSlot_C_ExecuteUbergraph_UIW_HUD_Menu_PouchSlot");
static_assert(sizeof(UIW_HUD_Menu_PouchSlot_C_ExecuteUbergraph_UIW_HUD_Menu_PouchSlot) == 0x0000B0, "Wrong size on UIW_HUD_Menu_PouchSlot_C_ExecuteUbergraph_UIW_HUD_Menu_PouchSlot");
static_assert(offsetof(UIW_HUD_Menu_PouchSlot_C_ExecuteUbergraph_UIW_HUD_Menu_PouchSlot, EntryPoint) == 0x000000, "Member 'UIW_HUD_Menu_PouchSlot_C_ExecuteUbergraph_UIW_HUD_Menu_PouchSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_PouchSlot_C_ExecuteUbergraph_UIW_HUD_Menu_PouchSlot, K2Node_Event_MyGeometry) == 0x000004, "Member 'UIW_HUD_Menu_PouchSlot_C_ExecuteUbergraph_UIW_HUD_Menu_PouchSlot::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_PouchSlot_C_ExecuteUbergraph_UIW_HUD_Menu_PouchSlot, K2Node_Event_MouseEvent) == 0x000040, "Member 'UIW_HUD_Menu_PouchSlot_C_ExecuteUbergraph_UIW_HUD_Menu_PouchSlot::K2Node_Event_MouseEvent' has a wrong offset!");

// Function UIW_HUD_Menu_PouchSlot.UIW_HUD_Menu_PouchSlot_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct UIW_HUD_Menu_PouchSlot_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIW_HUD_Menu_PouchSlot_C_OnMouseEnter) == 0x000008, "Wrong alignment on UIW_HUD_Menu_PouchSlot_C_OnMouseEnter");
static_assert(sizeof(UIW_HUD_Menu_PouchSlot_C_OnMouseEnter) == 0x0000A8, "Wrong size on UIW_HUD_Menu_PouchSlot_C_OnMouseEnter");
static_assert(offsetof(UIW_HUD_Menu_PouchSlot_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'UIW_HUD_Menu_PouchSlot_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_PouchSlot_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'UIW_HUD_Menu_PouchSlot_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function UIW_HUD_Menu_PouchSlot.UIW_HUD_Menu_PouchSlot_C.OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDown");
static_assert(sizeof(UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDown) == 0x000218, "Wrong size on UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDown");
static_assert(offsetof(UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UIW_HUD_Menu_PouchSlot.UIW_HUD_Menu_PouchSlot_C.OnMouseButtonDoubleClick
// 0x0218 (0x0218 - 0x0000)
struct UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDoubleClick final
{
public:
	struct FGeometry                              InMyGeometry;                                      // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InMouseEvent;                                      // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDoubleClick) == 0x000008, "Wrong alignment on UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDoubleClick");
static_assert(sizeof(UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDoubleClick) == 0x000218, "Wrong size on UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDoubleClick");
static_assert(offsetof(UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDoubleClick, InMyGeometry) == 0x000000, "Member 'UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDoubleClick::InMyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDoubleClick, InMouseEvent) == 0x000038, "Member 'UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDoubleClick::InMouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDoubleClick, ReturnValue) == 0x0000A8, "Member 'UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDoubleClick::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDoubleClick, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDoubleClick::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

