#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ListItem_SlaveArm_ReinForceInfo

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UIW_ListItem_SlaveArm_ReinForceInfo.UIW_ListItem_SlaveArm_ReinforceInfo_C.OnFocusedSlot__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusedSlot__DelegateSignature final
{
public:
	class UUIW_ListItem_SlaveArm_ReinforceInfo_C* Slot_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusedSlot__DelegateSignature) == 0x000008, "Wrong alignment on UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusedSlot__DelegateSignature");
static_assert(sizeof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusedSlot__DelegateSignature) == 0x000008, "Wrong size on UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusedSlot__DelegateSignature");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusedSlot__DelegateSignature, Slot_0) == 0x000000, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusedSlot__DelegateSignature::Slot_0' has a wrong offset!");

// Function UIW_ListItem_SlaveArm_ReinForceInfo.UIW_ListItem_SlaveArm_ReinforceInfo_C.ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo
// 0x0208 (0x0208 - 0x0000)
struct UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0078(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x00B0(0x0070)(ConstParm)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0130(0x0070)(ConstParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x01A0(0x0028)()
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x01C8(0x0008)(NoDestructor)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x01D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x01E0(0x0028)()
};
static_assert(alignof(UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo) == 0x000008, "Wrong alignment on UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo");
static_assert(sizeof(UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo) == 0x000208, "Wrong size on UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo, EntryPoint) == 0x000000, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo, Temp_bool_Variable) == 0x000030, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo, Temp_struct_Variable) == 0x000034, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo, Temp_struct_Variable_1) == 0x000044, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo, Temp_bool_Variable_1) == 0x000054, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo, Temp_struct_Variable_2) == 0x000058, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo, Temp_struct_Variable_3) == 0x000068, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo, K2Node_Event_MyGeometry) == 0x000078, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo, K2Node_Event_MouseEvent_1) == 0x0000B0, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo, K2Node_Select_Default) == 0x000120, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo, K2Node_Event_MouseEvent) == 0x000130, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo, K2Node_MakeStruct_SlateColor_1) == 0x0001A0, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo, K2Node_Event_InFocusEvent) == 0x0001C8, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo, K2Node_Select_Default_1) == 0x0001D0, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo, K2Node_MakeStruct_SlateColor_2) == 0x0001E0, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_ExecuteUbergraph_UIW_ListItem_SlaveArm_ReinforceInfo::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");

// Function UIW_ListItem_SlaveArm_ReinForceInfo.UIW_ListItem_SlaveArm_ReinforceInfo_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusLost) == 0x000004, "Wrong alignment on UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusLost");
static_assert(sizeof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusLost) == 0x000008, "Wrong size on UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusLost");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function UIW_ListItem_SlaveArm_ReinForceInfo.UIW_ListItem_SlaveArm_ReinforceInfo_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseLeave) == 0x000008, "Wrong alignment on UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseLeave");
static_assert(sizeof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseLeave) == 0x000070, "Wrong size on UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseLeave");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function UIW_ListItem_SlaveArm_ReinForceInfo.UIW_ListItem_SlaveArm_ReinforceInfo_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseEnter) == 0x000008, "Wrong alignment on UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseEnter");
static_assert(sizeof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseEnter) == 0x0000A8, "Wrong size on UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseEnter");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function UIW_ListItem_SlaveArm_ReinForceInfo.UIW_ListItem_SlaveArm_ReinforceInfo_C.OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDown");
static_assert(sizeof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDown) == 0x000218, "Wrong size on UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDown");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UIW_ListItem_SlaveArm_ReinForceInfo.UIW_ListItem_SlaveArm_ReinforceInfo_C.OnMouseButtonDoubleClick
// 0x0218 (0x0218 - 0x0000)
struct UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDoubleClick final
{
public:
	struct FGeometry                              InMyGeometry;                                      // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InMouseEvent;                                      // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDoubleClick) == 0x000008, "Wrong alignment on UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDoubleClick");
static_assert(sizeof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDoubleClick) == 0x000218, "Wrong size on UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDoubleClick");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDoubleClick, InMyGeometry) == 0x000000, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDoubleClick::InMyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDoubleClick, InMouseEvent) == 0x000038, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDoubleClick::InMouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDoubleClick, ReturnValue) == 0x0000A8, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDoubleClick::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDoubleClick, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_OnMouseButtonDoubleClick::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UIW_ListItem_SlaveArm_ReinForceInfo.UIW_ListItem_SlaveArm_ReinforceInfo_C.OnFocusReceived
// 0x01D8 (0x01D8 - 0x0000)
struct UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00F8(0x0028)()
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0120(0x00B8)()
};
static_assert(alignof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusReceived) == 0x000008, "Wrong alignment on UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusReceived");
static_assert(sizeof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusReceived) == 0x0001D8, "Wrong size on UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusReceived");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusReceived, K2Node_MakeStruct_SlateColor) == 0x0000F8, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusReceived::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000120, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UIW_ListItem_SlaveArm_ReinForceInfo.UIW_ListItem_SlaveArm_ReinforceInfo_C.SetData
// 0x0020 (0x0020 - 0x0000)
struct UIW_ListItem_SlaveArm_ReinforceInfo_C_SetData final
{
public:
	class ULSlaveArmTree*                         SlotData_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalTextNameLocalize_ReturnValue;     // 0x0008(0x0018)()
};
static_assert(alignof(UIW_ListItem_SlaveArm_ReinforceInfo_C_SetData) == 0x000008, "Wrong alignment on UIW_ListItem_SlaveArm_ReinforceInfo_C_SetData");
static_assert(sizeof(UIW_ListItem_SlaveArm_ReinforceInfo_C_SetData) == 0x000020, "Wrong size on UIW_ListItem_SlaveArm_ReinforceInfo_C_SetData");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_SetData, SlotData_0) == 0x000000, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_SetData::SlotData_0' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_SlaveArm_ReinforceInfo_C_SetData, CallFunc_GetLocalTextNameLocalize_ReturnValue) == 0x000008, "Member 'UIW_ListItem_SlaveArm_ReinforceInfo_C_SetData::CallFunc_GetLocalTextNameLocalize_ReturnValue' has a wrong offset!");

}

