#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_QA_ListItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_QA_ListItem.UIW_QA_ListItem_C
// 0x0020 (0x0288 - 0x0268)
class UUIW_QA_ListItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Btn;                                               // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ELSecondStat                                  SecondStat;                                        // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_0;                                           // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_QA_ListItem(int32 EntryPoint);
	void BndEvt__UIW_QA_ListItem_Btn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_QA_ListItem_C">();
	}
	static class UUIW_QA_ListItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_QA_ListItem_C>();
	}
};
static_assert(alignof(UUIW_QA_ListItem_C) == 0x000008, "Wrong alignment on UUIW_QA_ListItem_C");
static_assert(sizeof(UUIW_QA_ListItem_C) == 0x000288, "Wrong size on UUIW_QA_ListItem_C");
static_assert(offsetof(UUIW_QA_ListItem_C, UberGraphFrame) == 0x000268, "Member 'UUIW_QA_ListItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_QA_ListItem_C, Btn) == 0x000270, "Member 'UUIW_QA_ListItem_C::Btn' has a wrong offset!");
static_assert(offsetof(UUIW_QA_ListItem_C, Text) == 0x000278, "Member 'UUIW_QA_ListItem_C::Text' has a wrong offset!");
static_assert(offsetof(UUIW_QA_ListItem_C, SecondStat) == 0x000280, "Member 'UUIW_QA_ListItem_C::SecondStat' has a wrong offset!");
static_assert(offsetof(UUIW_QA_ListItem_C, Index_0) == 0x000284, "Member 'UUIW_QA_ListItem_C::Index_0' has a wrong offset!");

}

