#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Alert_TorsionCoil

#include "Basic.hpp"


namespace SDK::Params
{

// Function UIW_Alert_TorsionCoil.UIW_Alert_TorsionCoil_C.ExecuteUbergraph_UIW_Alert_TorsionCoil
// 0x0068 (0x0068 - 0x0000)
struct UIW_Alert_TorsionCoil_C_ExecuteUbergraph_UIW_Alert_TorsionCoil final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NameData;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NameData)>         K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Alert_TorsionCoil_C_ExecuteUbergraph_UIW_Alert_TorsionCoil) == 0x000008, "Wrong alignment on UIW_Alert_TorsionCoil_C_ExecuteUbergraph_UIW_Alert_TorsionCoil");
static_assert(sizeof(UIW_Alert_TorsionCoil_C_ExecuteUbergraph_UIW_Alert_TorsionCoil) == 0x000068, "Wrong size on UIW_Alert_TorsionCoil_C_ExecuteUbergraph_UIW_Alert_TorsionCoil");
static_assert(offsetof(UIW_Alert_TorsionCoil_C_ExecuteUbergraph_UIW_Alert_TorsionCoil, EntryPoint) == 0x000000, "Member 'UIW_Alert_TorsionCoil_C_ExecuteUbergraph_UIW_Alert_TorsionCoil::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_Alert_TorsionCoil_C_ExecuteUbergraph_UIW_Alert_TorsionCoil, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'UIW_Alert_TorsionCoil_C_ExecuteUbergraph_UIW_Alert_TorsionCoil::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_TorsionCoil_C_ExecuteUbergraph_UIW_Alert_TorsionCoil, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'UIW_Alert_TorsionCoil_C_ExecuteUbergraph_UIW_Alert_TorsionCoil::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_TorsionCoil_C_ExecuteUbergraph_UIW_Alert_TorsionCoil, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000018, "Member 'UIW_Alert_TorsionCoil_C_ExecuteUbergraph_UIW_Alert_TorsionCoil::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Alert_TorsionCoil_C_ExecuteUbergraph_UIW_Alert_TorsionCoil, K2Node_CustomEvent_NameData) == 0x000020, "Member 'UIW_Alert_TorsionCoil_C_ExecuteUbergraph_UIW_Alert_TorsionCoil::K2Node_CustomEvent_NameData' has a wrong offset!");
static_assert(offsetof(UIW_Alert_TorsionCoil_C_ExecuteUbergraph_UIW_Alert_TorsionCoil, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000028, "Member 'UIW_Alert_TorsionCoil_C_ExecuteUbergraph_UIW_Alert_TorsionCoil::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(UIW_Alert_TorsionCoil_C_ExecuteUbergraph_UIW_Alert_TorsionCoil, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000030, "Member 'UIW_Alert_TorsionCoil_C_ExecuteUbergraph_UIW_Alert_TorsionCoil::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_TorsionCoil_C_ExecuteUbergraph_UIW_Alert_TorsionCoil, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'UIW_Alert_TorsionCoil_C_ExecuteUbergraph_UIW_Alert_TorsionCoil::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_TorsionCoil_C_ExecuteUbergraph_UIW_Alert_TorsionCoil, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'UIW_Alert_TorsionCoil_C_ExecuteUbergraph_UIW_Alert_TorsionCoil::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_Alert_TorsionCoil_C_ExecuteUbergraph_UIW_Alert_TorsionCoil, K2Node_CreateDelegate_OutputDelegate_1) == 0x00004C, "Member 'UIW_Alert_TorsionCoil_C_ExecuteUbergraph_UIW_Alert_TorsionCoil::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UIW_Alert_TorsionCoil_C_ExecuteUbergraph_UIW_Alert_TorsionCoil, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000060, "Member 'UIW_Alert_TorsionCoil_C_ExecuteUbergraph_UIW_Alert_TorsionCoil::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");

// Function UIW_Alert_TorsionCoil.UIW_Alert_TorsionCoil_C.Show
// 0x0008 (0x0008 - 0x0000)
struct UIW_Alert_TorsionCoil_C_Show final
{
public:
	class FName                                   NameData;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Alert_TorsionCoil_C_Show) == 0x000004, "Wrong alignment on UIW_Alert_TorsionCoil_C_Show");
static_assert(sizeof(UIW_Alert_TorsionCoil_C_Show) == 0x000008, "Wrong size on UIW_Alert_TorsionCoil_C_Show");
static_assert(offsetof(UIW_Alert_TorsionCoil_C_Show, NameData) == 0x000000, "Member 'UIW_Alert_TorsionCoil_C_Show::NameData' has a wrong offset!");

}

