#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Alert_BGM

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UIW_Alert_BGM.UIW_Alert_BGM_C.ExecuteUbergraph_UIW_Alert_BGM
// 0x0020 (0x0020 - 0x0000)
struct UIW_Alert_BGM_C_ExecuteUbergraph_UIW_Alert_BGM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULSoundSystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName SoundName)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(UIW_Alert_BGM_C_ExecuteUbergraph_UIW_Alert_BGM) == 0x000008, "Wrong alignment on UIW_Alert_BGM_C_ExecuteUbergraph_UIW_Alert_BGM");
static_assert(sizeof(UIW_Alert_BGM_C_ExecuteUbergraph_UIW_Alert_BGM) == 0x000020, "Wrong size on UIW_Alert_BGM_C_ExecuteUbergraph_UIW_Alert_BGM");
static_assert(offsetof(UIW_Alert_BGM_C_ExecuteUbergraph_UIW_Alert_BGM, EntryPoint) == 0x000000, "Member 'UIW_Alert_BGM_C_ExecuteUbergraph_UIW_Alert_BGM::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_Alert_BGM_C_ExecuteUbergraph_UIW_Alert_BGM, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UIW_Alert_BGM_C_ExecuteUbergraph_UIW_Alert_BGM::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_BGM_C_ExecuteUbergraph_UIW_Alert_BGM, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'UIW_Alert_BGM_C_ExecuteUbergraph_UIW_Alert_BGM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function UIW_Alert_BGM.UIW_Alert_BGM_C.ShowBGM
// 0x0098 (0x0098 - 0x0000)
struct UIW_Alert_BGM_C_ShowBGM final
{
public:
	class FName                                   RowName;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLBGMTableRowType                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x0078)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Alert_BGM_C_ShowBGM) == 0x000008, "Wrong alignment on UIW_Alert_BGM_C_ShowBGM");
static_assert(sizeof(UIW_Alert_BGM_C_ShowBGM) == 0x000098, "Wrong size on UIW_Alert_BGM_C_ShowBGM");
static_assert(offsetof(UIW_Alert_BGM_C_ShowBGM, RowName) == 0x000000, "Member 'UIW_Alert_BGM_C_ShowBGM::RowName' has a wrong offset!");
static_assert(offsetof(UIW_Alert_BGM_C_ShowBGM, CallFunc_GetDataTableRowFromName_OutRow) == 0x000008, "Member 'UIW_Alert_BGM_C_ShowBGM::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UIW_Alert_BGM_C_ShowBGM, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000080, "Member 'UIW_Alert_BGM_C_ShowBGM::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_BGM_C_ShowBGM, CallFunc_TextIsEmpty_ReturnValue) == 0x000081, "Member 'UIW_Alert_BGM_C_ShowBGM::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_BGM_C_ShowBGM, CallFunc_K2_SetTimer_ReturnValue) == 0x000088, "Member 'UIW_Alert_BGM_C_ShowBGM::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_BGM_C_ShowBGM, CallFunc_K2_SetTimer_ReturnValue_1) == 0x000090, "Member 'UIW_Alert_BGM_C_ShowBGM::CallFunc_K2_SetTimer_ReturnValue_1' has a wrong offset!");

// Function UIW_Alert_BGM.UIW_Alert_BGM_C.HideBGM
// 0x0008 (0x0008 - 0x0000)
struct UIW_Alert_BGM_C_HideBGM final
{
public:
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Alert_BGM_C_HideBGM) == 0x000008, "Wrong alignment on UIW_Alert_BGM_C_HideBGM");
static_assert(sizeof(UIW_Alert_BGM_C_HideBGM) == 0x000008, "Wrong size on UIW_Alert_BGM_C_HideBGM");
static_assert(offsetof(UIW_Alert_BGM_C_HideBGM, CallFunc_K2_SetTimer_ReturnValue) == 0x000000, "Member 'UIW_Alert_BGM_C_HideBGM::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function UIW_Alert_BGM.UIW_Alert_BGM_C.VisibleEffectShow
// 0x0018 (0x0018 - 0x0000)
struct UIW_Alert_BGM_C_VisibleEffectShow final
{
public:
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Alert_BGM_C_VisibleEffectShow) == 0x000008, "Wrong alignment on UIW_Alert_BGM_C_VisibleEffectShow");
static_assert(sizeof(UIW_Alert_BGM_C_VisibleEffectShow) == 0x000018, "Wrong size on UIW_Alert_BGM_C_VisibleEffectShow");
static_assert(offsetof(UIW_Alert_BGM_C_VisibleEffectShow, CallFunc_Ease_ReturnValue) == 0x000000, "Member 'UIW_Alert_BGM_C_VisibleEffectShow::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_BGM_C_VisibleEffectShow, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'UIW_Alert_BGM_C_VisibleEffectShow::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_BGM_C_VisibleEffectShow, CallFunc_GetEffectMaterial_ReturnValue) == 0x000008, "Member 'UIW_Alert_BGM_C_VisibleEffectShow::CallFunc_GetEffectMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_BGM_C_VisibleEffectShow, CallFunc_Add_FloatFloat_ReturnValue) == 0x000010, "Member 'UIW_Alert_BGM_C_VisibleEffectShow::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function UIW_Alert_BGM.UIW_Alert_BGM_C.VisibleEffectHide
// 0x0018 (0x0018 - 0x0000)
struct UIW_Alert_BGM_C_VisibleEffectHide final
{
public:
	float                                         CallFunc_Ease_ReturnValue;                         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Alert_BGM_C_VisibleEffectHide) == 0x000008, "Wrong alignment on UIW_Alert_BGM_C_VisibleEffectHide");
static_assert(sizeof(UIW_Alert_BGM_C_VisibleEffectHide) == 0x000018, "Wrong size on UIW_Alert_BGM_C_VisibleEffectHide");
static_assert(offsetof(UIW_Alert_BGM_C_VisibleEffectHide, CallFunc_Ease_ReturnValue) == 0x000000, "Member 'UIW_Alert_BGM_C_VisibleEffectHide::CallFunc_Ease_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_BGM_C_VisibleEffectHide, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'UIW_Alert_BGM_C_VisibleEffectHide::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_BGM_C_VisibleEffectHide, CallFunc_GetEffectMaterial_ReturnValue) == 0x000008, "Member 'UIW_Alert_BGM_C_VisibleEffectHide::CallFunc_GetEffectMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_BGM_C_VisibleEffectHide, CallFunc_Add_FloatFloat_ReturnValue) == 0x000010, "Member 'UIW_Alert_BGM_C_VisibleEffectHide::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

}

