#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_SlaveArm_List

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UIW_SlaveArm_List.UIW_SlaveArm_List_C.ExecuteUbergraph_UIW_SlaveArm_List
// 0x00E0 (0x00E0 - 0x0000)
struct UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLocalTextTooltipLocalize_ReturnValue;  // 0x0038(0x0018)()
	class FName                                   CallFunc_GetLocalTextTooltipCn_ReturnValue;        // 0x0050(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalTextNameLocalize_ReturnValue;     // 0x0058(0x0018)()
	class FText                                   CallFunc_GetPlatformBranchTextSA_Text;             // 0x0070(0x0018)()
	bool                                          CallFunc_GetPlatformBranchTextSA_IsChanged;        // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0090(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x00B8(0x0028)()
};
static_assert(alignof(UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List) == 0x000008, "Wrong alignment on UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List");
static_assert(sizeof(UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List) == 0x0000E0, "Wrong size on UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List");
static_assert(offsetof(UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List, EntryPoint) == 0x000000, "Member 'UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List, K2Node_Event_bIsExpanded) == 0x000030, "Member 'UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List, K2Node_Event_bIsSelected) == 0x000031, "Member 'UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List, CallFunc_GetLocalTextTooltipLocalize_ReturnValue) == 0x000038, "Member 'UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List::CallFunc_GetLocalTextTooltipLocalize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List, CallFunc_GetLocalTextTooltipCn_ReturnValue) == 0x000050, "Member 'UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List::CallFunc_GetLocalTextTooltipCn_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List, CallFunc_GetLocalTextNameLocalize_ReturnValue) == 0x000058, "Member 'UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List::CallFunc_GetLocalTextNameLocalize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List, CallFunc_GetPlatformBranchTextSA_Text) == 0x000070, "Member 'UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List::CallFunc_GetPlatformBranchTextSA_Text' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List, CallFunc_GetPlatformBranchTextSA_IsChanged) == 0x000088, "Member 'UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List::CallFunc_GetPlatformBranchTextSA_IsChanged' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List, K2Node_MakeStruct_SlateColor_1) == 0x000090, "Member 'UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List, K2Node_MakeStruct_SlateColor_2) == 0x0000B8, "Member 'UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");

// Function UIW_SlaveArm_List.UIW_SlaveArm_List_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_SlaveArm_List_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_SlaveArm_List_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on UIW_SlaveArm_List_C_BP_OnItemSelectionChanged");
static_assert(sizeof(UIW_SlaveArm_List_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on UIW_SlaveArm_List_C_BP_OnItemSelectionChanged");
static_assert(offsetof(UIW_SlaveArm_List_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'UIW_SlaveArm_List_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function UIW_SlaveArm_List.UIW_SlaveArm_List_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_SlaveArm_List_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_SlaveArm_List_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on UIW_SlaveArm_List_C_BP_OnItemExpansionChanged");
static_assert(sizeof(UIW_SlaveArm_List_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on UIW_SlaveArm_List_C_BP_OnItemExpansionChanged");
static_assert(offsetof(UIW_SlaveArm_List_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'UIW_SlaveArm_List_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

}

