#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Grinder

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK::Params
{

// Function UIW_Grinder.UIW_Grinder_C.ExecuteUbergraph_UIW_Grinder
// 0x0060 (0x0060 - 0x0000)
struct UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_1;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsComplexItem_ReturnValue;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MakeComplexItem_ReturnValue;              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MakeComplexItem_ReturnValue_1;            // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder) == 0x000008, "Wrong alignment on UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder");
static_assert(sizeof(UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder) == 0x000060, "Wrong size on UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder");
static_assert(offsetof(UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder, EntryPoint) == 0x000000, "Member 'UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder, K2Node_ComponentBoundEvent_BtnKey_1) == 0x000010, "Member 'UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder::K2Node_ComponentBoundEvent_BtnKey_1' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder, K2Node_MakeArray_Array) == 0x000018, "Member 'UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder, K2Node_ComponentBoundEvent_BtnKey) == 0x000028, "Member 'UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder::K2Node_ComponentBoundEvent_BtnKey' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder, CallFunc_IsComplexItem_ReturnValue) == 0x000030, "Member 'UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder::CallFunc_IsComplexItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder, K2Node_ComponentBoundEvent_Item) == 0x000038, "Member 'UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder, K2Node_ComponentBoundEvent_bIsSelected) == 0x000040, "Member 'UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder::K2Node_ComponentBoundEvent_bIsSelected' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder, CallFunc_MakeComplexItem_ReturnValue) == 0x000041, "Member 'UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder::CallFunc_MakeComplexItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder, CallFunc_MakeComplexItem_ReturnValue_1) == 0x000042, "Member 'UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder::CallFunc_MakeComplexItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder, CallFunc_GetIndexForItem_ReturnValue) == 0x000044, "Member 'UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000048, "Member 'UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder, CallFunc_GetMainWidget_MainWidget) == 0x000050, "Member 'UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000058, "Member 'UIW_Grinder_C_ExecuteUbergraph_UIW_Grinder::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");

// Function UIW_Grinder.UIW_Grinder_C.BndEvt__UIW_Grinder_List_Item_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UIW_Grinder_C_BndEvt__UIW_Grinder_List_Item_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Grinder_C_BndEvt__UIW_Grinder_List_Item_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on UIW_Grinder_C_BndEvt__UIW_Grinder_List_Item_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(sizeof(UIW_Grinder_C_BndEvt__UIW_Grinder_List_Item_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000010, "Wrong size on UIW_Grinder_C_BndEvt__UIW_Grinder_List_Item_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(offsetof(UIW_Grinder_C_BndEvt__UIW_Grinder_List_Item_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature, Item) == 0x000000, "Member 'UIW_Grinder_C_BndEvt__UIW_Grinder_List_Item_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_BndEvt__UIW_Grinder_List_Item_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature, bIsSelected) == 0x000008, "Member 'UIW_Grinder_C_BndEvt__UIW_Grinder_List_Item_K2Node_ComponentBoundEvent_2_OnListItemSelectionChangedDynamic__DelegateSignature::bIsSelected' has a wrong offset!");

// Function UIW_Grinder.UIW_Grinder_C.BndEvt__UIW_Transition_Btn_Equip_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Grinder_C_BndEvt__UIW_Transition_Btn_Equip_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Grinder_C_BndEvt__UIW_Transition_Btn_Equip_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_Grinder_C_BndEvt__UIW_Transition_Btn_Equip_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature");
static_assert(sizeof(UIW_Grinder_C_BndEvt__UIW_Transition_Btn_Equip_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_Grinder_C_BndEvt__UIW_Transition_Btn_Equip_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature");
static_assert(offsetof(UIW_Grinder_C_BndEvt__UIW_Transition_Btn_Equip_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_Grinder_C_BndEvt__UIW_Transition_Btn_Equip_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_Grinder.UIW_Grinder_C.BndEvt__UIW_Transition_Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Grinder_C_BndEvt__UIW_Transition_Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Grinder_C_BndEvt__UIW_Transition_Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_Grinder_C_BndEvt__UIW_Transition_Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature");
static_assert(sizeof(UIW_Grinder_C_BndEvt__UIW_Transition_Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_Grinder_C_BndEvt__UIW_Transition_Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature");
static_assert(offsetof(UIW_Grinder_C_BndEvt__UIW_Transition_Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_Grinder_C_BndEvt__UIW_Transition_Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_Grinder.UIW_Grinder_C.OnReady
// 0x0520 (0x0520 - 0x0000)
struct UIW_Grinder_C_OnReady final
{
public:
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScrollBarStyle                        CallFunc_GetScrollBarStyle_ScrollBarStyle;         // 0x0008(0x04D0)()
	class ULCommonConstantValues*                 CallFunc_GetConstantValues_ReturnValue;            // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Item)>          K2Node_CreateDelegate_OutputDelegate;              // 0x04E0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   CallFunc_GetUniqueGrinderMainItem_ReturnValue;     // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Item, bool bIsSelected)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0500(0x0010)(ZeroConstructor, NoDestructor)
	class ULPlayerInventory*                      CallFunc_GetPlayerInventory_ReturnValue;           // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 CallFunc_FindItemByCodeName_ReturnValue;           // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Grinder_C_OnReady) == 0x000008, "Wrong alignment on UIW_Grinder_C_OnReady");
static_assert(sizeof(UIW_Grinder_C_OnReady) == 0x000520, "Wrong size on UIW_Grinder_C_OnReady");
static_assert(offsetof(UIW_Grinder_C_OnReady, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'UIW_Grinder_C_OnReady::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_OnReady, CallFunc_GetScrollBarStyle_ScrollBarStyle) == 0x000008, "Member 'UIW_Grinder_C_OnReady::CallFunc_GetScrollBarStyle_ScrollBarStyle' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_OnReady, CallFunc_GetConstantValues_ReturnValue) == 0x0004D8, "Member 'UIW_Grinder_C_OnReady::CallFunc_GetConstantValues_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_OnReady, K2Node_CreateDelegate_OutputDelegate) == 0x0004E0, "Member 'UIW_Grinder_C_OnReady::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_OnReady, CallFunc_GetUniqueGrinderMainItem_ReturnValue) == 0x0004F0, "Member 'UIW_Grinder_C_OnReady::CallFunc_GetUniqueGrinderMainItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_OnReady, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0004F8, "Member 'UIW_Grinder_C_OnReady::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_OnReady, K2Node_CreateDelegate_OutputDelegate_1) == 0x000500, "Member 'UIW_Grinder_C_OnReady::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_OnReady, CallFunc_GetPlayerInventory_ReturnValue) == 0x000510, "Member 'UIW_Grinder_C_OnReady::CallFunc_GetPlayerInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_OnReady, CallFunc_FindItemByCodeName_ReturnValue) == 0x000518, "Member 'UIW_Grinder_C_OnReady::CallFunc_FindItemByCodeName_ReturnValue' has a wrong offset!");

// Function UIW_Grinder.UIW_Grinder_C.OnSelectedChanged
// 0x0068 (0x0068 - 0x0000)
struct UIW_Grinder_C_OnSelectedChanged final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x000C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_Item_C*                  K2Node_DynamicCast_AsUIBP_List_Data_Item;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_1;                              // 0x0024(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0030(0x0018)()
	bool                                          CallFunc_IsComplexItem_ReturnValue;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x0050(0x0018)()
};
static_assert(alignof(UIW_Grinder_C_OnSelectedChanged) == 0x000008, "Wrong alignment on UIW_Grinder_C_OnSelectedChanged");
static_assert(sizeof(UIW_Grinder_C_OnSelectedChanged) == 0x000068, "Wrong size on UIW_Grinder_C_OnSelectedChanged");
static_assert(offsetof(UIW_Grinder_C_OnSelectedChanged, Item) == 0x000000, "Member 'UIW_Grinder_C_OnSelectedChanged::Item' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_OnSelectedChanged, bIsSelected) == 0x000008, "Member 'UIW_Grinder_C_OnSelectedChanged::bIsSelected' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_OnSelectedChanged, Temp_name_Variable) == 0x00000C, "Member 'UIW_Grinder_C_OnSelectedChanged::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_OnSelectedChanged, K2Node_DynamicCast_AsUIBP_List_Data_Item) == 0x000018, "Member 'UIW_Grinder_C_OnSelectedChanged::K2Node_DynamicCast_AsUIBP_List_Data_Item' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_OnSelectedChanged, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'UIW_Grinder_C_OnSelectedChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_OnSelectedChanged, Temp_name_Variable_1) == 0x000024, "Member 'UIW_Grinder_C_OnSelectedChanged::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_OnSelectedChanged, CallFunc_GetGameStrWithName_ReturnValue) == 0x000030, "Member 'UIW_Grinder_C_OnSelectedChanged::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_OnSelectedChanged, CallFunc_IsComplexItem_ReturnValue) == 0x000048, "Member 'UIW_Grinder_C_OnSelectedChanged::CallFunc_IsComplexItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_OnSelectedChanged, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'UIW_Grinder_C_OnSelectedChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_OnSelectedChanged, CallFunc_GetGameStrWithName_ReturnValue_1) == 0x000050, "Member 'UIW_Grinder_C_OnSelectedChanged::CallFunc_GetGameStrWithName_ReturnValue_1' has a wrong offset!");

// Function UIW_Grinder.UIW_Grinder_C.OnDoubleClicked
// 0x0008 (0x0008 - 0x0000)
struct UIW_Grinder_C_OnDoubleClicked final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Grinder_C_OnDoubleClicked) == 0x000008, "Wrong alignment on UIW_Grinder_C_OnDoubleClicked");
static_assert(sizeof(UIW_Grinder_C_OnDoubleClicked) == 0x000008, "Wrong size on UIW_Grinder_C_OnDoubleClicked");
static_assert(offsetof(UIW_Grinder_C_OnDoubleClicked, Item) == 0x000000, "Member 'UIW_Grinder_C_OnDoubleClicked::Item' has a wrong offset!");

// Function UIW_Grinder.UIW_Grinder_C.SetItem
// 0x0168 (0x0168 - 0x0000)
struct UIW_Grinder_C_SetItem final
{
public:
	int32                                         LocalOtherItemIndex;                               // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemConsumeInfoPtr                    LocalConsumeInfo;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, NoDestructor)
	struct FItemCommonInfoPtr                     LocalCommonInfo;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor)
	class ULItem*                                 LocalUnitItem;                                     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 LocalMainItem;                                     // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 CallFunc_GetComplexItem_Unit_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemConsumeInfoPtr                    CallFunc_GetConsumeInfo_ReturnValue;               // 0x0030(0x0008)(NoDestructor)
	struct FItemCommonInfoPtr                     CallFunc_GetCommonInfo_ReturnValue;                // 0x0038(0x0008)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemCommonInfoPtr                     CallFunc_GetCommonInfo_ReturnValue_1;              // 0x0048(0x0008)(NoDestructor)
	class FText                                   CallFunc_GetSimpleTooltipLocalize_ReturnValue;     // 0x0050(0x0018)()
	class FText                                   CallFunc_GetLocalTextItemNameLocalize_ReturnValue; // 0x0068(0x0018)()
	TSoftObjectPtr<class UObject>                 CallFunc_GetImageResource_ReturnValue;             // 0x0080(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x00A8(0x0018)()
	class FText                                   CallFunc_GetSecondCategoryLabel_Label;             // 0x00C0(0x0018)()
	TSoftObjectPtr<class UObject>                 CallFunc_GetImageResource_ReturnValue_1;           // 0x00D8(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalTextTooltip2Localize_ReturnValue; // 0x0100(0x0018)()
	class FText                                   CallFunc_GetLocalTextTooltip1Localize_ReturnValue; // 0x0118(0x0018)()
	ELItemSecondCategory                          CallFunc_GetSecondCategory_ReturnValue;            // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLocalTextItemNameLocalize_ReturnValue_1; // 0x0138(0x0018)()
	class FText                                   CallFunc_GetSecondCategoryLabel_Label_1;           // 0x0150(0x0018)()
};
static_assert(alignof(UIW_Grinder_C_SetItem) == 0x000008, "Wrong alignment on UIW_Grinder_C_SetItem");
static_assert(sizeof(UIW_Grinder_C_SetItem) == 0x000168, "Wrong size on UIW_Grinder_C_SetItem");
static_assert(offsetof(UIW_Grinder_C_SetItem, LocalOtherItemIndex) == 0x000000, "Member 'UIW_Grinder_C_SetItem::LocalOtherItemIndex' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_SetItem, LocalConsumeInfo) == 0x000008, "Member 'UIW_Grinder_C_SetItem::LocalConsumeInfo' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_SetItem, LocalCommonInfo) == 0x000010, "Member 'UIW_Grinder_C_SetItem::LocalCommonInfo' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_SetItem, LocalUnitItem) == 0x000018, "Member 'UIW_Grinder_C_SetItem::LocalUnitItem' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_SetItem, LocalMainItem) == 0x000020, "Member 'UIW_Grinder_C_SetItem::LocalMainItem' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_SetItem, CallFunc_GetComplexItem_Unit_ReturnValue) == 0x000028, "Member 'UIW_Grinder_C_SetItem::CallFunc_GetComplexItem_Unit_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_SetItem, CallFunc_GetConsumeInfo_ReturnValue) == 0x000030, "Member 'UIW_Grinder_C_SetItem::CallFunc_GetConsumeInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_SetItem, CallFunc_GetCommonInfo_ReturnValue) == 0x000038, "Member 'UIW_Grinder_C_SetItem::CallFunc_GetCommonInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_SetItem, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'UIW_Grinder_C_SetItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_SetItem, CallFunc_GetCommonInfo_ReturnValue_1) == 0x000048, "Member 'UIW_Grinder_C_SetItem::CallFunc_GetCommonInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_SetItem, CallFunc_GetSimpleTooltipLocalize_ReturnValue) == 0x000050, "Member 'UIW_Grinder_C_SetItem::CallFunc_GetSimpleTooltipLocalize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_SetItem, CallFunc_GetLocalTextItemNameLocalize_ReturnValue) == 0x000068, "Member 'UIW_Grinder_C_SetItem::CallFunc_GetLocalTextItemNameLocalize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_SetItem, CallFunc_GetImageResource_ReturnValue) == 0x000080, "Member 'UIW_Grinder_C_SetItem::CallFunc_GetImageResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_SetItem, CallFunc_GetGameStrWithName_ReturnValue) == 0x0000A8, "Member 'UIW_Grinder_C_SetItem::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_SetItem, CallFunc_GetSecondCategoryLabel_Label) == 0x0000C0, "Member 'UIW_Grinder_C_SetItem::CallFunc_GetSecondCategoryLabel_Label' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_SetItem, CallFunc_GetImageResource_ReturnValue_1) == 0x0000D8, "Member 'UIW_Grinder_C_SetItem::CallFunc_GetImageResource_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_SetItem, CallFunc_GetLocalTextTooltip2Localize_ReturnValue) == 0x000100, "Member 'UIW_Grinder_C_SetItem::CallFunc_GetLocalTextTooltip2Localize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_SetItem, CallFunc_GetLocalTextTooltip1Localize_ReturnValue) == 0x000118, "Member 'UIW_Grinder_C_SetItem::CallFunc_GetLocalTextTooltip1Localize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_SetItem, CallFunc_GetSecondCategory_ReturnValue) == 0x000130, "Member 'UIW_Grinder_C_SetItem::CallFunc_GetSecondCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_SetItem, CallFunc_GetLocalTextItemNameLocalize_ReturnValue_1) == 0x000138, "Member 'UIW_Grinder_C_SetItem::CallFunc_GetLocalTextItemNameLocalize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_SetItem, CallFunc_GetSecondCategoryLabel_Label_1) == 0x000150, "Member 'UIW_Grinder_C_SetItem::CallFunc_GetSecondCategoryLabel_Label_1' has a wrong offset!");

// Function UIW_Grinder.UIW_Grinder_C.RefreshInvenItem
// 0x00B8 (0x00B8 - 0x0000)
struct UIW_Grinder_C_RefreshInvenItem final
{
public:
	int32                                         LocalLastIndex;                                    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUIBP_ListData_Item_C*>          LocalLItemListData;                                // 0x0008(0x0010)(Edit, BlueprintVisible)
	TArray<class ULItem*>                         LocalItems;                                        // 0x0018(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerInventory*                      CallFunc_GetPlayerInventory_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ULItem*>                         CallFunc_FindUICategoryItems_ReturnValue;          // 0x0050(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsComplexItem_ReturnValue;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELItemSecondCategory                          CallFunc_GetSecondCategory_ReturnValue;            // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_Item_C*                  CallFunc_SpawnObject_ReturnValue;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_Item_C*                  CallFunc_SpawnObject_ReturnValue_1;                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Grinder_C_RefreshInvenItem) == 0x000008, "Wrong alignment on UIW_Grinder_C_RefreshInvenItem");
static_assert(sizeof(UIW_Grinder_C_RefreshInvenItem) == 0x0000B8, "Wrong size on UIW_Grinder_C_RefreshInvenItem");
static_assert(offsetof(UIW_Grinder_C_RefreshInvenItem, LocalLastIndex) == 0x000000, "Member 'UIW_Grinder_C_RefreshInvenItem::LocalLastIndex' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_RefreshInvenItem, LocalLItemListData) == 0x000008, "Member 'UIW_Grinder_C_RefreshInvenItem::LocalLItemListData' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_RefreshInvenItem, LocalItems) == 0x000018, "Member 'UIW_Grinder_C_RefreshInvenItem::LocalItems' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_RefreshInvenItem, Temp_int_Array_Index_Variable) == 0x000028, "Member 'UIW_Grinder_C_RefreshInvenItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_RefreshInvenItem, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'UIW_Grinder_C_RefreshInvenItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_RefreshInvenItem, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'UIW_Grinder_C_RefreshInvenItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_RefreshInvenItem, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000038, "Member 'UIW_Grinder_C_RefreshInvenItem::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_RefreshInvenItem, CallFunc_GetPlayerInventory_ReturnValue) == 0x000040, "Member 'UIW_Grinder_C_RefreshInvenItem::CallFunc_GetPlayerInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_RefreshInvenItem, CallFunc_Array_Get_Item) == 0x000048, "Member 'UIW_Grinder_C_RefreshInvenItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_RefreshInvenItem, CallFunc_FindUICategoryItems_ReturnValue) == 0x000050, "Member 'UIW_Grinder_C_RefreshInvenItem::CallFunc_FindUICategoryItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_RefreshInvenItem, CallFunc_IsComplexItem_ReturnValue) == 0x000060, "Member 'UIW_Grinder_C_RefreshInvenItem::CallFunc_IsComplexItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_RefreshInvenItem, CallFunc_GetSecondCategory_ReturnValue) == 0x000061, "Member 'UIW_Grinder_C_RefreshInvenItem::CallFunc_GetSecondCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_RefreshInvenItem, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'UIW_Grinder_C_RefreshInvenItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_RefreshInvenItem, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'UIW_Grinder_C_RefreshInvenItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_RefreshInvenItem, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x000070, "Member 'UIW_Grinder_C_RefreshInvenItem::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_RefreshInvenItem, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'UIW_Grinder_C_RefreshInvenItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_RefreshInvenItem, CallFunc_GetIndexForItem_ReturnValue) == 0x00007C, "Member 'UIW_Grinder_C_RefreshInvenItem::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_RefreshInvenItem, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000080, "Member 'UIW_Grinder_C_RefreshInvenItem::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_RefreshInvenItem, CallFunc_SpawnObject_ReturnValue) == 0x000088, "Member 'UIW_Grinder_C_RefreshInvenItem::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_RefreshInvenItem, CallFunc_Array_Add_ReturnValue) == 0x000090, "Member 'UIW_Grinder_C_RefreshInvenItem::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_RefreshInvenItem, Temp_bool_Variable) == 0x000094, "Member 'UIW_Grinder_C_RefreshInvenItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_RefreshInvenItem, Temp_int_Variable) == 0x000098, "Member 'UIW_Grinder_C_RefreshInvenItem::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_RefreshInvenItem, K2Node_Select_Default) == 0x00009C, "Member 'UIW_Grinder_C_RefreshInvenItem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_RefreshInvenItem, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000A0, "Member 'UIW_Grinder_C_RefreshInvenItem::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_RefreshInvenItem, CallFunc_SpawnObject_ReturnValue_1) == 0x0000A8, "Member 'UIW_Grinder_C_RefreshInvenItem::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_RefreshInvenItem, CallFunc_Array_Add_ReturnValue_1) == 0x0000B0, "Member 'UIW_Grinder_C_RefreshInvenItem::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function UIW_Grinder.UIW_Grinder_C.FocusManage
// 0x02D8 (0x02D8 - 0x0000)
struct UIW_Grinder_C_FocusManage final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_FocusManage_ReturnValue;                  // 0x0160(0x00B8)()
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0220(0x00B8)()
};
static_assert(alignof(UIW_Grinder_C_FocusManage) == 0x000008, "Wrong alignment on UIW_Grinder_C_FocusManage");
static_assert(sizeof(UIW_Grinder_C_FocusManage) == 0x0002D8, "Wrong size on UIW_Grinder_C_FocusManage");
static_assert(offsetof(UIW_Grinder_C_FocusManage, MyGeometry) == 0x000000, "Member 'UIW_Grinder_C_FocusManage::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_FocusManage, MouseEvent) == 0x000038, "Member 'UIW_Grinder_C_FocusManage::MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_FocusManage, ReturnValue) == 0x0000A8, "Member 'UIW_Grinder_C_FocusManage::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_FocusManage, CallFunc_FocusManage_ReturnValue) == 0x000160, "Member 'UIW_Grinder_C_FocusManage::CallFunc_FocusManage_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_FocusManage, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x000218, "Member 'UIW_Grinder_C_FocusManage::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_FocusManage, CallFunc_Handled_ReturnValue) == 0x000220, "Member 'UIW_Grinder_C_FocusManage::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UIW_Grinder.UIW_Grinder_C.CallbackContextMenu
// 0x000C (0x000C - 0x0000)
struct UIW_Grinder_C_CallbackContextMenu final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Grinder_C_CallbackContextMenu) == 0x000004, "Wrong alignment on UIW_Grinder_C_CallbackContextMenu");
static_assert(sizeof(UIW_Grinder_C_CallbackContextMenu) == 0x00000C, "Wrong size on UIW_Grinder_C_CallbackContextMenu");
static_assert(offsetof(UIW_Grinder_C_CallbackContextMenu, EventName) == 0x000000, "Member 'UIW_Grinder_C_CallbackContextMenu::EventName' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_CallbackContextMenu, K2Node_SwitchName_CmpSuccess) == 0x000008, "Member 'UIW_Grinder_C_CallbackContextMenu::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function UIW_Grinder.UIW_Grinder_C.NavToTop
// 0x0018 (0x0018 - 0x0000)
struct UIW_Grinder_C_NavToTop final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Grinder_C_NavToTop) == 0x000008, "Wrong alignment on UIW_Grinder_C_NavToTop");
static_assert(sizeof(UIW_Grinder_C_NavToTop) == 0x000018, "Wrong size on UIW_Grinder_C_NavToTop");
static_assert(offsetof(UIW_Grinder_C_NavToTop, Navigation_0) == 0x000000, "Member 'UIW_Grinder_C_NavToTop::Navigation_0' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_NavToTop, ReturnValue) == 0x000008, "Member 'UIW_Grinder_C_NavToTop::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_NavToTop, CallFunc_Percent_IntInt_ReturnValue) == 0x000010, "Member 'UIW_Grinder_C_NavToTop::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");

// Function UIW_Grinder.UIW_Grinder_C.NavToBottom
// 0x0070 (0x0070 - 0x0000)
struct UIW_Grinder_C_NavToBottom final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_4;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_5;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_6;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Grinder_C_NavToBottom) == 0x000008, "Wrong alignment on UIW_Grinder_C_NavToBottom");
static_assert(sizeof(UIW_Grinder_C_NavToBottom) == 0x000070, "Wrong size on UIW_Grinder_C_NavToBottom");
static_assert(offsetof(UIW_Grinder_C_NavToBottom, Navigation_0) == 0x000000, "Member 'UIW_Grinder_C_NavToBottom::Navigation_0' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_NavToBottom, ReturnValue) == 0x000008, "Member 'UIW_Grinder_C_NavToBottom::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_NavToBottom, Temp_int_Variable) == 0x000010, "Member 'UIW_Grinder_C_NavToBottom::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_NavToBottom, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x000018, "Member 'UIW_Grinder_C_NavToBottom::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_NavToBottom, CallFunc_GetNumItems_ReturnValue) == 0x000020, "Member 'UIW_Grinder_C_NavToBottom::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_NavToBottom, CallFunc_GetIndexForItem_ReturnValue) == 0x000024, "Member 'UIW_Grinder_C_NavToBottom::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_NavToBottom, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'UIW_Grinder_C_NavToBottom::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_NavToBottom, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'UIW_Grinder_C_NavToBottom::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_NavToBottom, Temp_bool_Variable) == 0x000030, "Member 'UIW_Grinder_C_NavToBottom::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_NavToBottom, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000034, "Member 'UIW_Grinder_C_NavToBottom::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_NavToBottom, CallFunc_Percent_IntInt_ReturnValue) == 0x000038, "Member 'UIW_Grinder_C_NavToBottom::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_NavToBottom, Temp_bool_Variable_1) == 0x00003C, "Member 'UIW_Grinder_C_NavToBottom::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_NavToBottom, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00003D, "Member 'UIW_Grinder_C_NavToBottom::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_NavToBottom, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000040, "Member 'UIW_Grinder_C_NavToBottom::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_NavToBottom, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000044, "Member 'UIW_Grinder_C_NavToBottom::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_NavToBottom, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x000048, "Member 'UIW_Grinder_C_NavToBottom::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_NavToBottom, Temp_bool_Variable_2) == 0x00004C, "Member 'UIW_Grinder_C_NavToBottom::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_NavToBottom, CallFunc_Subtract_IntInt_ReturnValue_4) == 0x000050, "Member 'UIW_Grinder_C_NavToBottom::CallFunc_Subtract_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_NavToBottom, K2Node_Select_Default) == 0x000054, "Member 'UIW_Grinder_C_NavToBottom::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_NavToBottom, K2Node_Select_Default_1) == 0x000058, "Member 'UIW_Grinder_C_NavToBottom::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_NavToBottom, CallFunc_Less_IntInt_ReturnValue) == 0x00005C, "Member 'UIW_Grinder_C_NavToBottom::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_NavToBottom, CallFunc_Add_IntInt_ReturnValue_1) == 0x000060, "Member 'UIW_Grinder_C_NavToBottom::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_NavToBottom, CallFunc_Subtract_IntInt_ReturnValue_5) == 0x000064, "Member 'UIW_Grinder_C_NavToBottom::CallFunc_Subtract_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_NavToBottom, CallFunc_Subtract_IntInt_ReturnValue_6) == 0x000068, "Member 'UIW_Grinder_C_NavToBottom::CallFunc_Subtract_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UIW_Grinder_C_NavToBottom, K2Node_Select_Default_2) == 0x00006C, "Member 'UIW_Grinder_C_NavToBottom::K2Node_Select_Default_2' has a wrong offset!");

// Function UIW_Grinder.UIW_Grinder_C.NavToLRLoop
// 0x0058 (0x0058 - 0x0000)
struct UIW_Grinder_C_NavToLRLoop final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalIndex;                                        // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalDirection;                                    // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
