#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ComboBox_List

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UIW_ComboBox_List.UIW_ComboBox_List_C.ExecuteUbergraph_UIW_ComboBox_List
// 0x0550 (0x0550 - 0x0000)
struct UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScrollBarStyle                        CallFunc_GetScrollBarStyle_ScrollBarStyle;         // 0x0008(0x04D0)()
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x04E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_501[0x3];                                      // 0x0501(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0504(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_514[0x4];                                      // 0x0514(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0518(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0528(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName CategoryName)>     K2Node_CreateDelegate_OutputDelegate_2;            // 0x0540(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List) == 0x000008, "Wrong alignment on UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List");
static_assert(sizeof(UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List) == 0x000550, "Wrong size on UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List");
static_assert(offsetof(UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List, EntryPoint) == 0x000000, "Member 'UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List, CallFunc_GetScrollBarStyle_ScrollBarStyle) == 0x000008, "Member 'UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List::CallFunc_GetScrollBarStyle_ScrollBarStyle' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List, CallFunc_MakeLiteralByte_ReturnValue) == 0x0004D8, "Member 'UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List, K2Node_ComponentBoundEvent_Item) == 0x0004E0, "Member 'UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x0004E8, "Member 'UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List, CallFunc_Conv_StringToName_ReturnValue) == 0x0004F8, "Member 'UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000500, "Member 'UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List, K2Node_CreateDelegate_OutputDelegate) == 0x000504, "Member 'UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000518, "Member 'UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List, K2Node_CreateDelegate_OutputDelegate_1) == 0x000528, "Member 'UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000538, "Member 'UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List, K2Node_CreateDelegate_OutputDelegate_2) == 0x000540, "Member 'UIW_ComboBox_List_C_ExecuteUbergraph_UIW_ComboBox_List::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function UIW_ComboBox_List.UIW_ComboBox_List_C.BndEvt__List_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_ComboBox_List_C_BndEvt__List_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ComboBox_List_C_BndEvt__List_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong alignment on UIW_ComboBox_List_C_BndEvt__List_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature");
static_assert(sizeof(UIW_ComboBox_List_C_BndEvt__List_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong size on UIW_ComboBox_List_C_BndEvt__List_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature");
static_assert(offsetof(UIW_ComboBox_List_C_BndEvt__List_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature, Item) == 0x000000, "Member 'UIW_ComboBox_List_C_BndEvt__List_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature::Item' has a wrong offset!");

// Function UIW_ComboBox_List.UIW_ComboBox_List_C.SetComboBoxList
// 0x00B8 (0x00B8 - 0x0000)
struct UIW_ComboBox_List_C_SetComboBoxList final
{
public:
	class UUIW_ComboBox_C*                        Owner_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           Options;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         SelectedIndex;                                     // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGlobal;                                          // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LocalNeedScroll;                                   // 0x001D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUIBP_ListData_Default_C*>       LocalList;                                         // 0x0020(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0040(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_Default_C*               CallFunc_SpawnObject_ReturnValue;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Min_ReturnValue;                          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ComboBox_List_C_SetComboBoxList) == 0x000008, "Wrong alignment on UIW_ComboBox_List_C_SetComboBoxList");
static_assert(sizeof(UIW_ComboBox_List_C_SetComboBoxList) == 0x0000B8, "Wrong size on UIW_ComboBox_List_C_SetComboBoxList");
static_assert(offsetof(UIW_ComboBox_List_C_SetComboBoxList, Owner_0) == 0x000000, "Member 'UIW_ComboBox_List_C_SetComboBoxList::Owner_0' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetComboBoxList, Options) == 0x000008, "Member 'UIW_ComboBox_List_C_SetComboBoxList::Options' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetComboBoxList, SelectedIndex) == 0x000018, "Member 'UIW_ComboBox_List_C_SetComboBoxList::SelectedIndex' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetComboBoxList, IsGlobal) == 0x00001C, "Member 'UIW_ComboBox_List_C_SetComboBoxList::IsGlobal' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetComboBoxList, LocalNeedScroll) == 0x00001D, "Member 'UIW_ComboBox_List_C_SetComboBoxList::LocalNeedScroll' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetComboBoxList, LocalList) == 0x000020, "Member 'UIW_ComboBox_List_C_SetComboBoxList::LocalList' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetComboBoxList, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'UIW_ComboBox_List_C_SetComboBoxList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetComboBoxList, Temp_int_Array_Index_Variable) == 0x000034, "Member 'UIW_ComboBox_List_C_SetComboBoxList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetComboBoxList, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'UIW_ComboBox_List_C_SetComboBoxList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetComboBoxList, CallFunc_Array_Get_Item) == 0x000040, "Member 'UIW_ComboBox_List_C_SetComboBoxList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetComboBoxList, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'UIW_ComboBox_List_C_SetComboBoxList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetComboBoxList, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'UIW_ComboBox_List_C_SetComboBoxList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetComboBoxList, CallFunc_SpawnObject_ReturnValue) == 0x000060, "Member 'UIW_ComboBox_List_C_SetComboBoxList::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetComboBoxList, CallFunc_Array_Length_ReturnValue_1) == 0x000068, "Member 'UIW_ComboBox_List_C_SetComboBoxList::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetComboBoxList, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000070, "Member 'UIW_ComboBox_List_C_SetComboBoxList::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetComboBoxList, CallFunc_Greater_IntInt_ReturnValue) == 0x000078, "Member 'UIW_ComboBox_List_C_SetComboBoxList::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetComboBoxList, CallFunc_Min_ReturnValue) == 0x00007C, "Member 'UIW_ComboBox_List_C_SetComboBoxList::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetComboBoxList, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000080, "Member 'UIW_ComboBox_List_C_SetComboBoxList::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetComboBoxList, CallFunc_Add_FloatFloat_ReturnValue) == 0x000084, "Member 'UIW_ComboBox_List_C_SetComboBoxList::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetComboBoxList, Temp_name_Variable) == 0x000088, "Member 'UIW_ComboBox_List_C_SetComboBoxList::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetComboBoxList, Temp_name_Variable_1) == 0x000090, "Member 'UIW_ComboBox_List_C_SetComboBoxList::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetComboBoxList, Temp_bool_Variable) == 0x000098, "Member 'UIW_ComboBox_List_C_SetComboBoxList::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetComboBoxList, K2Node_Select_Default) == 0x00009C, "Member 'UIW_ComboBox_List_C_SetComboBoxList::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetComboBoxList, CallFunc_Array_Add_ReturnValue) == 0x0000A4, "Member 'UIW_ComboBox_List_C_SetComboBoxList::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetComboBoxList, Temp_bool_Variable_1) == 0x0000A8, "Member 'UIW_ComboBox_List_C_SetComboBoxList::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetComboBoxList, K2Node_Select_Default_1) == 0x0000AC, "Member 'UIW_ComboBox_List_C_SetComboBoxList::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetComboBoxList, CallFunc_MakeVector2D_ReturnValue) == 0x0000B0, "Member 'UIW_ComboBox_List_C_SetComboBoxList::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function UIW_ComboBox_List.UIW_ComboBox_List_C.Active
// 0x0010 (0x0010 - 0x0000)
struct UIW_ComboBox_List_C_Active final
{
public:
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ComboBox_List_C_Active) == 0x000008, "Wrong alignment on UIW_ComboBox_List_C_Active");
static_assert(sizeof(UIW_ComboBox_List_C_Active) == 0x000010, "Wrong size on UIW_ComboBox_List_C_Active");
static_assert(offsetof(UIW_ComboBox_List_C_Active, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x000000, "Member 'UIW_ComboBox_List_C_Active::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_Active, CallFunc_GetIndexForItem_ReturnValue) == 0x000008, "Member 'UIW_ComboBox_List_C_Active::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_Active, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00000C, "Member 'UIW_ComboBox_List_C_Active::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

// Function UIW_ComboBox_List.UIW_ComboBox_List_C.OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct UIW_ComboBox_List_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UIW_ComboBox_List_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on UIW_ComboBox_List_C_OnMouseButtonDown");
static_assert(sizeof(UIW_ComboBox_List_C_OnMouseButtonDown) == 0x000218, "Wrong size on UIW_ComboBox_List_C_OnMouseButtonDown");
static_assert(offsetof(UIW_ComboBox_List_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'UIW_ComboBox_List_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'UIW_ComboBox_List_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'UIW_ComboBox_List_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'UIW_ComboBox_List_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UIW_ComboBox_List.UIW_ComboBox_List_C.CompleteTween
// 0x0018 (0x0018 - 0x0000)
struct UIW_ComboBox_List_C_CompleteTween final
{
public:
	class FName                                   CategoryName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ComboBox_List_C_CompleteTween) == 0x000008, "Wrong alignment on UIW_ComboBox_List_C_CompleteTween");
static_assert(sizeof(UIW_ComboBox_List_C_CompleteTween) == 0x000018, "Wrong size on UIW_ComboBox_List_C_CompleteTween");
static_assert(offsetof(UIW_ComboBox_List_C_CompleteTween, CategoryName) == 0x000000, "Member 'UIW_ComboBox_List_C_CompleteTween::CategoryName' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_CompleteTween, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000008, "Member 'UIW_ComboBox_List_C_CompleteTween::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_CompleteTween, CallFunc_GetMainWidget_MainWidget) == 0x000010, "Member 'UIW_ComboBox_List_C_CompleteTween::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");

// Function UIW_ComboBox_List.UIW_ComboBox_List_C.OpenTween
// 0x0018 (0x0018 - 0x0000)
struct UIW_ComboBox_List_C_OpenTween final
{
public:
	struct FTweenEase                             K2Node_MakeStruct_TweenEase;                       // 0x0000(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_1;                     // 0x000C(0x000C)(NoDestructor)
};
static_assert(alignof(UIW_ComboBox_List_C_OpenTween) == 0x000004, "Wrong alignment on UIW_ComboBox_List_C_OpenTween");
static_assert(sizeof(UIW_ComboBox_List_C_OpenTween) == 0x000018, "Wrong size on UIW_ComboBox_List_C_OpenTween");
static_assert(offsetof(UIW_ComboBox_List_C_OpenTween, K2Node_MakeStruct_TweenEase) == 0x000000, "Member 'UIW_ComboBox_List_C_OpenTween::K2Node_MakeStruct_TweenEase' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_OpenTween, K2Node_MakeStruct_TweenEase_1) == 0x00000C, "Member 'UIW_ComboBox_List_C_OpenTween::K2Node_MakeStruct_TweenEase_1' has a wrong offset!");

// Function UIW_ComboBox_List.UIW_ComboBox_List_C.SetPosition
// 0x01A0 (0x01A0 - 0x0000)
struct UIW_ComboBox_List_C_SetPosition final
{
public:
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetViewportWidgetGeometry_ReturnValue;    // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_PixelPosition;            // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_ViewportPosition;         // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetTickSpaceGeometry_ReturnValue;         // 0x0070(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_PixelPosition_1;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_ViewportPosition_1;       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetTickSpaceGeometry_ReturnValue_1;       // 0x00EC(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FGeometry                              CallFunc_GetTickSpaceGeometry_ReturnValue_2;       // 0x0124(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_LocalToViewport_PixelPosition_2;          // 0x015C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_ViewportPosition_2;       // 0x0164(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue_1;               // 0x016C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_3;                        // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_3;                        // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_PixelPosition_3;          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_ViewportPosition_3;       // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ComboBox_List_C_SetPosition) == 0x000008, "Wrong alignment on UIW_ComboBox_List_C_SetPosition");
static_assert(sizeof(UIW_ComboBox_List_C_SetPosition) == 0x0001A0, "Wrong size on UIW_ComboBox_List_C_SetPosition");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_MakeLiteralInt_ReturnValue) == 0x000000, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_GetViewportWidgetGeometry_ReturnValue) == 0x000004, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_GetViewportWidgetGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_GetNumItems_ReturnValue) == 0x00003C, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_GetLocalSize_ReturnValue) == 0x000040, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_GetLocalSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_Multiply_IntInt_ReturnValue) == 0x000048, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_LocalToViewport_PixelPosition) == 0x00004C, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_LocalToViewport_PixelPosition' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_LocalToViewport_ViewportPosition) == 0x000054, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_LocalToViewport_ViewportPosition' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_Min_ReturnValue) == 0x00005C, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_BreakVector2D_X) == 0x000060, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_BreakVector2D_Y) == 0x000064, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000068, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00006C, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_GetTickSpaceGeometry_ReturnValue) == 0x000070, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_GetTickSpaceGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x0000A8, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_LocalToViewport_PixelPosition_1) == 0x0000B0, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_LocalToViewport_PixelPosition_1' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_LocalToViewport_ViewportPosition_1) == 0x0000B8, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_LocalToViewport_ViewportPosition_1' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_GetSize_ReturnValue) == 0x0000C0, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_BreakVector2D_X_1) == 0x0000C8, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_BreakVector2D_Y_1) == 0x0000CC, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_BreakVector2D_X_2) == 0x0000D0, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_BreakVector2D_Y_2) == 0x0000D4, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000D8, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_Multiply_IntFloat_ReturnValue) == 0x0000DC, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000E0, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_MakeVector2D_ReturnValue) == 0x0000E4, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_GetTickSpaceGeometry_ReturnValue_1) == 0x0000EC, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_GetTickSpaceGeometry_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_GetTickSpaceGeometry_ReturnValue_2) == 0x000124, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_GetTickSpaceGeometry_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_LocalToViewport_PixelPosition_2) == 0x00015C, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_LocalToViewport_PixelPosition_2' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_LocalToViewport_ViewportPosition_2) == 0x000164, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_LocalToViewport_ViewportPosition_2' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_GetLocalSize_ReturnValue_1) == 0x00016C, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_GetLocalSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_BreakVector2D_X_3) == 0x000174, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_BreakVector2D_X_3' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_BreakVector2D_Y_3) == 0x000178, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_BreakVector2D_Y_3' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000180, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_MakeVector2D_ReturnValue_1) == 0x000188, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_LocalToViewport_PixelPosition_3) == 0x000190, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_LocalToViewport_PixelPosition_3' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_SetPosition, CallFunc_LocalToViewport_ViewportPosition_3) == 0x000198, "Member 'UIW_ComboBox_List_C_SetPosition::CallFunc_LocalToViewport_ViewportPosition_3' has a wrong offset!");

// Function UIW_ComboBox_List.UIW_ComboBox_List_C.RequestCloseWindow
// 0x0018 (0x0018 - 0x0000)
struct UIW_ComboBox_List_C_RequestCloseWindow final
{
public:
	struct FTweenEase                             K2Node_MakeStruct_TweenEase;                       // 0x0000(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_1;                     // 0x000C(0x000C)(NoDestructor)
};
static_assert(alignof(UIW_ComboBox_List_C_RequestCloseWindow) == 0x000004, "Wrong alignment on UIW_ComboBox_List_C_RequestCloseWindow");
static_assert(sizeof(UIW_ComboBox_List_C_RequestCloseWindow) == 0x000018, "Wrong size on UIW_ComboBox_List_C_RequestCloseWindow");
static_assert(offsetof(UIW_ComboBox_List_C_RequestCloseWindow, K2Node_MakeStruct_TweenEase) == 0x000000, "Member 'UIW_ComboBox_List_C_RequestCloseWindow::K2Node_MakeStruct_TweenEase' has a wrong offset!");
static_assert(offsetof(UIW_ComboBox_List_C_RequestCloseWindow, K2Node_MakeStruct_TweenEase_1) == 0x00000C, "Member 'UIW_ComboBox_List_C_RequestCloseWindow::K2Node_MakeStruct_TweenEase_1' has a wrong offset!");

}

