#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HotelArena

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK::Params
{

// Function UIW_HotelArena.UIW_HotelArena_C.ExecuteUbergraph_UIW_HotelArena
// 0x0090 (0x0090 - 0x0000)
struct UIW_HotelArena_C_ExecuteUbergraph_UIW_HotelArena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ELEquipSlotType EquipSlot, class ULItem* OldItem, class ULItem* NewItem)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsAnimationPlayingForward_ReturnValue;    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0018(0x0018)()
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FLEquipItemSlot& EquipSlot)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	struct FLEquipItemSlot                        CallFunc_GetChosenWeaponItem_ReturnValue;          // 0x0050(0x0018)(NoDestructor)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue_1;         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x0078(0x0018)()
};
static_assert(alignof(UIW_HotelArena_C_ExecuteUbergraph_UIW_HotelArena) == 0x000008, "Wrong alignment on UIW_HotelArena_C_ExecuteUbergraph_UIW_HotelArena");
static_assert(sizeof(UIW_HotelArena_C_ExecuteUbergraph_UIW_HotelArena) == 0x000090, "Wrong size on UIW_HotelArena_C_ExecuteUbergraph_UIW_HotelArena");
static_assert(offsetof(UIW_HotelArena_C_ExecuteUbergraph_UIW_HotelArena, EntryPoint) == 0x000000, "Member 'UIW_HotelArena_C_ExecuteUbergraph_UIW_HotelArena::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_ExecuteUbergraph_UIW_HotelArena, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UIW_HotelArena_C_ExecuteUbergraph_UIW_HotelArena::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_ExecuteUbergraph_UIW_HotelArena, CallFunc_IsAnimationPlayingForward_ReturnValue) == 0x000014, "Member 'UIW_HotelArena_C_ExecuteUbergraph_UIW_HotelArena::CallFunc_IsAnimationPlayingForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_ExecuteUbergraph_UIW_HotelArena, CallFunc_GetGameStrWithName_ReturnValue) == 0x000018, "Member 'UIW_HotelArena_C_ExecuteUbergraph_UIW_HotelArena::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_ExecuteUbergraph_UIW_HotelArena, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'UIW_HotelArena_C_ExecuteUbergraph_UIW_HotelArena::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_ExecuteUbergraph_UIW_HotelArena, CallFunc_GetPlayerEquipment_ReturnValue) == 0x000038, "Member 'UIW_HotelArena_C_ExecuteUbergraph_UIW_HotelArena::CallFunc_GetPlayerEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_ExecuteUbergraph_UIW_HotelArena, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'UIW_HotelArena_C_ExecuteUbergraph_UIW_HotelArena::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_ExecuteUbergraph_UIW_HotelArena, CallFunc_GetChosenWeaponItem_ReturnValue) == 0x000050, "Member 'UIW_HotelArena_C_ExecuteUbergraph_UIW_HotelArena::CallFunc_GetChosenWeaponItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_ExecuteUbergraph_UIW_HotelArena, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000068, "Member 'UIW_HotelArena_C_ExecuteUbergraph_UIW_HotelArena::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_ExecuteUbergraph_UIW_HotelArena, CallFunc_GetPlayerEquipment_ReturnValue_1) == 0x000070, "Member 'UIW_HotelArena_C_ExecuteUbergraph_UIW_HotelArena::CallFunc_GetPlayerEquipment_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_ExecuteUbergraph_UIW_HotelArena, CallFunc_GetGameStrWithName_ReturnValue_1) == 0x000078, "Member 'UIW_HotelArena_C_ExecuteUbergraph_UIW_HotelArena::CallFunc_GetGameStrWithName_ReturnValue_1' has a wrong offset!");

// Function UIW_HotelArena.UIW_HotelArena_C.ShowAndHide
// 0x0018 (0x0018 - 0x0000)
struct UIW_HotelArena_C_ShowAndHide final
{
public:
	bool                                          ShowOrHide;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HotelArena_C_ShowAndHide) == 0x000008, "Wrong alignment on UIW_HotelArena_C_ShowAndHide");
static_assert(sizeof(UIW_HotelArena_C_ShowAndHide) == 0x000018, "Wrong size on UIW_HotelArena_C_ShowAndHide");
static_assert(offsetof(UIW_HotelArena_C_ShowAndHide, ShowOrHide) == 0x000000, "Member 'UIW_HotelArena_C_ShowAndHide::ShowOrHide' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_ShowAndHide, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'UIW_HotelArena_C_ShowAndHide::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_ShowAndHide, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'UIW_HotelArena_C_ShowAndHide::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function UIW_HotelArena.UIW_HotelArena_C.OnChangeEquipItem
// 0x0288 (0x0288 - 0x0000)
struct UIW_HotelArena_C_OnChangeEquipItem final
{
public:
	ELEquipSlotType                               EquipSlot;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 OldItem;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 NewItem;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemCommonInfoPtr                     LocalHandleCommonInfo;                             // 0x0018(0x0008)(Edit, BlueprintVisible, NoDestructor)
	struct FItemCommonInfoPtr                     LocalBladeCommonInfo;                              // 0x0020(0x0008)(Edit, BlueprintVisible, NoDestructor)
	class UTexture2D*                             LocalTexture2D;                                    // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemHandleInfoPtr                     LocalHandleInfo;                                   // 0x0030(0x0008)(Edit, BlueprintVisible, NoDestructor)
	struct FItemBladeInfoPtr                      LocalBladeInfo;                                    // 0x0038(0x0008)(Edit, BlueprintVisible, NoDestructor)
	class ULWeaponItem*                           LocalWeapon;                                       // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULWeaponItem*                           K2Node_DynamicCast_AsLWeapon_Item;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetWeaponByname_ItemName;                 // 0x0068(0x0018)()
	struct FLEquipItemSlot                        CallFunc_GetChosenWeaponItem_ReturnValue;          // 0x0080(0x0018)(NoDestructor)
	struct FItemHandleInfoPtr                     CallFunc_GetHandleInfo_ReturnValue;                // 0x0098(0x0008)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemBladeInfoPtr                      CallFunc_GetBladeInfo_ReturnValue;                 // 0x00A8(0x0008)(NoDestructor)
	struct FItemCommonInfoPtr                     CallFunc_GetHandleCommonInfo_ReturnValue;          // 0x00B0(0x0008)(NoDestructor)
	struct FItemCommonInfoPtr                     CallFunc_GetBladeCommonInfo_ReturnValue;           // 0x00B8(0x0008)(NoDestructor)
	TArray<ELFirstStat>                           K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm)
	TArray<ELFirstStat>                           K2Node_MakeArray_Array_1;                          // 0x00D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x00E0(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x00F8(0x0018)()
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue;                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHaveThrustMotion_ReturnValue;          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPhysicalSubtypeWithThrustMod_ReturnValue; // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0128(0x0018)(ConstParm)
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_1;                // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_2;         // 0x0148(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_3;         // 0x0160(0x0018)()
	class FName                                   CallFunc_GetFrenzySkillCodeName_ReturnValue;       // 0x0178(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetFrenzySkillCodeName_ReturnValue_1;     // 0x0180(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_4;         // 0x0188(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_5;         // 0x01A0(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_6;         // 0x01B8(0x0018)()
	int32                                         CallFunc_GetHandleCorrectionGrade_OutStackLevel;   // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELHandleCorrectResultGrade                    CallFunc_GetHandleCorrectionGrade_ReturnValue;     // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetHandleCorrectionGrade_OutStackLevel_1; // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELHandleCorrectResultGrade                    CallFunc_GetHandleCorrectionGrade_ReturnValue_1;   // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetHandleCorrectionGrade_OutStackLevel_2; // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELHandleCorrectResultGrade                    CallFunc_GetHandleCorrectionGrade_ReturnValue_2;   // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetHandleCorrectionGrade_OutStackLevel_3; // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELHandleCorrectResultGrade                    CallFunc_GetHandleCorrectionGrade_ReturnValue_3;   // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1ED[0x3];                                      // 0x01ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetHandleCorrectionGrade_OutStackLevel_4; // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELHandleCorrectResultGrade                    CallFunc_GetHandleCorrectionGrade_ReturnValue_4;   // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetHandleCorrectionGrade_OutStackLevel_5; // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELHandleCorrectResultGrade                    CallFunc_GetHandleCorrectionGrade_ReturnValue_5;   // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ELFirstStat>                           K2Node_MakeArray_Array_2;                          // 0x0200(0x0010)(ReferenceParm)
	TArray<ELFirstStat>                           K2Node_MakeArray_Array_3;                          // 0x0210(0x0010)(ReferenceParm)
	class FText                                   Temp_text_Variable_1;                              // 0x0220(0x0018)(ConstParm)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_7;         // 0x0238(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_8;         // 0x0250(0x0018)()
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_2;                // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHaveSwingMotion_ReturnValue;           // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPhysicalSubtypeWithSwingMod_ReturnValue; // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A[0x6];                                      // 0x027A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_3;                // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HotelArena_C_OnChangeEquipItem) == 0x000008, "Wrong alignment on UIW_HotelArena_C_OnChangeEquipItem");
static_assert(sizeof(UIW_HotelArena_C_OnChangeEquipItem) == 0x000288, "Wrong size on UIW_HotelArena_C_OnChangeEquipItem");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, EquipSlot) == 0x000000, "Member 'UIW_HotelArena_C_OnChangeEquipItem::EquipSlot' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, OldItem) == 0x000008, "Member 'UIW_HotelArena_C_OnChangeEquipItem::OldItem' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, NewItem) == 0x000010, "Member 'UIW_HotelArena_C_OnChangeEquipItem::NewItem' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, LocalHandleCommonInfo) == 0x000018, "Member 'UIW_HotelArena_C_OnChangeEquipItem::LocalHandleCommonInfo' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, LocalBladeCommonInfo) == 0x000020, "Member 'UIW_HotelArena_C_OnChangeEquipItem::LocalBladeCommonInfo' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, LocalTexture2D) == 0x000028, "Member 'UIW_HotelArena_C_OnChangeEquipItem::LocalTexture2D' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, LocalHandleInfo) == 0x000030, "Member 'UIW_HotelArena_C_OnChangeEquipItem::LocalHandleInfo' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, LocalBladeInfo) == 0x000038, "Member 'UIW_HotelArena_C_OnChangeEquipItem::LocalBladeInfo' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, LocalWeapon) == 0x000040, "Member 'UIW_HotelArena_C_OnChangeEquipItem::LocalWeapon' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000048, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, K2Node_DynamicCast_AsLWeapon_Item) == 0x000050, "Member 'UIW_HotelArena_C_OnChangeEquipItem::K2Node_DynamicCast_AsLWeapon_Item' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'UIW_HotelArena_C_OnChangeEquipItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetPlayerEquipment_ReturnValue) == 0x000060, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetPlayerEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetWeaponByname_ItemName) == 0x000068, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetWeaponByname_ItemName' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetChosenWeaponItem_ReturnValue) == 0x000080, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetChosenWeaponItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetHandleInfo_ReturnValue) == 0x000098, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetHandleInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000A1, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetBladeInfo_ReturnValue) == 0x0000A8, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetBladeInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetHandleCommonInfo_ReturnValue) == 0x0000B0, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetHandleCommonInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetBladeCommonInfo_ReturnValue) == 0x0000B8, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetBladeCommonInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, K2Node_MakeArray_Array) == 0x0000C0, "Member 'UIW_HotelArena_C_OnChangeEquipItem::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, K2Node_MakeArray_Array_1) == 0x0000D0, "Member 'UIW_HotelArena_C_OnChangeEquipItem::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetGameStrWithName_ReturnValue) == 0x0000E0, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetGameStrWithName_ReturnValue_1) == 0x0000F8, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetGameStrWithName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_SpawnObject_ReturnValue) == 0x000110, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetHaveThrustMotion_ReturnValue) == 0x000118, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetHaveThrustMotion_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetPhysicalSubtypeWithThrustMod_ReturnValue) == 0x00011C, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetPhysicalSubtypeWithThrustMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_Greater_IntInt_ReturnValue) == 0x000120, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_Less_IntInt_ReturnValue) == 0x000121, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, Temp_text_Variable) == 0x000128, "Member 'UIW_HotelArena_C_OnChangeEquipItem::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_SpawnObject_ReturnValue_1) == 0x000140, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetGameStrWithName_ReturnValue_2) == 0x000148, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetGameStrWithName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetGameStrWithName_ReturnValue_3) == 0x000160, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetGameStrWithName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetFrenzySkillCodeName_ReturnValue) == 0x000178, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetFrenzySkillCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetFrenzySkillCodeName_ReturnValue_1) == 0x000180, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetFrenzySkillCodeName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetGameStrWithName_ReturnValue_4) == 0x000188, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetGameStrWithName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetGameStrWithName_ReturnValue_5) == 0x0001A0, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetGameStrWithName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetGameStrWithName_ReturnValue_6) == 0x0001B8, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetGameStrWithName_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetHandleCorrectionGrade_OutStackLevel) == 0x0001D0, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetHandleCorrectionGrade_OutStackLevel' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetHandleCorrectionGrade_ReturnValue) == 0x0001D4, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetHandleCorrectionGrade_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetHandleCorrectionGrade_OutStackLevel_1) == 0x0001D8, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetHandleCorrectionGrade_OutStackLevel_1' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetHandleCorrectionGrade_ReturnValue_1) == 0x0001DC, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetHandleCorrectionGrade_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetHandleCorrectionGrade_OutStackLevel_2) == 0x0001E0, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetHandleCorrectionGrade_OutStackLevel_2' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetHandleCorrectionGrade_ReturnValue_2) == 0x0001E4, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetHandleCorrectionGrade_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetHandleCorrectionGrade_OutStackLevel_3) == 0x0001E8, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetHandleCorrectionGrade_OutStackLevel_3' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetHandleCorrectionGrade_ReturnValue_3) == 0x0001EC, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetHandleCorrectionGrade_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetHandleCorrectionGrade_OutStackLevel_4) == 0x0001F0, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetHandleCorrectionGrade_OutStackLevel_4' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetHandleCorrectionGrade_ReturnValue_4) == 0x0001F4, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetHandleCorrectionGrade_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetHandleCorrectionGrade_OutStackLevel_5) == 0x0001F8, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetHandleCorrectionGrade_OutStackLevel_5' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetHandleCorrectionGrade_ReturnValue_5) == 0x0001FC, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetHandleCorrectionGrade_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, K2Node_MakeArray_Array_2) == 0x000200, "Member 'UIW_HotelArena_C_OnChangeEquipItem::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, K2Node_MakeArray_Array_3) == 0x000210, "Member 'UIW_HotelArena_C_OnChangeEquipItem::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, Temp_text_Variable_1) == 0x000220, "Member 'UIW_HotelArena_C_OnChangeEquipItem::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetGameStrWithName_ReturnValue_7) == 0x000238, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetGameStrWithName_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetGameStrWithName_ReturnValue_8) == 0x000250, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetGameStrWithName_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_SpawnObject_ReturnValue_2) == 0x000268, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_SpawnObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetHaveSwingMotion_ReturnValue) == 0x000270, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetHaveSwingMotion_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_GetPhysicalSubtypeWithSwingMod_ReturnValue) == 0x000274, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_GetPhysicalSubtypeWithSwingMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000278, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_Less_IntInt_ReturnValue_1) == 0x000279, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_OnChangeEquipItem, CallFunc_SpawnObject_ReturnValue_3) == 0x000280, "Member 'UIW_HotelArena_C_OnChangeEquipItem::CallFunc_SpawnObject_ReturnValue_3' has a wrong offset!");

// Function UIW_HotelArena.UIW_HotelArena_C.OnChooseWeapon
// 0x0018 (0x0018 - 0x0000)
struct UIW_HotelArena_C_OnChooseWeapon final
{
public:
	struct FLEquipItemSlot                        EquipSlot;                                         // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(UIW_HotelArena_C_OnChooseWeapon) == 0x000008, "Wrong alignment on UIW_HotelArena_C_OnChooseWeapon");
static_assert(sizeof(UIW_HotelArena_C_OnChooseWeapon) == 0x000018, "Wrong size on UIW_HotelArena_C_OnChooseWeapon");
static_assert(offsetof(UIW_HotelArena_C_OnChooseWeapon, EquipSlot) == 0x000000, "Member 'UIW_HotelArena_C_OnChooseWeapon::EquipSlot' has a wrong offset!");

// Function UIW_HotelArena.UIW_HotelArena_C.Refresh Frenzy
// 0x00D0 (0x00D0 - 0x0000)
struct UIW_HotelArena_C_Refresh_Frenzy final
{
public:
	class FName                                   FrenzySkillCodeName;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ItemName;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UWidget*                                GroupWidget;                                       // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_SubTitle_C*                        SubTitleFrenzy;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_ListItem_Stat_Normal_C*            FrenzyWidget;                                      // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_LRichKeyTextBlock_C*              Tooltip;                                           // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_OneStat_C*               LocalStatOne;                                      // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSkillInfoPtr                          LocalSkillInfo;                                    // 0x0048(0x0008)(Edit, BlueprintVisible, NoDestructor)
	struct FSkillInfoPtr                          CallFunc_FindSkillInfoByNameBP_ReturnValue;        // 0x0050(0x0008)(NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ELFirstStat>                           K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FText                                   CallFunc_GetLocalTextSkillTooltipLocalize_ReturnValue; // 0x0070(0x0018)()
	int32                                         CallFunc_GetRequireFrenzyUnitCount_ReturnValue;    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0090(0x0018)()
	class FText                                   CallFunc_GetLocalTextSkillNameLocalize_ReturnValue; // 0x00A8(0x0018)()
	class FName                                   Temp_name_Variable;                                // 0x00C0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HotelArena_C_Refresh_Frenzy) == 0x000008, "Wrong alignment on UIW_HotelArena_C_Refresh_Frenzy");
static_assert(sizeof(UIW_HotelArena_C_Refresh_Frenzy) == 0x0000D0, "Wrong size on UIW_HotelArena_C_Refresh_Frenzy");
static_assert(offsetof(UIW_HotelArena_C_Refresh_Frenzy, FrenzySkillCodeName) == 0x000000, "Member 'UIW_HotelArena_C_Refresh_Frenzy::FrenzySkillCodeName' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_Refresh_Frenzy, ItemName) == 0x000008, "Member 'UIW_HotelArena_C_Refresh_Frenzy::ItemName' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_Refresh_Frenzy, GroupWidget) == 0x000020, "Member 'UIW_HotelArena_C_Refresh_Frenzy::GroupWidget' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_Refresh_Frenzy, SubTitleFrenzy) == 0x000028, "Member 'UIW_HotelArena_C_Refresh_Frenzy::SubTitleFrenzy' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_Refresh_Frenzy, FrenzyWidget) == 0x000030, "Member 'UIW_HotelArena_C_Refresh_Frenzy::FrenzyWidget' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_Refresh_Frenzy, Tooltip) == 0x000038, "Member 'UIW_HotelArena_C_Refresh_Frenzy::Tooltip' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_Refresh_Frenzy, LocalStatOne) == 0x000040, "Member 'UIW_HotelArena_C_Refresh_Frenzy::LocalStatOne' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_Refresh_Frenzy, LocalSkillInfo) == 0x000048, "Member 'UIW_HotelArena_C_Refresh_Frenzy::LocalSkillInfo' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_Refresh_Frenzy, CallFunc_FindSkillInfoByNameBP_ReturnValue) == 0x000050, "Member 'UIW_HotelArena_C_Refresh_Frenzy::CallFunc_FindSkillInfoByNameBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_Refresh_Frenzy, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000058, "Member 'UIW_HotelArena_C_Refresh_Frenzy::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_Refresh_Frenzy, CallFunc_IsValid_ReturnValue) == 0x000059, "Member 'UIW_HotelArena_C_Refresh_Frenzy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_Refresh_Frenzy, K2Node_MakeArray_Array) == 0x000060, "Member 'UIW_HotelArena_C_Refresh_Frenzy::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_Refresh_Frenzy, CallFunc_GetLocalTextSkillTooltipLocalize_ReturnValue) == 0x000070, "Member 'UIW_HotelArena_C_Refresh_Frenzy::CallFunc_GetLocalTextSkillTooltipLocalize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_Refresh_Frenzy, CallFunc_GetRequireFrenzyUnitCount_ReturnValue) == 0x000088, "Member 'UIW_HotelArena_C_Refresh_Frenzy::CallFunc_GetRequireFrenzyUnitCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_Refresh_Frenzy, CallFunc_Conv_IntToText_ReturnValue) == 0x000090, "Member 'UIW_HotelArena_C_Refresh_Frenzy::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_Refresh_Frenzy, CallFunc_GetLocalTextSkillNameLocalize_ReturnValue) == 0x0000A8, "Member 'UIW_HotelArena_C_Refresh_Frenzy::CallFunc_GetLocalTextSkillNameLocalize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_Refresh_Frenzy, Temp_name_Variable) == 0x0000C0, "Member 'UIW_HotelArena_C_Refresh_Frenzy::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_Refresh_Frenzy, CallFunc_SpawnObject_ReturnValue) == 0x0000C8, "Member 'UIW_HotelArena_C_Refresh_Frenzy::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function UIW_HotelArena.UIW_HotelArena_C.SetCurrentEquip
// 0x0038 (0x0038 - 0x0000)
struct UIW_HotelArena_C_SetCurrentEquip final
{
public:
	bool                                          IsValid;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLEquipItemSlot                        CallFunc_GetChosenWeaponItem_ReturnValue;          // 0x0018(0x0018)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_HotelArena_C_SetCurrentEquip) == 0x000008, "Wrong alignment on UIW_HotelArena_C_SetCurrentEquip");
static_assert(sizeof(UIW_HotelArena_C_SetCurrentEquip) == 0x000038, "Wrong size on UIW_HotelArena_C_SetCurrentEquip");
static_assert(offsetof(UIW_HotelArena_C_SetCurrentEquip, IsValid) == 0x000000, "Member 'UIW_HotelArena_C_SetCurrentEquip::IsValid' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_SetCurrentEquip, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UIW_HotelArena_C_SetCurrentEquip::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HotelArena_C_SetCurrentEquip, CallFunc_GetPlayerEquipment_ReturnValue) == 0x000010, "Member 'UIW_HotelArena_C_SetCurrentEquip::CallFunc_GetPlayerEquipment_ReturnValue' has a wrong offset!");
