#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HUD_Abnormal_Item

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"


namespace SDK::Params
{

// Function UIW_HUD_Abnormal_Item.UIW_HUD_Abnormal_Item_C.SetData
// 0x0070 (0x0070 - 0x0000)
struct UIW_HUD_Abnormal_Item_C_SetData final
{
public:
	bool                                          IsPassive_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CodeName_0;                                        // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSpecialBuffInfoPtr                    CallFunc_FindSpecialBuffInfoByNameBP_ReturnValue;  // 0x0010(0x0008)(NoDestructor)
	struct FAbnormalStateCommonInfoPtr            CallFunc_FindAbnormalStateCommonInfoByNameBP_ReturnValue; // 0x0018(0x0008)(NoDestructor)
	TSoftObjectPtr<class UObject>                 CallFunc_GetIconResource_ReturnValue;              // 0x0020(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_GetIconResource_ReturnValue_1;            // 0x0048(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HUD_Abnormal_Item_C_SetData) == 0x000008, "Wrong alignment on UIW_HUD_Abnormal_Item_C_SetData");
static_assert(sizeof(UIW_HUD_Abnormal_Item_C_SetData) == 0x000070, "Wrong size on UIW_HUD_Abnormal_Item_C_SetData");
static_assert(offsetof(UIW_HUD_Abnormal_Item_C_SetData, IsPassive_0) == 0x000000, "Member 'UIW_HUD_Abnormal_Item_C_SetData::IsPassive_0' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Abnormal_Item_C_SetData, CodeName_0) == 0x000004, "Member 'UIW_HUD_Abnormal_Item_C_SetData::CodeName_0' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Abnormal_Item_C_SetData, CallFunc_FindSpecialBuffInfoByNameBP_ReturnValue) == 0x000010, "Member 'UIW_HUD_Abnormal_Item_C_SetData::CallFunc_FindSpecialBuffInfoByNameBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Abnormal_Item_C_SetData, CallFunc_FindAbnormalStateCommonInfoByNameBP_ReturnValue) == 0x000018, "Member 'UIW_HUD_Abnormal_Item_C_SetData::CallFunc_FindAbnormalStateCommonInfoByNameBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Abnormal_Item_C_SetData, CallFunc_GetIconResource_ReturnValue) == 0x000020, "Member 'UIW_HUD_Abnormal_Item_C_SetData::CallFunc_GetIconResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Abnormal_Item_C_SetData, CallFunc_GetIconResource_ReturnValue_1) == 0x000048, "Member 'UIW_HUD_Abnormal_Item_C_SetData::CallFunc_GetIconResource_ReturnValue_1' has a wrong offset!");

}

