#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Weapon_Equip

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function UIW_Weapon_Equip.UIW_Weapon_Equip_C.ExecuteUbergraph_UIW_Weapon_Equip
// 0x01C8 (0x01C8 - 0x0000)
struct UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_1;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULWeaponItem*                           K2Node_ComponentBoundEvent_LWeaponItem_4;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULWeaponItem*                           K2Node_ComponentBoundEvent_LWeaponItem_3;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0048(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x0060(0x0018)()
	class ULWeaponItem*                           K2Node_ComponentBoundEvent_LWeaponItem_2;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULWeaponItem*                           K2Node_ComponentBoundEvent_LWeaponItem_1;          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULWeaponItem*                           K2Node_ComponentBoundEvent_LWeaponItem;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00B0(0x0028)()
	bool                                          CallFunc_EquipItem_ReturnValue;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x00E0(0x0028)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_2;         // 0x0108(0x0018)()
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0128(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0150(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0178(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x01A0(0x0028)()
};
static_assert(alignof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip) == 0x000008, "Wrong alignment on UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip");
static_assert(sizeof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip) == 0x0001C8, "Wrong size on UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip");
static_assert(offsetof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip, EntryPoint) == 0x000000, "Member 'UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip, K2Node_ComponentBoundEvent_BtnKey_1) == 0x000008, "Member 'UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip::K2Node_ComponentBoundEvent_BtnKey_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip, K2Node_ComponentBoundEvent_BtnKey) == 0x000010, "Member 'UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip::K2Node_ComponentBoundEvent_BtnKey' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip, K2Node_ComponentBoundEvent_LWeaponItem_4) == 0x000018, "Member 'UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip::K2Node_ComponentBoundEvent_LWeaponItem_4' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip, K2Node_MakeArray_Array) == 0x000020, "Member 'UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip, K2Node_ComponentBoundEvent_LWeaponItem_3) == 0x000038, "Member 'UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip::K2Node_ComponentBoundEvent_LWeaponItem_3' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip, CallFunc_GetGameStrWithName_ReturnValue) == 0x000048, "Member 'UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip, CallFunc_GetGameStrWithName_ReturnValue_1) == 0x000060, "Member 'UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip::CallFunc_GetGameStrWithName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip, K2Node_ComponentBoundEvent_LWeaponItem_2) == 0x000078, "Member 'UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip::K2Node_ComponentBoundEvent_LWeaponItem_2' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip, K2Node_ComponentBoundEvent_LWeaponItem_1) == 0x000080, "Member 'UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip::K2Node_ComponentBoundEvent_LWeaponItem_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000088, "Member 'UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000089, "Member 'UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip, K2Node_ComponentBoundEvent_LWeaponItem) == 0x000090, "Member 'UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip::K2Node_ComponentBoundEvent_LWeaponItem' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip, CallFunc_IsValid_ReturnValue_2) == 0x000098, "Member 'UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000A0, "Member 'UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip, CallFunc_GetPlayerEquipment_ReturnValue) == 0x0000A8, "Member 'UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip::CallFunc_GetPlayerEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip, K2Node_MakeStruct_SlateColor) == 0x0000B0, "Member 'UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip, CallFunc_EquipItem_ReturnValue) == 0x0000D8, "Member 'UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip::CallFunc_EquipItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip, K2Node_MakeStruct_SlateColor_1) == 0x0000E0, "Member 'UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip, CallFunc_GetGameStrWithName_ReturnValue_2) == 0x000108, "Member 'UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip::CallFunc_GetGameStrWithName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip, CallFunc_NotEqual_ByteByte_ReturnValue_2) == 0x000120, "Member 'UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip::CallFunc_NotEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip, K2Node_MakeStruct_SlateColor_2) == 0x000128, "Member 'UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip, K2Node_MakeStruct_SlateColor_3) == 0x000150, "Member 'UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip, K2Node_MakeStruct_SlateColor_4) == 0x000178, "Member 'UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip, K2Node_MakeStruct_SlateColor_5) == 0x0001A0, "Member 'UIW_Weapon_Equip_C_ExecuteUbergraph_UIW_Weapon_Equip::K2Node_MakeStruct_SlateColor_5' has a wrong offset!");

// Function UIW_Weapon_Equip.UIW_Weapon_Equip_C.BndEvt__UIW_Weapon_Equip_Slot_Weapon_3_K2Node_ComponentBoundEvent_6_OnSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_3_K2Node_ComponentBoundEvent_6_OnSelected__DelegateSignature final
{
public:
	class ULWeaponItem*                           LWeaponItem;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_3_K2Node_ComponentBoundEvent_6_OnSelected__DelegateSignature) == 0x000008, "Wrong alignment on UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_3_K2Node_ComponentBoundEvent_6_OnSelected__DelegateSignature");
static_assert(sizeof(UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_3_K2Node_ComponentBoundEvent_6_OnSelected__DelegateSignature) == 0x000008, "Wrong size on UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_3_K2Node_ComponentBoundEvent_6_OnSelected__DelegateSignature");
static_assert(offsetof(UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_3_K2Node_ComponentBoundEvent_6_OnSelected__DelegateSignature, LWeaponItem) == 0x000000, "Member 'UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_3_K2Node_ComponentBoundEvent_6_OnSelected__DelegateSignature::LWeaponItem' has a wrong offset!");

// Function UIW_Weapon_Equip.UIW_Weapon_Equip_C.BndEvt__UIW_Weapon_Equip_Slot_Weapon_2_K2Node_ComponentBoundEvent_5_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_2_K2Node_ComponentBoundEvent_5_OnActive__DelegateSignature final
{
public:
	class ULWeaponItem*                           LWeaponItem;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_2_K2Node_ComponentBoundEvent_5_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_2_K2Node_ComponentBoundEvent_5_OnActive__DelegateSignature");
static_assert(sizeof(UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_2_K2Node_ComponentBoundEvent_5_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_2_K2Node_ComponentBoundEvent_5_OnActive__DelegateSignature");
static_assert(offsetof(UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_2_K2Node_ComponentBoundEvent_5_OnActive__DelegateSignature, LWeaponItem) == 0x000000, "Member 'UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_2_K2Node_ComponentBoundEvent_5_OnActive__DelegateSignature::LWeaponItem' has a wrong offset!");

// Function UIW_Weapon_Equip.UIW_Weapon_Equip_C.BndEvt__UIW_Weapon_Equip_Slot_Weapon_1_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_1_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature final
{
public:
	class ULWeaponItem*                           LWeaponItem;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_1_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_1_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature");
static_assert(sizeof(UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_1_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_1_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature");
static_assert(offsetof(UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_1_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature, LWeaponItem) == 0x000000, "Member 'UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_1_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature::LWeaponItem' has a wrong offset!");

// Function UIW_Weapon_Equip.UIW_Weapon_Equip_C.BndEvt__UIW_Weapon_Equip_Slot_Weapon_2_K2Node_ComponentBoundEvent_3_OnSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_2_K2Node_ComponentBoundEvent_3_OnSelected__DelegateSignature final
{
public:
	class ULWeaponItem*                           LWeaponItem;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_2_K2Node_ComponentBoundEvent_3_OnSelected__DelegateSignature) == 0x000008, "Wrong alignment on UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_2_K2Node_ComponentBoundEvent_3_OnSelected__DelegateSignature");
static_assert(sizeof(UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_2_K2Node_ComponentBoundEvent_3_OnSelected__DelegateSignature) == 0x000008, "Wrong size on UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_2_K2Node_ComponentBoundEvent_3_OnSelected__DelegateSignature");
static_assert(offsetof(UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_2_K2Node_ComponentBoundEvent_3_OnSelected__DelegateSignature, LWeaponItem) == 0x000000, "Member 'UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_2_K2Node_ComponentBoundEvent_3_OnSelected__DelegateSignature::LWeaponItem' has a wrong offset!");

// Function UIW_Weapon_Equip.UIW_Weapon_Equip_C.BndEvt__UIW_Weapon_Equip_Slot_Weapon_1_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_1_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature final
{
public:
	class ULWeaponItem*                           LWeaponItem;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_1_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature) == 0x000008, "Wrong alignment on UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_1_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature");
static_assert(sizeof(UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_1_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature) == 0x000008, "Wrong size on UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_1_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature");
static_assert(offsetof(UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_1_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature, LWeaponItem) == 0x000000, "Member 'UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Slot_Weapon_1_K2Node_ComponentBoundEvent_2_OnSelected__DelegateSignature::LWeaponItem' has a wrong offset!");

// Function UIW_Weapon_Equip.UIW_Weapon_Equip_C.BndEvt__UIW_Weapon_Equip_Btn_Close_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Btn_Close_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Btn_Close_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Btn_Close_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature");
static_assert(sizeof(UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Btn_Close_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Btn_Close_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature");
static_assert(offsetof(UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Btn_Close_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Btn_Close_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_Weapon_Equip.UIW_Weapon_Equip_C.BndEvt__UIW_Weapon_Equip_Btn_Equipment_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Btn_Equipment_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Btn_Equipment_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Btn_Equipment_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature");
static_assert(sizeof(UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Btn_Equipment_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Btn_Equipment_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature");
static_assert(offsetof(UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Btn_Equipment_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_Weapon_Equip_C_BndEvt__UIW_Weapon_Equip_Btn_Equipment_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_Weapon_Equip.UIW_Weapon_Equip_C.OnReady
// 0x0110 (0x0110 - 0x0000)
struct UIW_Weapon_Equip_C_OnReady final
{
public:
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEquipItemSlot_bFound;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLEquipItemSlot                        CallFunc_GetEquipItemSlot_ReturnValue;             // 0x0020(0x0018)(NoDestructor)
	class ULItem*                                 CallFunc_GetEquipItem_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULWeaponItem*                           K2Node_DynamicCast_AsLWeapon_Item;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULWeaponItem*                           K2Node_DynamicCast_AsLWeapon_Item_1;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 CallFunc_GetEquipItem_ReturnValue_1;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULWeaponItem*                           K2Node_DynamicCast_AsLWeapon_Item_2;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_Weapon_C*                CallFunc_SpawnObject_ReturnValue;                  // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_Weapon_C*                CallFunc_SpawnObject_ReturnValue_1;                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0098(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x00A0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_Weapon_C*                CallFunc_SpawnObject_ReturnValue_2;                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x00B0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_Weapon_C*                CallFunc_SpawnObject_ReturnValue_3;                // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_Weapon_C*                CallFunc_SpawnObject_ReturnValue_4;                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_Weapon_C*                CallFunc_SpawnObject_ReturnValue_5;                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_4;                              // 0x00D0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_5;                              // 0x00D8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x00E0(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x00F8(0x0018)()
};
static_assert(alignof(UIW_Weapon_Equip_C_OnReady) == 0x000008, "Wrong alignment on UIW_Weapon_Equip_C_OnReady");
static_assert(sizeof(UIW_Weapon_Equip_C_OnReady) == 0x000110, "Wrong size on UIW_Weapon_Equip_C_OnReady");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'UIW_Weapon_Equip_C_OnReady::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, Temp_name_Variable) == 0x000008, "Member 'UIW_Weapon_Equip_C_OnReady::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, CallFunc_GetPlayerEquipment_ReturnValue) == 0x000010, "Member 'UIW_Weapon_Equip_C_OnReady::CallFunc_GetPlayerEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, CallFunc_GetEquipItemSlot_bFound) == 0x000018, "Member 'UIW_Weapon_Equip_C_OnReady::CallFunc_GetEquipItemSlot_bFound' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, CallFunc_GetEquipItemSlot_ReturnValue) == 0x000020, "Member 'UIW_Weapon_Equip_C_OnReady::CallFunc_GetEquipItemSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, CallFunc_GetEquipItem_ReturnValue) == 0x000038, "Member 'UIW_Weapon_Equip_C_OnReady::CallFunc_GetEquipItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'UIW_Weapon_Equip_C_OnReady::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, K2Node_DynamicCast_AsLWeapon_Item) == 0x000048, "Member 'UIW_Weapon_Equip_C_OnReady::K2Node_DynamicCast_AsLWeapon_Item' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'UIW_Weapon_Equip_C_OnReady::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, CallFunc_IsValid_ReturnValue_1) == 0x000051, "Member 'UIW_Weapon_Equip_C_OnReady::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, K2Node_DynamicCast_AsLWeapon_Item_1) == 0x000058, "Member 'UIW_Weapon_Equip_C_OnReady::K2Node_DynamicCast_AsLWeapon_Item_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'UIW_Weapon_Equip_C_OnReady::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, CallFunc_GetEquipItem_ReturnValue_1) == 0x000068, "Member 'UIW_Weapon_Equip_C_OnReady::CallFunc_GetEquipItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, CallFunc_IsValid_ReturnValue_2) == 0x000070, "Member 'UIW_Weapon_Equip_C_OnReady::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, K2Node_DynamicCast_AsLWeapon_Item_2) == 0x000078, "Member 'UIW_Weapon_Equip_C_OnReady::K2Node_DynamicCast_AsLWeapon_Item_2' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, K2Node_DynamicCast_bSuccess_2) == 0x000080, "Member 'UIW_Weapon_Equip_C_OnReady::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, CallFunc_SpawnObject_ReturnValue) == 0x000088, "Member 'UIW_Weapon_Equip_C_OnReady::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, CallFunc_SpawnObject_ReturnValue_1) == 0x000090, "Member 'UIW_Weapon_Equip_C_OnReady::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, Temp_name_Variable_1) == 0x000098, "Member 'UIW_Weapon_Equip_C_OnReady::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, Temp_name_Variable_2) == 0x0000A0, "Member 'UIW_Weapon_Equip_C_OnReady::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, CallFunc_SpawnObject_ReturnValue_2) == 0x0000A8, "Member 'UIW_Weapon_Equip_C_OnReady::CallFunc_SpawnObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, Temp_name_Variable_3) == 0x0000B0, "Member 'UIW_Weapon_Equip_C_OnReady::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, CallFunc_SpawnObject_ReturnValue_3) == 0x0000B8, "Member 'UIW_Weapon_Equip_C_OnReady::CallFunc_SpawnObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, CallFunc_SpawnObject_ReturnValue_4) == 0x0000C0, "Member 'UIW_Weapon_Equip_C_OnReady::CallFunc_SpawnObject_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, CallFunc_SpawnObject_ReturnValue_5) == 0x0000C8, "Member 'UIW_Weapon_Equip_C_OnReady::CallFunc_SpawnObject_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, Temp_name_Variable_4) == 0x0000D0, "Member 'UIW_Weapon_Equip_C_OnReady::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, Temp_name_Variable_5) == 0x0000D8, "Member 'UIW_Weapon_Equip_C_OnReady::Temp_name_Variable_5' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, CallFunc_GetGameStrWithName_ReturnValue) == 0x0000E0, "Member 'UIW_Weapon_Equip_C_OnReady::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_OnReady, CallFunc_GetGameStrWithName_ReturnValue_1) == 0x0000F8, "Member 'UIW_Weapon_Equip_C_OnReady::CallFunc_GetGameStrWithName_ReturnValue_1' has a wrong offset!");

// Function UIW_Weapon_Equip.UIW_Weapon_Equip_C.SetData
// 0x0020 (0x0020 - 0x0000)
struct UIW_Weapon_Equip_C_SetData final
{
public:
	class ULItem*                                 LItem;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULWeaponItem*                           K2Node_DynamicCast_AsLWeapon_Item;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_Weapon_C*                CallFunc_SpawnObject_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Weapon_Equip_C_SetData) == 0x000008, "Wrong alignment on UIW_Weapon_Equip_C_SetData");
static_assert(sizeof(UIW_Weapon_Equip_C_SetData) == 0x000020, "Wrong size on UIW_Weapon_Equip_C_SetData");
static_assert(offsetof(UIW_Weapon_Equip_C_SetData, LItem) == 0x000000, "Member 'UIW_Weapon_Equip_C_SetData::LItem' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_SetData, K2Node_DynamicCast_AsLWeapon_Item) == 0x000008, "Member 'UIW_Weapon_Equip_C_SetData::K2Node_DynamicCast_AsLWeapon_Item' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_SetData, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'UIW_Weapon_Equip_C_SetData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_SetData, CallFunc_SpawnObject_ReturnValue) == 0x000018, "Member 'UIW_Weapon_Equip_C_SetData::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");

// Function UIW_Weapon_Equip.UIW_Weapon_Equip_C.FocusManage
// 0x02D8 (0x02D8 - 0x0000)
struct UIW_Weapon_Equip_C_FocusManage final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_FocusManage_ReturnValue;                  // 0x0160(0x00B8)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0220(0x00B8)()
};
static_assert(alignof(UIW_Weapon_Equip_C_FocusManage) == 0x000008, "Wrong alignment on UIW_Weapon_Equip_C_FocusManage");
static_assert(sizeof(UIW_Weapon_Equip_C_FocusManage) == 0x0002D8, "Wrong size on UIW_Weapon_Equip_C_FocusManage");
static_assert(offsetof(UIW_Weapon_Equip_C_FocusManage, MyGeometry) == 0x000000, "Member 'UIW_Weapon_Equip_C_FocusManage::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_FocusManage, MouseEvent) == 0x000038, "Member 'UIW_Weapon_Equip_C_FocusManage::MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_FocusManage, ReturnValue) == 0x0000A8, "Member 'UIW_Weapon_Equip_C_FocusManage::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Equip_C_FocusManage, CallFunc_FocusManage_ReturnValue) == 0x000160, "Member 'UIW_Weapon_Equip_C_FocusManage::CallFunc_FocusManage_ReturnValue' has a wrong offset!");
