#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Fx_Btn_Bg_Left

#include "Basic.hpp"


namespace SDK::Params
{

// Function UIW_Fx_Btn_Bg_Left.UIW_Fx_Btn_Bg_Left_C.ExecuteUbergraph_UIW_Fx_Btn_Bg_Left
// 0x0008 (0x0008 - 0x0000)
struct UIW_Fx_Btn_Bg_Left_C_ExecuteUbergraph_UIW_Fx_Btn_Bg_Left final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Fx_Btn_Bg_Left_C_ExecuteUbergraph_UIW_Fx_Btn_Bg_Left) == 0x000004, "Wrong alignment on UIW_Fx_Btn_Bg_Left_C_ExecuteUbergraph_UIW_Fx_Btn_Bg_Left");
static_assert(sizeof(UIW_Fx_Btn_Bg_Left_C_ExecuteUbergraph_UIW_Fx_Btn_Bg_Left) == 0x000008, "Wrong size on UIW_Fx_Btn_Bg_Left_C_ExecuteUbergraph_UIW_Fx_Btn_Bg_Left");
static_assert(offsetof(UIW_Fx_Btn_Bg_Left_C_ExecuteUbergraph_UIW_Fx_Btn_Bg_Left, EntryPoint) == 0x000000, "Member 'UIW_Fx_Btn_Bg_Left_C_ExecuteUbergraph_UIW_Fx_Btn_Bg_Left::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_Fx_Btn_Bg_Left_C_ExecuteUbergraph_UIW_Fx_Btn_Bg_Left, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UIW_Fx_Btn_Bg_Left_C_ExecuteUbergraph_UIW_Fx_Btn_Bg_Left::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function UIW_Fx_Btn_Bg_Left.UIW_Fx_Btn_Bg_Left_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UIW_Fx_Btn_Bg_Left_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Fx_Btn_Bg_Left_C_PreConstruct) == 0x000001, "Wrong alignment on UIW_Fx_Btn_Bg_Left_C_PreConstruct");
static_assert(sizeof(UIW_Fx_Btn_Bg_Left_C_PreConstruct) == 0x000001, "Wrong size on UIW_Fx_Btn_Bg_Left_C_PreConstruct");
static_assert(offsetof(UIW_Fx_Btn_Bg_Left_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UIW_Fx_Btn_Bg_Left_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

