#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ListItem_WeaponParts

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UIW_ListItem_WeaponParts.UIW_ListItem_WeaponParts_C.ExecuteUbergraph_UIW_ListItem_WeaponParts
// 0x0068 (0x0068 - 0x0000)
struct UIW_ListItem_WeaponParts_C_ExecuteUbergraph_UIW_ListItem_WeaponParts final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItem;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetReinforceLevel_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_CombineItem_C*           K2Node_DynamicCast_AsUIBP_List_Data_Combine_Item;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0048(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_WeaponParts_C_ExecuteUbergraph_UIW_ListItem_WeaponParts) == 0x000008, "Wrong alignment on UIW_ListItem_WeaponParts_C_ExecuteUbergraph_UIW_ListItem_WeaponParts");
static_assert(sizeof(UIW_ListItem_WeaponParts_C_ExecuteUbergraph_UIW_ListItem_WeaponParts) == 0x000068, "Wrong size on UIW_ListItem_WeaponParts_C_ExecuteUbergraph_UIW_ListItem_WeaponParts");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_ExecuteUbergraph_UIW_ListItem_WeaponParts, EntryPoint) == 0x000000, "Member 'UIW_ListItem_WeaponParts_C_ExecuteUbergraph_UIW_ListItem_WeaponParts::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_ExecuteUbergraph_UIW_ListItem_WeaponParts, K2Node_Event_ListItem) == 0x000008, "Member 'UIW_ListItem_WeaponParts_C_ExecuteUbergraph_UIW_ListItem_WeaponParts::K2Node_Event_ListItem' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_ExecuteUbergraph_UIW_ListItem_WeaponParts, CallFunc_GetReinforceLevel_ReturnValue) == 0x000010, "Member 'UIW_ListItem_WeaponParts_C_ExecuteUbergraph_UIW_ListItem_WeaponParts::CallFunc_GetReinforceLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_ExecuteUbergraph_UIW_ListItem_WeaponParts, K2Node_DynamicCast_AsUIBP_List_Data_Combine_Item) == 0x000018, "Member 'UIW_ListItem_WeaponParts_C_ExecuteUbergraph_UIW_ListItem_WeaponParts::K2Node_DynamicCast_AsUIBP_List_Data_Combine_Item' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_ExecuteUbergraph_UIW_ListItem_WeaponParts, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'UIW_ListItem_WeaponParts_C_ExecuteUbergraph_UIW_ListItem_WeaponParts::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_ExecuteUbergraph_UIW_ListItem_WeaponParts, CallFunc_Conv_IntToString_ReturnValue) == 0x000028, "Member 'UIW_ListItem_WeaponParts_C_ExecuteUbergraph_UIW_ListItem_WeaponParts::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_ExecuteUbergraph_UIW_ListItem_WeaponParts, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'UIW_ListItem_WeaponParts_C_ExecuteUbergraph_UIW_ListItem_WeaponParts::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_ExecuteUbergraph_UIW_ListItem_WeaponParts, CallFunc_Conv_StringToText_ReturnValue) == 0x000048, "Member 'UIW_ListItem_WeaponParts_C_ExecuteUbergraph_UIW_ListItem_WeaponParts::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_ExecuteUbergraph_UIW_ListItem_WeaponParts, CallFunc_Greater_IntInt_ReturnValue) == 0x000060, "Member 'UIW_ListItem_WeaponParts_C_ExecuteUbergraph_UIW_ListItem_WeaponParts::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_ExecuteUbergraph_UIW_ListItem_WeaponParts, CallFunc_IsValid_ReturnValue) == 0x000061, "Member 'UIW_ListItem_WeaponParts_C_ExecuteUbergraph_UIW_ListItem_WeaponParts::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UIW_ListItem_WeaponParts.UIW_ListItem_WeaponParts_C.Set Item
// 0x0008 (0x0008 - 0x0000)
struct UIW_ListItem_WeaponParts_C_Set_Item final
{
public:
	class UObject*                                ListItem;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ListItem_WeaponParts_C_Set_Item) == 0x000008, "Wrong alignment on UIW_ListItem_WeaponParts_C_Set_Item");
static_assert(sizeof(UIW_ListItem_WeaponParts_C_Set_Item) == 0x000008, "Wrong size on UIW_ListItem_WeaponParts_C_Set_Item");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_Set_Item, ListItem) == 0x000000, "Member 'UIW_ListItem_WeaponParts_C_Set_Item::ListItem' has a wrong offset!");

// Function UIW_ListItem_WeaponParts.UIW_ListItem_WeaponParts_C.SetEquiped
// 0x0010 (0x0010 - 0x0000)
struct UIW_ListItem_WeaponParts_C_SetEquiped final
{
public:
	class UUIW_Weapon_Custom_C*                   K2Node_DynamicCast_AsUIW_Weapon_Custom;            // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_WeaponParts_C_SetEquiped) == 0x000008, "Wrong alignment on UIW_ListItem_WeaponParts_C_SetEquiped");
static_assert(sizeof(UIW_ListItem_WeaponParts_C_SetEquiped) == 0x000010, "Wrong size on UIW_ListItem_WeaponParts_C_SetEquiped");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_SetEquiped, K2Node_DynamicCast_AsUIW_Weapon_Custom) == 0x000000, "Member 'UIW_ListItem_WeaponParts_C_SetEquiped::K2Node_DynamicCast_AsUIW_Weapon_Custom' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_SetEquiped, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'UIW_ListItem_WeaponParts_C_SetEquiped::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_SetEquiped, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000009, "Member 'UIW_ListItem_WeaponParts_C_SetEquiped::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_SetEquiped, CallFunc_IsValid_ReturnValue) == 0x00000A, "Member 'UIW_ListItem_WeaponParts_C_SetEquiped::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UIW_ListItem_WeaponParts.UIW_ListItem_WeaponParts_C.OnFocusReceived
// 0x01E8 (0x01E8 - 0x0000)
struct UIW_ListItem_WeaponParts_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x00F8(0x00B8)()
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_PixelPosition;            // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_ViewportPosition;         // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_CombineItem_C*           K2Node_DynamicCast_AsUIBP_List_Data_Combine_Item;  // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_WeaponParts_C_OnFocusReceived) == 0x000008, "Wrong alignment on UIW_ListItem_WeaponParts_C_OnFocusReceived");
static_assert(sizeof(UIW_ListItem_WeaponParts_C_OnFocusReceived) == 0x0001E8, "Wrong size on UIW_ListItem_WeaponParts_C_OnFocusReceived");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UIW_ListItem_WeaponParts_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UIW_ListItem_WeaponParts_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UIW_ListItem_WeaponParts_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_OnFocusReceived, K2Node_MakeStruct_EventReply) == 0x0000F8, "Member 'UIW_ListItem_WeaponParts_C_OnFocusReceived::K2Node_MakeStruct_EventReply' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_OnFocusReceived, CallFunc_GetLocalSize_ReturnValue) == 0x0001B0, "Member 'UIW_ListItem_WeaponParts_C_OnFocusReceived::CallFunc_GetLocalSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_OnFocusReceived, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x0001B8, "Member 'UIW_ListItem_WeaponParts_C_OnFocusReceived::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_OnFocusReceived, CallFunc_GetListItemObject_ReturnValue) == 0x0001C0, "Member 'UIW_ListItem_WeaponParts_C_OnFocusReceived::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_OnFocusReceived, CallFunc_LocalToViewport_PixelPosition) == 0x0001C8, "Member 'UIW_ListItem_WeaponParts_C_OnFocusReceived::CallFunc_LocalToViewport_PixelPosition' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_OnFocusReceived, CallFunc_LocalToViewport_ViewportPosition) == 0x0001D0, "Member 'UIW_ListItem_WeaponParts_C_OnFocusReceived::CallFunc_LocalToViewport_ViewportPosition' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_OnFocusReceived, K2Node_DynamicCast_AsUIBP_List_Data_Combine_Item) == 0x0001D8, "Member 'UIW_ListItem_WeaponParts_C_OnFocusReceived::K2Node_DynamicCast_AsUIBP_List_Data_Combine_Item' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_OnFocusReceived, K2Node_DynamicCast_bSuccess) == 0x0001E0, "Member 'UIW_ListItem_WeaponParts_C_OnFocusReceived::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UIW_ListItem_WeaponParts.UIW_ListItem_WeaponParts_C.SetEquipPossible
// 0x0048 (0x0048 - 0x0000)
struct UIW_ListItem_WeaponParts_C_SetEquipPossible final
{
public:
	class ULItem*                                 LocalHandle;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 LocalBlade;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Weapon_Custom_C*                   LocalWeaponCustom;                                 // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ULWeaponItem*                           CallFunc_GetCombineResultWeapon_ReturnValue;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBladeItem_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Weapon_Custom_C*                   K2Node_DynamicCast_AsUIW_Weapon_Custom;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_WeaponParts_C_SetEquipPossible) == 0x000008, "Wrong alignment on UIW_ListItem_WeaponParts_C_SetEquipPossible");
static_assert(sizeof(UIW_ListItem_WeaponParts_C_SetEquipPossible) == 0x000048, "Wrong size on UIW_ListItem_WeaponParts_C_SetEquipPossible");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_SetEquipPossible, LocalHandle) == 0x000000, "Member 'UIW_ListItem_WeaponParts_C_SetEquipPossible::LocalHandle' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_SetEquipPossible, LocalBlade) == 0x000008, "Member 'UIW_ListItem_WeaponParts_C_SetEquipPossible::LocalBlade' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_SetEquipPossible, LocalWeaponCustom) == 0x000010, "Member 'UIW_ListItem_WeaponParts_C_SetEquipPossible::LocalWeaponCustom' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_SetEquipPossible, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'UIW_ListItem_WeaponParts_C_SetEquipPossible::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_SetEquipPossible, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'UIW_ListItem_WeaponParts_C_SetEquipPossible::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_SetEquipPossible, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'UIW_ListItem_WeaponParts_C_SetEquipPossible::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_SetEquipPossible, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'UIW_ListItem_WeaponParts_C_SetEquipPossible::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_SetEquipPossible, CallFunc_GetCombineResultWeapon_ReturnValue) == 0x000028, "Member 'UIW_ListItem_WeaponParts_C_SetEquipPossible::CallFunc_GetCombineResultWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_SetEquipPossible, CallFunc_IsValid_ReturnValue_2) == 0x000030, "Member 'UIW_ListItem_WeaponParts_C_SetEquipPossible::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_SetEquipPossible, CallFunc_IsBladeItem_ReturnValue) == 0x000031, "Member 'UIW_ListItem_WeaponParts_C_SetEquipPossible::CallFunc_IsBladeItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_SetEquipPossible, K2Node_DynamicCast_AsUIW_Weapon_Custom) == 0x000038, "Member 'UIW_ListItem_WeaponParts_C_SetEquipPossible::K2Node_DynamicCast_AsUIW_Weapon_Custom' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_WeaponParts_C_SetEquipPossible, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'UIW_ListItem_WeaponParts_C_SetEquipPossible::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

