#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Weapon_Custom

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"
#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UIEN_WeaponPart_structs.hpp"


namespace SDK::Params
{

// Function UIW_Weapon_Custom.UIW_Weapon_Custom_C.ExecuteUbergraph_UIW_Weapon_Custom
// 0x02F0 (0x02F0 - 0x0000)
struct UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_4;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_3;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_2;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUIW_Popup_C* Popup, class UUIW_Btn_Key_C* BtnKey)> K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class UUIW_Popup_C*                           CallFunc_AddPopupWidget_Widget;                    // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetWeaponByname_ItemName;                 // 0x0060(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00A0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm)
	struct FItemCommonInfoPtr                     CallFunc_GetCommonInfo_ReturnValue;                // 0x00F0(0x0008)(NoDestructor)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget_1;               // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_GetImageResource_ReturnValue;             // 0x0100(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class UUIW_Popup_C*                           CallFunc_AddPopupWidget_Widget_1;                  // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalTextItemNameLocalize_ReturnValue; // 0x0130(0x0018)()
	TDelegate<void(class UUIW_Popup_C* Popup, class UUIW_Btn_Key_C* BtnKey)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0148(0x0010)(ZeroConstructor, NoDestructor)
	struct FItemCommonInfoPtr                     CallFunc_GetCommonInfo_ReturnValue_1;              // 0x0158(0x0008)(NoDestructor)
	TSoftObjectPtr<class UObject>                 CallFunc_GetImageResource_ReturnValue_1;           // 0x0160(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalTextItemNameLocalize_ReturnValue_1; // 0x0188(0x0018)()
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_CombineItem_C*           K2Node_DynamicCast_AsUIBP_List_Data_Combine_Item;  // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_CombineItem_C*           K2Node_DynamicCast_AsUIBP_List_Data_Combine_Item_1; // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeCombinePopupText_Text;                // 0x01D0(0x0018)()
	class ULWeaponItem*                           CallFunc_GetCombineResultWeapon_ReturnValue;       // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEquipped_ReturnValue;                   // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F3[0x5];                                      // 0x01F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x01F8(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x0210(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0228(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0240(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0250(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_1;               // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget_2;               // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_AddWidget_Widget;                         // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0298(0x0018)()
	class UUIW_Weapon_Equip_C*                    K2Node_DynamicCast_AsUIW_Weapon_Equip;             // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x02BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x02C0(0x0018)(ConstParm)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_ComponentBoundEvent_InVisibility;           // 0x02DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DB[0x5];                                      // 0x02DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        K2Node_MakeArray_Array_1;                          // 0x02E0(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom) == 0x000008, "Wrong alignment on UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom");
static_assert(sizeof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom) == 0x0002F0, "Wrong size on UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, EntryPoint) == 0x000000, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, K2Node_ComponentBoundEvent_BtnKey) == 0x000008, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::K2Node_ComponentBoundEvent_BtnKey' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, K2Node_ComponentBoundEvent_BtnKey_4) == 0x000020, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::K2Node_ComponentBoundEvent_BtnKey_4' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, K2Node_ComponentBoundEvent_BtnKey_3) == 0x000028, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::K2Node_ComponentBoundEvent_BtnKey_3' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, K2Node_ComponentBoundEvent_BtnKey_2) == 0x000030, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::K2Node_ComponentBoundEvent_BtnKey_2' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, K2Node_SwitchInteger_CmpSuccess) == 0x000038, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, K2Node_SwitchInteger_CmpSuccess_1) == 0x000039, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_GetMainWidget_MainWidget) == 0x000040, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_AddPopupWidget_Widget) == 0x000058, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_AddPopupWidget_Widget' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_GetWeaponByname_ItemName) == 0x000060, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_GetWeaponByname_ItemName' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_Conv_TextToString_ReturnValue) == 0x000078, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, K2Node_MakeStruct_FormatArgumentData) == 0x0000A0, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, K2Node_MakeArray_Array) == 0x0000E0, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_GetCommonInfo_ReturnValue) == 0x0000F0, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_GetCommonInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_GetMainWidget_MainWidget_1) == 0x0000F8, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_GetMainWidget_MainWidget_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_GetImageResource_ReturnValue) == 0x000100, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_GetImageResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_AddPopupWidget_Widget_1) == 0x000128, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_AddPopupWidget_Widget_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_GetLocalTextItemNameLocalize_ReturnValue) == 0x000130, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_GetLocalTextItemNameLocalize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, K2Node_CreateDelegate_OutputDelegate_1) == 0x000148, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_GetCommonInfo_ReturnValue_1) == 0x000158, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_GetCommonInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_GetImageResource_ReturnValue_1) == 0x000160, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_GetImageResource_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_GetLocalTextItemNameLocalize_ReturnValue_1) == 0x000188, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_GetLocalTextItemNameLocalize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0001A0, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x0001A8, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, K2Node_DynamicCast_AsUIBP_List_Data_Combine_Item) == 0x0001B0, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::K2Node_DynamicCast_AsUIBP_List_Data_Combine_Item' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, K2Node_DynamicCast_bSuccess) == 0x0001B8, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, K2Node_DynamicCast_AsUIBP_List_Data_Combine_Item_1) == 0x0001C0, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::K2Node_DynamicCast_AsUIBP_List_Data_Combine_Item_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, K2Node_DynamicCast_bSuccess_1) == 0x0001C8, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_IsValid_ReturnValue_1) == 0x0001C9, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_IsValid_ReturnValue_2) == 0x0001CA, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_BooleanAND_ReturnValue) == 0x0001CB, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_MakeCombinePopupText_Text) == 0x0001D0, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_MakeCombinePopupText_Text' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_GetCombineResultWeapon_ReturnValue) == 0x0001E8, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_GetCombineResultWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_IsValid_ReturnValue_3) == 0x0001F0, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_IsEquipped_ReturnValue) == 0x0001F1, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_IsEquipped_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, K2Node_SwitchEnum_CmpSuccess) == 0x0001F2, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_GetGameStrWithName_ReturnValue) == 0x0001F8, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_GetGameStrWithName_ReturnValue_1) == 0x000210, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_GetGameStrWithName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_Format_ReturnValue) == 0x000228, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000240, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000250, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, K2Node_ComponentBoundEvent_BtnKey_1) == 0x000260, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::K2Node_ComponentBoundEvent_BtnKey_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_Concat_StrStr_ReturnValue) == 0x000268, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_GetMainWidget_MainWidget_2) == 0x000278, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_GetMainWidget_MainWidget_2' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000280, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_AddWidget_Widget) == 0x000290, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_AddWidget_Widget' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000298, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, K2Node_DynamicCast_AsUIW_Weapon_Equip) == 0x0002B0, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::K2Node_DynamicCast_AsUIW_Weapon_Equip' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, K2Node_DynamicCast_bSuccess_2) == 0x0002B8, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, Temp_bool_Variable) == 0x0002B9, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0002BA, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0002BB, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, K2Node_Select_Default) == 0x0002C0, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_BooleanAND_ReturnValue_1) == 0x0002D8, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, CallFunc_Not_PreBool_ReturnValue) == 0x0002D9, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, K2Node_ComponentBoundEvent_InVisibility) == 0x0002DA, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::K2Node_ComponentBoundEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom, K2Node_MakeArray_Array_1) == 0x0002E0, "Member 'UIW_Weapon_Custom_C_ExecuteUbergraph_UIW_Weapon_Custom::K2Node_MakeArray_Array_1' has a wrong offset!");

// Function UIW_Weapon_Custom.UIW_Weapon_Custom_C.BndEvt__UIW_Weapon_Custom_Btn_Combine_K2Node_ComponentBoundEvent_5_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Combine_K2Node_ComponentBoundEvent_5_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Combine_K2Node_ComponentBoundEvent_5_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Combine_K2Node_ComponentBoundEvent_5_OnActive__DelegateSignature");
static_assert(sizeof(UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Combine_K2Node_ComponentBoundEvent_5_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Combine_K2Node_ComponentBoundEvent_5_OnActive__DelegateSignature");
static_assert(offsetof(UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Combine_K2Node_ComponentBoundEvent_5_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Combine_K2Node_ComponentBoundEvent_5_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_Weapon_Custom.UIW_Weapon_Custom_C.BndEvt__UIW_Weapon_Custom_ItemInfo_Compare_K2Node_ComponentBoundEvent_4_OnVisibilityChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_ItemInfo_Compare_K2Node_ComponentBoundEvent_4_OnVisibilityChangedEvent__DelegateSignature final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_ItemInfo_Compare_K2Node_ComponentBoundEvent_4_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_ItemInfo_Compare_K2Node_ComponentBoundEvent_4_OnVisibilityChangedEvent__DelegateSignature");
static_assert(sizeof(UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_ItemInfo_Compare_K2Node_ComponentBoundEvent_4_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong size on UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_ItemInfo_Compare_K2Node_ComponentBoundEvent_4_OnVisibilityChangedEvent__DelegateSignature");
static_assert(offsetof(UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_ItemInfo_Compare_K2Node_ComponentBoundEvent_4_OnVisibilityChangedEvent__DelegateSignature, InVisibility) == 0x000000, "Member 'UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_ItemInfo_Compare_K2Node_ComponentBoundEvent_4_OnVisibilityChangedEvent__DelegateSignature::InVisibility' has a wrong offset!");

// Function UIW_Weapon_Custom.UIW_Weapon_Custom_C.BndEvt__UIW_Weapon_Custom_Btn_Equip_K2Node_ComponentBoundEvent_3_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Equip_K2Node_ComponentBoundEvent_3_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Equip_K2Node_ComponentBoundEvent_3_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Equip_K2Node_ComponentBoundEvent_3_OnActive__DelegateSignature");
static_assert(sizeof(UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Equip_K2Node_ComponentBoundEvent_3_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Equip_K2Node_ComponentBoundEvent_3_OnActive__DelegateSignature");
static_assert(offsetof(UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Equip_K2Node_ComponentBoundEvent_3_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Equip_K2Node_ComponentBoundEvent_3_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_Weapon_Custom.UIW_Weapon_Custom_C.BndEvt__UIW_Weapon_Custom_Btn_Select_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Select_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Select_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Select_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature");
static_assert(sizeof(UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Select_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Select_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature");
static_assert(offsetof(UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Select_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Select_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_Weapon_Custom.UIW_Weapon_Custom_C.BndEvt__UIW_Weapon_Custom_Btn_Back_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Back_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Back_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Back_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature");
static_assert(sizeof(UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Back_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Back_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature");
static_assert(offsetof(UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Back_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Back_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_Weapon_Custom.UIW_Weapon_Custom_C.BndEvt__UIW_Weapon_Custom_Btn_Divide_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Divide_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Divide_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Divide_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature");
static_assert(sizeof(UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Divide_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Divide_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature");
static_assert(offsetof(UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Divide_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_Weapon_Custom_C_BndEvt__UIW_Weapon_Custom_Btn_Divide_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_Weapon_Custom.UIW_Weapon_Custom_C.OnReady
// 0x05B8 (0x05B8 - 0x0000)
struct UIW_Weapon_Custom_C_OnReady final
{
public:
	TArray<class UUIBP_ListData_WeaponPart_C*>    LocalTabDataList;                                  // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<EUIEN_WeaponPart>                      LocalTabList;                                      // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScrollBarStyle                        CallFunc_GetScrollBarStyle_ScrollBarStyle;         // 0x0030(0x04D0)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0500(0x0018)()
	TDelegate<void(class UObject* Item)>          K2Node_CreateDelegate_OutputDelegate;              // 0x0518(0x0010)(ZeroConstructor, NoDestructor)
	class UUIBP_ListData_WeaponPart_C*            CallFunc_SpawnObject_ReturnValue;                  // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Item, bool bIsSelected)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0530(0x0010)(ZeroConstructor, NoDestructor)
	EUIEN_WeaponPart                              CallFunc_Array_Get_Item;                           // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0x3];                                      // 0x0541(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0544(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_549[0x7];                                      // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EUIEN_WeaponPart>                      K2Node_MakeArray_Array;                            // 0x0550(0x0010)(ReferenceParm)
	TDelegate<void(class UObject* Item, bool bIsSelected)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0560(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Item)>          K2Node_CreateDelegate_OutputDelegate_3;            // 0x0574(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Item, bool bIsSelected)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0584(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UUIW_Btn_Key_C* BtnKey)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0594(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UUIW_Btn_Key_C* BtnKey)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x05A4(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(UIW_Weapon_Custom_C_OnReady) == 0x000008, "Wrong alignment on UIW_Weapon_Custom_C_OnReady");
static_assert(sizeof(UIW_Weapon_Custom_C_OnReady) == 0x0005B8, "Wrong size on UIW_Weapon_Custom_C_OnReady");
static_assert(offsetof(UIW_Weapon_Custom_C_OnReady, LocalTabDataList) == 0x000000, "Member 'UIW_Weapon_Custom_C_OnReady::LocalTabDataList' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_OnReady, LocalTabList) == 0x000010, "Member 'UIW_Weapon_Custom_C_OnReady::LocalTabList' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_OnReady, Temp_int_Array_Index_Variable) == 0x000020, "Member 'UIW_Weapon_Custom_C_OnReady::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_OnReady, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'UIW_Weapon_Custom_C_OnReady::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_OnReady, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'UIW_Weapon_Custom_C_OnReady::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_OnReady, CallFunc_GetScrollBarStyle_ScrollBarStyle) == 0x000030, "Member 'UIW_Weapon_Custom_C_OnReady::CallFunc_GetScrollBarStyle_ScrollBarStyle' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_OnReady, CallFunc_GetGameStrWithName_ReturnValue) == 0x000500, "Member 'UIW_Weapon_Custom_C_OnReady::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_OnReady, K2Node_CreateDelegate_OutputDelegate) == 0x000518, "Member 'UIW_Weapon_Custom_C_OnReady::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_OnReady, CallFunc_SpawnObject_ReturnValue) == 0x000528, "Member 'UIW_Weapon_Custom_C_OnReady::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_OnReady, K2Node_CreateDelegate_OutputDelegate_1) == 0x000530, "Member 'UIW_Weapon_Custom_C_OnReady::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_OnReady, CallFunc_Array_Get_Item) == 0x000540, "Member 'UIW_Weapon_Custom_C_OnReady::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_OnReady, CallFunc_Array_Length_ReturnValue) == 0x000544, "Member 'UIW_Weapon_Custom_C_OnReady::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_OnReady, CallFunc_Less_IntInt_ReturnValue) == 0x000548, "Member 'UIW_Weapon_Custom_C_OnReady::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_OnReady, K2Node_MakeArray_Array) == 0x000550, "Member 'UIW_Weapon_Custom_C_OnReady::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_OnReady, K2Node_CreateDelegate_OutputDelegate_2) == 0x000560, "Member 'UIW_Weapon_Custom_C_OnReady::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_OnReady, CallFunc_Array_Add_ReturnValue) == 0x000570, "Member 'UIW_Weapon_Custom_C_OnReady::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_OnReady, K2Node_CreateDelegate_OutputDelegate_3) == 0x000574, "Member 'UIW_Weapon_Custom_C_OnReady::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_OnReady, K2Node_CreateDelegate_OutputDelegate_4) == 0x000584, "Member 'UIW_Weapon_Custom_C_OnReady::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_OnReady, K2Node_CreateDelegate_OutputDelegate_5) == 0x000594, "Member 'UIW_Weapon_Custom_C_OnReady::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_OnReady, K2Node_CreateDelegate_OutputDelegate_6) == 0x0005A4, "Member 'UIW_Weapon_Custom_C_OnReady::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");

// Function UIW_Weapon_Custom.UIW_Weapon_Custom_C.MoveLeftTab
// 0x0008 (0x0008 - 0x0000)
struct UIW_Weapon_Custom_C_MoveLeftTab final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Weapon_Custom_C_MoveLeftTab) == 0x000008, "Wrong alignment on UIW_Weapon_Custom_C_MoveLeftTab");
static_assert(sizeof(UIW_Weapon_Custom_C_MoveLeftTab) == 0x000008, "Wrong size on UIW_Weapon_Custom_C_MoveLeftTab");
static_assert(offsetof(UIW_Weapon_Custom_C_MoveLeftTab, BtnKey) == 0x000000, "Member 'UIW_Weapon_Custom_C_MoveLeftTab::BtnKey' has a wrong offset!");

// Function UIW_Weapon_Custom.UIW_Weapon_Custom_C.MoveRightTab
// 0x0008 (0x0008 - 0x0000)
struct UIW_Weapon_Custom_C_MoveRightTab final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Weapon_Custom_C_MoveRightTab) == 0x000008, "Wrong alignment on UIW_Weapon_Custom_C_MoveRightTab");
static_assert(sizeof(UIW_Weapon_Custom_C_MoveRightTab) == 0x000008, "Wrong size on UIW_Weapon_Custom_C_MoveRightTab");
static_assert(offsetof(UIW_Weapon_Custom_C_MoveRightTab, BtnKey) == 0x000000, "Member 'UIW_Weapon_Custom_C_MoveRightTab::BtnKey' has a wrong offset!");

// Function UIW_Weapon_Custom.UIW_Weapon_Custom_C.ChangeTab
// 0x0020 (0x0020 - 0x0000)
struct UIW_Weapon_Custom_C_ChangeTab final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_WeaponPart_C*            K2Node_DynamicCast_AsUIBP_List_Data_Weapon_Part;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Weapon_Custom_C_ChangeTab) == 0x000008, "Wrong alignment on UIW_Weapon_Custom_C_ChangeTab");
static_assert(sizeof(UIW_Weapon_Custom_C_ChangeTab) == 0x000020, "Wrong size on UIW_Weapon_Custom_C_ChangeTab");
static_assert(offsetof(UIW_Weapon_Custom_C_ChangeTab, Item) == 0x000000, "Member 'UIW_Weapon_Custom_C_ChangeTab::Item' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ChangeTab, bIsSelected) == 0x000008, "Member 'UIW_Weapon_Custom_C_ChangeTab::bIsSelected' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ChangeTab, K2Node_DynamicCast_AsUIBP_List_Data_Weapon_Part) == 0x000010, "Member 'UIW_Weapon_Custom_C_ChangeTab::K2Node_DynamicCast_AsUIBP_List_Data_Weapon_Part' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_ChangeTab, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UIW_Weapon_Custom_C_ChangeTab::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UIW_Weapon_Custom.UIW_Weapon_Custom_C.RefreshWeapon
// 0x00D0 (0x00D0 - 0x0000)
struct UIW_Weapon_Custom_C_RefreshWeapon final
{
public:
	TArray<class UUIBP_ListData_Weapon_C*>        LocalWeaponList;                                   // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<class ULWeaponItem*>                   LocalWeaponItems;                                  // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULWeaponItem*                           CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        CallFunc_GetListItems_ReturnValue;                 // 0x0050(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULPlayerInventory*                      CallFunc_GetPlayerInventory_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ULWeaponItem*>                   CallFunc_GetWeaponItems_SortedByEquipSlot_ReturnValue; // 0x0080(0x0010)(ReferenceParm)
	class ULWeaponItem*                           CallFunc_Array_Get_Item_1;                         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHeroicWeapon_ReturnValue;               // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue;                          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_Weapon_C*                CallFunc_SpawnObject_ReturnValue;                  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_Weapon_C*                CallFunc_SpawnObject_ReturnValue_1;                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Weapon_Custom_C_RefreshWeapon) == 0x000008, "Wrong alignment on UIW_Weapon_Custom_C_RefreshWeapon");
static_assert(sizeof(UIW_Weapon_Custom_C_RefreshWeapon) == 0x0000D0, "Wrong size on UIW_Weapon_Custom_C_RefreshWeapon");
static_assert(offsetof(UIW_Weapon_Custom_C_RefreshWeapon, LocalWeaponList) == 0x000000, "Member 'UIW_Weapon_Custom_C_RefreshWeapon::LocalWeaponList' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_RefreshWeapon, LocalWeaponItems) == 0x000010, "Member 'UIW_Weapon_Custom_C_RefreshWeapon::LocalWeaponItems' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_RefreshWeapon, Temp_int_Array_Index_Variable) == 0x000020, "Member 'UIW_Weapon_Custom_C_RefreshWeapon::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_RefreshWeapon, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'UIW_Weapon_Custom_C_RefreshWeapon::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_RefreshWeapon, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'UIW_Weapon_Custom_C_RefreshWeapon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_RefreshWeapon, Temp_int_Array_Index_Variable_1) == 0x00002C, "Member 'UIW_Weapon_Custom_C_RefreshWeapon::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_RefreshWeapon, Temp_int_Loop_Counter_Variable_1) == 0x000030, "Member 'UIW_Weapon_Custom_C_RefreshWeapon::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_RefreshWeapon, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'UIW_Weapon_Custom_C_RefreshWeapon::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_RefreshWeapon, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000038, "Member 'UIW_Weapon_Custom_C_RefreshWeapon::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_RefreshWeapon, CallFunc_Array_Get_Item) == 0x000040, "Member 'UIW_Weapon_Custom_C_RefreshWeapon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_RefreshWeapon, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'UIW_Weapon_Custom_C_RefreshWeapon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_RefreshWeapon, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'UIW_Weapon_Custom_C_RefreshWeapon::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_RefreshWeapon, CallFunc_GetListItems_ReturnValue) == 0x000050, "Member 'UIW_Weapon_Custom_C_RefreshWeapon::CallFunc_GetListItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_RefreshWeapon, CallFunc_Array_LastIndex_ReturnValue) == 0x000060, "Member 'UIW_Weapon_Custom_C_RefreshWeapon::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_RefreshWeapon, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000068, "Member 'UIW_Weapon_Custom_C_RefreshWeapon::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_RefreshWeapon, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000070, "Member 'UIW_Weapon_Custom_C_RefreshWeapon::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_RefreshWeapon, CallFunc_GetPlayerInventory_ReturnValue) == 0x000078, "Member 'UIW_Weapon_Custom_C_RefreshWeapon::CallFunc_GetPlayerInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_RefreshWeapon, CallFunc_GetWeaponItems_SortedByEquipSlot_ReturnValue) == 0x000080, "Member 'UIW_Weapon_Custom_C_RefreshWeapon::CallFunc_GetWeaponItems_SortedByEquipSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_RefreshWeapon, CallFunc_Array_Get_Item_1) == 0x000090, "Member 'UIW_Weapon_Custom_C_RefreshWeapon::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_RefreshWeapon, CallFunc_Array_Length_ReturnValue_1) == 0x000098, "Member 'UIW_Weapon_Custom_C_RefreshWeapon::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_RefreshWeapon, CallFunc_Array_RemoveItem_ReturnValue) == 0x00009C, "Member 'UIW_Weapon_Custom_C_RefreshWeapon::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_RefreshWeapon, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000A0, "Member 'UIW_Weapon_Custom_C_RefreshWeapon::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_RefreshWeapon, CallFunc_IsHeroicWeapon_ReturnValue) == 0x0000A4, "Member 'UIW_Weapon_Custom_C_RefreshWeapon::CallFunc_IsHeroicWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_RefreshWeapon, CallFunc_Max_ReturnValue) == 0x0000A8, "Member 'UIW_Weapon_Custom_C_RefreshWeapon::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_RefreshWeapon, CallFunc_SpawnObject_ReturnValue) == 0x0000B0, "Member 'UIW_Weapon_Custom_C_RefreshWeapon::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Weapon_Custom_C_RefreshWeapon, CallFunc_Array_Add_ReturnValue) == 0x0000B8, "Member 'UIW_Weapon_Custom_C_RefreshWeapon::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
