#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_QA_ListItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UIW_QA_ListItem.UIW_QA_ListItem_C.ExecuteUbergraph_UIW_QA_ListItem
// 0x00E0 (0x00E0 - 0x0000)
struct UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0060(0x0028)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A0(0x0018)()
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget_1;               // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget_2;               // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem) == 0x000008, "Wrong alignment on UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem");
static_assert(sizeof(UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem) == 0x0000E0, "Wrong size on UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem");
static_assert(offsetof(UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem, EntryPoint) == 0x000000, "Member 'UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem, CallFunc_Conv_IntToString_ReturnValue) == 0x000030, "Member 'UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem, CallFunc_Concat_StrStr_ReturnValue) == 0x000040, "Member 'UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000050, "Member 'UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem, K2Node_MakeStruct_SlateColor_1) == 0x000060, "Member 'UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000088, "Member 'UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem, CallFunc_GetMainWidget_MainWidget) == 0x000098, "Member 'UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A0, "Member 'UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem, CallFunc_Array_Contains_ReturnValue) == 0x0000B8, "Member 'UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem, CallFunc_GetMainWidget_MainWidget_1) == 0x0000C0, "Member 'UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem::CallFunc_GetMainWidget_MainWidget_1' has a wrong offset!");
static_assert(offsetof(UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem, CallFunc_GetMainWidget_MainWidget_2) == 0x0000C8, "Member 'UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem::CallFunc_GetMainWidget_MainWidget_2' has a wrong offset!");
static_assert(offsetof(UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem, CallFunc_Array_RemoveItem_ReturnValue) == 0x0000D0, "Member 'UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem, CallFunc_Array_Add_ReturnValue) == 0x0000D4, "Member 'UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem, CallFunc_Array_Contains_ReturnValue_1) == 0x0000D8, "Member 'UIW_QA_ListItem_C_ExecuteUbergraph_UIW_QA_ListItem::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");

}

