#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ListItem_Lie_Low

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UIW_ListItem_Lie_Low.UIW_ListItem_Lie_Low_C.On Focused__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_ListItem_Lie_Low_C_On_Focused__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ListItem_Lie_Low_C_On_Focused__DelegateSignature) == 0x000004, "Wrong alignment on UIW_ListItem_Lie_Low_C_On_Focused__DelegateSignature");
static_assert(sizeof(UIW_ListItem_Lie_Low_C_On_Focused__DelegateSignature) == 0x000004, "Wrong size on UIW_ListItem_Lie_Low_C_On_Focused__DelegateSignature");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_On_Focused__DelegateSignature, Index_0) == 0x000000, "Member 'UIW_ListItem_Lie_Low_C_On_Focused__DelegateSignature::Index_0' has a wrong offset!");

// Function UIW_ListItem_Lie_Low.UIW_ListItem_Lie_Low_C.On Clicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_ListItem_Lie_Low_C_On_Clicked__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ListItem_Lie_Low_C_On_Clicked__DelegateSignature) == 0x000004, "Wrong alignment on UIW_ListItem_Lie_Low_C_On_Clicked__DelegateSignature");
static_assert(sizeof(UIW_ListItem_Lie_Low_C_On_Clicked__DelegateSignature) == 0x000004, "Wrong size on UIW_ListItem_Lie_Low_C_On_Clicked__DelegateSignature");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_On_Clicked__DelegateSignature, Index_0) == 0x000000, "Member 'UIW_ListItem_Lie_Low_C_On_Clicked__DelegateSignature::Index_0' has a wrong offset!");

// Function UIW_ListItem_Lie_Low.UIW_ListItem_Lie_Low_C.ExecuteUbergraph_UIW_ListItem_Lie_Low
// 0x0180 (0x0180 - 0x0000)
struct UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0028)()
	TDelegate<void(int32 Index)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 Index)>                  K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0058(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0080(0x0028)()
	bool                                          K2Node_Event_bIsSelected;                          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_IsNew_C*                 K2Node_CustomEvent_Data;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00B8(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00F0(0x0070)(ConstParm)
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_NPCDialog_C*                       K2Node_DynamicCast_AsUIW_NPCDialog;                // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0174(0x0008)(NoDestructor)
};
static_assert(alignof(UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low) == 0x000008, "Wrong alignment on UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low");
static_assert(sizeof(UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low) == 0x000180, "Wrong size on UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low, EntryPoint) == 0x000000, "Member 'UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low, K2Node_MakeStruct_SlateColor) == 0x000010, "Member 'UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low, K2Node_MakeStruct_SlateColor_1) == 0x000058, "Member 'UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low, K2Node_MakeStruct_SlateColor_2) == 0x000080, "Member 'UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low, K2Node_Event_bIsSelected) == 0x0000A8, "Member 'UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low, K2Node_CustomEvent_Data) == 0x0000B0, "Member 'UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low::K2Node_CustomEvent_Data' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low, K2Node_Event_MyGeometry) == 0x0000B8, "Member 'UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low, K2Node_Event_MouseEvent) == 0x0000F0, "Member 'UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low, CallFunc_GetOuterObject_ReturnValue) == 0x000160, "Member 'UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low, K2Node_DynamicCast_AsUIW_NPCDialog) == 0x000168, "Member 'UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low::K2Node_DynamicCast_AsUIW_NPCDialog' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low, K2Node_DynamicCast_bSuccess) == 0x000170, "Member 'UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low, K2Node_Event_InFocusEvent) == 0x000174, "Member 'UIW_ListItem_Lie_Low_C_ExecuteUbergraph_UIW_ListItem_Lie_Low::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function UIW_ListItem_Lie_Low.UIW_ListItem_Lie_Low_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct UIW_ListItem_Lie_Low_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Lie_Low_C_OnFocusLost) == 0x000004, "Wrong alignment on UIW_ListItem_Lie_Low_C_OnFocusLost");
static_assert(sizeof(UIW_ListItem_Lie_Low_C_OnFocusLost) == 0x000008, "Wrong size on UIW_ListItem_Lie_Low_C_OnFocusLost");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'UIW_ListItem_Lie_Low_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function UIW_ListItem_Lie_Low.UIW_ListItem_Lie_Low_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct UIW_ListItem_Lie_Low_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIW_ListItem_Lie_Low_C_OnMouseEnter) == 0x000008, "Wrong alignment on UIW_ListItem_Lie_Low_C_OnMouseEnter");
static_assert(sizeof(UIW_ListItem_Lie_Low_C_OnMouseEnter) == 0x0000A8, "Wrong size on UIW_ListItem_Lie_Low_C_OnMouseEnter");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'UIW_ListItem_Lie_Low_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'UIW_ListItem_Lie_Low_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function UIW_ListItem_Lie_Low.UIW_ListItem_Lie_Low_C.SetData
// 0x0008 (0x0008 - 0x0000)
struct UIW_ListItem_Lie_Low_C_SetData final
{
public:
	class UUIBP_ListData_IsNew_C*                 Data;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ListItem_Lie_Low_C_SetData) == 0x000008, "Wrong alignment on UIW_ListItem_Lie_Low_C_SetData");
static_assert(sizeof(UIW_ListItem_Lie_Low_C_SetData) == 0x000008, "Wrong size on UIW_ListItem_Lie_Low_C_SetData");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_SetData, Data) == 0x000000, "Member 'UIW_ListItem_Lie_Low_C_SetData::Data' has a wrong offset!");

// Function UIW_ListItem_Lie_Low.UIW_ListItem_Lie_Low_C.SetSelected
// 0x0001 (0x0001 - 0x0000)
struct UIW_ListItem_Lie_Low_C_SetSelected final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Lie_Low_C_SetSelected) == 0x000001, "Wrong alignment on UIW_ListItem_Lie_Low_C_SetSelected");
static_assert(sizeof(UIW_ListItem_Lie_Low_C_SetSelected) == 0x000001, "Wrong size on UIW_ListItem_Lie_Low_C_SetSelected");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_SetSelected, bIsSelected) == 0x000000, "Member 'UIW_ListItem_Lie_Low_C_SetSelected::bIsSelected' has a wrong offset!");

// Function UIW_ListItem_Lie_Low.UIW_ListItem_Lie_Low_C.OnSelectedLie
// 0x0008 (0x0008 - 0x0000)
struct UIW_ListItem_Lie_Low_C_OnSelectedLie final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Lie_Low_C_OnSelectedLie) == 0x000004, "Wrong alignment on UIW_ListItem_Lie_Low_C_OnSelectedLie");
static_assert(sizeof(UIW_ListItem_Lie_Low_C_OnSelectedLie) == 0x000008, "Wrong size on UIW_ListItem_Lie_Low_C_OnSelectedLie");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_OnSelectedLie, Index_0) == 0x000000, "Member 'UIW_ListItem_Lie_Low_C_OnSelectedLie::Index_0' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_OnSelectedLie, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'UIW_ListItem_Lie_Low_C_OnSelectedLie::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function UIW_ListItem_Lie_Low.UIW_ListItem_Lie_Low_C.OnMouseButtonUp
// 0x0218 (0x0218 - 0x0000)
struct UIW_ListItem_Lie_Low_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UIW_ListItem_Lie_Low_C_OnMouseButtonUp) == 0x000008, "Wrong alignment on UIW_ListItem_Lie_Low_C_OnMouseButtonUp");
static_assert(sizeof(UIW_ListItem_Lie_Low_C_OnMouseButtonUp) == 0x000218, "Wrong size on UIW_ListItem_Lie_Low_C_OnMouseButtonUp");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_OnMouseButtonUp, MyGeometry) == 0x000000, "Member 'UIW_ListItem_Lie_Low_C_OnMouseButtonUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_OnMouseButtonUp, MouseEvent) == 0x000038, "Member 'UIW_ListItem_Lie_Low_C_OnMouseButtonUp::MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_OnMouseButtonUp, ReturnValue) == 0x0000A8, "Member 'UIW_ListItem_Lie_Low_C_OnMouseButtonUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_OnMouseButtonUp, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'UIW_ListItem_Lie_Low_C_OnMouseButtonUp::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UIW_ListItem_Lie_Low.UIW_ListItem_Lie_Low_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct UIW_ListItem_Lie_Low_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(UIW_ListItem_Lie_Low_C_OnFocusReceived) == 0x000008, "Wrong alignment on UIW_ListItem_Lie_Low_C_OnFocusReceived");
static_assert(sizeof(UIW_ListItem_Lie_Low_C_OnFocusReceived) == 0x0001B0, "Wrong size on UIW_ListItem_Lie_Low_C_OnFocusReceived");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UIW_ListItem_Lie_Low_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UIW_ListItem_Lie_Low_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UIW_ListItem_Lie_Low_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Lie_Low_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'UIW_ListItem_Lie_Low_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

}

