#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_BladeReinforced

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UIEN_WeaponPart_structs.hpp"
#include "UIW_Window_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_BladeReinforced.UIW_BladeReinforced_C
// 0x0130 (0x0480 - 0x0350)
class UUIW_BladeReinforced_C final : public UUIW_Window_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UIW_BladeReinforced_C;              // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Reinforced;                                    // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUIW_BG_Tab_C*                          BG_Tab;                                            // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Fx_Btn_Bg_C*                       BG_Text_Name;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Arrow_C*                       Btn_ArrowL;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Arrow_C*                       Btn_ArrowR;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Back;                                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_ItemInfo;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_NextPage;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_PrevPage;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Reinforced;                                    // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Scroll;                                        // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Tab_LeftKey;                                   // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Tab_RightKey;                                  // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Cost_Group;                                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx;                                                // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_1;                                              // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Group_FX;                                          // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img;                                               // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Item_Light;                                    // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_ItemInfo_C*                        ItemInfo;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULListView*                             List_Blade;                                        // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListView*                              List_Resource;                                     // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULListView*                             List_Tab;                                          // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULListView*                             List_Weapon;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Name_Group;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Tab;                                               // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Cost;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Name;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EUIEN_WeaponPart                              WeaponPart;                                        // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULWeaponItem*                           SelectedWeapon;                                    // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 SelectedBlade;                                     // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsReinforcing;                                     // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUIBP_ListData_Resource_C*>      ResourceListData;                                  // 0x0458(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          EnoughResource;                                    // 0x0468(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_469[0x3];                                      // 0x0469(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectedIndex;                                     // 0x046C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CountForPage;                                      // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_474[0x4];                                      // 0x0474(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULListView*                             SelectedList;                                      // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_BladeReinforced(int32 EntryPoint);
	void BndEvt__UIW_BladeReinforced_Btn_NextPage_K2Node_ComponentBoundEvent_3_OnActive__DelegateSignature(class UUIW_Btn_Key_C* BtnKey);
	void BndEvt__UIW_BladeReinforced_Btn_PrevPage_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature(class UUIW_Btn_Key_C* BtnKey);
	void Destruct();
	void BndEvt__List_Item_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void WidgetAnimationEvt_Ani_Reinforced_K2Node_WidgetAnimationEvent_2();
	void BndEvt__Btn_Select_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature(class UUIW_Btn_Key_C* BtnKey);
	void BndEvt__Btn_Back_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature(class UUIW_Btn_Key_C* BtnKey);
	void Construct();
	void HasWeapon_Blade();
	void MoveLeftTab(class UUIW_Btn_Key_C* BtnKey);
	void MoveRightTab(class UUIW_Btn_Key_C* BtnKey);
	void RefreshTab();
	void ChangeTab(class UObject* Item, bool bIsSelected);
	void RefreshInventory();
	void FocusedWeaponParts(class UObject* Item, bool bIsSelected);
	void RefreshResource();
	void MoveLeftItem();
	void MoveRightItem();
	void CallbackReinforced(class UUIW_Popup_C* Popup, class UUIW_Btn_Key_C* BtnKey);
	struct FEventReply FocusManage(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void ItemDoubleClick(class UObject* Item);
	void SetEnabledWindow(bool IsEnabled);
	void CallbackContextMenu(class FName EventName);
	void CanReinforced(bool* CanCombine);
	void OnReady();
	class UWidget* NavToLeftWeapon(EUINavigation Navigation_0);
	class UWidget* NavToRightWeapon(EUINavigation Navigation_0);
	class UWidget* NavToLeftBlade(EUINavigation Navigation_0);
	class UWidget* NavToRightBlade(EUINavigation Navigation_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_BladeReinforced_C">();
	}
	static class UUIW_BladeReinforced_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_BladeReinforced_C>();
	}
};
static_assert(alignof(UUIW_BladeReinforced_C) == 0x000008, "Wrong alignment on UUIW_BladeReinforced_C");
static_assert(sizeof(UUIW_BladeReinforced_C) == 0x000480, "Wrong size on UUIW_BladeReinforced_C");
static_assert(offsetof(UUIW_BladeReinforced_C, UberGraphFrame_UIW_BladeReinforced_C) == 0x000350, "Member 'UUIW_BladeReinforced_C::UberGraphFrame_UIW_BladeReinforced_C' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, Ani_Reinforced) == 0x000358, "Member 'UUIW_BladeReinforced_C::Ani_Reinforced' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, BG_Tab) == 0x000360, "Member 'UUIW_BladeReinforced_C::BG_Tab' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, BG_Text_Name) == 0x000368, "Member 'UUIW_BladeReinforced_C::BG_Text_Name' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, Btn_ArrowL) == 0x000370, "Member 'UUIW_BladeReinforced_C::Btn_ArrowL' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, Btn_ArrowR) == 0x000378, "Member 'UUIW_BladeReinforced_C::Btn_ArrowR' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, Btn_Back) == 0x000380, "Member 'UUIW_BladeReinforced_C::Btn_Back' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, Btn_ItemInfo) == 0x000388, "Member 'UUIW_BladeReinforced_C::Btn_ItemInfo' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, Btn_NextPage) == 0x000390, "Member 'UUIW_BladeReinforced_C::Btn_NextPage' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, Btn_PrevPage) == 0x000398, "Member 'UUIW_BladeReinforced_C::Btn_PrevPage' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, Btn_Reinforced) == 0x0003A0, "Member 'UUIW_BladeReinforced_C::Btn_Reinforced' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, Btn_Scroll) == 0x0003A8, "Member 'UUIW_BladeReinforced_C::Btn_Scroll' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, Btn_Tab_LeftKey) == 0x0003B0, "Member 'UUIW_BladeReinforced_C::Btn_Tab_LeftKey' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, Btn_Tab_RightKey) == 0x0003B8, "Member 'UUIW_BladeReinforced_C::Btn_Tab_RightKey' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, Cost_Group) == 0x0003C0, "Member 'UUIW_BladeReinforced_C::Cost_Group' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, Fx) == 0x0003C8, "Member 'UUIW_BladeReinforced_C::Fx' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, Fx_1) == 0x0003D0, "Member 'UUIW_BladeReinforced_C::Fx_1' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, Group_FX) == 0x0003D8, "Member 'UUIW_BladeReinforced_C::Group_FX' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, Img) == 0x0003E0, "Member 'UUIW_BladeReinforced_C::Img' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, Img_Item_Light) == 0x0003E8, "Member 'UUIW_BladeReinforced_C::Img_Item_Light' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, ItemInfo) == 0x0003F0, "Member 'UUIW_BladeReinforced_C::ItemInfo' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, List_Blade) == 0x0003F8, "Member 'UUIW_BladeReinforced_C::List_Blade' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, List_Resource) == 0x000400, "Member 'UUIW_BladeReinforced_C::List_Resource' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, List_Tab) == 0x000408, "Member 'UUIW_BladeReinforced_C::List_Tab' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, List_Weapon) == 0x000410, "Member 'UUIW_BladeReinforced_C::List_Weapon' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, Name_Group) == 0x000418, "Member 'UUIW_BladeReinforced_C::Name_Group' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, Tab) == 0x000420, "Member 'UUIW_BladeReinforced_C::Tab' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, Text_Cost) == 0x000428, "Member 'UUIW_BladeReinforced_C::Text_Cost' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, Text_Name) == 0x000430, "Member 'UUIW_BladeReinforced_C::Text_Name' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, WeaponPart) == 0x000438, "Member 'UUIW_BladeReinforced_C::WeaponPart' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, SelectedWeapon) == 0x000440, "Member 'UUIW_BladeReinforced_C::SelectedWeapon' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, SelectedBlade) == 0x000448, "Member 'UUIW_BladeReinforced_C::SelectedBlade' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, IsReinforcing) == 0x000450, "Member 'UUIW_BladeReinforced_C::IsReinforcing' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, ResourceListData) == 0x000458, "Member 'UUIW_BladeReinforced_C::ResourceListData' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, EnoughResource) == 0x000468, "Member 'UUIW_BladeReinforced_C::EnoughResource' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, SelectedIndex) == 0x00046C, "Member 'UUIW_BladeReinforced_C::SelectedIndex' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, CountForPage) == 0x000470, "Member 'UUIW_BladeReinforced_C::CountForPage' has a wrong offset!");
static_assert(offsetof(UUIW_BladeReinforced_C, SelectedList) == 0x000478, "Member 'UUIW_BladeReinforced_C::SelectedList' has a wrong offset!");

}

