#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HUD_Menu_PouchSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UIW_Slot_Pouch_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_HUD_Menu_PouchSlot.UIW_HUD_Menu_PouchSlot_C
// 0x0028 (0x03A8 - 0x0380)
class UUIW_HUD_Menu_PouchSlot_C final : public UUIW_Slot_Pouch_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UIW_HUD_Menu_PouchSlot_C;           // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	FMulticastInlineDelegateProperty_             OnHovered;                                         // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnPressed;                                         // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void OnHovered__DelegateSignature(class UUIW_HUD_Menu_PouchSlot_C* PouchSlot);
	void OnPressed__DelegateSignature(class UUIW_HUD_Menu_PouchSlot_C* PouchSlot);
	void ExecuteUbergraph_UIW_HUD_Menu_PouchSlot(int32 EntryPoint);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseButtonDoubleClick(const struct FGeometry& InMyGeometry, const struct FPointerEvent& InMouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_HUD_Menu_PouchSlot_C">();
	}
	static class UUIW_HUD_Menu_PouchSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_HUD_Menu_PouchSlot_C>();
	}
};
static_assert(alignof(UUIW_HUD_Menu_PouchSlot_C) == 0x000008, "Wrong alignment on UUIW_HUD_Menu_PouchSlot_C");
static_assert(sizeof(UUIW_HUD_Menu_PouchSlot_C) == 0x0003A8, "Wrong size on UUIW_HUD_Menu_PouchSlot_C");
static_assert(offsetof(UUIW_HUD_Menu_PouchSlot_C, UberGraphFrame_UIW_HUD_Menu_PouchSlot_C) == 0x000380, "Member 'UUIW_HUD_Menu_PouchSlot_C::UberGraphFrame_UIW_HUD_Menu_PouchSlot_C' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Menu_PouchSlot_C, OnHovered) == 0x000388, "Member 'UUIW_HUD_Menu_PouchSlot_C::OnHovered' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Menu_PouchSlot_C, OnPressed) == 0x000398, "Member 'UUIW_HUD_Menu_PouchSlot_C::OnPressed' has a wrong offset!");

}

