#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ResultProto

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UIW_ResultProto.UIW_ResultProto_C.ExecuteUbergraph_UIW_ResultProto
// 0x0038 (0x0038 - 0x0000)
struct UIW_ResultProto_C_ExecuteUbergraph_UIW_ResultProto final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ResultProto_C_ExecuteUbergraph_UIW_ResultProto) == 0x000008, "Wrong alignment on UIW_ResultProto_C_ExecuteUbergraph_UIW_ResultProto");
static_assert(sizeof(UIW_ResultProto_C_ExecuteUbergraph_UIW_ResultProto) == 0x000038, "Wrong size on UIW_ResultProto_C_ExecuteUbergraph_UIW_ResultProto");
static_assert(offsetof(UIW_ResultProto_C_ExecuteUbergraph_UIW_ResultProto, EntryPoint) == 0x000000, "Member 'UIW_ResultProto_C_ExecuteUbergraph_UIW_ResultProto::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_ResultProto_C_ExecuteUbergraph_UIW_ResultProto, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UIW_ResultProto_C_ExecuteUbergraph_UIW_ResultProto::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_ResultProto_C_ExecuteUbergraph_UIW_ResultProto, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'UIW_ResultProto_C_ExecuteUbergraph_UIW_ResultProto::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ResultProto_C_ExecuteUbergraph_UIW_ResultProto, K2Node_ComponentBoundEvent_BtnKey) == 0x000020, "Member 'UIW_ResultProto_C_ExecuteUbergraph_UIW_ResultProto::K2Node_ComponentBoundEvent_BtnKey' has a wrong offset!");
static_assert(offsetof(UIW_ResultProto_C_ExecuteUbergraph_UIW_ResultProto, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'UIW_ResultProto_C_ExecuteUbergraph_UIW_ResultProto::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ResultProto_C_ExecuteUbergraph_UIW_ResultProto, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'UIW_ResultProto_C_ExecuteUbergraph_UIW_ResultProto::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function UIW_ResultProto.UIW_ResultProto_C.BndEvt__Btn_Close_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_ResultProto_C_BndEvt__Btn_Close_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ResultProto_C_BndEvt__Btn_Close_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_ResultProto_C_BndEvt__Btn_Close_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature");
static_assert(sizeof(UIW_ResultProto_C_BndEvt__Btn_Close_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_ResultProto_C_BndEvt__Btn_Close_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature");
static_assert(offsetof(UIW_ResultProto_C_BndEvt__Btn_Close_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_ResultProto_C_BndEvt__Btn_Close_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_ResultProto.UIW_ResultProto_C.CallbackGoTitle
// 0x0028 (0x0028 - 0x0000)
struct UIW_ResultProto_C_CallbackGoTitle final
{
public:
	class UUIW_Popup_C*                           Popup;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULWorldSystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ResultProto_C_CallbackGoTitle) == 0x000008, "Wrong alignment on UIW_ResultProto_C_CallbackGoTitle");
static_assert(sizeof(UIW_ResultProto_C_CallbackGoTitle) == 0x000028, "Wrong size on UIW_ResultProto_C_CallbackGoTitle");
static_assert(offsetof(UIW_ResultProto_C_CallbackGoTitle, Popup) == 0x000000, "Member 'UIW_ResultProto_C_CallbackGoTitle::Popup' has a wrong offset!");
static_assert(offsetof(UIW_ResultProto_C_CallbackGoTitle, BtnKey) == 0x000008, "Member 'UIW_ResultProto_C_CallbackGoTitle::BtnKey' has a wrong offset!");
static_assert(offsetof(UIW_ResultProto_C_CallbackGoTitle, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'UIW_ResultProto_C_CallbackGoTitle::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ResultProto_C_CallbackGoTitle, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'UIW_ResultProto_C_CallbackGoTitle::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ResultProto_C_CallbackGoTitle, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000020, "Member 'UIW_ResultProto_C_CallbackGoTitle::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");

}

