#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HUD_Gauge_HP

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_HUD_Gauge_HP.UIW_HUD_Gauge_HP_C
// 0x0048 (0x02F0 - 0x02A8)
class UUIW_HUD_Gauge_HP_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUIW_HUD_GaugeFX_C*                     Fx;                                                // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FX_Gradation;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Gauge_Fx_Paralyze_C*               FX_ParalyzeGroup;                                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HP;                                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RegainHP;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         InitSize;                                          // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALNPCCharacter*                         OwnerNPC;                                          // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsParalyzeDestructing;                             // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsParalyzeTime;                                    // 0x02E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UIW_HUD_Gauge_HP(int32 EntryPoint);
	void Construct();
	void OnInitialized();
	void Destruct();
	void PreConstruct(bool IsDesignTime);
	void InitGauge();
	void SetGaugeColor(const struct FLinearColor& HPColor, const struct FLinearColor& FXGradationColor);
	void SetParalyze(class ALNPCCharacter* NPC, bool IsAbleParalyze);
	void SetGroggy();
	void ResetParalyze();
	void RefreshGauge(class ULStatComponent* StatComponent, bool NeedFxUpdate, bool NeedEffectUpdate, float CurrentPercent, bool NeedGaugeTween, float* GaugeSizeX);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_HUD_Gauge_HP_C">();
	}
	static class UUIW_HUD_Gauge_HP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_HUD_Gauge_HP_C>();
	}
};
static_assert(alignof(UUIW_HUD_Gauge_HP_C) == 0x000008, "Wrong alignment on UUIW_HUD_Gauge_HP_C");
static_assert(sizeof(UUIW_HUD_Gauge_HP_C) == 0x0002F0, "Wrong size on UUIW_HUD_Gauge_HP_C");
static_assert(offsetof(UUIW_HUD_Gauge_HP_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_HUD_Gauge_HP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_HP_C, Fx) == 0x0002B0, "Member 'UUIW_HUD_Gauge_HP_C::Fx' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_HP_C, FX_Gradation) == 0x0002B8, "Member 'UUIW_HUD_Gauge_HP_C::FX_Gradation' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_HP_C, FX_ParalyzeGroup) == 0x0002C0, "Member 'UUIW_HUD_Gauge_HP_C::FX_ParalyzeGroup' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_HP_C, HP) == 0x0002C8, "Member 'UUIW_HUD_Gauge_HP_C::HP' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_HP_C, RegainHP) == 0x0002D0, "Member 'UUIW_HUD_Gauge_HP_C::RegainHP' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_HP_C, InitSize) == 0x0002D8, "Member 'UUIW_HUD_Gauge_HP_C::InitSize' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_HP_C, OwnerNPC) == 0x0002E0, "Member 'UUIW_HUD_Gauge_HP_C::OwnerNPC' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_HP_C, IsParalyzeDestructing) == 0x0002E8, "Member 'UUIW_HUD_Gauge_HP_C::IsParalyzeDestructing' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_HP_C, IsParalyzeTime) == 0x0002E9, "Member 'UUIW_HUD_Gauge_HP_C::IsParalyzeTime' has a wrong offset!");

}

