#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_OnOffButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UIW_OnOffButton.UIW_OnOffButton_C.OnToggleStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UIW_OnOffButton_C_OnToggleStateChanged__DelegateSignature final
{
public:
	bool                                          IsSelected_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_OnOffButton_C_OnToggleStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on UIW_OnOffButton_C_OnToggleStateChanged__DelegateSignature");
static_assert(sizeof(UIW_OnOffButton_C_OnToggleStateChanged__DelegateSignature) == 0x000001, "Wrong size on UIW_OnOffButton_C_OnToggleStateChanged__DelegateSignature");
static_assert(offsetof(UIW_OnOffButton_C_OnToggleStateChanged__DelegateSignature, IsSelected_0) == 0x000000, "Member 'UIW_OnOffButton_C_OnToggleStateChanged__DelegateSignature::IsSelected_0' has a wrong offset!");

// Function UIW_OnOffButton.UIW_OnOffButton_C.ExecuteUbergraph_UIW_OnOffButton
// 0x0258 (0x0258 - 0x0000)
struct UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0014(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x001C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_4;                              // 0x0024(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_5;                              // 0x002C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_6;                              // 0x0034(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_7;                              // 0x003C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Map_Find_Value;                           // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0058(0x0028)()
	struct FLinearColor                           CallFunc_Map_Find_Value_1;                         // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Map_Find_Value_2;                         // 0x0094(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x00A8(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x00D0(0x0028)()
	struct FLinearColor                           CallFunc_Map_Find_Value_3;                         // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_3;                   // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Map_Find_Value_4;                         // 0x010C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_4;                   // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0120(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0148(0x0028)()
	struct FLinearColor                           CallFunc_Map_Find_Value_5;                         // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_5;                   // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Map_Find_Value_6;                         // 0x0184(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_6;                   // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x0198(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_6;                    // 0x01C0(0x0028)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x01E8(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x0200(0x0018)()
	struct FLinearColor                           CallFunc_Map_Find_Value_7;                         // 0x0218(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_7;                   // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_7;                    // 0x0230(0x0028)()
};
static_assert(alignof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton) == 0x000008, "Wrong alignment on UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton");
static_assert(sizeof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton) == 0x000258, "Wrong size on UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, EntryPoint) == 0x000000, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, Temp_name_Variable) == 0x000004, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, Temp_name_Variable_1) == 0x00000C, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, Temp_name_Variable_2) == 0x000014, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, Temp_name_Variable_3) == 0x00001C, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, Temp_name_Variable_4) == 0x000024, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, Temp_name_Variable_5) == 0x00002C, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::Temp_name_Variable_5' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, Temp_name_Variable_6) == 0x000034, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::Temp_name_Variable_6' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, Temp_name_Variable_7) == 0x00003C, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::Temp_name_Variable_7' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, CallFunc_Map_Find_Value) == 0x000044, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, CallFunc_Map_Find_ReturnValue) == 0x000054, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, K2Node_MakeStruct_SlateColor) == 0x000058, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, CallFunc_Map_Find_Value_1) == 0x000080, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, CallFunc_Map_Find_ReturnValue_1) == 0x000090, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, CallFunc_Map_Find_Value_2) == 0x000094, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, CallFunc_Map_Find_ReturnValue_2) == 0x0000A4, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, K2Node_MakeStruct_SlateColor_1) == 0x0000A8, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, K2Node_MakeStruct_SlateColor_2) == 0x0000D0, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, CallFunc_Map_Find_Value_3) == 0x0000F8, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::CallFunc_Map_Find_Value_3' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, CallFunc_Map_Find_ReturnValue_3) == 0x000108, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::CallFunc_Map_Find_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, CallFunc_Map_Find_Value_4) == 0x00010C, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::CallFunc_Map_Find_Value_4' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, CallFunc_Map_Find_ReturnValue_4) == 0x00011C, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::CallFunc_Map_Find_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, K2Node_MakeStruct_SlateColor_3) == 0x000120, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, K2Node_MakeStruct_SlateColor_4) == 0x000148, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, CallFunc_Map_Find_Value_5) == 0x000170, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::CallFunc_Map_Find_Value_5' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, CallFunc_Map_Find_ReturnValue_5) == 0x000180, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::CallFunc_Map_Find_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, CallFunc_Map_Find_Value_6) == 0x000184, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::CallFunc_Map_Find_Value_6' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, CallFunc_Map_Find_ReturnValue_6) == 0x000194, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::CallFunc_Map_Find_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, K2Node_MakeStruct_SlateColor_5) == 0x000198, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::K2Node_MakeStruct_SlateColor_5' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, K2Node_MakeStruct_SlateColor_6) == 0x0001C0, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::K2Node_MakeStruct_SlateColor_6' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, CallFunc_GetGameStrWithName_ReturnValue) == 0x0001E8, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, CallFunc_GetGameStrWithName_ReturnValue_1) == 0x000200, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::CallFunc_GetGameStrWithName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, CallFunc_Map_Find_Value_7) == 0x000218, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::CallFunc_Map_Find_Value_7' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, CallFunc_Map_Find_ReturnValue_7) == 0x000228, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::CallFunc_Map_Find_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton, K2Node_MakeStruct_SlateColor_7) == 0x000230, "Member 'UIW_OnOffButton_C_ExecuteUbergraph_UIW_OnOffButton::K2Node_MakeStruct_SlateColor_7' has a wrong offset!");

// Function UIW_OnOffButton.UIW_OnOffButton_C.GetToggle
// 0x0001 (0x0001 - 0x0000)
struct UIW_OnOffButton_C_GetToggle final
{
public:
	bool                                          IsSelected_0;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_OnOffButton_C_GetToggle) == 0x000001, "Wrong alignment on UIW_OnOffButton_C_GetToggle");
static_assert(sizeof(UIW_OnOffButton_C_GetToggle) == 0x000001, "Wrong size on UIW_OnOffButton_C_GetToggle");
static_assert(offsetof(UIW_OnOffButton_C_GetToggle, IsSelected_0) == 0x000000, "Member 'UIW_OnOffButton_C_GetToggle::IsSelected_0' has a wrong offset!");

// Function UIW_OnOffButton.UIW_OnOffButton_C.SetToggle
// 0x0118 (0x0118 - 0x0000)
struct UIW_OnOffButton_C_SetToggle final
{
public:
	bool                                          IsSelected_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0014(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_3;                              // 0x001C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Map_Find_Value;                           // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Map_Find_Value_1;                         // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0050(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0078(0x0028)()
	struct FLinearColor                           CallFunc_Map_Find_Value_2;                         // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Map_Find_Value_3;                         // 0x00B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_3;                   // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x00C8(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x00F0(0x0028)()
};
static_assert(alignof(UIW_OnOffButton_C_SetToggle) == 0x000008, "Wrong alignment on UIW_OnOffButton_C_SetToggle");
static_assert(sizeof(UIW_OnOffButton_C_SetToggle) == 0x000118, "Wrong size on UIW_OnOffButton_C_SetToggle");
static_assert(offsetof(UIW_OnOffButton_C_SetToggle, IsSelected_0) == 0x000000, "Member 'UIW_OnOffButton_C_SetToggle::IsSelected_0' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_SetToggle, Temp_name_Variable) == 0x000004, "Member 'UIW_OnOffButton_C_SetToggle::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_SetToggle, Temp_name_Variable_1) == 0x00000C, "Member 'UIW_OnOffButton_C_SetToggle::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_SetToggle, Temp_name_Variable_2) == 0x000014, "Member 'UIW_OnOffButton_C_SetToggle::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_SetToggle, Temp_name_Variable_3) == 0x00001C, "Member 'UIW_OnOffButton_C_SetToggle::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_SetToggle, CallFunc_Map_Find_Value) == 0x000024, "Member 'UIW_OnOffButton_C_SetToggle::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_SetToggle, CallFunc_Map_Find_ReturnValue) == 0x000034, "Member 'UIW_OnOffButton_C_SetToggle::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_SetToggle, CallFunc_Map_Find_Value_1) == 0x000038, "Member 'UIW_OnOffButton_C_SetToggle::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_SetToggle, CallFunc_Map_Find_ReturnValue_1) == 0x000048, "Member 'UIW_OnOffButton_C_SetToggle::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_SetToggle, K2Node_MakeStruct_SlateColor) == 0x000050, "Member 'UIW_OnOffButton_C_SetToggle::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_SetToggle, K2Node_MakeStruct_SlateColor_1) == 0x000078, "Member 'UIW_OnOffButton_C_SetToggle::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_SetToggle, CallFunc_Map_Find_Value_2) == 0x0000A0, "Member 'UIW_OnOffButton_C_SetToggle::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_SetToggle, CallFunc_Map_Find_ReturnValue_2) == 0x0000B0, "Member 'UIW_OnOffButton_C_SetToggle::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_SetToggle, CallFunc_Map_Find_Value_3) == 0x0000B4, "Member 'UIW_OnOffButton_C_SetToggle::CallFunc_Map_Find_Value_3' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_SetToggle, CallFunc_Map_Find_ReturnValue_3) == 0x0000C4, "Member 'UIW_OnOffButton_C_SetToggle::CallFunc_Map_Find_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_SetToggle, K2Node_MakeStruct_SlateColor_2) == 0x0000C8, "Member 'UIW_OnOffButton_C_SetToggle::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(UIW_OnOffButton_C_SetToggle, K2Node_MakeStruct_SlateColor_3) == 0x0000F0, "Member 'UIW_OnOffButton_C_SetToggle::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");

// Function UIW_OnOffButton.UIW_OnOffButton_C.ReversedToggle
// 0x0001 (0x0001 - 0x0000)
struct UIW_OnOffButton_C_ReversedToggle final
{
public:
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_OnOffButton_C_ReversedToggle) == 0x000001, "Wrong alignment on UIW_OnOffButton_C_ReversedToggle");
static_assert(sizeof(UIW_OnOffButton_C_ReversedToggle) == 0x000001, "Wrong size on UIW_OnOffButton_C_ReversedToggle");
static_assert(offsetof(UIW_OnOffButton_C_ReversedToggle, CallFunc_Not_PreBool_ReturnValue) == 0x000000, "Member 'UIW_OnOffButton_C_ReversedToggle::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function UIW_OnOffButton.UIW_OnOffButton_C.ReturnToggle
// 0x0001 (0x0001 - 0x0000)
struct UIW_OnOffButton_C_ReturnToggle final
{
public:
	bool                                          IsSelected_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_OnOffButton_C_ReturnToggle) == 0x000001, "Wrong alignment on UIW_OnOffButton_C_ReturnToggle");
static_assert(sizeof(UIW_OnOffButton_C_ReturnToggle) == 0x000001, "Wrong size on UIW_OnOffButton_C_ReturnToggle");
static_assert(offsetof(UIW_OnOffButton_C_ReturnToggle, IsSelected_0) == 0x000000, "Member 'UIW_OnOffButton_C_ReturnToggle::IsSelected_0' has a wrong offset!");

}

