#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Module_TextList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UIW_Popup_Module_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Module_TextList.UIW_Module_TextList_C
// 0x0098 (0x0348 - 0x02B0)
class UUIW_Module_TextList_C final : public UUIW_Popup_Module_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUIW_Module_Text_C*                     ItemText_1;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Module_Text_C*                     ItemText_2;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Module_Text_C*                     ItemText_3;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Module_Text_C*                     ItemText_4;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Module_Text_C*                     ItemText_5;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Module_Text_C*                     ItemText_6;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Module_Text_C*                     ItemText_7;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Module_Text_C*                     ItemText_8;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Module_Text_C*                     ItemText_9;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Module_Text_C*                     ItemText_10;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Module_Text_C*                     ItemText_11;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Module_Text_C*                     ItemText_12;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ListText;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UUIW_Module_Text_C*>             ItemArr;                                           // 0x0320(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          IsEnableSelect;                                    // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 SelectedDataStr;                                   // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_Module_TextList(int32 EntryPoint);
	void OnFocused(class UUIW_Module_Text_C* SelfObj, bool IsFocused);
	void Construct();
	void SetListItem(TArray<class FText>& NameArr);
	void SetListData(TArray<class FString>& StrArr, bool IsEnableSelect_0);
	void SetSelect();
	struct FEventReply FocusManage(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Module_TextList_C">();
	}
	static class UUIW_Module_TextList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Module_TextList_C>();
	}
};
static_assert(alignof(UUIW_Module_TextList_C) == 0x000008, "Wrong alignment on UUIW_Module_TextList_C");
static_assert(sizeof(UUIW_Module_TextList_C) == 0x000348, "Wrong size on UUIW_Module_TextList_C");
static_assert(offsetof(UUIW_Module_TextList_C, UberGraphFrame) == 0x0002B0, "Member 'UUIW_Module_TextList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_Module_TextList_C, ItemText_1) == 0x0002B8, "Member 'UUIW_Module_TextList_C::ItemText_1' has a wrong offset!");
static_assert(offsetof(UUIW_Module_TextList_C, ItemText_2) == 0x0002C0, "Member 'UUIW_Module_TextList_C::ItemText_2' has a wrong offset!");
static_assert(offsetof(UUIW_Module_TextList_C, ItemText_3) == 0x0002C8, "Member 'UUIW_Module_TextList_C::ItemText_3' has a wrong offset!");
static_assert(offsetof(UUIW_Module_TextList_C, ItemText_4) == 0x0002D0, "Member 'UUIW_Module_TextList_C::ItemText_4' has a wrong offset!");
static_assert(offsetof(UUIW_Module_TextList_C, ItemText_5) == 0x0002D8, "Member 'UUIW_Module_TextList_C::ItemText_5' has a wrong offset!");
static_assert(offsetof(UUIW_Module_TextList_C, ItemText_6) == 0x0002E0, "Member 'UUIW_Module_TextList_C::ItemText_6' has a wrong offset!");
static_assert(offsetof(UUIW_Module_TextList_C, ItemText_7) == 0x0002E8, "Member 'UUIW_Module_TextList_C::ItemText_7' has a wrong offset!");
static_assert(offsetof(UUIW_Module_TextList_C, ItemText_8) == 0x0002F0, "Member 'UUIW_Module_TextList_C::ItemText_8' has a wrong offset!");
static_assert(offsetof(UUIW_Module_TextList_C, ItemText_9) == 0x0002F8, "Member 'UUIW_Module_TextList_C::ItemText_9' has a wrong offset!");
static_assert(offsetof(UUIW_Module_TextList_C, ItemText_10) == 0x000300, "Member 'UUIW_Module_TextList_C::ItemText_10' has a wrong offset!");
static_assert(offsetof(UUIW_Module_TextList_C, ItemText_11) == 0x000308, "Member 'UUIW_Module_TextList_C::ItemText_11' has a wrong offset!");
static_assert(offsetof(UUIW_Module_TextList_C, ItemText_12) == 0x000310, "Member 'UUIW_Module_TextList_C::ItemText_12' has a wrong offset!");
static_assert(offsetof(UUIW_Module_TextList_C, ListText) == 0x000318, "Member 'UUIW_Module_TextList_C::ListText' has a wrong offset!");
static_assert(offsetof(UUIW_Module_TextList_C, ItemArr) == 0x000320, "Member 'UUIW_Module_TextList_C::ItemArr' has a wrong offset!");
static_assert(offsetof(UUIW_Module_TextList_C, IsEnableSelect) == 0x000330, "Member 'UUIW_Module_TextList_C::IsEnableSelect' has a wrong offset!");
static_assert(offsetof(UUIW_Module_TextList_C, SelectedDataStr) == 0x000338, "Member 'UUIW_Module_TextList_C::SelectedDataStr' has a wrong offset!");

}

