#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_EULA

#include "Basic.hpp"


namespace SDK::Params
{

// Function UIW_EULA.UIW_EULA_C.ActiveDispatcher__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_EULA_C_ActiveDispatcher__DelegateSignature final
{
public:
	int32                                         BtnIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_EULA_C_ActiveDispatcher__DelegateSignature) == 0x000004, "Wrong alignment on UIW_EULA_C_ActiveDispatcher__DelegateSignature");
static_assert(sizeof(UIW_EULA_C_ActiveDispatcher__DelegateSignature) == 0x000004, "Wrong size on UIW_EULA_C_ActiveDispatcher__DelegateSignature");
static_assert(offsetof(UIW_EULA_C_ActiveDispatcher__DelegateSignature, BtnIndex) == 0x000000, "Member 'UIW_EULA_C_ActiveDispatcher__DelegateSignature::BtnIndex' has a wrong offset!");

// Function UIW_EULA.UIW_EULA_C.ExecuteUbergraph_UIW_EULA
// 0x0068 (0x0068 - 0x0000)
struct UIW_EULA_C_ExecuteUbergraph_UIW_EULA final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0008(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x0020(0x0018)()
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_2;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_1;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
	float                                         K2Node_ComponentBoundEvent_Delta;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_EULA_C_ExecuteUbergraph_UIW_EULA) == 0x000008, "Wrong alignment on UIW_EULA_C_ExecuteUbergraph_UIW_EULA");
static_assert(sizeof(UIW_EULA_C_ExecuteUbergraph_UIW_EULA) == 0x000068, "Wrong size on UIW_EULA_C_ExecuteUbergraph_UIW_EULA");
static_assert(offsetof(UIW_EULA_C_ExecuteUbergraph_UIW_EULA, EntryPoint) == 0x000000, "Member 'UIW_EULA_C_ExecuteUbergraph_UIW_EULA::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_EULA_C_ExecuteUbergraph_UIW_EULA, CallFunc_GetGameStrWithName_ReturnValue) == 0x000008, "Member 'UIW_EULA_C_ExecuteUbergraph_UIW_EULA::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_EULA_C_ExecuteUbergraph_UIW_EULA, CallFunc_GetGameStrWithName_ReturnValue_1) == 0x000020, "Member 'UIW_EULA_C_ExecuteUbergraph_UIW_EULA::CallFunc_GetGameStrWithName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_EULA_C_ExecuteUbergraph_UIW_EULA, K2Node_ComponentBoundEvent_BtnKey_2) == 0x000038, "Member 'UIW_EULA_C_ExecuteUbergraph_UIW_EULA::K2Node_ComponentBoundEvent_BtnKey_2' has a wrong offset!");
static_assert(offsetof(UIW_EULA_C_ExecuteUbergraph_UIW_EULA, K2Node_ComponentBoundEvent_BtnKey_1) == 0x000040, "Member 'UIW_EULA_C_ExecuteUbergraph_UIW_EULA::K2Node_ComponentBoundEvent_BtnKey_1' has a wrong offset!");
static_assert(offsetof(UIW_EULA_C_ExecuteUbergraph_UIW_EULA, K2Node_ComponentBoundEvent_BtnKey) == 0x000048, "Member 'UIW_EULA_C_ExecuteUbergraph_UIW_EULA::K2Node_ComponentBoundEvent_BtnKey' has a wrong offset!");
static_assert(offsetof(UIW_EULA_C_ExecuteUbergraph_UIW_EULA, K2Node_MakeArray_Array) == 0x000050, "Member 'UIW_EULA_C_ExecuteUbergraph_UIW_EULA::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIW_EULA_C_ExecuteUbergraph_UIW_EULA, K2Node_ComponentBoundEvent_Delta) == 0x000060, "Member 'UIW_EULA_C_ExecuteUbergraph_UIW_EULA::K2Node_ComponentBoundEvent_Delta' has a wrong offset!");

// Function UIW_EULA.UIW_EULA_C.BndEvt__UIW_EULA_Btn_Scroll_K2Node_ComponentBoundEvent_3_OnScroll__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_EULA_C_BndEvt__UIW_EULA_Btn_Scroll_K2Node_ComponentBoundEvent_3_OnScroll__DelegateSignature final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_EULA_C_BndEvt__UIW_EULA_Btn_Scroll_K2Node_ComponentBoundEvent_3_OnScroll__DelegateSignature) == 0x000004, "Wrong alignment on UIW_EULA_C_BndEvt__UIW_EULA_Btn_Scroll_K2Node_ComponentBoundEvent_3_OnScroll__DelegateSignature");
static_assert(sizeof(UIW_EULA_C_BndEvt__UIW_EULA_Btn_Scroll_K2Node_ComponentBoundEvent_3_OnScroll__DelegateSignature) == 0x000004, "Wrong size on UIW_EULA_C_BndEvt__UIW_EULA_Btn_Scroll_K2Node_ComponentBoundEvent_3_OnScroll__DelegateSignature");
static_assert(offsetof(UIW_EULA_C_BndEvt__UIW_EULA_Btn_Scroll_K2Node_ComponentBoundEvent_3_OnScroll__DelegateSignature, Delta) == 0x000000, "Member 'UIW_EULA_C_BndEvt__UIW_EULA_Btn_Scroll_K2Node_ComponentBoundEvent_3_OnScroll__DelegateSignature::Delta' has a wrong offset!");

// Function UIW_EULA.UIW_EULA_C.BndEvt__UIW_EULA_Btn_ChangeLanguage_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_EULA_C_BndEvt__UIW_EULA_Btn_ChangeLanguage_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_EULA_C_BndEvt__UIW_EULA_Btn_ChangeLanguage_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_EULA_C_BndEvt__UIW_EULA_Btn_ChangeLanguage_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature");
static_assert(sizeof(UIW_EULA_C_BndEvt__UIW_EULA_Btn_ChangeLanguage_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_EULA_C_BndEvt__UIW_EULA_Btn_ChangeLanguage_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature");
static_assert(offsetof(UIW_EULA_C_BndEvt__UIW_EULA_Btn_ChangeLanguage_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_EULA_C_BndEvt__UIW_EULA_Btn_ChangeLanguage_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_EULA.UIW_EULA_C.BndEvt__UIW_EULA_Btn_Decline_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_EULA_C_BndEvt__UIW_EULA_Btn_Decline_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_EULA_C_BndEvt__UIW_EULA_Btn_Decline_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_EULA_C_BndEvt__UIW_EULA_Btn_Decline_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature");
static_assert(sizeof(UIW_EULA_C_BndEvt__UIW_EULA_Btn_Decline_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_EULA_C_BndEvt__UIW_EULA_Btn_Decline_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature");
static_assert(offsetof(UIW_EULA_C_BndEvt__UIW_EULA_Btn_Decline_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_EULA_C_BndEvt__UIW_EULA_Btn_Decline_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_EULA.UIW_EULA_C.BndEvt__UIW_EULA_Btn_Agree_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_EULA_C_BndEvt__UIW_EULA_Btn_Agree_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_EULA_C_BndEvt__UIW_EULA_Btn_Agree_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_EULA_C_BndEvt__UIW_EULA_Btn_Agree_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature");
static_assert(sizeof(UIW_EULA_C_BndEvt__UIW_EULA_Btn_Agree_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_EULA_C_BndEvt__UIW_EULA_Btn_Agree_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature");
static_assert(offsetof(UIW_EULA_C_BndEvt__UIW_EULA_Btn_Agree_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_EULA_C_BndEvt__UIW_EULA_Btn_Agree_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

}

