#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Record_ListItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UIW_Record_ListItem.UIW_Record_ListItem_C.ExecuteUbergraph_UIW_Record_ListItem
// 0x0218 (0x0218 - 0x0000)
struct UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UListViewBase*                          CallFunc_GetOwningListView_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UListView*                              K2Node_DynamicCast_AsList_View;                    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool IsPlayStart, class FName RecordCodeName)> K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0038(0x0070)(ConstParm)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00A8(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x00E0(0x0070)(ConstParm)
	struct FItemCommonInfoPtr                     CallFunc_FindItemCommonInfoByNameBP_ReturnValue;   // 0x0150(0x0008)(NoDestructor)
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_GetImageResource_ReturnValue;             // 0x0160(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class UUIBP_ListData_Default_C*               K2Node_DynamicCast_AsUIBP_List_Data_Default;       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalTextItemNameLocalize_ReturnValue; // 0x01A0(0x0018)()
	class UUIW_Record_C*                          K2Node_DynamicCast_AsUIW_Record;                   // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C2[0x6];                                      // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULSoundSystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRecord_CanAquireHumanity_ReturnValue;   // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNotiRecord_ReturnValue;                 // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D2[0x6];                                      // 0x01D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULSoundSystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULSoundSystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRecordDuration_ReturnValue;            // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_MakeTimespan_ReturnValue;                 // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_AsTimespan_Timespan_ReturnValue;          // 0x0200(0x0018)()
};
static_assert(alignof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem) == 0x000008, "Wrong alignment on UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem");
static_assert(sizeof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem) == 0x000218, "Wrong size on UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, EntryPoint) == 0x000000, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, CallFunc_GetOwningListView_ReturnValue) == 0x000008, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::CallFunc_GetOwningListView_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, K2Node_Event_bIsSelected) == 0x000010, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, K2Node_DynamicCast_AsList_View) == 0x000018, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::K2Node_DynamicCast_AsList_View' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, K2Node_Event_MouseEvent) == 0x000038, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, K2Node_Event_MyGeometry) == 0x0000A8, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, K2Node_Event_MouseEvent_1) == 0x0000E0, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, CallFunc_FindItemCommonInfoByNameBP_ReturnValue) == 0x000150, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::CallFunc_FindItemCommonInfoByNameBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, K2Node_Event_ListItemObject) == 0x000158, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, CallFunc_GetImageResource_ReturnValue) == 0x000160, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::CallFunc_GetImageResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, K2Node_DynamicCast_AsUIBP_List_Data_Default) == 0x000188, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::K2Node_DynamicCast_AsUIBP_List_Data_Default' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, K2Node_DynamicCast_bSuccess_1) == 0x000190, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, CallFunc_GetOuterObject_ReturnValue) == 0x000198, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, CallFunc_GetLocalTextItemNameLocalize_ReturnValue) == 0x0001A0, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::CallFunc_GetLocalTextItemNameLocalize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, K2Node_DynamicCast_AsUIW_Record) == 0x0001B8, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::K2Node_DynamicCast_AsUIW_Record' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, K2Node_DynamicCast_bSuccess_2) == 0x0001C0, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, K2Node_Event_bIsExpanded) == 0x0001C1, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0001C8, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, CallFunc_IsRecord_CanAquireHumanity_ReturnValue) == 0x0001D0, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::CallFunc_IsRecord_CanAquireHumanity_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, CallFunc_IsNotiRecord_ReturnValue) == 0x0001D1, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::CallFunc_IsNotiRecord_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0001D8, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x0001E0, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0001E8, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, CallFunc_GetRecordDuration_ReturnValue) == 0x0001EC, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::CallFunc_GetRecordDuration_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, CallFunc_FTrunc_ReturnValue) == 0x0001F0, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, CallFunc_MakeTimespan_ReturnValue) == 0x0001F8, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::CallFunc_MakeTimespan_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem, CallFunc_AsTimespan_Timespan_ReturnValue) == 0x000200, "Member 'UIW_Record_ListItem_C_ExecuteUbergraph_UIW_Record_ListItem::CallFunc_AsTimespan_Timespan_ReturnValue' has a wrong offset!");

// Function UIW_Record_ListItem.UIW_Record_ListItem_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_Record_ListItem_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Record_ListItem_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on UIW_Record_ListItem_C_BP_OnItemSelectionChanged");
static_assert(sizeof(UIW_Record_ListItem_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on UIW_Record_ListItem_C_BP_OnItemSelectionChanged");
static_assert(offsetof(UIW_Record_ListItem_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'UIW_Record_ListItem_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function UIW_Record_ListItem.UIW_Record_ListItem_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct UIW_Record_ListItem_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIW_Record_ListItem_C_OnMouseLeave) == 0x000008, "Wrong alignment on UIW_Record_ListItem_C_OnMouseLeave");
static_assert(sizeof(UIW_Record_ListItem_C_OnMouseLeave) == 0x000070, "Wrong size on UIW_Record_ListItem_C_OnMouseLeave");
static_assert(offsetof(UIW_Record_ListItem_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'UIW_Record_ListItem_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function UIW_Record_ListItem.UIW_Record_ListItem_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct UIW_Record_ListItem_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIW_Record_ListItem_C_OnMouseEnter) == 0x000008, "Wrong alignment on UIW_Record_ListItem_C_OnMouseEnter");
static_assert(sizeof(UIW_Record_ListItem_C_OnMouseEnter) == 0x0000A8, "Wrong size on UIW_Record_ListItem_C_OnMouseEnter");
static_assert(offsetof(UIW_Record_ListItem_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'UIW_Record_ListItem_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'UIW_Record_ListItem_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function UIW_Record_ListItem.UIW_Record_ListItem_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct UIW_Record_ListItem_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Record_ListItem_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on UIW_Record_ListItem_C_OnListItemObjectSet");
static_assert(sizeof(UIW_Record_ListItem_C_OnListItemObjectSet) == 0x000008, "Wrong size on UIW_Record_ListItem_C_OnListItemObjectSet");
static_assert(offsetof(UIW_Record_ListItem_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'UIW_Record_ListItem_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function UIW_Record_ListItem.UIW_Record_ListItem_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_Record_ListItem_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Record_ListItem_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on UIW_Record_ListItem_C_BP_OnItemExpansionChanged");
static_assert(sizeof(UIW_Record_ListItem_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on UIW_Record_ListItem_C_BP_OnItemExpansionChanged");
static_assert(offsetof(UIW_Record_ListItem_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'UIW_Record_ListItem_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function UIW_Record_ListItem.UIW_Record_ListItem_C.SetMoveFocusEffect
// 0x0048 (0x0048 - 0x0000)
struct UIW_Record_ListItem_C_SetMoveFocusEffect final
{
public:
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UListViewBase*                          CallFunc_GetOwningListView_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Window_C*                          CallFunc_GetTopWindow_Window;                      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UListView*                              K2Node_DynamicCast_AsList_View;                    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Record_C*                          K2Node_DynamicCast_AsUIW_Record;                   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget_1;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_MoveFocusOnList_SelectedWidget;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Record_ListItem_C_SetMoveFocusEffect) == 0x000008, "Wrong alignment on UIW_Record_ListItem_C_SetMoveFocusEffect");
static_assert(sizeof(UIW_Record_ListItem_C_SetMoveFocusEffect) == 0x000048, "Wrong size on UIW_Record_ListItem_C_SetMoveFocusEffect");
static_assert(offsetof(UIW_Record_ListItem_C_SetMoveFocusEffect, CallFunc_GetMainWidget_MainWidget) == 0x000000, "Member 'UIW_Record_ListItem_C_SetMoveFocusEffect::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_SetMoveFocusEffect, CallFunc_GetOwningListView_ReturnValue) == 0x000008, "Member 'UIW_Record_ListItem_C_SetMoveFocusEffect::CallFunc_GetOwningListView_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_SetMoveFocusEffect, CallFunc_GetTopWindow_Window) == 0x000010, "Member 'UIW_Record_ListItem_C_SetMoveFocusEffect::CallFunc_GetTopWindow_Window' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_SetMoveFocusEffect, K2Node_DynamicCast_AsList_View) == 0x000018, "Member 'UIW_Record_ListItem_C_SetMoveFocusEffect::K2Node_DynamicCast_AsList_View' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_SetMoveFocusEffect, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'UIW_Record_ListItem_C_SetMoveFocusEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_SetMoveFocusEffect, K2Node_DynamicCast_AsUIW_Record) == 0x000028, "Member 'UIW_Record_ListItem_C_SetMoveFocusEffect::K2Node_DynamicCast_AsUIW_Record' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_SetMoveFocusEffect, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'UIW_Record_ListItem_C_SetMoveFocusEffect::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_SetMoveFocusEffect, CallFunc_GetMainWidget_MainWidget_1) == 0x000038, "Member 'UIW_Record_ListItem_C_SetMoveFocusEffect::CallFunc_GetMainWidget_MainWidget_1' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_SetMoveFocusEffect, CallFunc_MoveFocusOnList_SelectedWidget) == 0x000040, "Member 'UIW_Record_ListItem_C_SetMoveFocusEffect::CallFunc_MoveFocusOnList_SelectedWidget' has a wrong offset!");

// Function UIW_Record_ListItem.UIW_Record_ListItem_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct UIW_Record_ListItem_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(UIW_Record_ListItem_C_OnFocusReceived) == 0x000008, "Wrong alignment on UIW_Record_ListItem_C_OnFocusReceived");
static_assert(sizeof(UIW_Record_ListItem_C_OnFocusReceived) == 0x0001B0, "Wrong size on UIW_Record_ListItem_C_OnFocusReceived");
static_assert(offsetof(UIW_Record_ListItem_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UIW_Record_ListItem_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UIW_Record_ListItem_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UIW_Record_ListItem_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_OnFocusReceived, K2Node_MakeStruct_EventReply) == 0x0000F8, "Member 'UIW_Record_ListItem_C_OnFocusReceived::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function UIW_Record_ListItem.UIW_Record_ListItem_C.SetPlaying
// 0x0001 (0x0001 - 0x0000)
struct UIW_Record_ListItem_C_SetPlaying final
{
public:
	bool                                          IsPlaying;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Record_ListItem_C_SetPlaying) == 0x000001, "Wrong alignment on UIW_Record_ListItem_C_SetPlaying");
static_assert(sizeof(UIW_Record_ListItem_C_SetPlaying) == 0x000001, "Wrong size on UIW_Record_ListItem_C_SetPlaying");
static_assert(offsetof(UIW_Record_ListItem_C_SetPlaying, IsPlaying) == 0x000000, "Member 'UIW_Record_ListItem_C_SetPlaying::IsPlaying' has a wrong offset!");

// Function UIW_Record_ListItem.UIW_Record_ListItem_C.OnPlay
// 0x0028 (0x0028 - 0x0000)
struct UIW_Record_ListItem_C_OnPlay final
{
public:
	bool                                          IsPlaying;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CodeName;                                          // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_Default_C*               K2Node_DynamicCast_AsUIBP_List_Data_Default;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Record_ListItem_C_OnPlay) == 0x000008, "Wrong alignment on UIW_Record_ListItem_C_OnPlay");
static_assert(sizeof(UIW_Record_ListItem_C_OnPlay) == 0x000028, "Wrong size on UIW_Record_ListItem_C_OnPlay");
static_assert(offsetof(UIW_Record_ListItem_C_OnPlay, IsPlaying) == 0x000000, "Member 'UIW_Record_ListItem_C_OnPlay::IsPlaying' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_OnPlay, CodeName) == 0x000004, "Member 'UIW_Record_ListItem_C_OnPlay::CodeName' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_OnPlay, CallFunc_GetListItemObject_ReturnValue) == 0x000010, "Member 'UIW_Record_ListItem_C_OnPlay::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_OnPlay, K2Node_DynamicCast_AsUIBP_List_Data_Default) == 0x000018, "Member 'UIW_Record_ListItem_C_OnPlay::K2Node_DynamicCast_AsUIBP_List_Data_Default' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_OnPlay, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'UIW_Record_ListItem_C_OnPlay::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_OnPlay, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000021, "Member 'UIW_Record_ListItem_C_OnPlay::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function UIW_Record_ListItem.UIW_Record_ListItem_C.SetTextColor
// 0x00C8 (0x00C8 - 0x0000)
struct UIW_Record_ListItem_C_SetTextColor final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0028(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0050(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0078(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x00A0(0x0028)()
};
static_assert(alignof(UIW_Record_ListItem_C_SetTextColor) == 0x000008, "Wrong alignment on UIW_Record_ListItem_C_SetTextColor");
static_assert(sizeof(UIW_Record_ListItem_C_SetTextColor) == 0x0000C8, "Wrong size on UIW_Record_ListItem_C_SetTextColor");
static_assert(offsetof(UIW_Record_ListItem_C_SetTextColor, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'UIW_Record_ListItem_C_SetTextColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_SetTextColor, K2Node_MakeStruct_SlateColor_1) == 0x000028, "Member 'UIW_Record_ListItem_C_SetTextColor::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UIW_Record_ListItem_C_SetTextColor, K2Node_MakeStruct_SlateColor_2) == 0x000050, "Member 'UIW_Record_ListItem_C_SetTextColor::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
