#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Lie_Progress_Low

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UIW_Lie_Progress_Low.UIW_Lie_Progress_Low_C.SetProgress
// 0x0028 (0x0028 - 0x0000)
struct UIW_Lie_Progress_Low_C_SetProgress final
{
public:
	float                                         Current;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Lie_Progress_Low_C_SetProgress) == 0x000008, "Wrong alignment on UIW_Lie_Progress_Low_C_SetProgress");
static_assert(sizeof(UIW_Lie_Progress_Low_C_SetProgress) == 0x000028, "Wrong size on UIW_Lie_Progress_Low_C_SetProgress");
static_assert(offsetof(UIW_Lie_Progress_Low_C_SetProgress, Current) == 0x000000, "Member 'UIW_Lie_Progress_Low_C_SetProgress::Current' has a wrong offset!");
static_assert(offsetof(UIW_Lie_Progress_Low_C_SetProgress, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000004, "Member 'UIW_Lie_Progress_Low_C_SetProgress::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Lie_Progress_Low_C_SetProgress, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000008, "Member 'UIW_Lie_Progress_Low_C_SetProgress::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Lie_Progress_Low_C_SetProgress, CallFunc_MakeVector2D_ReturnValue) == 0x00000C, "Member 'UIW_Lie_Progress_Low_C_SetProgress::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Lie_Progress_Low_C_SetProgress, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'UIW_Lie_Progress_Low_C_SetProgress::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Lie_Progress_Low_C_SetProgress, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000020, "Member 'UIW_Lie_Progress_Low_C_SetProgress::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");

}

