#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_LetterPreview

#include "Basic.hpp"

#include "UIEN_PreviewType_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "ProjectP_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"
#include "UIST_Time_structs.hpp"


namespace SDK::Params
{

// Function UIW_LetterPreview.UIW_LetterPreview_C.ExecuteUbergraph_UIW_LetterPreview
// 0x0130 (0x0130 - 0x0000)
struct UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULDLCSystem*                            CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsOpened, bool NeedCenterMouse)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class ULPlayerInventory*                      CallFunc_GetPlayerInventory_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsOpened)>                K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName CategoryName)>     K2Node_CreateDelegate_OutputDelegate_2;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey;                 // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget_1;               // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ULItem* Item, int32 Count)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	class UUserWidget*                            CallFunc_AddWidget_Widget;                         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_AddWidget_Widget_1;                       // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	class UUIW_CollectionInfo_C*                  K2Node_DynamicCast_AsUIW_Collection_Info;          // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCodeName_ReturnValue;                  // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ULItem* Item, int32 Count)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00C0(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName CollectionCodeName)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0100(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerInventory*                      CallFunc_GetPlayerInventory_ReturnValue_1;         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerItemLocker*                     CallFunc_GetPlayerItemLocker_ReturnValue;          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview) == 0x000008, "Wrong alignment on UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview");
static_assert(sizeof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview) == 0x000130, "Wrong size on UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, EntryPoint) == 0x000000, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, CallFunc_GetMainWidget_MainWidget) == 0x000010, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000018, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, CallFunc_GetPlayerInventory_ReturnValue) == 0x000030, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::CallFunc_GetPlayerInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, K2Node_CreateDelegate_OutputDelegate_2) == 0x000048, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, K2Node_ComponentBoundEvent_BtnKey) == 0x000058, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::K2Node_ComponentBoundEvent_BtnKey' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, CallFunc_GetMainWidget_MainWidget_1) == 0x000060, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::CallFunc_GetMainWidget_MainWidget_1' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, K2Node_CreateDelegate_OutputDelegate_3) == 0x000068, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, CallFunc_AddWidget_Widget) == 0x000078, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::CallFunc_AddWidget_Widget' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, CallFunc_AddWidget_Widget_1) == 0x000080, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::CallFunc_AddWidget_Widget_1' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, K2Node_CreateDelegate_OutputDelegate_4) == 0x000088, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, K2Node_DynamicCast_AsUIW_Collection_Info) == 0x000098, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::K2Node_DynamicCast_AsUIW_Collection_Info' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, CallFunc_IsValid_ReturnValue) == 0x0000A1, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, CallFunc_IsValid_ReturnValue_1) == 0x0000A2, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, K2Node_SwitchEnum_CmpSuccess) == 0x0000A3, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, CallFunc_IsValid_ReturnValue_2) == 0x0000A4, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, CallFunc_GetCodeName_ReturnValue) == 0x0000A8, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::CallFunc_GetCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000B0, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, K2Node_Event_MyGeometry) == 0x0000C0, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, K2Node_Event_InDeltaTime) == 0x0000F8, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000FC, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, K2Node_CreateDelegate_OutputDelegate_6) == 0x000100, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000110, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000118, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, CallFunc_GetPlayerInventory_ReturnValue_1) == 0x000120, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::CallFunc_GetPlayerInventory_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview, CallFunc_GetPlayerItemLocker_ReturnValue) == 0x000128, "Member 'UIW_LetterPreview_C_ExecuteUbergraph_UIW_LetterPreview::CallFunc_GetPlayerItemLocker_ReturnValue' has a wrong offset!");

// Function UIW_LetterPreview.UIW_LetterPreview_C.Tick
// 0x003C (0x003C - 0x0000)
struct UIW_LetterPreview_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_LetterPreview_C_Tick) == 0x000004, "Wrong alignment on UIW_LetterPreview_C_Tick");
static_assert(sizeof(UIW_LetterPreview_C_Tick) == 0x00003C, "Wrong size on UIW_LetterPreview_C_Tick");
static_assert(offsetof(UIW_LetterPreview_C_Tick, MyGeometry) == 0x000000, "Member 'UIW_LetterPreview_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_Tick, InDeltaTime) == 0x000038, "Member 'UIW_LetterPreview_C_Tick::InDeltaTime' has a wrong offset!");

// Function UIW_LetterPreview.UIW_LetterPreview_C.BndEvt__Btn_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_LetterPreview_C_BndEvt__Btn_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_LetterPreview_C_BndEvt__Btn_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_LetterPreview_C_BndEvt__Btn_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature");
static_assert(sizeof(UIW_LetterPreview_C_BndEvt__Btn_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_LetterPreview_C_BndEvt__Btn_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature");
static_assert(offsetof(UIW_LetterPreview_C_BndEvt__Btn_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_LetterPreview_C_BndEvt__Btn_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_LetterPreview.UIW_LetterPreview_C.ShowGetItemCollectionPreview
// 0x0020 (0x0020 - 0x0000)
struct UIW_LetterPreview_C_ShowGetItemCollectionPreview final
{
public:
	class ULItem*                                 LItem_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalNoDetail;                                     // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LocalNeedShow;                                     // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EUIEN_PreviewType                             LocalPreviewType;                                  // 0x000E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemCollectionInfoPtr                 CallFunc_GetCollectionInfo_ReturnValue;            // 0x0010(0x0008)(NoDestructor)
	int32                                         CallFunc_GetPageMax_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EContentInfoExecutePin                        CallFunc_IsValidBranch_Branches;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DequeuePreview_IsShow;                    // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_LetterPreview_C_ShowGetItemCollectionPreview) == 0x000008, "Wrong alignment on UIW_LetterPreview_C_ShowGetItemCollectionPreview");
static_assert(sizeof(UIW_LetterPreview_C_ShowGetItemCollectionPreview) == 0x000020, "Wrong size on UIW_LetterPreview_C_ShowGetItemCollectionPreview");
static_assert(offsetof(UIW_LetterPreview_C_ShowGetItemCollectionPreview, LItem_0) == 0x000000, "Member 'UIW_LetterPreview_C_ShowGetItemCollectionPreview::LItem_0' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ShowGetItemCollectionPreview, Count) == 0x000008, "Member 'UIW_LetterPreview_C_ShowGetItemCollectionPreview::Count' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ShowGetItemCollectionPreview, LocalNoDetail) == 0x00000C, "Member 'UIW_LetterPreview_C_ShowGetItemCollectionPreview::LocalNoDetail' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ShowGetItemCollectionPreview, LocalNeedShow) == 0x00000D, "Member 'UIW_LetterPreview_C_ShowGetItemCollectionPreview::LocalNeedShow' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ShowGetItemCollectionPreview, LocalPreviewType) == 0x00000E, "Member 'UIW_LetterPreview_C_ShowGetItemCollectionPreview::LocalPreviewType' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ShowGetItemCollectionPreview, CallFunc_GetCollectionInfo_ReturnValue) == 0x000010, "Member 'UIW_LetterPreview_C_ShowGetItemCollectionPreview::CallFunc_GetCollectionInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ShowGetItemCollectionPreview, CallFunc_GetPageMax_ReturnValue) == 0x000018, "Member 'UIW_LetterPreview_C_ShowGetItemCollectionPreview::CallFunc_GetPageMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ShowGetItemCollectionPreview, CallFunc_IsValidBranch_Branches) == 0x00001C, "Member 'UIW_LetterPreview_C_ShowGetItemCollectionPreview::CallFunc_IsValidBranch_Branches' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ShowGetItemCollectionPreview, CallFunc_Greater_IntInt_ReturnValue) == 0x00001D, "Member 'UIW_LetterPreview_C_ShowGetItemCollectionPreview::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ShowGetItemCollectionPreview, K2Node_SwitchEnum_CmpSuccess) == 0x00001E, "Member 'UIW_LetterPreview_C_ShowGetItemCollectionPreview::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ShowGetItemCollectionPreview, CallFunc_DequeuePreview_IsShow) == 0x00001F, "Member 'UIW_LetterPreview_C_ShowGetItemCollectionPreview::CallFunc_DequeuePreview_IsShow' has a wrong offset!");

// Function UIW_LetterPreview.UIW_LetterPreview_C.ShowGetItemSpecialPreview
// 0x0020 (0x0020 - 0x0000)
struct UIW_LetterPreview_C_ShowGetItemSpecialPreview final
{
public:
	class ULItem*                                 LItem_0;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LocalNeedShow;                                     // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	EUIEN_PreviewType                             LocalPreviewType;                                  // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemCommonInfoPtr                     CallFunc_GetCommonInfo_ReturnValue;                // 0x0010(0x0008)(NoDestructor)
	int32                                         CallFunc_GetInfoNoticeCount_ReturnValue;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DequeuePreview_IsShow;                    // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_LetterPreview_C_ShowGetItemSpecialPreview) == 0x000008, "Wrong alignment on UIW_LetterPreview_C_ShowGetItemSpecialPreview");
static_assert(sizeof(UIW_LetterPreview_C_ShowGetItemSpecialPreview) == 0x000020, "Wrong size on UIW_LetterPreview_C_ShowGetItemSpecialPreview");
static_assert(offsetof(UIW_LetterPreview_C_ShowGetItemSpecialPreview, LItem_0) == 0x000000, "Member 'UIW_LetterPreview_C_ShowGetItemSpecialPreview::LItem_0' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ShowGetItemSpecialPreview, Count) == 0x000008, "Member 'UIW_LetterPreview_C_ShowGetItemSpecialPreview::Count' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ShowGetItemSpecialPreview, LocalNeedShow) == 0x00000C, "Member 'UIW_LetterPreview_C_ShowGetItemSpecialPreview::LocalNeedShow' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ShowGetItemSpecialPreview, LocalPreviewType) == 0x00000D, "Member 'UIW_LetterPreview_C_ShowGetItemSpecialPreview::LocalPreviewType' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ShowGetItemSpecialPreview, CallFunc_GetCommonInfo_ReturnValue) == 0x000010, "Member 'UIW_LetterPreview_C_ShowGetItemSpecialPreview::CallFunc_GetCommonInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ShowGetItemSpecialPreview, CallFunc_GetInfoNoticeCount_ReturnValue) == 0x000018, "Member 'UIW_LetterPreview_C_ShowGetItemSpecialPreview::CallFunc_GetInfoNoticeCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ShowGetItemSpecialPreview, CallFunc_Greater_IntInt_ReturnValue) == 0x00001C, "Member 'UIW_LetterPreview_C_ShowGetItemSpecialPreview::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ShowGetItemSpecialPreview, CallFunc_DequeuePreview_IsShow) == 0x00001D, "Member 'UIW_LetterPreview_C_ShowGetItemSpecialPreview::CallFunc_DequeuePreview_IsShow' has a wrong offset!");

// Function UIW_LetterPreview.UIW_LetterPreview_C.ShowPromoteDLC
// 0x0038 (0x0038 - 0x0000)
struct UIW_LetterPreview_C_ShowPromoteDLC final
{
public:
	bool                                          CallFunc_DequeuePreview_IsShow;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0008(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x0020(0x0018)()
};
static_assert(alignof(UIW_LetterPreview_C_ShowPromoteDLC) == 0x000008, "Wrong alignment on UIW_LetterPreview_C_ShowPromoteDLC");
static_assert(sizeof(UIW_LetterPreview_C_ShowPromoteDLC) == 0x000038, "Wrong size on UIW_LetterPreview_C_ShowPromoteDLC");
static_assert(offsetof(UIW_LetterPreview_C_ShowPromoteDLC, CallFunc_DequeuePreview_IsShow) == 0x000000, "Member 'UIW_LetterPreview_C_ShowPromoteDLC::CallFunc_DequeuePreview_IsShow' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ShowPromoteDLC, CallFunc_GetGameStrWithName_ReturnValue) == 0x000008, "Member 'UIW_LetterPreview_C_ShowPromoteDLC::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ShowPromoteDLC, CallFunc_GetGameStrWithName_ReturnValue_1) == 0x000020, "Member 'UIW_LetterPreview_C_ShowPromoteDLC::CallFunc_GetGameStrWithName_ReturnValue_1' has a wrong offset!");

// Function UIW_LetterPreview.UIW_LetterPreview_C.RefreshVisible
// 0x0002 (0x0002 - 0x0000)
struct UIW_LetterPreview_C_RefreshVisible final
{
public:
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_LetterPreview_C_RefreshVisible) == 0x000001, "Wrong alignment on UIW_LetterPreview_C_RefreshVisible");
static_assert(sizeof(UIW_LetterPreview_C_RefreshVisible) == 0x000002, "Wrong size on UIW_LetterPreview_C_RefreshVisible");
static_assert(offsetof(UIW_LetterPreview_C_RefreshVisible, CallFunc_IsVisible_ReturnValue) == 0x000000, "Member 'UIW_LetterPreview_C_RefreshVisible::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_RefreshVisible, CallFunc_BooleanOR_ReturnValue) == 0x000001, "Member 'UIW_LetterPreview_C_RefreshVisible::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function UIW_LetterPreview.UIW_LetterPreview_C.VisibleMenu
// 0x0002 (0x0002 - 0x0000)
struct UIW_LetterPreview_C_VisibleMenu final
{
public:
	bool                                          IsOpened;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NeedCenterMouse;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_LetterPreview_C_VisibleMenu) == 0x000001, "Wrong alignment on UIW_LetterPreview_C_VisibleMenu");
static_assert(sizeof(UIW_LetterPreview_C_VisibleMenu) == 0x000002, "Wrong size on UIW_LetterPreview_C_VisibleMenu");
static_assert(offsetof(UIW_LetterPreview_C_VisibleMenu, IsOpened) == 0x000000, "Member 'UIW_LetterPreview_C_VisibleMenu::IsOpened' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_VisibleMenu, NeedCenterMouse) == 0x000001, "Member 'UIW_LetterPreview_C_VisibleMenu::NeedCenterMouse' has a wrong offset!");

// Function UIW_LetterPreview.UIW_LetterPreview_C.VisibleWindow
// 0x0001 (0x0001 - 0x0000)
struct UIW_LetterPreview_C_VisibleWindow final
{
public:
	bool                                          IsOpened;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_LetterPreview_C_VisibleWindow) == 0x000001, "Wrong alignment on UIW_LetterPreview_C_VisibleWindow");
static_assert(sizeof(UIW_LetterPreview_C_VisibleWindow) == 0x000001, "Wrong size on UIW_LetterPreview_C_VisibleWindow");
static_assert(offsetof(UIW_LetterPreview_C_VisibleWindow, IsOpened) == 0x000000, "Member 'UIW_LetterPreview_C_VisibleWindow::IsOpened' has a wrong offset!");

// Function UIW_LetterPreview.UIW_LetterPreview_C.CompleteTween
// 0x0018 (0x0018 - 0x0000)
struct UIW_LetterPreview_C_CompleteTween final
{
public:
	class FName                                   CategoryName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DequeuePreview_IsShow;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_LetterPreview_C_CompleteTween) == 0x000008, "Wrong alignment on UIW_LetterPreview_C_CompleteTween");
static_assert(sizeof(UIW_LetterPreview_C_CompleteTween) == 0x000018, "Wrong size on UIW_LetterPreview_C_CompleteTween");
static_assert(offsetof(UIW_LetterPreview_C_CompleteTween, CategoryName) == 0x000000, "Member 'UIW_LetterPreview_C_CompleteTween::CategoryName' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_CompleteTween, CallFunc_GetMainWidget_MainWidget) == 0x000008, "Member 'UIW_LetterPreview_C_CompleteTween::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_CompleteTween, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000010, "Member 'UIW_LetterPreview_C_CompleteTween::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_CompleteTween, CallFunc_DequeuePreview_IsShow) == 0x000011, "Member 'UIW_LetterPreview_C_CompleteTween::CallFunc_DequeuePreview_IsShow' has a wrong offset!");

// Function UIW_LetterPreview.UIW_LetterPreview_C.SetView
// 0x00A0 (0x00A0 - 0x0000)
struct UIW_LetterPreview_C_SetView final
{
public:
	class ULItem*                                 Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Title;                                             // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Description;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemCommonInfoPtr                     CallFunc_GetCommonInfo_ReturnValue;                // 0x0040(0x0008)(NoDestructor)
	class FText                                   CallFunc_GetLocalTextTooltip2Localize_ReturnValue; // 0x0048(0x0018)()
	class FText                                   CallFunc_GetLocalTextItemNameLocalize_ReturnValue; // 0x0060(0x0018)()
	TSoftObjectPtr<class UObject>                 CallFunc_GetImageResource_ReturnValue;             // 0x0078(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(UIW_LetterPreview_C_SetView) == 0x000008, "Wrong alignment on UIW_LetterPreview_C_SetView");
static_assert(sizeof(UIW_LetterPreview_C_SetView) == 0x0000A0, "Wrong size on UIW_LetterPreview_C_SetView");
static_assert(offsetof(UIW_LetterPreview_C_SetView, Item) == 0x000000, "Member 'UIW_LetterPreview_C_SetView::Item' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_SetView, Title) == 0x000008, "Member 'UIW_LetterPreview_C_SetView::Title' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_SetView, Description) == 0x000020, "Member 'UIW_LetterPreview_C_SetView::Description' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_SetView, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'UIW_LetterPreview_C_SetView::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_SetView, CallFunc_GetCommonInfo_ReturnValue) == 0x000040, "Member 'UIW_LetterPreview_C_SetView::CallFunc_GetCommonInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_SetView, CallFunc_GetLocalTextTooltip2Localize_ReturnValue) == 0x000048, "Member 'UIW_LetterPreview_C_SetView::CallFunc_GetLocalTextTooltip2Localize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_SetView, CallFunc_GetLocalTextItemNameLocalize_ReturnValue) == 0x000060, "Member 'UIW_LetterPreview_C_SetView::CallFunc_GetLocalTextItemNameLocalize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_SetView, CallFunc_GetImageResource_ReturnValue) == 0x000078, "Member 'UIW_LetterPreview_C_SetView::CallFunc_GetImageResource_ReturnValue' has a wrong offset!");

// Function UIW_LetterPreview.UIW_LetterPreview_C.ShowPreview
// 0x0038 (0x0038 - 0x0000)
struct UIW_LetterPreview_C_ShowPreview final
{
public:
	struct FUIST_Time                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0000(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTweenEase                             K2Node_MakeStruct_TweenEase;                       // 0x001C(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_1;                     // 0x0028(0x000C)(NoDestructor)
};
static_assert(alignof(UIW_LetterPreview_C_ShowPreview) == 0x000008, "Wrong alignment on UIW_LetterPreview_C_ShowPreview");
static_assert(sizeof(UIW_LetterPreview_C_ShowPreview) == 0x000038, "Wrong size on UIW_LetterPreview_C_ShowPreview");
static_assert(offsetof(UIW_LetterPreview_C_ShowPreview, CallFunc_GetDataTableRowFromName_OutRow) == 0x000000, "Member 'UIW_LetterPreview_C_ShowPreview::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ShowPreview, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000018, "Member 'UIW_LetterPreview_C_ShowPreview::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ShowPreview, K2Node_MakeStruct_TweenEase) == 0x00001C, "Member 'UIW_LetterPreview_C_ShowPreview::K2Node_MakeStruct_TweenEase' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ShowPreview, K2Node_MakeStruct_TweenEase_1) == 0x000028, "Member 'UIW_LetterPreview_C_ShowPreview::K2Node_MakeStruct_TweenEase_1' has a wrong offset!");

// Function UIW_LetterPreview.UIW_LetterPreview_C.HidePreview
// 0x0020 (0x0020 - 0x0000)
struct UIW_LetterPreview_C_HidePreview final
{
public:
	bool                                          NeedTween;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTweenEase                             K2Node_MakeStruct_TweenEase;                       // 0x0004(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_1;                     // 0x0010(0x000C)(NoDestructor)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_LetterPreview_C_HidePreview) == 0x000004, "Wrong alignment on UIW_LetterPreview_C_HidePreview");
static_assert(sizeof(UIW_LetterPreview_C_HidePreview) == 0x000020, "Wrong size on UIW_LetterPreview_C_HidePreview");
static_assert(offsetof(UIW_LetterPreview_C_HidePreview, NeedTween) == 0x000000, "Member 'UIW_LetterPreview_C_HidePreview::NeedTween' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_HidePreview, K2Node_MakeStruct_TweenEase) == 0x000004, "Member 'UIW_LetterPreview_C_HidePreview::K2Node_MakeStruct_TweenEase' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_HidePreview, K2Node_MakeStruct_TweenEase_1) == 0x000010, "Member 'UIW_LetterPreview_C_HidePreview::K2Node_MakeStruct_TweenEase_1' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_HidePreview, CallFunc_GetRenderOpacity_ReturnValue) == 0x00001C, "Member 'UIW_LetterPreview_C_HidePreview::CallFunc_GetRenderOpacity_ReturnValue' has a wrong offset!");

// Function UIW_LetterPreview.UIW_LetterPreview_C.EnqueuePreview
// 0x0050 (0x0050 - 0x0000)
struct UIW_LetterPreview_C_EnqueuePreview final
{
public:
	class ULItem*                                 Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Title;                                             // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Description;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	EUIEN_PreviewType                             PreviewType;                                       // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_PreviewQueue_C*                   CallFunc_SpawnObject_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_LetterPreview_C_EnqueuePreview) == 0x000008, "Wrong alignment on UIW_LetterPreview_C_EnqueuePreview");
static_assert(sizeof(UIW_LetterPreview_C_EnqueuePreview) == 0x000050, "Wrong size on UIW_LetterPreview_C_EnqueuePreview");
static_assert(offsetof(UIW_LetterPreview_C_EnqueuePreview, Item) == 0x000000, "Member 'UIW_LetterPreview_C_EnqueuePreview::Item' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_EnqueuePreview, Title) == 0x000008, "Member 'UIW_LetterPreview_C_EnqueuePreview::Title' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_EnqueuePreview, Description) == 0x000020, "Member 'UIW_LetterPreview_C_EnqueuePreview::Description' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_EnqueuePreview, PreviewType) == 0x000038, "Member 'UIW_LetterPreview_C_EnqueuePreview::PreviewType' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_EnqueuePreview, CallFunc_SpawnObject_ReturnValue) == 0x000040, "Member 'UIW_LetterPreview_C_EnqueuePreview::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_EnqueuePreview, CallFunc_Array_Add_ReturnValue) == 0x000048, "Member 'UIW_LetterPreview_C_EnqueuePreview::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function UIW_LetterPreview.UIW_LetterPreview_C.DequeuePreview
// 0x0058 (0x0058 - 0x0000)
struct UIW_LetterPreview_C_DequeuePreview final
{
public:
	bool                                          IsShow;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_PreviewQueue_C*                   LocalData;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUIEN_PreviewType                             Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default;                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_PreviewQueue_C*                   CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_LetterPreview_C_DequeuePreview) == 0x000008, "Wrong alignment on UIW_LetterPreview_C_DequeuePreview");
static_assert(sizeof(UIW_LetterPreview_C_DequeuePreview) == 0x000058, "Wrong size on UIW_LetterPreview_C_DequeuePreview");
static_assert(offsetof(UIW_LetterPreview_C_DequeuePreview, IsShow) == 0x000000, "Member 'UIW_LetterPreview_C_DequeuePreview::IsShow' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_DequeuePreview, LocalData) == 0x000008, "Member 'UIW_LetterPreview_C_DequeuePreview::LocalData' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_DequeuePreview, Temp_byte_Variable) == 0x000010, "Member 'UIW_LetterPreview_C_DequeuePreview::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_DequeuePreview, Temp_name_Variable) == 0x000014, "Member 'UIW_LetterPreview_C_DequeuePreview::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_DequeuePreview, K2Node_SwitchEnum_CmpSuccess) == 0x00001C, "Member 'UIW_LetterPreview_C_DequeuePreview::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_DequeuePreview, CallFunc_GetMainWidget_MainWidget) == 0x000020, "Member 'UIW_LetterPreview_C_DequeuePreview::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_DequeuePreview, Temp_name_Variable_1) == 0x000028, "Member 'UIW_LetterPreview_C_DequeuePreview::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_DequeuePreview, Temp_name_Variable_2) == 0x000030, "Member 'UIW_LetterPreview_C_DequeuePreview::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_DequeuePreview, K2Node_Select_Default) == 0x000038, "Member 'UIW_LetterPreview_C_DequeuePreview::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_DequeuePreview, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'UIW_LetterPreview_C_DequeuePreview::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_DequeuePreview, CallFunc_Array_Get_Item) == 0x000048, "Member 'UIW_LetterPreview_C_DequeuePreview::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_DequeuePreview, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000050, "Member 'UIW_LetterPreview_C_DequeuePreview::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function UIW_LetterPreview.UIW_LetterPreview_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct UIW_LetterPreview_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_OnFocusReceived_ReturnValue;              // 0x00F8(0x00B8)()
};
static_assert(alignof(UIW_LetterPreview_C_OnFocusReceived) == 0x000008, "Wrong alignment on UIW_LetterPreview_C_OnFocusReceived");
static_assert(sizeof(UIW_LetterPreview_C_OnFocusReceived) == 0x0001B0, "Wrong size on UIW_LetterPreview_C_OnFocusReceived");
static_assert(offsetof(UIW_LetterPreview_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UIW_LetterPreview_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UIW_LetterPreview_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UIW_LetterPreview_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_OnFocusReceived, CallFunc_OnFocusReceived_ReturnValue) == 0x0000F8, "Member 'UIW_LetterPreview_C_OnFocusReceived::CallFunc_OnFocusReceived_ReturnValue' has a wrong offset!");

// Function UIW_LetterPreview.UIW_LetterPreview_C.SetHUDVisible
// 0x0002 (0x0002 - 0x0000)
struct UIW_LetterPreview_C_SetHUDVisible final
{
public:
	bool                                          IsShow;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DequeuePreview_IsShow;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_LetterPreview_C_SetHUDVisible) == 0x000001, "Wrong alignment on UIW_LetterPreview_C_SetHUDVisible");
static_assert(sizeof(UIW_LetterPreview_C_SetHUDVisible) == 0x000002, "Wrong size on UIW_LetterPreview_C_SetHUDVisible");
static_assert(offsetof(UIW_LetterPreview_C_SetHUDVisible, IsShow) == 0x000000, "Member 'UIW_LetterPreview_C_SetHUDVisible::IsShow' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_SetHUDVisible, CallFunc_DequeuePreview_IsShow) == 0x000001, "Member 'UIW_LetterPreview_C_SetHUDVisible::CallFunc_DequeuePreview_IsShow' has a wrong offset!");

// Function UIW_LetterPreview.UIW_LetterPreview_C.ListenPreviewAction
// 0x00B8 (0x00B8 - 0x0000)
struct UIW_LetterPreview_C_ListenPreviewAction final
{
public:
	class FName                                   LocalBtnLabel;                                     // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUIEN_PreviewType                             Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUIEN_PreviewType                             Temp_byte_Variable_1;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_3;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_4;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_5;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUIEN_PreviewType                             Temp_byte_Variable_2;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_6;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_7;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_8;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayInputSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_1;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePadMode_ReturnValue;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingPlayStationGamePad_ReturnValue;    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_9;                              // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_10;                             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUIEN_PreviewType                             Temp_byte_Variable_3;                              // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_11;                             // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_2;                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default_3;                           // 0x00AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_LetterPreview_C_ListenPreviewAction) == 0x000008, "Wrong alignment on UIW_LetterPreview_C_ListenPreviewAction");
static_assert(sizeof(UIW_LetterPreview_C_ListenPreviewAction) == 0x0000B8, "Wrong size on UIW_LetterPreview_C_ListenPreviewAction");
static_assert(offsetof(UIW_LetterPreview_C_ListenPreviewAction, LocalBtnLabel) == 0x000000, "Member 'UIW_LetterPreview_C_ListenPreviewAction::LocalBtnLabel' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ListenPreviewAction, Temp_byte_Variable) == 0x000008, "Member 'UIW_LetterPreview_C_ListenPreviewAction::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ListenPreviewAction, Temp_name_Variable) == 0x00000C, "Member 'UIW_LetterPreview_C_ListenPreviewAction::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ListenPreviewAction, Temp_name_Variable_1) == 0x000014, "Member 'UIW_LetterPreview_C_ListenPreviewAction::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ListenPreviewAction, Temp_name_Variable_2) == 0x00001C, "Member 'UIW_LetterPreview_C_ListenPreviewAction::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ListenPreviewAction, CallFunc_MakeLiteralByte_ReturnValue) == 0x000024, "Member 'UIW_LetterPreview_C_ListenPreviewAction::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ListenPreviewAction, Temp_byte_Variable_1) == 0x000025, "Member 'UIW_LetterPreview_C_ListenPreviewAction::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ListenPreviewAction, Temp_name_Variable_3) == 0x000028, "Member 'UIW_LetterPreview_C_ListenPreviewAction::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ListenPreviewAction, Temp_name_Variable_4) == 0x000030, "Member 'UIW_LetterPreview_C_ListenPreviewAction::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ListenPreviewAction, Temp_name_Variable_5) == 0x000038, "Member 'UIW_LetterPreview_C_ListenPreviewAction::Temp_name_Variable_5' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ListenPreviewAction, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000040, "Member 'UIW_LetterPreview_C_ListenPreviewAction::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_LetterPreview_C_ListenPreviewAction, K2Node_Select_Default) == 0x000044, "Member 'UIW_LetterPreview_C_ListenPreviewAction::K2Node_Select_Default' has a wrong offset!");
