#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_SlaveArm_List

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_SlaveArm_List.UIW_SlaveArm_List_C
// 0x0040 (0x02A8 - 0x0268)
class UUIW_SlaveArm_List_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUIW_SlaveArm_ReinforceSlot_C*          Icon_Reinforce;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Info;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Title;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULSlaveArmTree*                         SlaveArmTree;                                      // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   TooltipTextBranch;                                 // 0x0290(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_UIW_SlaveArm_List(int32 EntryPoint);
	void Construct();
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_SlaveArm_List_C">();
	}
	static class UUIW_SlaveArm_List_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_SlaveArm_List_C>();
	}
};
static_assert(alignof(UUIW_SlaveArm_List_C) == 0x000008, "Wrong alignment on UUIW_SlaveArm_List_C");
static_assert(sizeof(UUIW_SlaveArm_List_C) == 0x0002A8, "Wrong size on UUIW_SlaveArm_List_C");
static_assert(offsetof(UUIW_SlaveArm_List_C, UberGraphFrame) == 0x000268, "Member 'UUIW_SlaveArm_List_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_List_C, Icon_Reinforce) == 0x000270, "Member 'UUIW_SlaveArm_List_C::Icon_Reinforce' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_List_C, Text_Info) == 0x000278, "Member 'UUIW_SlaveArm_List_C::Text_Info' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_List_C, Text_Title) == 0x000280, "Member 'UUIW_SlaveArm_List_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_List_C, SlaveArmTree) == 0x000288, "Member 'UUIW_SlaveArm_List_C::SlaveArmTree' has a wrong offset!");
static_assert(offsetof(UUIW_SlaveArm_List_C, TooltipTextBranch) == 0x000290, "Member 'UUIW_SlaveArm_List_C::TooltipTextBranch' has a wrong offset!");

}

