#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ListItem_ChapterTab

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UIW_ListItem_ChapterTab.UIW_ListItem_ChapterTab_C.ExecuteUbergraph_UIW_ListItem_ChapterTab
// 0x0248 (0x0248 - 0x0000)
struct UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_IsNew_C*                 K2Node_DynamicCast_AsUIBP_List_Data_Is_New;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x006C(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x00A8(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0118(0x0070)(ConstParm)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0198(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x01A8(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x01D0(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x01F8(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0220(0x0028)()
};
static_assert(alignof(UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab) == 0x000008, "Wrong alignment on UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab");
static_assert(sizeof(UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab) == 0x000248, "Wrong size on UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab");
static_assert(offsetof(UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab, EntryPoint) == 0x000000, "Member 'UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab, Temp_bool_Variable) == 0x000004, "Member 'UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab, Temp_struct_Variable) == 0x000008, "Member 'UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab, Temp_struct_Variable_1) == 0x000018, "Member 'UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab, Temp_bool_Variable_1) == 0x000028, "Member 'UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab, Temp_struct_Variable_2) == 0x00002C, "Member 'UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab, Temp_struct_Variable_3) == 0x00003C, "Member 'UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab, K2Node_Event_bIsExpanded) == 0x00004C, "Member 'UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab, K2Node_Event_ListItemObject) == 0x000050, "Member 'UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab, K2Node_Event_bIsSelected) == 0x000058, "Member 'UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab, K2Node_DynamicCast_AsUIBP_List_Data_Is_New) == 0x000060, "Member 'UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab::K2Node_DynamicCast_AsUIBP_List_Data_Is_New' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab, K2Node_Event_MyGeometry) == 0x00006C, "Member 'UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab, K2Node_Event_MouseEvent_1) == 0x0000A8, "Member 'UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab, K2Node_Event_MouseEvent) == 0x000118, "Member 'UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab, K2Node_Select_Default) == 0x000188, "Member 'UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab, K2Node_Select_Default_1) == 0x000198, "Member 'UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab, K2Node_MakeStruct_SlateColor) == 0x0001A8, "Member 'UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab, K2Node_MakeStruct_SlateColor_1) == 0x0001D0, "Member 'UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab, K2Node_MakeStruct_SlateColor_2) == 0x0001F8, "Member 'UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab, K2Node_MakeStruct_SlateColor_3) == 0x000220, "Member 'UIW_ListItem_ChapterTab_C_ExecuteUbergraph_UIW_ListItem_ChapterTab::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");

// Function UIW_ListItem_ChapterTab.UIW_ListItem_ChapterTab_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct UIW_ListItem_ChapterTab_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIW_ListItem_ChapterTab_C_OnMouseLeave) == 0x000008, "Wrong alignment on UIW_ListItem_ChapterTab_C_OnMouseLeave");
static_assert(sizeof(UIW_ListItem_ChapterTab_C_OnMouseLeave) == 0x000070, "Wrong size on UIW_ListItem_ChapterTab_C_OnMouseLeave");
static_assert(offsetof(UIW_ListItem_ChapterTab_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'UIW_ListItem_ChapterTab_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function UIW_ListItem_ChapterTab.UIW_ListItem_ChapterTab_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct UIW_ListItem_ChapterTab_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIW_ListItem_ChapterTab_C_OnMouseEnter) == 0x000008, "Wrong alignment on UIW_ListItem_ChapterTab_C_OnMouseEnter");
static_assert(sizeof(UIW_ListItem_ChapterTab_C_OnMouseEnter) == 0x0000A8, "Wrong size on UIW_ListItem_ChapterTab_C_OnMouseEnter");
static_assert(offsetof(UIW_ListItem_ChapterTab_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'UIW_ListItem_ChapterTab_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ChapterTab_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'UIW_ListItem_ChapterTab_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function UIW_ListItem_ChapterTab.UIW_ListItem_ChapterTab_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_ListItem_ChapterTab_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_ChapterTab_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on UIW_ListItem_ChapterTab_C_BP_OnItemSelectionChanged");
static_assert(sizeof(UIW_ListItem_ChapterTab_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on UIW_ListItem_ChapterTab_C_BP_OnItemSelectionChanged");
static_assert(offsetof(UIW_ListItem_ChapterTab_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'UIW_ListItem_ChapterTab_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function UIW_ListItem_ChapterTab.UIW_ListItem_ChapterTab_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct UIW_ListItem_ChapterTab_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ListItem_ChapterTab_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on UIW_ListItem_ChapterTab_C_OnListItemObjectSet");
static_assert(sizeof(UIW_ListItem_ChapterTab_C_OnListItemObjectSet) == 0x000008, "Wrong size on UIW_ListItem_ChapterTab_C_OnListItemObjectSet");
static_assert(offsetof(UIW_ListItem_ChapterTab_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'UIW_ListItem_ChapterTab_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function UIW_ListItem_ChapterTab.UIW_ListItem_ChapterTab_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_ListItem_ChapterTab_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_ChapterTab_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on UIW_ListItem_ChapterTab_C_BP_OnItemExpansionChanged");
static_assert(sizeof(UIW_ListItem_ChapterTab_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on UIW_ListItem_ChapterTab_C_BP_OnItemExpansionChanged");
static_assert(offsetof(UIW_ListItem_ChapterTab_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'UIW_ListItem_ChapterTab_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

}

