#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ListItem_ImageTab

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_ListItem_ImageTab.UIW_ListItem_ImageTab_C
// 0x0090 (0x0338 - 0x02A8)
class UUIW_ListItem_ImageTab_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Icon;                                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Hover;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_New_Dot;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Select_1;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Select_2;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Label;                                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class FName, class UTexture2D*>          IconMap;                                           // 0x02E0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Condition;                                         // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSelected;                                        // 0x0331(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UIW_ListItem_ImageTab(int32 EntryPoint);
	void Construct();
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();
	void CustomEvent(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_ListItem_ImageTab_C">();
	}
	static class UUIW_ListItem_ImageTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_ListItem_ImageTab_C>();
	}
};
static_assert(alignof(UUIW_ListItem_ImageTab_C) == 0x000008, "Wrong alignment on UUIW_ListItem_ImageTab_C");
static_assert(sizeof(UUIW_ListItem_ImageTab_C) == 0x000338, "Wrong size on UUIW_ListItem_ImageTab_C");
static_assert(offsetof(UUIW_ListItem_ImageTab_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_ListItem_ImageTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ImageTab_C, Icon) == 0x0002B0, "Member 'UUIW_ListItem_ImageTab_C::Icon' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ImageTab_C, Img_Hover) == 0x0002B8, "Member 'UUIW_ListItem_ImageTab_C::Img_Hover' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ImageTab_C, Img_New_Dot) == 0x0002C0, "Member 'UUIW_ListItem_ImageTab_C::Img_New_Dot' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ImageTab_C, Img_Select_1) == 0x0002C8, "Member 'UUIW_ListItem_ImageTab_C::Img_Select_1' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ImageTab_C, Img_Select_2) == 0x0002D0, "Member 'UUIW_ListItem_ImageTab_C::Img_Select_2' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ImageTab_C, Label) == 0x0002D8, "Member 'UUIW_ListItem_ImageTab_C::Label' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ImageTab_C, IconMap) == 0x0002E0, "Member 'UUIW_ListItem_ImageTab_C::IconMap' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ImageTab_C, Condition) == 0x000330, "Member 'UUIW_ListItem_ImageTab_C::Condition' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ImageTab_C, IsSelected) == 0x000331, "Member 'UUIW_ListItem_ImageTab_C::IsSelected' has a wrong offset!");

}

