#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Record_ListItem

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Record_ListItem.UIW_Record_ListItem_C
// 0x0070 (0x0318 - 0x02A8)
class UUIW_Record_ListItem_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 FX_Play;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Group_BG_Light;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Notification;                                 // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Cover;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Play;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Record;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Fx_Listbar_C*                      Selected;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Name;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PlayTime;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListView*                              OwnerListView;                                     // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnabled;                                         // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   RecordID;                                          // 0x0304(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x030C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsFirstTime;                                       // 0x030D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30E[0x2];                                      // 0x030E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Record_C*                          OwnerWindow;                                       // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_Record_ListItem(int32 EntryPoint);
	void BP_OnEntryReleased();
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void Construct();
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void Destruct();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void SetMoveFocusEffect();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void SetPlaying(bool IsPlaying);
	void OnPlay(bool IsPlaying, class FName CodeName);
	void SetTextColor();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Record_ListItem_C">();
	}
	static class UUIW_Record_ListItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Record_ListItem_C>();
	}
};
static_assert(alignof(UUIW_Record_ListItem_C) == 0x000008, "Wrong alignment on UUIW_Record_ListItem_C");
static_assert(sizeof(UUIW_Record_ListItem_C) == 0x000318, "Wrong size on UUIW_Record_ListItem_C");
static_assert(offsetof(UUIW_Record_ListItem_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_Record_ListItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_Record_ListItem_C, FX_Play) == 0x0002B0, "Member 'UUIW_Record_ListItem_C::FX_Play' has a wrong offset!");
static_assert(offsetof(UUIW_Record_ListItem_C, Group_BG_Light) == 0x0002B8, "Member 'UUIW_Record_ListItem_C::Group_BG_Light' has a wrong offset!");
static_assert(offsetof(UUIW_Record_ListItem_C, Icon_Notification) == 0x0002C0, "Member 'UUIW_Record_ListItem_C::Icon_Notification' has a wrong offset!");
static_assert(offsetof(UUIW_Record_ListItem_C, Img_Cover) == 0x0002C8, "Member 'UUIW_Record_ListItem_C::Img_Cover' has a wrong offset!");
static_assert(offsetof(UUIW_Record_ListItem_C, Img_Play) == 0x0002D0, "Member 'UUIW_Record_ListItem_C::Img_Play' has a wrong offset!");
static_assert(offsetof(UUIW_Record_ListItem_C, Img_Record) == 0x0002D8, "Member 'UUIW_Record_ListItem_C::Img_Record' has a wrong offset!");
static_assert(offsetof(UUIW_Record_ListItem_C, Selected) == 0x0002E0, "Member 'UUIW_Record_ListItem_C::Selected' has a wrong offset!");
static_assert(offsetof(UUIW_Record_ListItem_C, Text_Name) == 0x0002E8, "Member 'UUIW_Record_ListItem_C::Text_Name' has a wrong offset!");
static_assert(offsetof(UUIW_Record_ListItem_C, Text_PlayTime) == 0x0002F0, "Member 'UUIW_Record_ListItem_C::Text_PlayTime' has a wrong offset!");
static_assert(offsetof(UUIW_Record_ListItem_C, OwnerListView) == 0x0002F8, "Member 'UUIW_Record_ListItem_C::OwnerListView' has a wrong offset!");
static_assert(offsetof(UUIW_Record_ListItem_C, IsEnabled) == 0x000300, "Member 'UUIW_Record_ListItem_C::IsEnabled' has a wrong offset!");
static_assert(offsetof(UUIW_Record_ListItem_C, RecordID) == 0x000304, "Member 'UUIW_Record_ListItem_C::RecordID' has a wrong offset!");
static_assert(offsetof(UUIW_Record_ListItem_C, IsSelected) == 0x00030C, "Member 'UUIW_Record_ListItem_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UUIW_Record_ListItem_C, IsFirstTime) == 0x00030D, "Member 'UUIW_Record_ListItem_C::IsFirstTime' has a wrong offset!");
static_assert(offsetof(UUIW_Record_ListItem_C, OwnerWindow) == 0x000310, "Member 'UUIW_Record_ListItem_C::OwnerWindow' has a wrong offset!");

}

