#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ContextMenu

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function UIW_ContextMenu.UIW_ContextMenu_C.ExecuteUbergraph_UIW_ContextMenu
// 0x0068 (0x0068 - 0x0000)
struct UIW_ContextMenu_C_ExecuteUbergraph_UIW_ContextMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ContextMenu_C_ExecuteUbergraph_UIW_ContextMenu) == 0x000008, "Wrong alignment on UIW_ContextMenu_C_ExecuteUbergraph_UIW_ContextMenu");
static_assert(sizeof(UIW_ContextMenu_C_ExecuteUbergraph_UIW_ContextMenu) == 0x000068, "Wrong size on UIW_ContextMenu_C_ExecuteUbergraph_UIW_ContextMenu");
static_assert(offsetof(UIW_ContextMenu_C_ExecuteUbergraph_UIW_ContextMenu, EntryPoint) == 0x000000, "Member 'UIW_ContextMenu_C_ExecuteUbergraph_UIW_ContextMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_ExecuteUbergraph_UIW_ContextMenu, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'UIW_ContextMenu_C_ExecuteUbergraph_UIW_ContextMenu::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_ExecuteUbergraph_UIW_ContextMenu, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'UIW_ContextMenu_C_ExecuteUbergraph_UIW_ContextMenu::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_ExecuteUbergraph_UIW_ContextMenu, CallFunc_Conv_StringToName_ReturnValue) == 0x000018, "Member 'UIW_ContextMenu_C_ExecuteUbergraph_UIW_ContextMenu::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_ExecuteUbergraph_UIW_ContextMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'UIW_ContextMenu_C_ExecuteUbergraph_UIW_ContextMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_ExecuteUbergraph_UIW_ContextMenu, CallFunc_GetMainWidget_MainWidget) == 0x000030, "Member 'UIW_ContextMenu_C_ExecuteUbergraph_UIW_ContextMenu::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_ExecuteUbergraph_UIW_ContextMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'UIW_ContextMenu_C_ExecuteUbergraph_UIW_ContextMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_ExecuteUbergraph_UIW_ContextMenu, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000048, "Member 'UIW_ContextMenu_C_ExecuteUbergraph_UIW_ContextMenu::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_ExecuteUbergraph_UIW_ContextMenu, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000050, "Member 'UIW_ContextMenu_C_ExecuteUbergraph_UIW_ContextMenu::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_ExecuteUbergraph_UIW_ContextMenu, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000060, "Member 'UIW_ContextMenu_C_ExecuteUbergraph_UIW_ContextMenu::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");

// Function UIW_ContextMenu.UIW_ContextMenu_C.Set Context Menu
// 0x0118 (0x0118 - 0x0000)
struct UIW_ContextMenu_C_Set_Context_Menu final
{
public:
	class UUIW_Window_C*                          Window_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class FText>                MenuList;                                          // 0x0008(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FVector2D                              Position;                                          // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0060(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0078(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualExactly_Vector2DVector2D_ReturnValue; // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName EventName)>        K2Node_CreateDelegate_OutputDelegate;              // 0x009C(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector2D                              CallFunc_GetMousePositionOnViewport_ReturnValue;   // 0x00AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName EventName)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	class UUIW_ContextMenu_Btn_C*                 CallFunc_Create_ReturnValue;                       // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase;                       // 0x00E0(0x000C)(NoDestructor)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value;                           // 0x00F0(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ContextMenu_C_Set_Context_Menu) == 0x000008, "Wrong alignment on UIW_ContextMenu_C_Set_Context_Menu");
static_assert(sizeof(UIW_ContextMenu_C_Set_Context_Menu) == 0x000118, "Wrong size on UIW_ContextMenu_C_Set_Context_Menu");
static_assert(offsetof(UIW_ContextMenu_C_Set_Context_Menu, Window_0) == 0x000000, "Member 'UIW_ContextMenu_C_Set_Context_Menu::Window_0' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_Set_Context_Menu, MenuList) == 0x000008, "Member 'UIW_ContextMenu_C_Set_Context_Menu::MenuList' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_Set_Context_Menu, Position) == 0x000058, "Member 'UIW_ContextMenu_C_Set_Context_Menu::Position' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_Set_Context_Menu, CallFunc_Map_Keys_Keys) == 0x000060, "Member 'UIW_ContextMenu_C_Set_Context_Menu::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_Set_Context_Menu, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'UIW_ContextMenu_C_Set_Context_Menu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_Set_Context_Menu, CallFunc_K2_SetTimer_ReturnValue) == 0x000078, "Member 'UIW_ContextMenu_C_Set_Context_Menu::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_Set_Context_Menu, Temp_int_Loop_Counter_Variable) == 0x000080, "Member 'UIW_ContextMenu_C_Set_Context_Menu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_Set_Context_Menu, CallFunc_Less_IntInt_ReturnValue) == 0x000084, "Member 'UIW_ContextMenu_C_Set_Context_Menu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_Set_Context_Menu, CallFunc_Add_IntInt_ReturnValue) == 0x000088, "Member 'UIW_ContextMenu_C_Set_Context_Menu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_Set_Context_Menu, Temp_int_Array_Index_Variable) == 0x00008C, "Member 'UIW_ContextMenu_C_Set_Context_Menu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_Set_Context_Menu, CallFunc_Array_Get_Item) == 0x000090, "Member 'UIW_ContextMenu_C_Set_Context_Menu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_Set_Context_Menu, CallFunc_EqualExactly_Vector2DVector2D_ReturnValue) == 0x000098, "Member 'UIW_ContextMenu_C_Set_Context_Menu::CallFunc_EqualExactly_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_Set_Context_Menu, K2Node_CreateDelegate_OutputDelegate) == 0x00009C, "Member 'UIW_ContextMenu_C_Set_Context_Menu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_Set_Context_Menu, CallFunc_GetMousePositionOnViewport_ReturnValue) == 0x0000AC, "Member 'UIW_ContextMenu_C_Set_Context_Menu::CallFunc_GetMousePositionOnViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_Set_Context_Menu, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x0000B4, "Member 'UIW_ContextMenu_C_Set_Context_Menu::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_Set_Context_Menu, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x0000C0, "Member 'UIW_ContextMenu_C_Set_Context_Menu::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_Set_Context_Menu, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000C8, "Member 'UIW_ContextMenu_C_Set_Context_Menu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_Set_Context_Menu, CallFunc_Create_ReturnValue) == 0x0000D8, "Member 'UIW_ContextMenu_C_Set_Context_Menu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_Set_Context_Menu, K2Node_MakeStruct_TweenEase) == 0x0000E0, "Member 'UIW_ContextMenu_C_Set_Context_Menu::K2Node_MakeStruct_TweenEase' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_Set_Context_Menu, CallFunc_Map_Find_Value) == 0x0000F0, "Member 'UIW_ContextMenu_C_Set_Context_Menu::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_Set_Context_Menu, CallFunc_Map_Find_ReturnValue) == 0x000108, "Member 'UIW_ContextMenu_C_Set_Context_Menu::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_Set_Context_Menu, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000110, "Member 'UIW_ContextMenu_C_Set_Context_Menu::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

// Function UIW_ContextMenu.UIW_ContextMenu_C.ReleasedButton
// 0x0010 (0x0010 - 0x0000)
struct UIW_ContextMenu_C_ReleasedButton final
{
public:
	class FName                                   EventName_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ContextMenu_C_ReleasedButton) == 0x000008, "Wrong alignment on UIW_ContextMenu_C_ReleasedButton");
static_assert(sizeof(UIW_ContextMenu_C_ReleasedButton) == 0x000010, "Wrong size on UIW_ContextMenu_C_ReleasedButton");
static_assert(offsetof(UIW_ContextMenu_C_ReleasedButton, EventName_0) == 0x000000, "Member 'UIW_ContextMenu_C_ReleasedButton::EventName_0' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_ReleasedButton, CallFunc_GetMainWidget_MainWidget) == 0x000008, "Member 'UIW_ContextMenu_C_ReleasedButton::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");

// Function UIW_ContextMenu.UIW_ContextMenu_C.OnKeyUp
// 0x0210 (0x0210 - 0x0000)
struct UIW_ContextMenu_C_OnKeyUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0070(0x00B8)(Parm, OutParm, ReturnParm)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUINavigation                                 CallFunc_Key_GetNavigationDirectionFromKey_ReturnValue; // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUINavigationAction                           CallFunc_Key_GetNavigationActionFromKey_ReturnValue; // 0x0132(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_133[0x5];                                      // 0x0133(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0138(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Key_IsButtonAxis_ReturnValue;             // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_153[0x5];                                      // 0x0153(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0158(0x00B8)()
};
static_assert(alignof(UIW_ContextMenu_C_OnKeyUp) == 0x000008, "Wrong alignment on UIW_ContextMenu_C_OnKeyUp");
static_assert(sizeof(UIW_ContextMenu_C_OnKeyUp) == 0x000210, "Wrong size on UIW_ContextMenu_C_OnKeyUp");
static_assert(offsetof(UIW_ContextMenu_C_OnKeyUp, MyGeometry) == 0x000000, "Member 'UIW_ContextMenu_C_OnKeyUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_OnKeyUp, InKeyEvent) == 0x000038, "Member 'UIW_ContextMenu_C_OnKeyUp::InKeyEvent' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_OnKeyUp, ReturnValue) == 0x000070, "Member 'UIW_ContextMenu_C_OnKeyUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_OnKeyUp, CallFunc_GetMainWidget_MainWidget) == 0x000128, "Member 'UIW_ContextMenu_C_OnKeyUp::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_OnKeyUp, CallFunc_Key_GetNavigationDirectionFromKey_ReturnValue) == 0x000130, "Member 'UIW_ContextMenu_C_OnKeyUp::CallFunc_Key_GetNavigationDirectionFromKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_OnKeyUp, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000131, "Member 'UIW_ContextMenu_C_OnKeyUp::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_OnKeyUp, CallFunc_Key_GetNavigationActionFromKey_ReturnValue) == 0x000132, "Member 'UIW_ContextMenu_C_OnKeyUp::CallFunc_Key_GetNavigationActionFromKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_OnKeyUp, CallFunc_GetKey_ReturnValue) == 0x000138, "Member 'UIW_ContextMenu_C_OnKeyUp::CallFunc_GetKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_OnKeyUp, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000150, "Member 'UIW_ContextMenu_C_OnKeyUp::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_OnKeyUp, CallFunc_Key_IsButtonAxis_ReturnValue) == 0x000151, "Member 'UIW_ContextMenu_C_OnKeyUp::CallFunc_Key_IsButtonAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_OnKeyUp, CallFunc_BooleanAND_ReturnValue) == 0x000152, "Member 'UIW_ContextMenu_C_OnKeyUp::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_OnKeyUp, CallFunc_Handled_ReturnValue) == 0x000158, "Member 'UIW_ContextMenu_C_OnKeyUp::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UIW_ContextMenu.UIW_ContextMenu_C.SelectedButton
// 0x0008 (0x0008 - 0x0000)
struct UIW_ContextMenu_C_SelectedButton final
{
public:
	class FName                                   EventName_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ContextMenu_C_SelectedButton) == 0x000004, "Wrong alignment on UIW_ContextMenu_C_SelectedButton");
static_assert(sizeof(UIW_ContextMenu_C_SelectedButton) == 0x000008, "Wrong size on UIW_ContextMenu_C_SelectedButton");
static_assert(offsetof(UIW_ContextMenu_C_SelectedButton, EventName_0) == 0x000000, "Member 'UIW_ContextMenu_C_SelectedButton::EventName_0' has a wrong offset!");

// Function UIW_ContextMenu.UIW_ContextMenu_C.OnFocusReceived
// 0x01C0 (0x01C0 - 0x0000)
struct UIW_ContextMenu_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x00F8(0x00B8)()
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ContextMenu_C_OnFocusReceived) == 0x000008, "Wrong alignment on UIW_ContextMenu_C_OnFocusReceived");
static_assert(sizeof(UIW_ContextMenu_C_OnFocusReceived) == 0x0001C0, "Wrong size on UIW_ContextMenu_C_OnFocusReceived");
static_assert(offsetof(UIW_ContextMenu_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UIW_ContextMenu_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UIW_ContextMenu_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UIW_ContextMenu_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_OnFocusReceived, K2Node_MakeStruct_EventReply) == 0x0000F8, "Member 'UIW_ContextMenu_C_OnFocusReceived::K2Node_MakeStruct_EventReply' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_OnFocusReceived, CallFunc_HasAnyChildren_ReturnValue) == 0x0001B0, "Member 'UIW_ContextMenu_C_OnFocusReceived::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_OnFocusReceived, CallFunc_GetChildAt_ReturnValue) == 0x0001B8, "Member 'UIW_ContextMenu_C_OnFocusReceived::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");

// Function UIW_ContextMenu.UIW_ContextMenu_C.OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct UIW_ContextMenu_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UIW_ContextMenu_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on UIW_ContextMenu_C_OnMouseButtonDown");
static_assert(sizeof(UIW_ContextMenu_C_OnMouseButtonDown) == 0x000218, "Wrong size on UIW_ContextMenu_C_OnMouseButtonDown");
static_assert(offsetof(UIW_ContextMenu_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'UIW_ContextMenu_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'UIW_ContextMenu_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'UIW_ContextMenu_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_OnMouseButtonDown, K2Node_MakeStruct_EventReply) == 0x000160, "Member 'UIW_ContextMenu_C_OnMouseButtonDown::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function UIW_ContextMenu.UIW_ContextMenu_C.FirstFocus
// 0x0008 (0x0008 - 0x0000)
struct UIW_ContextMenu_C_FirstFocus final
{
public:
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ContextMenu_C_FirstFocus) == 0x000008, "Wrong alignment on UIW_ContextMenu_C_FirstFocus");
static_assert(sizeof(UIW_ContextMenu_C_FirstFocus) == 0x000008, "Wrong size on UIW_ContextMenu_C_FirstFocus");
static_assert(offsetof(UIW_ContextMenu_C_FirstFocus, CallFunc_GetChildAt_ReturnValue) == 0x000000, "Member 'UIW_ContextMenu_C_FirstFocus::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");

// Function UIW_ContextMenu.UIW_ContextMenu_C.Close
// 0x0008 (0x0008 - 0x0000)
struct UIW_ContextMenu_C_Close final
{
public:
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ContextMenu_C_Close) == 0x000008, "Wrong alignment on UIW_ContextMenu_C_Close");
static_assert(sizeof(UIW_ContextMenu_C_Close) == 0x000008, "Wrong size on UIW_ContextMenu_C_Close");
static_assert(offsetof(UIW_ContextMenu_C_Close, CallFunc_GetMainWidget_MainWidget) == 0x000000, "Member 'UIW_ContextMenu_C_Close::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");

// Function UIW_ContextMenu.UIW_ContextMenu_C.OnMouseButtonUp
// 0x0218 (0x0218 - 0x0000)
struct UIW_ContextMenu_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UIW_ContextMenu_C_OnMouseButtonUp) == 0x000008, "Wrong alignment on UIW_ContextMenu_C_OnMouseButtonUp");
static_assert(sizeof(UIW_ContextMenu_C_OnMouseButtonUp) == 0x000218, "Wrong size on UIW_ContextMenu_C_OnMouseButtonUp");
static_assert(offsetof(UIW_ContextMenu_C_OnMouseButtonUp, MyGeometry) == 0x000000, "Member 'UIW_ContextMenu_C_OnMouseButtonUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_OnMouseButtonUp, MouseEvent) == 0x000038, "Member 'UIW_ContextMenu_C_OnMouseButtonUp::MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_OnMouseButtonUp, ReturnValue) == 0x0000A8, "Member 'UIW_ContextMenu_C_OnMouseButtonUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_C_OnMouseButtonUp, K2Node_MakeStruct_EventReply) == 0x000160, "Member 'UIW_ContextMenu_C_OnMouseButtonUp::K2Node_MakeStruct_EventReply' has a wrong offset!");

}

