#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ListItem_Stat_Normal

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_ListItem_Stat_Normal.UIW_ListItem_Stat_Normal_C
// 0x00B8 (0x0360 - 0x02A8)
class UUIW_ListItem_Stat_Normal_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUIW_Stat_Diff_C*                       Diff;                                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FableUnit_0;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FableUnit_1;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FableUnit_2;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FableUnit_3;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FableUnit_4;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FableUnit_5;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Img_ChaUpPreview;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Icon;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Stat_1;                                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Stat_2;                                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Stat_3;                                            // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Stat_Fable;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Stat_Slash_01;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Stat_Slash_02;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Label;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Value_1;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Value_2;                                      // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Value_3;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<ELFirstStat>                           ChaUpPreviewStat;                                  // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UUIW_CharacterUpgrade_C*                ChaUpWidget;                                       // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_ListItem_Stat_Normal(int32 EntryPoint);
	void Destruct();
	void Construct();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();
	void SetOneStat(class UUIBP_ListData_OneStat_C* StatData);
	void SetTwoStat(class UUIBP_ListData_TwoStat_C* StatData);
	void OnUpgradePreview(ELFirstStat FirstStat);
	void SetThreeStat(class UUIBP_ListData_ThreeStat_C* StatData);
	void SetCommon(const class FText& Label, TSoftObjectPtr<class UObject> Icon, TArray<ELFirstStat>& ChaUpPreview);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_ListItem_Stat_Normal_C">();
	}
	static class UUIW_ListItem_Stat_Normal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_ListItem_Stat_Normal_C>();
	}
};
static_assert(alignof(UUIW_ListItem_Stat_Normal_C) == 0x000008, "Wrong alignment on UUIW_ListItem_Stat_Normal_C");
static_assert(sizeof(UUIW_ListItem_Stat_Normal_C) == 0x000360, "Wrong size on UUIW_ListItem_Stat_Normal_C");
static_assert(offsetof(UUIW_ListItem_Stat_Normal_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_ListItem_Stat_Normal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Normal_C, Diff) == 0x0002B0, "Member 'UUIW_ListItem_Stat_Normal_C::Diff' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Normal_C, FableUnit_0) == 0x0002B8, "Member 'UUIW_ListItem_Stat_Normal_C::FableUnit_0' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Normal_C, FableUnit_1) == 0x0002C0, "Member 'UUIW_ListItem_Stat_Normal_C::FableUnit_1' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Normal_C, FableUnit_2) == 0x0002C8, "Member 'UUIW_ListItem_Stat_Normal_C::FableUnit_2' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Normal_C, FableUnit_3) == 0x0002D0, "Member 'UUIW_ListItem_Stat_Normal_C::FableUnit_3' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Normal_C, FableUnit_4) == 0x0002D8, "Member 'UUIW_ListItem_Stat_Normal_C::FableUnit_4' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Normal_C, FableUnit_5) == 0x0002E0, "Member 'UUIW_ListItem_Stat_Normal_C::FableUnit_5' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Normal_C, Img_ChaUpPreview) == 0x0002E8, "Member 'UUIW_ListItem_Stat_Normal_C::Img_ChaUpPreview' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Normal_C, Img_Icon) == 0x0002F0, "Member 'UUIW_ListItem_Stat_Normal_C::Img_Icon' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Normal_C, Stat_1) == 0x0002F8, "Member 'UUIW_ListItem_Stat_Normal_C::Stat_1' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Normal_C, Stat_2) == 0x000300, "Member 'UUIW_ListItem_Stat_Normal_C::Stat_2' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Normal_C, Stat_3) == 0x000308, "Member 'UUIW_ListItem_Stat_Normal_C::Stat_3' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Normal_C, Stat_Fable) == 0x000310, "Member 'UUIW_ListItem_Stat_Normal_C::Stat_Fable' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Normal_C, Stat_Slash_01) == 0x000318, "Member 'UUIW_ListItem_Stat_Normal_C::Stat_Slash_01' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Normal_C, Stat_Slash_02) == 0x000320, "Member 'UUIW_ListItem_Stat_Normal_C::Stat_Slash_02' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Normal_C, Text_Label) == 0x000328, "Member 'UUIW_ListItem_Stat_Normal_C::Text_Label' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Normal_C, Text_Value_1) == 0x000330, "Member 'UUIW_ListItem_Stat_Normal_C::Text_Value_1' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Normal_C, Text_Value_2) == 0x000338, "Member 'UUIW_ListItem_Stat_Normal_C::Text_Value_2' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Normal_C, Text_Value_3) == 0x000340, "Member 'UUIW_ListItem_Stat_Normal_C::Text_Value_3' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Normal_C, ChaUpPreviewStat) == 0x000348, "Member 'UUIW_ListItem_Stat_Normal_C::ChaUpPreviewStat' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Stat_Normal_C, ChaUpWidget) == 0x000358, "Member 'UUIW_ListItem_Stat_Normal_C::ChaUpWidget' has a wrong offset!");

}

