#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ListItem_Custom

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_ListItem_Custom.UIW_ListItem_Custom_C
// 0x00B0 (0x0358 - 0x02A8)
class UUIW_ListItem_Custom_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Deco_BlankBox_1;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Deco_BlankBox_2;                                   // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Group_ItemLabel;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Group_ItemLabel_1;                                 // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Group_ItemLabel_2;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Group_LocalName;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Group_Plus;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Blade;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Correction;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Equip;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Handle;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_LabelCutLine;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ReinforceNum;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Fx_ListBtn_Bg_C*                   Selected;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_CombineWeapon;                                // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ItemLabel_1;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ItemLabel_2;                                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULWeaponItem*                           LWeapon;                                           // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Window_C*                          OwerWindow;                                        // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UListView*                              OwnerListView;                                     // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UIW_ListItem_Custom(int32 EntryPoint);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void Construct();
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void Destruct();
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void SetMoveFocusEffect();
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void Set_Handle_Correction();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_ListItem_Custom_C">();
	}
	static class UUIW_ListItem_Custom_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_ListItem_Custom_C>();
	}
};
static_assert(alignof(UUIW_ListItem_Custom_C) == 0x000008, "Wrong alignment on UUIW_ListItem_Custom_C");
static_assert(sizeof(UUIW_ListItem_Custom_C) == 0x000358, "Wrong size on UUIW_ListItem_Custom_C");
static_assert(offsetof(UUIW_ListItem_Custom_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_ListItem_Custom_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Custom_C, Deco_BlankBox_1) == 0x0002B0, "Member 'UUIW_ListItem_Custom_C::Deco_BlankBox_1' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Custom_C, Deco_BlankBox_2) == 0x0002B8, "Member 'UUIW_ListItem_Custom_C::Deco_BlankBox_2' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Custom_C, Group_ItemLabel) == 0x0002C0, "Member 'UUIW_ListItem_Custom_C::Group_ItemLabel' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Custom_C, Group_ItemLabel_1) == 0x0002C8, "Member 'UUIW_ListItem_Custom_C::Group_ItemLabel_1' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Custom_C, Group_ItemLabel_2) == 0x0002D0, "Member 'UUIW_ListItem_Custom_C::Group_ItemLabel_2' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Custom_C, Group_LocalName) == 0x0002D8, "Member 'UUIW_ListItem_Custom_C::Group_LocalName' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Custom_C, Group_Plus) == 0x0002E0, "Member 'UUIW_ListItem_Custom_C::Group_Plus' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Custom_C, Img_Blade) == 0x0002E8, "Member 'UUIW_ListItem_Custom_C::Img_Blade' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Custom_C, Img_Correction) == 0x0002F0, "Member 'UUIW_ListItem_Custom_C::Img_Correction' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Custom_C, Img_Equip) == 0x0002F8, "Member 'UUIW_ListItem_Custom_C::Img_Equip' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Custom_C, Img_Handle) == 0x000300, "Member 'UUIW_ListItem_Custom_C::Img_Handle' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Custom_C, IMG_LabelCutLine) == 0x000308, "Member 'UUIW_ListItem_Custom_C::IMG_LabelCutLine' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Custom_C, ReinforceNum) == 0x000310, "Member 'UUIW_ListItem_Custom_C::ReinforceNum' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Custom_C, Selected) == 0x000318, "Member 'UUIW_ListItem_Custom_C::Selected' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Custom_C, Text_CombineWeapon) == 0x000320, "Member 'UUIW_ListItem_Custom_C::Text_CombineWeapon' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Custom_C, Text_ItemLabel_1) == 0x000328, "Member 'UUIW_ListItem_Custom_C::Text_ItemLabel_1' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Custom_C, Text_ItemLabel_2) == 0x000330, "Member 'UUIW_ListItem_Custom_C::Text_ItemLabel_2' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Custom_C, LWeapon) == 0x000338, "Member 'UUIW_ListItem_Custom_C::LWeapon' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Custom_C, OwerWindow) == 0x000340, "Member 'UUIW_ListItem_Custom_C::OwerWindow' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Custom_C, OwnerListView) == 0x000348, "Member 'UUIW_ListItem_Custom_C::OwnerListView' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Custom_C, IsSelected) == 0x000350, "Member 'UUIW_ListItem_Custom_C::IsSelected' has a wrong offset!");

}

