#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Correction_ListItem

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"
#include "ProjectP_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UIW_Correction_ListItem.UIW_Correction_ListItem_C.ExecuteUbergraph_UIW_Correction_ListItem
// 0x0468 (0x0468 - 0x0000)
struct UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0038(0x0028)()
	class UUIBP_ListData_HandleCorrection_C*      K2Node_DynamicCast_AsUIBP_List_Data_Handle_Correction; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetListItemObject_ReturnValue_1;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0078(0x0028)()
	class UUIBP_ListData_HandleCorrection_C*      K2Node_DynamicCast_AsUIBP_List_Data_Handle_Correction_1; // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetListItemObject_ReturnValue_2;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x00B8(0x0028)()
	class UUIBP_ListData_HandleCorrection_C*      K2Node_DynamicCast_AsUIBP_List_Data_Handle_Correction_2; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetListItemObject_ReturnValue_3;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_HandleCorrection_C*      K2Node_DynamicCast_AsUIBP_List_Data_Handle_Correction_3; // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetListItemObject_ReturnValue_4;          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_HandleCorrection_C*      K2Node_DynamicCast_AsUIBP_List_Data_Handle_Correction_4; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x0120(0x0028)()
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_HandleCorrection_C*      K2Node_DynamicCast_AsUIBP_List_Data_Handle_Correction_5; // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x016C(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x01A8(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0218(0x0070)(ConstParm)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0288(0x0008)(NoDestructor)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x0298(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_6;                    // 0x02C0(0x0028)()
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentErgo_ReturnValue;               // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerInventory*                      CallFunc_GetPlayerInventory_ReturnValue;           // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_7;                    // 0x0310(0x0028)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanCorrection_CanCorrection;              // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33A[0x6];                                      // 0x033A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_8;                    // 0x0340(0x0028)()
	struct FHandleStatCorrectionChangeInfoPtr     CallFunc_GetCorrectionInfo_CorrectionInfo;         // 0x0368(0x0008)(NoDestructor)
	class FName                                   CallFunc_GetChangeCorrectionHandleNeeds_OutItemCodeName; // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChangeCorrectionHandleNeeds_OutItemCount; // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChangeCorrectionHandleNeeds_OutErgoCount; // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAdvanceGradeChange_ReturnValue;        // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_385[0x3];                                      // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetArrowIcon_Texture2D;                   // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemTotalCountByCodeName_ReturnValue;  // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTechniqueGradeChange_ReturnValue;      // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetArrowIcon_Texture2D_1;                 // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9[0x3];                                      // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMotivityGradeChange_ReturnValue;       // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetArrowIcon_Texture2D_2;                 // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetResultGrade_ResultGrade;               // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetResultGrade_ResultGrade_1;             // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetResultGrade_ResultGrade_2;             // 0x03BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BB[0x5];                                      // 0x03BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x03C0(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x03D8(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_2;         // 0x03F0(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_3;         // 0x0408(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_9;                    // 0x0420(0x0028)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetListItemObject_ReturnValue_5;          // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_HandleCorrection_C*      K2Node_DynamicCast_AsUIBP_List_Data_Handle_Correction_6; // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem) == 0x000008, "Wrong alignment on UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem");
static_assert(sizeof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem) == 0x000468, "Wrong size on UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, EntryPoint) == 0x000000, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetListItemObject_ReturnValue) == 0x000030, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_MakeStruct_SlateColor_1) == 0x000038, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_DynamicCast_AsUIBP_List_Data_Handle_Correction) == 0x000060, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_DynamicCast_AsUIBP_List_Data_Handle_Correction' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetListItemObject_ReturnValue_1) == 0x000070, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetListItemObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_MakeStruct_SlateColor_2) == 0x000078, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_DynamicCast_AsUIBP_List_Data_Handle_Correction_1) == 0x0000A0, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_DynamicCast_AsUIBP_List_Data_Handle_Correction_1' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_DynamicCast_bSuccess_1) == 0x0000A8, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetListItemObject_ReturnValue_2) == 0x0000B0, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetListItemObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_MakeStruct_SlateColor_3) == 0x0000B8, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_DynamicCast_AsUIBP_List_Data_Handle_Correction_2) == 0x0000E0, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_DynamicCast_AsUIBP_List_Data_Handle_Correction_2' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_DynamicCast_bSuccess_2) == 0x0000E8, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetListItemObject_ReturnValue_3) == 0x0000F0, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetListItemObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_DynamicCast_AsUIBP_List_Data_Handle_Correction_3) == 0x0000F8, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_DynamicCast_AsUIBP_List_Data_Handle_Correction_3' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_DynamicCast_bSuccess_3) == 0x000100, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetListItemObject_ReturnValue_4) == 0x000108, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetListItemObject_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_DynamicCast_AsUIBP_List_Data_Handle_Correction_4) == 0x000110, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_DynamicCast_AsUIBP_List_Data_Handle_Correction_4' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_DynamicCast_bSuccess_4) == 0x000118, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_MakeStruct_SlateColor_4) == 0x000120, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_Event_bIsExpanded) == 0x000148, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_Event_ListItemObject) == 0x000150, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_Event_bIsSelected) == 0x000158, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_DynamicCast_AsUIBP_List_Data_Handle_Correction_5) == 0x000160, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_DynamicCast_AsUIBP_List_Data_Handle_Correction_5' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_DynamicCast_bSuccess_5) == 0x000168, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_Event_MyGeometry) == 0x00016C, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_Event_MouseEvent_1) == 0x0001A8, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_Event_MouseEvent) == 0x000218, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_Event_InFocusEvent) == 0x000288, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetMainWidget_MainWidget) == 0x000290, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_MakeStruct_SlateColor_5) == 0x000298, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_MakeStruct_SlateColor_5' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_MakeStruct_SlateColor_6) == 0x0002C0, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_MakeStruct_SlateColor_6' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0002E8, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0002F0, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetCurrentErgo_ReturnValue) == 0x0002F8, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetCurrentErgo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000300, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetPlayerInventory_ReturnValue) == 0x000308, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetPlayerInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_MakeStruct_SlateColor_7) == 0x000310, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_MakeStruct_SlateColor_7' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_SwitchEnum_CmpSuccess) == 0x000338, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_CanCorrection_CanCorrection) == 0x000339, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_CanCorrection_CanCorrection' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_MakeStruct_SlateColor_8) == 0x000340, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_MakeStruct_SlateColor_8' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetCorrectionInfo_CorrectionInfo) == 0x000368, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetCorrectionInfo_CorrectionInfo' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetChangeCorrectionHandleNeeds_OutItemCodeName) == 0x000370, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetChangeCorrectionHandleNeeds_OutItemCodeName' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetChangeCorrectionHandleNeeds_OutItemCount) == 0x000378, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetChangeCorrectionHandleNeeds_OutItemCount' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetChangeCorrectionHandleNeeds_OutErgoCount) == 0x00037C, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetChangeCorrectionHandleNeeds_OutErgoCount' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetAdvanceGradeChange_ReturnValue) == 0x000380, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetAdvanceGradeChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000384, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetArrowIcon_Texture2D) == 0x000388, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetArrowIcon_Texture2D' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetItemTotalCountByCodeName_ReturnValue) == 0x000390, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetItemTotalCountByCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetTechniqueGradeChange_ReturnValue) == 0x000394, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetTechniqueGradeChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x000398, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetArrowIcon_Texture2D_1) == 0x0003A0, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetArrowIcon_Texture2D_1' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_BooleanAND_ReturnValue) == 0x0003A8, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetMotivityGradeChange_ReturnValue) == 0x0003AC, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetMotivityGradeChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetArrowIcon_Texture2D_2) == 0x0003B0, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetArrowIcon_Texture2D_2' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetResultGrade_ResultGrade) == 0x0003B8, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetResultGrade_ResultGrade' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetResultGrade_ResultGrade_1) == 0x0003B9, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetResultGrade_ResultGrade_1' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetResultGrade_ResultGrade_2) == 0x0003BA, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetResultGrade_ResultGrade_2' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetGameStrWithName_ReturnValue) == 0x0003C0, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetGameStrWithName_ReturnValue_1) == 0x0003D8, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetGameStrWithName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetGameStrWithName_ReturnValue_2) == 0x0003F0, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetGameStrWithName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetGameStrWithName_ReturnValue_3) == 0x000408, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetGameStrWithName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_MakeStruct_SlateColor_9) == 0x000420, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_MakeStruct_SlateColor_9' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_PlayAnimation_ReturnValue) == 0x000448, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, CallFunc_GetListItemObject_ReturnValue_5) == 0x000450, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::CallFunc_GetListItemObject_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_DynamicCast_AsUIBP_List_Data_Handle_Correction_6) == 0x000458, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_DynamicCast_AsUIBP_List_Data_Handle_Correction_6' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem, K2Node_DynamicCast_bSuccess_6) == 0x000460, "Member 'UIW_Correction_ListItem_C_ExecuteUbergraph_UIW_Correction_ListItem::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");

// Function UIW_Correction_ListItem.UIW_Correction_ListItem_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct UIW_Correction_ListItem_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UIW_Correction_ListItem_C_OnFocusLost) == 0x000004, "Wrong alignment on UIW_Correction_ListItem_C_OnFocusLost");
static_assert(sizeof(UIW_Correction_ListItem_C_OnFocusLost) == 0x000008, "Wrong size on UIW_Correction_ListItem_C_OnFocusLost");
static_assert(offsetof(UIW_Correction_ListItem_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'UIW_Correction_ListItem_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function UIW_Correction_ListItem.UIW_Correction_ListItem_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct UIW_Correction_ListItem_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIW_Correction_ListItem_C_OnMouseLeave) == 0x000008, "Wrong alignment on UIW_Correction_ListItem_C_OnMouseLeave");
static_assert(sizeof(UIW_Correction_ListItem_C_OnMouseLeave) == 0x000070, "Wrong size on UIW_Correction_ListItem_C_OnMouseLeave");
static_assert(offsetof(UIW_Correction_ListItem_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'UIW_Correction_ListItem_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function UIW_Correction_ListItem.UIW_Correction_ListItem_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct UIW_Correction_ListItem_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIW_Correction_ListItem_C_OnMouseEnter) == 0x000008, "Wrong alignment on UIW_Correction_ListItem_C_OnMouseEnter");
static_assert(sizeof(UIW_Correction_ListItem_C_OnMouseEnter) == 0x0000A8, "Wrong size on UIW_Correction_ListItem_C_OnMouseEnter");
static_assert(offsetof(UIW_Correction_ListItem_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'UIW_Correction_ListItem_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'UIW_Correction_ListItem_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function UIW_Correction_ListItem.UIW_Correction_ListItem_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_Correction_ListItem_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Correction_ListItem_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on UIW_Correction_ListItem_C_BP_OnItemSelectionChanged");
static_assert(sizeof(UIW_Correction_ListItem_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on UIW_Correction_ListItem_C_BP_OnItemSelectionChanged");
static_assert(offsetof(UIW_Correction_ListItem_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'UIW_Correction_ListItem_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function UIW_Correction_ListItem.UIW_Correction_ListItem_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct UIW_Correction_ListItem_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Correction_ListItem_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on UIW_Correction_ListItem_C_OnListItemObjectSet");
static_assert(sizeof(UIW_Correction_ListItem_C_OnListItemObjectSet) == 0x000008, "Wrong size on UIW_Correction_ListItem_C_OnListItemObjectSet");
static_assert(offsetof(UIW_Correction_ListItem_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'UIW_Correction_ListItem_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function UIW_Correction_ListItem.UIW_Correction_ListItem_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_Correction_ListItem_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Correction_ListItem_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on UIW_Correction_ListItem_C_BP_OnItemExpansionChanged");
static_assert(sizeof(UIW_Correction_ListItem_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on UIW_Correction_ListItem_C_BP_OnItemExpansionChanged");
static_assert(offsetof(UIW_Correction_ListItem_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'UIW_Correction_ListItem_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function UIW_Correction_ListItem.UIW_Correction_ListItem_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct UIW_Correction_ListItem_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(UIW_Correction_ListItem_C_OnFocusReceived) == 0x000008, "Wrong alignment on UIW_Correction_ListItem_C_OnFocusReceived");
static_assert(sizeof(UIW_Correction_ListItem_C_OnFocusReceived) == 0x0001B0, "Wrong size on UIW_Correction_ListItem_C_OnFocusReceived");
static_assert(offsetof(UIW_Correction_ListItem_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UIW_Correction_ListItem_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UIW_Correction_ListItem_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UIW_Correction_ListItem_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'UIW_Correction_ListItem_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UIW_Correction_ListItem.UIW_Correction_ListItem_C.CanCorrection
// 0x0018 (0x0018 - 0x0000)
struct UIW_Correction_ListItem_C_CanCorrection final
{
public:
	bool                                          CanCorrection_0;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULWeaponItem*                           K2Node_DynamicCast_AsLWeapon_Item;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanChangeCorrection_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanChangeCorrectionHandle_ReturnValue;    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Correction_ListItem_C_CanCorrection) == 0x000008, "Wrong alignment on UIW_Correction_ListItem_C_CanCorrection");
static_assert(sizeof(UIW_Correction_ListItem_C_CanCorrection) == 0x000018, "Wrong size on UIW_Correction_ListItem_C_CanCorrection");
static_assert(offsetof(UIW_Correction_ListItem_C_CanCorrection, CanCorrection_0) == 0x000000, "Member 'UIW_Correction_ListItem_C_CanCorrection::CanCorrection_0' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_CanCorrection, K2Node_DynamicCast_AsLWeapon_Item) == 0x000008, "Member 'UIW_Correction_ListItem_C_CanCorrection::K2Node_DynamicCast_AsLWeapon_Item' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_CanCorrection, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'UIW_Correction_ListItem_C_CanCorrection::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_CanCorrection, CallFunc_CanChangeCorrection_ReturnValue) == 0x000011, "Member 'UIW_Correction_ListItem_C_CanCorrection::CallFunc_CanChangeCorrection_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_CanCorrection, CallFunc_CanChangeCorrectionHandle_ReturnValue) == 0x000012, "Member 'UIW_Correction_ListItem_C_CanCorrection::CallFunc_CanChangeCorrectionHandle_ReturnValue' has a wrong offset!");

// Function UIW_Correction_ListItem.UIW_Correction_ListItem_C.GetCorrectionInfo
// 0x0028 (0x0028 - 0x0000)
struct UIW_Correction_ListItem_C_GetCorrectionInfo final
{
public:
	struct FHandleStatCorrectionChangeInfoPtr     CorrectionInfo;                                    // 0x0000(0x0008)(Parm, OutParm, NoDestructor)
	class ULWeaponItem*                           K2Node_DynamicCast_AsLWeapon_Item;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHandleStatCorrectionChangeInfoPtr     CallFunc_GetChangeCorrectionInfo_ReturnValue;      // 0x0018(0x0008)(NoDestructor)
	struct FHandleStatCorrectionChangeInfoPtr     CallFunc_GetHandleChangeCorrectionInfo_ReturnValue; // 0x0020(0x0008)(NoDestructor)
};
static_assert(alignof(UIW_Correction_ListItem_C_GetCorrectionInfo) == 0x000008, "Wrong alignment on UIW_Correction_ListItem_C_GetCorrectionInfo");
static_assert(sizeof(UIW_Correction_ListItem_C_GetCorrectionInfo) == 0x000028, "Wrong size on UIW_Correction_ListItem_C_GetCorrectionInfo");
static_assert(offsetof(UIW_Correction_ListItem_C_GetCorrectionInfo, CorrectionInfo) == 0x000000, "Member 'UIW_Correction_ListItem_C_GetCorrectionInfo::CorrectionInfo' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_GetCorrectionInfo, K2Node_DynamicCast_AsLWeapon_Item) == 0x000008, "Member 'UIW_Correction_ListItem_C_GetCorrectionInfo::K2Node_DynamicCast_AsLWeapon_Item' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_GetCorrectionInfo, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'UIW_Correction_ListItem_C_GetCorrectionInfo::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_GetCorrectionInfo, CallFunc_GetChangeCorrectionInfo_ReturnValue) == 0x000018, "Member 'UIW_Correction_ListItem_C_GetCorrectionInfo::CallFunc_GetChangeCorrectionInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_GetCorrectionInfo, CallFunc_GetHandleChangeCorrectionInfo_ReturnValue) == 0x000020, "Member 'UIW_Correction_ListItem_C_GetCorrectionInfo::CallFunc_GetHandleChangeCorrectionInfo_ReturnValue' has a wrong offset!");

// Function UIW_Correction_ListItem.UIW_Correction_ListItem_C.GetResultGrade
// 0x0028 (0x0028 - 0x0000)
struct UIW_Correction_ListItem_C_GetResultGrade final
{
public:
	ELFirstStat                                   FirstStat;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ResultGrade;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ELHandleCorrectResultGrade                    LocalResultGrade;                                  // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCorrectionGrade_OutStackLevel;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELHandleCorrectResultGrade                    CallFunc_GetCorrectionGrade_ReturnValue;           // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULWeaponItem*                           K2Node_DynamicCast_AsLWeapon_Item;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetHandleCorrectionGrade_OutStackLevel;   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELHandleCorrectResultGrade                    CallFunc_GetHandleCorrectionGrade_ReturnValue;     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Correction_ListItem_C_GetResultGrade) == 0x000008, "Wrong alignment on UIW_Correction_ListItem_C_GetResultGrade");
static_assert(sizeof(UIW_Correction_ListItem_C_GetResultGrade) == 0x000028, "Wrong size on UIW_Correction_ListItem_C_GetResultGrade");
static_assert(offsetof(UIW_Correction_ListItem_C_GetResultGrade, FirstStat) == 0x000000, "Member 'UIW_Correction_ListItem_C_GetResultGrade::FirstStat' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_GetResultGrade, ResultGrade) == 0x000001, "Member 'UIW_Correction_ListItem_C_GetResultGrade::ResultGrade' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_GetResultGrade, LocalResultGrade) == 0x000002, "Member 'UIW_Correction_ListItem_C_GetResultGrade::LocalResultGrade' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_GetResultGrade, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000003, "Member 'UIW_Correction_ListItem_C_GetResultGrade::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_GetResultGrade, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'UIW_Correction_ListItem_C_GetResultGrade::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_GetResultGrade, CallFunc_GetCorrectionGrade_OutStackLevel) == 0x000008, "Member 'UIW_Correction_ListItem_C_GetResultGrade::CallFunc_GetCorrectionGrade_OutStackLevel' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_GetResultGrade, CallFunc_GetCorrectionGrade_ReturnValue) == 0x00000C, "Member 'UIW_Correction_ListItem_C_GetResultGrade::CallFunc_GetCorrectionGrade_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_GetResultGrade, K2Node_DynamicCast_AsLWeapon_Item) == 0x000010, "Member 'UIW_Correction_ListItem_C_GetResultGrade::K2Node_DynamicCast_AsLWeapon_Item' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_GetResultGrade, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UIW_Correction_ListItem_C_GetResultGrade::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_GetResultGrade, CallFunc_GetHandleCorrectionGrade_OutStackLevel) == 0x00001C, "Member 'UIW_Correction_ListItem_C_GetResultGrade::CallFunc_GetHandleCorrectionGrade_OutStackLevel' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_GetResultGrade, CallFunc_GetHandleCorrectionGrade_ReturnValue) == 0x000020, "Member 'UIW_Correction_ListItem_C_GetResultGrade::CallFunc_GetHandleCorrectionGrade_ReturnValue' has a wrong offset!");

// Function UIW_Correction_ListItem.UIW_Correction_ListItem_C.GetArrowIcon
// 0x0018 (0x0018 - 0x0000)
struct UIW_Correction_ListItem_C_GetArrowIcon final
{
public:
	int32                                         Int;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Texture2D;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Correction_ListItem_C_GetArrowIcon) == 0x000008, "Wrong alignment on UIW_Correction_ListItem_C_GetArrowIcon");
static_assert(sizeof(UIW_Correction_ListItem_C_GetArrowIcon) == 0x000018, "Wrong size on UIW_Correction_ListItem_C_GetArrowIcon");
static_assert(offsetof(UIW_Correction_ListItem_C_GetArrowIcon, Int) == 0x000000, "Member 'UIW_Correction_ListItem_C_GetArrowIcon::Int' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_GetArrowIcon, Texture2D) == 0x000008, "Member 'UIW_Correction_ListItem_C_GetArrowIcon::Texture2D' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_GetArrowIcon, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'UIW_Correction_ListItem_C_GetArrowIcon::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Correction_ListItem_C_GetArrowIcon, CallFunc_Less_IntInt_ReturnValue) == 0x000011, "Member 'UIW_Correction_ListItem_C_GetArrowIcon::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function UIW_Correction_ListItem.UIW_Correction_ListItem_C.SetMoveFocusEffect
// 0x0008 (0x0008 - 0x0000)
struct UIW_Correction_ListItem_C_SetMoveFocusEffect final
{
public:
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Correction_ListItem_C_SetMoveFocusEffect) == 0x000008, "Wrong alignment on UIW_Correction_ListItem_C_SetMoveFocusEffect");
static_assert(sizeof(UIW_Correction_ListItem_C_SetMoveFocusEffect) == 0x000008, "Wrong size on UIW_Correction_ListItem_C_SetMoveFocusEffect");
static_assert(offsetof(UIW_Correction_ListItem_C_SetMoveFocusEffect, CallFunc_GetMainWidget_MainWidget) == 0x000000, "Member 'UIW_Correction_ListItem_C_SetMoveFocusEffect::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");

}

