#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HUD_Menu

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "ProjectP_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UIW_HUD_Menu.UIW_HUD_Menu_C.ExecuteUbergraph_UIW_HUD_Menu
// 0x0398 (0x0398 - 0x0000)
struct UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NeedCenterMouse;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_DoSave;                         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LockPCActions_ReturnValue;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_2;               // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUIW_HUD_Menu_Btn_C*>            K2Node_MakeArray_Array;                            // 0x0098(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUIW_HUD_Menu_Btn_C* MenuBtn)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00BC(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00E4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x00F4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0104(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget_1;               // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_1;               // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey;                 // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget_2;               // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUIW_HUD_Menu_BeltSlot_C* BeltSlot)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0138(0x0010)(ZeroConstructor, NoDestructor)
	class UUserWidget*                            CallFunc_AddWidget_Widget;                         // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUIW_HUD_Menu_BeltSlot_C* BeltSlot)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0150(0x0010)(ZeroConstructor, NoDestructor)
	class UUIW_Equipment_C*                       K2Node_DynamicCast_AsUIW_Equipment;                // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UUIW_HUD_Menu_PouchSlot_C* PouchSlot)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0174(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUIW_SecondTitle_Icon_C*>        K2Node_MakeArray_Array_1;                          // 0x0188(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void(class UUIW_HUD_Menu_PouchSlot_C* PouchSlot)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x0198(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class UUIW_HUD_Menu_PouchSlot_C*>      K2Node_MakeArray_Array_2;                          // 0x01A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UnEquipUseItem_SpecifiedLine_ReturnValue; // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BA[0x2];                                      // 0x01BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_HUD_Menu_Btn_C*                    CallFunc_Array_Get_Item;                           // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget_3;               // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_AddWidget_Widget_1;                       // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Equipment_C*                       K2Node_DynamicCast_AsUIW_Equipment_1;              // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Slot_Pouch_C*                      CallFunc_Array_Get_Item_1;                         // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bGamePad)>                K2Node_CreateDelegate_OutputDelegate_11;           // 0x0208(0x0010)(ZeroConstructor, NoDestructor)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue_1;         // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bGamePad)>                K2Node_CreateDelegate_OutputDelegate_12;           // 0x0220(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetUseItemSlot_bFound;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x3];                                      // 0x0231(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLUseItemSlot                          CallFunc_GetUseItemSlot_ReturnValue;               // 0x0234(0x0014)(NoDestructor)
	bool                                          CallFunc_GetUseItemSlot_bFound_1;                  // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLUseItemSlot                          CallFunc_GetUseItemSlot_ReturnValue_1;             // 0x024C(0x0014)(NoDestructor)
	bool                                          CallFunc_GetUseItemSlot_bFound_2;                  // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLUseItemSlot                          CallFunc_GetUseItemSlot_ReturnValue_2;             // 0x0264(0x0014)(NoDestructor)
	bool                                          CallFunc_GetUseItemSlot_bFound_3;                  // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLUseItemSlot                          CallFunc_GetUseItemSlot_ReturnValue_3;             // 0x027C(0x0014)(NoDestructor)
	TDelegate<void(bool SyncStart)>               K2Node_CreateDelegate_OutputDelegate_13;           // 0x0290(0x0010)(ZeroConstructor, NoDestructor)
	class ULOptionSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool SyncStart)>               K2Node_CreateDelegate_OutputDelegate_14;           // 0x02A8(0x0010)(ZeroConstructor, NoDestructor)
	class ULOptionSystem*                         CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayInputSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayInputSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_6;   // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePadMode_ReturnValue;                // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x02D8(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x02F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELItemFirstCategory                           CallFunc_GetFirstCategory_ReturnValue;             // 0x02F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELItemFirstCategory                           CallFunc_GetFirstCategory_ReturnValue_1;           // 0x02F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x02F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsListeningForInputAction_ReturnValue;    // 0x02F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x02F7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FA[0x2];                                      // 0x02FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Slot_Belt_C*                       CallFunc_FindBeltSlot_SlotBelt;                    // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_1;           // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_2;           // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_2;            // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_7;   // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_3;           // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue_2;         // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_3;            // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnEquipAssistUseItem_ReturnValue;         // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_335[0x3];                                      // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUIW_HUD_Menu_BeltSlot_C*>       K2Node_MakeArray_Array_3;                          // 0x0338(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UUIW_HUD_Menu_BeltSlot_C*>       K2Node_MakeArray_Array_4;                          // 0x0348(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUIW_HUD_Menu_BeltSlot_C*               CallFunc_Array_Get_Item_2;                         // 0x0358(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_4;           // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_4;            // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_5;           // 0x036D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36E[0x2];                                      // 0x036E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_5;            // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_6;           // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_7;           // 0x0375(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_376[0x2];                                      // 0x0376(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_6;            // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_7;            // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULUISystem*                             CallFunc_GetGameInstanceSubsystem_ReturnValue_8;   // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_HUD_Menu_PouchSlot_C*              CallFunc_Array_Get_Item_3;                         // 0x0388(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0394(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu) == 0x000008, "Wrong alignment on UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu");
static_assert(sizeof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu) == 0x000398, "Wrong size on UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, EntryPoint) == 0x000000, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetPlayerEquipment_ReturnValue) == 0x000018, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetPlayerEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, Temp_int_Loop_Counter_Variable_1) == 0x000024, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_CustomEvent_NeedCenterMouse) == 0x000030, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_CustomEvent_NeedCenterMouse' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_CustomEvent_DoSave) == 0x000031, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_CustomEvent_DoSave' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetMainWidget_MainWidget) == 0x000038, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_LockPCActions_ReturnValue) == 0x000040, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_LockPCActions_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetPlayerController_ReturnValue) == 0x000048, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000050, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000058, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000060, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_PlayAnimation_ReturnValue) == 0x000070, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_CreateDelegate_OutputDelegate) == 0x000078, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_ComponentBoundEvent_BtnKey_2) == 0x000088, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_ComponentBoundEvent_BtnKey_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, Temp_int_Loop_Counter_Variable_2) == 0x000090, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_MakeArray_Array) == 0x000098, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000A8, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000AC, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000BC, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Array_Length_ReturnValue) == 0x0000CC, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000D0, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Less_IntInt_ReturnValue) == 0x0000E0, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000E4, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000F4, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_CreateDelegate_OutputDelegate_6) == 0x000104, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetMainWidget_MainWidget_1) == 0x000118, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetMainWidget_MainWidget_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_ComponentBoundEvent_BtnKey_1) == 0x000120, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_ComponentBoundEvent_BtnKey_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_ComponentBoundEvent_BtnKey) == 0x000128, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_ComponentBoundEvent_BtnKey' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetMainWidget_MainWidget_2) == 0x000130, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetMainWidget_MainWidget_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_CreateDelegate_OutputDelegate_7) == 0x000138, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_AddWidget_Widget) == 0x000148, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_AddWidget_Widget' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_CreateDelegate_OutputDelegate_8) == 0x000150, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_DynamicCast_AsUIW_Equipment) == 0x000160, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_DynamicCast_AsUIW_Equipment' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_DynamicCast_bSuccess) == 0x000168, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, Temp_int_Array_Index_Variable_1) == 0x00016C, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000170, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_CreateDelegate_OutputDelegate_9) == 0x000174, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_MakeArray_Array_1) == 0x000188, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_CreateDelegate_OutputDelegate_10) == 0x000198, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_MakeArray_Array_2) == 0x0001A8, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_IsValid_ReturnValue_1) == 0x0001B8, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_UnEquipUseItem_SpecifiedLine_ReturnValue) == 0x0001B9, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_UnEquipUseItem_SpecifiedLine_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, Temp_int_Array_Index_Variable_2) == 0x0001BC, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_IsValid_ReturnValue_2) == 0x0001C0, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Array_Get_Item) == 0x0001C8, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetMainWidget_MainWidget_3) == 0x0001D0, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetMainWidget_MainWidget_3' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_AddWidget_Widget_1) == 0x0001D8, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_AddWidget_Widget_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_DynamicCast_AsUIW_Equipment_1) == 0x0001E0, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_DynamicCast_AsUIW_Equipment_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_DynamicCast_bSuccess_1) == 0x0001E8, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Array_Find_ReturnValue) == 0x0001EC, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Array_Get_Item_1) == 0x0001F0, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0001F8, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000200, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_CreateDelegate_OutputDelegate_11) == 0x000208, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetPlayerEquipment_ReturnValue_1) == 0x000218, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetPlayerEquipment_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_CreateDelegate_OutputDelegate_12) == 0x000220, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetUseItemSlot_bFound) == 0x000230, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetUseItemSlot_bFound' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetUseItemSlot_ReturnValue) == 0x000234, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetUseItemSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetUseItemSlot_bFound_1) == 0x000248, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetUseItemSlot_bFound_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetUseItemSlot_ReturnValue_1) == 0x00024C, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetUseItemSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetUseItemSlot_bFound_2) == 0x000260, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetUseItemSlot_bFound_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetUseItemSlot_ReturnValue_2) == 0x000264, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetUseItemSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetUseItemSlot_bFound_3) == 0x000278, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetUseItemSlot_bFound_3' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetUseItemSlot_ReturnValue_3) == 0x00027C, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetUseItemSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_CreateDelegate_OutputDelegate_13) == 0x000290, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x0002A0, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_CreateDelegate_OutputDelegate_14) == 0x0002A8, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x0002B8, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x0002C0, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetGameInstanceSubsystem_ReturnValue_6) == 0x0002C8, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetGameInstanceSubsystem_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_IsGamePadMode_ReturnValue) == 0x0002D0, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_IsGamePadMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetGameStrWithName_ReturnValue) == 0x0002D8, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_IsValid_ReturnValue_3) == 0x0002F0, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_IsValid_ReturnValue_4) == 0x0002F1, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetFirstCategory_ReturnValue) == 0x0002F2, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetFirstCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetFirstCategory_ReturnValue_1) == 0x0002F3, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetFirstCategory_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_SwitchEnum_CmpSuccess) == 0x0002F4, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_SwitchEnum_CmpSuccess_1) == 0x0002F5, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_IsListeningForInputAction_ReturnValue) == 0x0002F6, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_IsListeningForInputAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_IsValid_ReturnValue_5) == 0x0002F7, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_IsValid_ReturnValue_6) == 0x0002F8, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Array_RemoveItem_ReturnValue) == 0x0002F9, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Array_AddUnique_ReturnValue) == 0x0002FC, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_FindBeltSlot_SlotBelt) == 0x000300, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_FindBeltSlot_SlotBelt' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Array_RemoveItem_ReturnValue_1) == 0x000308, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Array_RemoveItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Array_AddUnique_ReturnValue_1) == 0x00030C, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Array_RemoveItem_ReturnValue_2) == 0x000310, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Array_RemoveItem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Array_AddUnique_ReturnValue_2) == 0x000314, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Array_AddUnique_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetGameInstanceSubsystem_ReturnValue_7) == 0x000318, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetGameInstanceSubsystem_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Array_RemoveItem_ReturnValue_3) == 0x000320, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Array_RemoveItem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetPlayerEquipment_ReturnValue_2) == 0x000328, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetPlayerEquipment_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Array_AddUnique_ReturnValue_3) == 0x000330, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Array_AddUnique_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_UnEquipAssistUseItem_ReturnValue) == 0x000334, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_UnEquipAssistUseItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_MakeArray_Array_3) == 0x000338, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, K2Node_MakeArray_Array_4) == 0x000348, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Array_Get_Item_2) == 0x000358, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Array_RemoveItem_ReturnValue_4) == 0x000360, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Array_RemoveItem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Array_AddUnique_ReturnValue_4) == 0x000364, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Array_AddUnique_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Array_Length_ReturnValue_1) == 0x000368, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Less_IntInt_ReturnValue_1) == 0x00036C, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Array_RemoveItem_ReturnValue_5) == 0x00036D, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Array_RemoveItem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Array_AddUnique_ReturnValue_5) == 0x000370, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Array_AddUnique_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Array_RemoveItem_ReturnValue_6) == 0x000374, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Array_RemoveItem_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Array_RemoveItem_ReturnValue_7) == 0x000375, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Array_RemoveItem_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Array_AddUnique_ReturnValue_6) == 0x000378, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Array_AddUnique_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Array_AddUnique_ReturnValue_7) == 0x00037C, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Array_AddUnique_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_GetGameInstanceSubsystem_ReturnValue_8) == 0x000380, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_GetGameInstanceSubsystem_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Array_Get_Item_3) == 0x000388, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Array_Length_ReturnValue_2) == 0x000390, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu, CallFunc_Less_IntInt_ReturnValue_2) == 0x000394, "Member 'UIW_HUD_Menu_C_ExecuteUbergraph_UIW_HUD_Menu::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function UIW_HUD_Menu.UIW_HUD_Menu_C.BndEvt__UIW_HUD_Menu_Btn_Use_K2Node_ComponentBoundEvent_3_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_HUD_Menu_C_BndEvt__UIW_HUD_Menu_Btn_Use_K2Node_ComponentBoundEvent_3_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HUD_Menu_C_BndEvt__UIW_HUD_Menu_Btn_Use_K2Node_ComponentBoundEvent_3_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_HUD_Menu_C_BndEvt__UIW_HUD_Menu_Btn_Use_K2Node_ComponentBoundEvent_3_OnActive__DelegateSignature");
static_assert(sizeof(UIW_HUD_Menu_C_BndEvt__UIW_HUD_Menu_Btn_Use_K2Node_ComponentBoundEvent_3_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_HUD_Menu_C_BndEvt__UIW_HUD_Menu_Btn_Use_K2Node_ComponentBoundEvent_3_OnActive__DelegateSignature");
static_assert(offsetof(UIW_HUD_Menu_C_BndEvt__UIW_HUD_Menu_Btn_Use_K2Node_ComponentBoundEvent_3_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_HUD_Menu_C_BndEvt__UIW_HUD_Menu_Btn_Use_K2Node_ComponentBoundEvent_3_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_HUD_Menu.UIW_HUD_Menu_C.BndEvt__UIW_HUD_Menu_Btn_Change_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_HUD_Menu_C_BndEvt__UIW_HUD_Menu_Btn_Change_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HUD_Menu_C_BndEvt__UIW_HUD_Menu_Btn_Change_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_HUD_Menu_C_BndEvt__UIW_HUD_Menu_Btn_Change_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature");
static_assert(sizeof(UIW_HUD_Menu_C_BndEvt__UIW_HUD_Menu_Btn_Change_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_HUD_Menu_C_BndEvt__UIW_HUD_Menu_Btn_Change_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature");
static_assert(offsetof(UIW_HUD_Menu_C_BndEvt__UIW_HUD_Menu_Btn_Change_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_HUD_Menu_C_BndEvt__UIW_HUD_Menu_Btn_Change_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_HUD_Menu.UIW_HUD_Menu_C.BndEvt__UIW_HUD_Menu_Btn_Select_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_HUD_Menu_C_BndEvt__UIW_HUD_Menu_Btn_Select_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HUD_Menu_C_BndEvt__UIW_HUD_Menu_Btn_Select_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_HUD_Menu_C_BndEvt__UIW_HUD_Menu_Btn_Select_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature");
static_assert(sizeof(UIW_HUD_Menu_C_BndEvt__UIW_HUD_Menu_Btn_Select_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_HUD_Menu_C_BndEvt__UIW_HUD_Menu_Btn_Select_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature");
static_assert(offsetof(UIW_HUD_Menu_C_BndEvt__UIW_HUD_Menu_Btn_Select_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_HUD_Menu_C_BndEvt__UIW_HUD_Menu_Btn_Select_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_HUD_Menu.UIW_HUD_Menu_C.Hide
// 0x0001 (0x0001 - 0x0000)
struct UIW_HUD_Menu_C_Hide final
{
public:
	bool                                          DoSave;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_HUD_Menu_C_Hide) == 0x000001, "Wrong alignment on UIW_HUD_Menu_C_Hide");
static_assert(sizeof(UIW_HUD_Menu_C_Hide) == 0x000001, "Wrong size on UIW_HUD_Menu_C_Hide");
static_assert(offsetof(UIW_HUD_Menu_C_Hide, DoSave) == 0x000000, "Member 'UIW_HUD_Menu_C_Hide::DoSave' has a wrong offset!");

// Function UIW_HUD_Menu.UIW_HUD_Menu_C.Show
// 0x0001 (0x0001 - 0x0000)
struct UIW_HUD_Menu_C_Show final
{
public:
	bool                                          NeedCenterMouse;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_HUD_Menu_C_Show) == 0x000001, "Wrong alignment on UIW_HUD_Menu_C_Show");
static_assert(sizeof(UIW_HUD_Menu_C_Show) == 0x000001, "Wrong size on UIW_HUD_Menu_C_Show");
static_assert(offsetof(UIW_HUD_Menu_C_Show, NeedCenterMouse) == 0x000000, "Member 'UIW_HUD_Menu_C_Show::NeedCenterMouse' has a wrong offset!");

// Function UIW_HUD_Menu.UIW_HUD_Menu_C.OpenWidget
// 0x0028 (0x0028 - 0x0000)
struct UIW_HUD_Menu_C_OpenWidget final
{
public:
	class FName                                   WidgetName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget_1;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_AddWidget_Widget;                         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_HUD_Menu_C_OpenWidget) == 0x000008, "Wrong alignment on UIW_HUD_Menu_C_OpenWidget");
static_assert(sizeof(UIW_HUD_Menu_C_OpenWidget) == 0x000028, "Wrong size on UIW_HUD_Menu_C_OpenWidget");
static_assert(offsetof(UIW_HUD_Menu_C_OpenWidget, WidgetName) == 0x000000, "Member 'UIW_HUD_Menu_C_OpenWidget::WidgetName' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_OpenWidget, CallFunc_GetMainWidget_MainWidget) == 0x000008, "Member 'UIW_HUD_Menu_C_OpenWidget::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_OpenWidget, CallFunc_GetMainWidget_MainWidget_1) == 0x000010, "Member 'UIW_HUD_Menu_C_OpenWidget::CallFunc_GetMainWidget_MainWidget_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_Menu_C_OpenWidget, CallFunc_AddWidget_Widget) == 0x000018, "Member 'UIW_HUD_Menu_C_OpenWidget::CallFunc_AddWidget_Widget' has a wrong offset!");
