#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ListItem_Achievement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_ListItem_Achievement.UIW_ListItem_Achievement_C
// 0x0068 (0x02D0 - 0x0268)
class UUIW_ListItem_Achievement_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_Icon;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IMG_Icon_Complete;                                 // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Fx_Btn_Bg_C*                       Selected;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ConditionText;                                // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_InfoText;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_LocalText;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ScoreValue;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FString>                         CommandLines;                                      // 0x02A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UUIW_CommandBook_C*                     CommandBook;                                       // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ConditionCountComplete;                            // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_Achievement_C*           ItemData;                                          // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_ListItem_Achievement(int32 EntryPoint);
	void OnDataUpdate(class UUIBP_ListData_Achievement_C* Data);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnDragDetected(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation** Operation);
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void SetData(class UUIBP_ListData_Achievement_C* ItemData_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_ListItem_Achievement_C">();
	}
	static class UUIW_ListItem_Achievement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_ListItem_Achievement_C>();
	}
};
static_assert(alignof(UUIW_ListItem_Achievement_C) == 0x000008, "Wrong alignment on UUIW_ListItem_Achievement_C");
static_assert(sizeof(UUIW_ListItem_Achievement_C) == 0x0002D0, "Wrong size on UUIW_ListItem_Achievement_C");
static_assert(offsetof(UUIW_ListItem_Achievement_C, UberGraphFrame) == 0x000268, "Member 'UUIW_ListItem_Achievement_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Achievement_C, Img_Icon) == 0x000270, "Member 'UUIW_ListItem_Achievement_C::Img_Icon' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Achievement_C, IMG_Icon_Complete) == 0x000278, "Member 'UUIW_ListItem_Achievement_C::IMG_Icon_Complete' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Achievement_C, Selected) == 0x000280, "Member 'UUIW_ListItem_Achievement_C::Selected' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Achievement_C, Text_ConditionText) == 0x000288, "Member 'UUIW_ListItem_Achievement_C::Text_ConditionText' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Achievement_C, Text_InfoText) == 0x000290, "Member 'UUIW_ListItem_Achievement_C::Text_InfoText' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Achievement_C, Text_LocalText) == 0x000298, "Member 'UUIW_ListItem_Achievement_C::Text_LocalText' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Achievement_C, Text_ScoreValue) == 0x0002A0, "Member 'UUIW_ListItem_Achievement_C::Text_ScoreValue' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Achievement_C, CommandLines) == 0x0002A8, "Member 'UUIW_ListItem_Achievement_C::CommandLines' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Achievement_C, CommandBook) == 0x0002B8, "Member 'UUIW_ListItem_Achievement_C::CommandBook' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Achievement_C, ConditionCountComplete) == 0x0002C0, "Member 'UUIW_ListItem_Achievement_C::ConditionCountComplete' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Achievement_C, ItemData) == 0x0002C8, "Member 'UUIW_ListItem_Achievement_C::ItemData' has a wrong offset!");

}

