#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Teleport

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UIW_Window_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Teleport.UIW_Teleport_C
// 0x0080 (0x03D0 - 0x0350)
class UUIW_Teleport_C final : public UUIW_Window_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UIW_Teleport_C;                     // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUIW_BG_Tab_C*                          BG_Tab;                                            // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Close;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Hotel;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Select;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Tab_LeftKey;                                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Tab_RightKey;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_CurrentBG;                                   // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PrevBG;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Line_Disable;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULListView*                             List_Location;                                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULListView*                             List_Tab;                                          // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ListBarHelperGroup;                                // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Fx_Reward_Bg_C*                    UIW_Fx_Reward_Bg;                                  // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Init;                                              // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x3];                                      // 0x03C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SelectedID;                                        // 0x03C4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_Teleport(int32 EntryPoint);
	void BndEvt__UIW_Teleport_List_Location_K2Node_ComponentBoundEvent_2_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void BndEvt__UIW_Teleport_Btn_Hotel_K2Node_ComponentBoundEvent_6_OnActive__DelegateSignature(class UUIW_Btn_Key_C* BtnKey);
	void BndEvt__Btn_Close_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature(class UUIW_Btn_Key_C* BtnKey);
	void BndEvt__Btn_Select_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature(class UUIW_Btn_Key_C* BtnKey);
	void Construct();
	void MoveLeftTab(class UUIW_Btn_Key_C* BtnKey);
	void MoveRightTab(class UUIW_Btn_Key_C* BtnKey);
	void ChangeTab(class UObject* Item, bool bIsSelected);
	struct FEventReply FocusManage(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnReady();
	void SelectedLocation(class UObject* Item, bool bIsSelected);
	void RequestCloseWindow();
	void CallbackTeleport(class UUIW_Popup_C* Popup, class UUIW_Btn_Key_C* BtnKey);
	class UWidget* NavToTop(EUINavigation Navigation_0);
	class UWidget* NavToBottom(EUINavigation Navigation_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Teleport_C">();
	}
	static class UUIW_Teleport_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Teleport_C>();
	}
};
static_assert(alignof(UUIW_Teleport_C) == 0x000008, "Wrong alignment on UUIW_Teleport_C");
static_assert(sizeof(UUIW_Teleport_C) == 0x0003D0, "Wrong size on UUIW_Teleport_C");
static_assert(offsetof(UUIW_Teleport_C, UberGraphFrame_UIW_Teleport_C) == 0x000350, "Member 'UUIW_Teleport_C::UberGraphFrame_UIW_Teleport_C' has a wrong offset!");
static_assert(offsetof(UUIW_Teleport_C, BG_Tab) == 0x000358, "Member 'UUIW_Teleport_C::BG_Tab' has a wrong offset!");
static_assert(offsetof(UUIW_Teleport_C, Btn_Close) == 0x000360, "Member 'UUIW_Teleport_C::Btn_Close' has a wrong offset!");
static_assert(offsetof(UUIW_Teleport_C, Btn_Hotel) == 0x000368, "Member 'UUIW_Teleport_C::Btn_Hotel' has a wrong offset!");
static_assert(offsetof(UUIW_Teleport_C, Btn_Select) == 0x000370, "Member 'UUIW_Teleport_C::Btn_Select' has a wrong offset!");
static_assert(offsetof(UUIW_Teleport_C, Btn_Tab_LeftKey) == 0x000378, "Member 'UUIW_Teleport_C::Btn_Tab_LeftKey' has a wrong offset!");
static_assert(offsetof(UUIW_Teleport_C, Btn_Tab_RightKey) == 0x000380, "Member 'UUIW_Teleport_C::Btn_Tab_RightKey' has a wrong offset!");
static_assert(offsetof(UUIW_Teleport_C, Image_CurrentBG) == 0x000388, "Member 'UUIW_Teleport_C::Image_CurrentBG' has a wrong offset!");
static_assert(offsetof(UUIW_Teleport_C, Image_PrevBG) == 0x000390, "Member 'UUIW_Teleport_C::Image_PrevBG' has a wrong offset!");
static_assert(offsetof(UUIW_Teleport_C, Img_Line_Disable) == 0x000398, "Member 'UUIW_Teleport_C::Img_Line_Disable' has a wrong offset!");
static_assert(offsetof(UUIW_Teleport_C, List_Location) == 0x0003A0, "Member 'UUIW_Teleport_C::List_Location' has a wrong offset!");
static_assert(offsetof(UUIW_Teleport_C, List_Tab) == 0x0003A8, "Member 'UUIW_Teleport_C::List_Tab' has a wrong offset!");
static_assert(offsetof(UUIW_Teleport_C, ListBarHelperGroup) == 0x0003B0, "Member 'UUIW_Teleport_C::ListBarHelperGroup' has a wrong offset!");
static_assert(offsetof(UUIW_Teleport_C, UIW_Fx_Reward_Bg) == 0x0003B8, "Member 'UUIW_Teleport_C::UIW_Fx_Reward_Bg' has a wrong offset!");
static_assert(offsetof(UUIW_Teleport_C, Init) == 0x0003C0, "Member 'UUIW_Teleport_C::Init' has a wrong offset!");
static_assert(offsetof(UUIW_Teleport_C, SelectedID) == 0x0003C4, "Member 'UUIW_Teleport_C::SelectedID' has a wrong offset!");

}

