#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Lie_Progress_High

#include "Basic.hpp"


namespace SDK::Params
{

// Function UIW_Lie_Progress_High.UIW_Lie_Progress_High_C.SetProgress
// 0x0050 (0x0050 - 0x0000)
struct UIW_Lie_Progress_High_C_SetProgress final
{
public:
	float                                         Current;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocalAngle;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_3;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Lie_Progress_High_C_SetProgress) == 0x000008, "Wrong alignment on UIW_Lie_Progress_High_C_SetProgress");
static_assert(sizeof(UIW_Lie_Progress_High_C_SetProgress) == 0x000050, "Wrong size on UIW_Lie_Progress_High_C_SetProgress");
static_assert(offsetof(UIW_Lie_Progress_High_C_SetProgress, Current) == 0x000000, "Member 'UIW_Lie_Progress_High_C_SetProgress::Current' has a wrong offset!");
static_assert(offsetof(UIW_Lie_Progress_High_C_SetProgress, LocalAngle) == 0x000004, "Member 'UIW_Lie_Progress_High_C_SetProgress::LocalAngle' has a wrong offset!");
static_assert(offsetof(UIW_Lie_Progress_High_C_SetProgress, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000008, "Member 'UIW_Lie_Progress_High_C_SetProgress::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Lie_Progress_High_C_SetProgress, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'UIW_Lie_Progress_High_C_SetProgress::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Lie_Progress_High_C_SetProgress, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000018, "Member 'UIW_Lie_Progress_High_C_SetProgress::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Lie_Progress_High_C_SetProgress, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'UIW_Lie_Progress_High_C_SetProgress::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Lie_Progress_High_C_SetProgress, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000028, "Member 'UIW_Lie_Progress_High_C_SetProgress::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Lie_Progress_High_C_SetProgress, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000030, "Member 'UIW_Lie_Progress_High_C_SetProgress::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Lie_Progress_High_C_SetProgress, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000038, "Member 'UIW_Lie_Progress_High_C_SetProgress::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Lie_Progress_High_C_SetProgress, CallFunc_Multiply_IntFloat_ReturnValue_2) == 0x00003C, "Member 'UIW_Lie_Progress_High_C_SetProgress::CallFunc_Multiply_IntFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Lie_Progress_High_C_SetProgress, CallFunc_Multiply_IntFloat_ReturnValue_3) == 0x000040, "Member 'UIW_Lie_Progress_High_C_SetProgress::CallFunc_Multiply_IntFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_Lie_Progress_High_C_SetProgress, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000048, "Member 'UIW_Lie_Progress_High_C_SetProgress::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");

}

