#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Module_CostGain

#include "Basic.hpp"


namespace SDK::Params
{

// Function UIW_Module_CostGain.UIW_Module_CostGain_C.ExecuteUbergraph_UIW_Module_CostGain
// 0x0038 (0x0038 - 0x0000)
struct UIW_Module_CostGain_C_ExecuteUbergraph_UIW_Module_CostGain final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0008(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x0020(0x0018)()
};
static_assert(alignof(UIW_Module_CostGain_C_ExecuteUbergraph_UIW_Module_CostGain) == 0x000008, "Wrong alignment on UIW_Module_CostGain_C_ExecuteUbergraph_UIW_Module_CostGain");
static_assert(sizeof(UIW_Module_CostGain_C_ExecuteUbergraph_UIW_Module_CostGain) == 0x000038, "Wrong size on UIW_Module_CostGain_C_ExecuteUbergraph_UIW_Module_CostGain");
static_assert(offsetof(UIW_Module_CostGain_C_ExecuteUbergraph_UIW_Module_CostGain, EntryPoint) == 0x000000, "Member 'UIW_Module_CostGain_C_ExecuteUbergraph_UIW_Module_CostGain::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_Module_CostGain_C_ExecuteUbergraph_UIW_Module_CostGain, CallFunc_GetGameStrWithName_ReturnValue) == 0x000008, "Member 'UIW_Module_CostGain_C_ExecuteUbergraph_UIW_Module_CostGain::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_CostGain_C_ExecuteUbergraph_UIW_Module_CostGain, CallFunc_GetGameStrWithName_ReturnValue_1) == 0x000020, "Member 'UIW_Module_CostGain_C_ExecuteUbergraph_UIW_Module_CostGain::CallFunc_GetGameStrWithName_ReturnValue_1' has a wrong offset!");

}

