#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Grid_Sample_Menu

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Grid_Sample_Menu.UIW_Grid_Sample_Menu_C
// 0x0040 (0x02E8 - 0x02A8)
class UUIW_Grid_Sample_Menu_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Bot_Tooltip;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Info;                                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Info_1;                                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Top_Blank;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Top_Tab_Image;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Top_Tab_Text;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          TextTabType;                                       // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          ImageTabType;                                      // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_UIW_Grid_Sample_Menu(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Grid_Sample_Menu_C">();
	}
	static class UUIW_Grid_Sample_Menu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Grid_Sample_Menu_C>();
	}
};
static_assert(alignof(UUIW_Grid_Sample_Menu_C) == 0x000008, "Wrong alignment on UUIW_Grid_Sample_Menu_C");
static_assert(sizeof(UUIW_Grid_Sample_Menu_C) == 0x0002E8, "Wrong size on UUIW_Grid_Sample_Menu_C");
static_assert(offsetof(UUIW_Grid_Sample_Menu_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_Grid_Sample_Menu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_Grid_Sample_Menu_C, Bot_Tooltip) == 0x0002B0, "Member 'UUIW_Grid_Sample_Menu_C::Bot_Tooltip' has a wrong offset!");
static_assert(offsetof(UUIW_Grid_Sample_Menu_C, Info) == 0x0002B8, "Member 'UUIW_Grid_Sample_Menu_C::Info' has a wrong offset!");
static_assert(offsetof(UUIW_Grid_Sample_Menu_C, Info_1) == 0x0002C0, "Member 'UUIW_Grid_Sample_Menu_C::Info_1' has a wrong offset!");
static_assert(offsetof(UUIW_Grid_Sample_Menu_C, Top_Blank) == 0x0002C8, "Member 'UUIW_Grid_Sample_Menu_C::Top_Blank' has a wrong offset!");
static_assert(offsetof(UUIW_Grid_Sample_Menu_C, Top_Tab_Image) == 0x0002D0, "Member 'UUIW_Grid_Sample_Menu_C::Top_Tab_Image' has a wrong offset!");
static_assert(offsetof(UUIW_Grid_Sample_Menu_C, Top_Tab_Text) == 0x0002D8, "Member 'UUIW_Grid_Sample_Menu_C::Top_Tab_Text' has a wrong offset!");
static_assert(offsetof(UUIW_Grid_Sample_Menu_C, TextTabType) == 0x0002E0, "Member 'UUIW_Grid_Sample_Menu_C::TextTabType' has a wrong offset!");
static_assert(offsetof(UUIW_Grid_Sample_Menu_C, ImageTabType) == 0x0002E1, "Member 'UUIW_Grid_Sample_Menu_C::ImageTabType' has a wrong offset!");

}

