#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_List_ShopItem

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_List_ShopItem.UIW_List_ShopItem_C
// 0x00F0 (0x0398 - 0x02A8)
class UUIW_List_ShopItem_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Deco_BlankBox_1;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Deco_BlankBox_2;                                   // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Deco_DotLine;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Dim;                                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Group_Price;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Blade;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Cross;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Equip;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Handle;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Heroic;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Hover;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Icon;                                          // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Select;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Transition;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_TransitionParts;                               // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_X;                                             // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ReinforceNum;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ReinforceNumParts;                                 // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Price;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_SoldOut;                                      // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Stack;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           WeaponGroup;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListView*                              OwnerListView;                                     // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 Item;                                              // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULWeaponItem*                           WeaponItem;                                        // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanBuy;                                            // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Window_C*                          OwnerWindow;                                       // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEmpty;                                           // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ListData;                                          // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_List_ShopItem(int32 EntryPoint);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();
	void SetMoveFocusEffect();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void SetEmptyView(bool IsEmpty_0);
	void SetItem(class UObject* InputPin, bool* IsEmpty_0);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_List_ShopItem_C">();
	}
	static class UUIW_List_ShopItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_List_ShopItem_C>();
	}
};
static_assert(alignof(UUIW_List_ShopItem_C) == 0x000008, "Wrong alignment on UUIW_List_ShopItem_C");
static_assert(sizeof(UUIW_List_ShopItem_C) == 0x000398, "Wrong size on UUIW_List_ShopItem_C");
static_assert(offsetof(UUIW_List_ShopItem_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_List_ShopItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, Deco_BlankBox_1) == 0x0002B0, "Member 'UUIW_List_ShopItem_C::Deco_BlankBox_1' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, Deco_BlankBox_2) == 0x0002B8, "Member 'UUIW_List_ShopItem_C::Deco_BlankBox_2' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, Deco_DotLine) == 0x0002C0, "Member 'UUIW_List_ShopItem_C::Deco_DotLine' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, Dim) == 0x0002C8, "Member 'UUIW_List_ShopItem_C::Dim' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, Group_Price) == 0x0002D0, "Member 'UUIW_List_ShopItem_C::Group_Price' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, Img_Blade) == 0x0002D8, "Member 'UUIW_List_ShopItem_C::Img_Blade' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, Img_Cross) == 0x0002E0, "Member 'UUIW_List_ShopItem_C::Img_Cross' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, Img_Equip) == 0x0002E8, "Member 'UUIW_List_ShopItem_C::Img_Equip' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, Img_Handle) == 0x0002F0, "Member 'UUIW_List_ShopItem_C::Img_Handle' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, Img_Heroic) == 0x0002F8, "Member 'UUIW_List_ShopItem_C::Img_Heroic' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, Img_Hover) == 0x000300, "Member 'UUIW_List_ShopItem_C::Img_Hover' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, Img_Icon) == 0x000308, "Member 'UUIW_List_ShopItem_C::Img_Icon' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, Img_Select) == 0x000310, "Member 'UUIW_List_ShopItem_C::Img_Select' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, Img_Transition) == 0x000318, "Member 'UUIW_List_ShopItem_C::Img_Transition' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, Img_TransitionParts) == 0x000320, "Member 'UUIW_List_ShopItem_C::Img_TransitionParts' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, Img_X) == 0x000328, "Member 'UUIW_List_ShopItem_C::Img_X' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, ReinforceNum) == 0x000330, "Member 'UUIW_List_ShopItem_C::ReinforceNum' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, ReinforceNumParts) == 0x000338, "Member 'UUIW_List_ShopItem_C::ReinforceNumParts' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, Text_Price) == 0x000340, "Member 'UUIW_List_ShopItem_C::Text_Price' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, Text_SoldOut) == 0x000348, "Member 'UUIW_List_ShopItem_C::Text_SoldOut' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, Text_Stack) == 0x000350, "Member 'UUIW_List_ShopItem_C::Text_Stack' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, WeaponGroup) == 0x000358, "Member 'UUIW_List_ShopItem_C::WeaponGroup' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, OwnerListView) == 0x000360, "Member 'UUIW_List_ShopItem_C::OwnerListView' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, Item) == 0x000368, "Member 'UUIW_List_ShopItem_C::Item' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, WeaponItem) == 0x000370, "Member 'UUIW_List_ShopItem_C::WeaponItem' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, CanBuy) == 0x000378, "Member 'UUIW_List_ShopItem_C::CanBuy' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, OwnerWindow) == 0x000380, "Member 'UUIW_List_ShopItem_C::OwnerWindow' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, IsEmpty) == 0x000388, "Member 'UUIW_List_ShopItem_C::IsEmpty' has a wrong offset!");
static_assert(offsetof(UUIW_List_ShopItem_C, ListData) == 0x000390, "Member 'UUIW_List_ShopItem_C::ListData' has a wrong offset!");

}

