#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Alert_Death

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Alert_Death.UIW_Alert_Death_C
// 0x0060 (0x02C8 - 0x0268)
class UUIW_Alert_Death_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Construct;                                     // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Broken;                                            // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 N_Big;                                             // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 N_Small;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 No_4;                                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 No1;                                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 No2;                                               // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 No3;                                               // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          AniShowPlaying;                                    // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           DieTimer;                                          // 0x02B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDiePlaying;                                      // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UIW_Alert_Death(int32 EntryPoint);
	void OnDieAniEnd();
	void Destruct();
	void Construct();
	void Show();
	void Audio_Fade_02();
	void Audio_Fade();
	void Finished_7ED619BC49A0A07D5226B7A91FF776BB();
	void SetAlertDeath();
	void FadeOutHUD();
	void SequenceEvent__ENTRYPOINTUIW_Alert_Death_0();
	void SequenceEvent__ENTRYPOINTUIW_Alert_Death_1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Alert_Death_C">();
	}
	static class UUIW_Alert_Death_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Alert_Death_C>();
	}
};
static_assert(alignof(UUIW_Alert_Death_C) == 0x000008, "Wrong alignment on UUIW_Alert_Death_C");
static_assert(sizeof(UUIW_Alert_Death_C) == 0x0002C8, "Wrong size on UUIW_Alert_Death_C");
static_assert(offsetof(UUIW_Alert_Death_C, UberGraphFrame) == 0x000268, "Member 'UUIW_Alert_Death_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_Death_C, Ani_Construct) == 0x000270, "Member 'UUIW_Alert_Death_C::Ani_Construct' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_Death_C, Broken) == 0x000278, "Member 'UUIW_Alert_Death_C::Broken' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_Death_C, N_Big) == 0x000280, "Member 'UUIW_Alert_Death_C::N_Big' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_Death_C, N_Small) == 0x000288, "Member 'UUIW_Alert_Death_C::N_Small' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_Death_C, No_4) == 0x000290, "Member 'UUIW_Alert_Death_C::No_4' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_Death_C, No1) == 0x000298, "Member 'UUIW_Alert_Death_C::No1' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_Death_C, No2) == 0x0002A0, "Member 'UUIW_Alert_Death_C::No2' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_Death_C, No3) == 0x0002A8, "Member 'UUIW_Alert_Death_C::No3' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_Death_C, AniShowPlaying) == 0x0002B0, "Member 'UUIW_Alert_Death_C::AniShowPlaying' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_Death_C, DieTimer) == 0x0002B8, "Member 'UUIW_Alert_Death_C::DieTimer' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_Death_C, IsDiePlaying) == 0x0002C0, "Member 'UUIW_Alert_Death_C::IsDiePlaying' has a wrong offset!");

}

