#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Control

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "UIW_Window_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Control.UIW_Control_C
// 0x00F8 (0x0448 - 0x0350)
class UUIW_Control_C final : public UUIW_Window_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UIW_Control_C;                      // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUIW_Btn_Key_C*                         Btn_Back;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Cancel;                                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Change;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Btn_Key;                                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                               EmptyList;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Group_BlankInfo;                                   // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Group_TextTooltip;                                 // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULListView*                             List_Key_0;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULListView*                             List_Key_1;                                        // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULListView*                             List_Key_2;                                        // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_SubTitle_C*                        Subtitle_0;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_SubTitle_C*                        Subtitle_1;                                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_SubTitle_C*                        Subtitle_2;                                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Description;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_EmptyInput;                                   // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_EmptyInputDesc;                               // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Title;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Tooltip;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBoxInScroll;                               // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsGamePad;                                         // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsChanging;                                        // 0x03F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FA[0x6];                                      // 0x03FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UListView*                              FocusedListView;                                   // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FocusedIndex;                                      // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_40C[0x4];                                      // 0x040C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           ImpossibleKey;                                     // 0x0410(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         PrevScrollBoxOffset;                               // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           ListPendingTimer;                                  // 0x0428(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UListView*                              SelectedList;                                      // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FKey>                           PossibleKey;                                       // 0x0438(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_UIW_Control(int32 EntryPoint);
	void Destruct();
	void BndEvt__UIW_Control_Btn_Cancel_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature(class UUIW_Btn_Key_C* BtnKey);
	void BndEvt__UIW_Control_ScrollBox_K2Node_ComponentBoundEvent_1_OnUserScrolledEvent__DelegateSignature(float CurrentOffset);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__UIW_Control_List_Key_2_K2Node_ComponentBoundEvent_10_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void BndEvt__UIW_Control_List_Key_1_K2Node_ComponentBoundEvent_9_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void BndEvt__UIW_Control_List_Key_2_K2Node_ComponentBoundEvent_7_OnListItemSelectionChangedDynamic__DelegateSignature(class UObject* Item, bool bIsSelected);
	void BndEvt__UIW_Control_List_Key_1_K2Node_ComponentBoundEvent_6_OnListItemSelectionChangedDynamic__DelegateSignature(class UObject* Item, bool bIsSelected);
	void BndEvt__UIW_Control_List_Key_0_K2Node_ComponentBoundEvent_4_OnListItemSelectionChangedDynamic__DelegateSignature(class UObject* Item, bool bIsSelected);
	void Construct();
	void BndEvt__List_Key_K2Node_ComponentBoundEvent_5_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void BndEvt__Btn_Edit_K2Node_ComponentBoundEvent_3_OnActive__DelegateSignature(class UUIW_Btn_Key_C* BtnKey);
	void BndEvt__Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature(class UUIW_Btn_Key_C* BtnKey);
	struct FEventReply FocusManage(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void CallbackUnregisteredKey(class UUIW_Popup_C* Popup, class UUIW_Btn_Key_C* BtnKey);
	void SetControllerType(bool IsGamePad_0);
	void RefreshKeyList();
	void OnReady();
	void StartChangeKey();
	void StopChangeKey(const struct FKey& Key);
	void OnSelectedChange(class UObject* Item);
	class UWidget* Navigation_0(EUINavigation Navigation_0);
	class UWidget* Navigation_1(EUINavigation Navigation_0);
	class UWidget* Navigation_2(EUINavigation Navigation_0);
	struct FEventReply OnKeyUp(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseWheel(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void CheckUnregisteredKey(bool* IsUnregisteredKey);
	class UWidget* NavToBottom(EUINavigation Navigation_0);
	void GetTopList(class UListView** ListView);
	void GetBottomList(class UListView** ListView);
	class UWidget* NavToTop(EUINavigation Navigation_0);
	void ListPendingCheck();
	void CallbackApplyKeyCustomizeBackup();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Control_C">();
	}
	static class UUIW_Control_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Control_C>();
	}
};
static_assert(alignof(UUIW_Control_C) == 0x000008, "Wrong alignment on UUIW_Control_C");
static_assert(sizeof(UUIW_Control_C) == 0x000448, "Wrong size on UUIW_Control_C");
static_assert(offsetof(UUIW_Control_C, UberGraphFrame_UIW_Control_C) == 0x000350, "Member 'UUIW_Control_C::UberGraphFrame_UIW_Control_C' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, Btn_Back) == 0x000358, "Member 'UUIW_Control_C::Btn_Back' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, Btn_Cancel) == 0x000360, "Member 'UUIW_Control_C::Btn_Cancel' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, Btn_Change) == 0x000368, "Member 'UUIW_Control_C::Btn_Change' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, Btn_Key) == 0x000370, "Member 'UUIW_Control_C::Btn_Key' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, EmptyList) == 0x000378, "Member 'UUIW_Control_C::EmptyList' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, Group_BlankInfo) == 0x000380, "Member 'UUIW_Control_C::Group_BlankInfo' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, Group_TextTooltip) == 0x000388, "Member 'UUIW_Control_C::Group_TextTooltip' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, List_Key_0) == 0x000390, "Member 'UUIW_Control_C::List_Key_0' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, List_Key_1) == 0x000398, "Member 'UUIW_Control_C::List_Key_1' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, List_Key_2) == 0x0003A0, "Member 'UUIW_Control_C::List_Key_2' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, ScrollBox) == 0x0003A8, "Member 'UUIW_Control_C::ScrollBox' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, Subtitle_0) == 0x0003B0, "Member 'UUIW_Control_C::Subtitle_0' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, Subtitle_1) == 0x0003B8, "Member 'UUIW_Control_C::Subtitle_1' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, Subtitle_2) == 0x0003C0, "Member 'UUIW_Control_C::Subtitle_2' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, Text_Description) == 0x0003C8, "Member 'UUIW_Control_C::Text_Description' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, Text_EmptyInput) == 0x0003D0, "Member 'UUIW_Control_C::Text_EmptyInput' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, Text_EmptyInputDesc) == 0x0003D8, "Member 'UUIW_Control_C::Text_EmptyInputDesc' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, Text_Title) == 0x0003E0, "Member 'UUIW_Control_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, Text_Tooltip) == 0x0003E8, "Member 'UUIW_Control_C::Text_Tooltip' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, VerticalBoxInScroll) == 0x0003F0, "Member 'UUIW_Control_C::VerticalBoxInScroll' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, IsGamePad) == 0x0003F8, "Member 'UUIW_Control_C::IsGamePad' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, IsChanging) == 0x0003F9, "Member 'UUIW_Control_C::IsChanging' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, FocusedListView) == 0x000400, "Member 'UUIW_Control_C::FocusedListView' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, FocusedIndex) == 0x000408, "Member 'UUIW_Control_C::FocusedIndex' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, ImpossibleKey) == 0x000410, "Member 'UUIW_Control_C::ImpossibleKey' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, PrevScrollBoxOffset) == 0x000420, "Member 'UUIW_Control_C::PrevScrollBoxOffset' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, ListPendingTimer) == 0x000428, "Member 'UUIW_Control_C::ListPendingTimer' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, SelectedList) == 0x000430, "Member 'UUIW_Control_C::SelectedList' has a wrong offset!");
static_assert(offsetof(UUIW_Control_C, PossibleKey) == 0x000438, "Member 'UUIW_Control_C::PossibleKey' has a wrong offset!");

}

