#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Equipment

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectP_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UIST_SecondCategoryArr_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "UIEN_EquipSlotSize_structs.hpp"


namespace SDK::Params
{

// Function UIW_Equipment.UIW_Equipment_C.ExecuteUbergraph_UIW_Equipment
// 0x0528 (0x0528 - 0x0000)
struct UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_4;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_57;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_56;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_55;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_54;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_53;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_52;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULWeaponItem*                           K2Node_ComponentBoundEvent_LWeaponItem_5;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULWeaponItem*                           K2Node_ComponentBoundEvent_LWeaponItem_4;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_3;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULWeaponItem*                           K2Node_ComponentBoundEvent_LWeaponItem_3;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULWeaponItem*                           K2Node_ComponentBoundEvent_LWeaponItem_2;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_51;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_50;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_49;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_48;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_47;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_46;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_22;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_21;                // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget_1;               // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenedWidget_IsOpened;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_IsOpenedWidget_UserWidget;                // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IsOpenedWidget_WidgetArrayIndex;          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_HUD_C*                             K2Node_DynamicCast_AsUIW_HUD;                      // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_45;               // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_44;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_2;               // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_43;               // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_42;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_41;               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_40;               // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_39;               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_38;               // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_37;               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_36;               // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_35;               // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_34;               // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_33;               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_32;               // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_31;               // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_30;               // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_29;               // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_28;               // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_27;               // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_26;               // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_25;               // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_24;               // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_HUD_Menu_BeltSlot_C*               CallFunc_FindBeltSlot_SlotBelt;                    // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01E0(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_HUD_Menu_PouchSlot_C*              CallFunc_Array_Get_Item;                           // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Delta;                  // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0210(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetMousePositionOnViewport_ReturnValue;   // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_23;               // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_22;               // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_20;                // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_21;               // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_20;               // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_19;               // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_18;               // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_1;               // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayInputSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePadMode_ReturnValue;                // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27B[0x5];                                      // 0x027B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_17;               // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_16;               // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_15;               // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_14;               // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_13;               // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_12;               // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_11;               // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_10;               // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCController*                         K2Node_DynamicCast_AsLPCController;                // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULPlayInputSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bGamePad)>                K2Node_CreateDelegate_OutputDelegate_1;            // 0x02E0(0x0010)(ZeroConstructor, NoDestructor)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue;           // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerInventory*                      CallFunc_GetPlayerInventory_ReturnValue;           // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_19;                // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_18;                // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_17;                // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_16;                // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_15;                // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_14;                // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_13;                // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_12;                // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_11;                // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_10;                // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected_10;         // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36A[0x6];                                      // 0x036A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_9;                 // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected_9;          // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_8;                 // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected_8;          // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x3];                                      // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForItem_ReturnValue_1;            // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForItem_ReturnValue_2;            // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_7;                 // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected_7;          // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_6;                 // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected_6;          // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9[0x3];                                      // 0x03B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForItem_ReturnValue_3;            // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x3];                                      // 0x03C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForItem_ReturnValue_4;            // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_5;                 // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected_5;          // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_4;                 // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected_4;          // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x3];                                      // 0x03E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForItem_ReturnValue_5;            // 0x03EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_5;          // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x3];                                      // 0x03F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForItem_ReturnValue_6;            // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_6;          // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_3;                 // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected_3;          // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_2;                 // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected_2;          // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_419[0x3];                                      // 0x0419(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForItem_ReturnValue_7;            // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_7;          // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421[0x3];                                      // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForItem_ReturnValue_8;            // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_8;          // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_1;                 // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected_1;          // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_439[0x3];                                      // 0x0439(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_CurrentOffset;          // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_ReturnValue_9;            // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_9;          // 0x0444(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0445(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_446[0x2];                                      // 0x0446(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0448(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRefreshPending_ReturnValue;             // 0x044C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x044D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x044E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44F[0x1];                                      // 0x044F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ULWeaponItem*                           K2Node_ComponentBoundEvent_LWeaponItem_1;          // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_9;                // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_8;                // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_7;                // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_6;                // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_5;                // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected;            // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0490(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUIBP_ListData_Default_C*               K2Node_DynamicCast_AsUIBP_List_Data_Default;       // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_1;                    // 0x04A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_2;                    // 0x04AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_3;                    // 0x04AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_4;                    // 0x04AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x04AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_5;                    // 0x04AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4AF[0x1];                                      // 0x04AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x04C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x04CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x04CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4CE[0x2];                                      // 0x04CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ULWeaponItem*                           K2Node_ComponentBoundEvent_LWeaponItem;            // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_4;                // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_3;                // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_2;                // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RefreshInven_Equip_IsNoItem;              // 0x04F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F2[0x6];                                      // 0x04F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 CallFunc_GetEquipItem_ReturnValue;                 // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bGamePad;                       // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0501(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0502(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x0503(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_504[0x4];                                      // 0x0504(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey;                 // 0x0508(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_511[0x7];                                      // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem_1;                // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_ComponentBoundEvent_LItem;                  // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment) == 0x000008, "Wrong alignment on UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment");
static_assert(sizeof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment) == 0x000528, "Wrong size on UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, EntryPoint) == 0x000000, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_BtnKey_4) == 0x000008, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_BtnKey_4' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_57) == 0x000010, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_57' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_56) == 0x000018, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_56' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_55) == 0x000020, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_55' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_54) == 0x000028, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_54' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_53) == 0x000030, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_53' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_52) == 0x000038, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_52' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LWeaponItem_5) == 0x000040, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LWeaponItem_5' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LWeaponItem_4) == 0x000048, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LWeaponItem_4' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_BtnKey_3) == 0x000050, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_BtnKey_3' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LWeaponItem_3) == 0x000058, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LWeaponItem_3' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LWeaponItem_2) == 0x000060, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LWeaponItem_2' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_51) == 0x000068, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_51' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_50) == 0x000070, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_50' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_49) == 0x000078, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_49' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_48) == 0x000080, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_48' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_47) == 0x000088, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_47' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_46) == 0x000090, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_46' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_Item_22) == 0x000098, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_Item_22' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_Item_21) == 0x0000A0, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_Item_21' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, CallFunc_GetMainWidget_MainWidget) == 0x0000A8, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, CallFunc_GetMainWidget_MainWidget_1) == 0x0000B0, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::CallFunc_GetMainWidget_MainWidget_1' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, CallFunc_IsOpenedWidget_IsOpened) == 0x0000B8, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::CallFunc_IsOpenedWidget_IsOpened' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, CallFunc_IsOpenedWidget_UserWidget) == 0x0000C0, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::CallFunc_IsOpenedWidget_UserWidget' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, CallFunc_IsOpenedWidget_WidgetArrayIndex) == 0x0000C8, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::CallFunc_IsOpenedWidget_WidgetArrayIndex' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000D0, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_DynamicCast_AsUIW_HUD) == 0x0000D8, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_DynamicCast_AsUIW_HUD' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_45) == 0x0000E8, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_45' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_44) == 0x0000F0, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_44' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, CallFunc_GetPlayerController_ReturnValue) == 0x0000F8, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000100, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, CallFunc_IsValid_ReturnValue) == 0x000108, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, CallFunc_GetViewTarget_ReturnValue) == 0x000110, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000118, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, CallFunc_GetPlayerController_ReturnValue_1) == 0x000120, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x000128, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_BtnKey_2) == 0x000130, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_BtnKey_2' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_43) == 0x000138, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_43' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_42) == 0x000140, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_42' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_41) == 0x000148, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_41' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_40) == 0x000150, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_40' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_39) == 0x000158, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_39' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_38) == 0x000160, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_38' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_37) == 0x000168, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_37' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_36) == 0x000170, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_36' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_35) == 0x000178, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_35' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_34) == 0x000180, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_34' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_33) == 0x000188, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_33' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_32) == 0x000190, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_32' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_31) == 0x000198, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_31' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_30) == 0x0001A0, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_30' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_29) == 0x0001A8, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_29' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_28) == 0x0001B0, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_28' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_27) == 0x0001B8, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_27' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_26) == 0x0001C0, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_26' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_25) == 0x0001C8, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_25' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_24) == 0x0001D0, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_24' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, CallFunc_FindBeltSlot_SlotBelt) == 0x0001D8, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::CallFunc_FindBeltSlot_SlotBelt' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_CreateDelegate_OutputDelegate) == 0x0001E0, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001F0, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, CallFunc_Array_Find_ReturnValue) == 0x0001F8, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_SwitchName_CmpSuccess) == 0x0001FC, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, CallFunc_Array_Get_Item) == 0x000200, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_Event_IsDesignTime) == 0x000208, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_Delta) == 0x00020C, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_Delta' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, CallFunc_K2_SetTimer_ReturnValue) == 0x000210, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, CallFunc_GetMousePositionOnViewport_ReturnValue) == 0x000218, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::CallFunc_GetMousePositionOnViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000220, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_23) == 0x000230, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_23' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_22) == 0x000238, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_22' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_Item_20) == 0x000240, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_Item_20' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_21) == 0x000248, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_21' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_20) == 0x000250, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_20' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_19) == 0x000258, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_19' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_LItem_18) == 0x000260, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_LItem_18' has a wrong offset!");
static_assert(offsetof(UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment, K2Node_ComponentBoundEvent_BtnKey_1) == 0x000268, "Member 'UIW_Equipment_C_ExecuteUbergraph_UIW_Equipment::K2Node_ComponentBoundEvent_BtnKey_1' has a wrong offset!");
