#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Module_TextList

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UIW_Module_TextList.UIW_Module_TextList_C.ExecuteUbergraph_UIW_Module_TextList
// 0x00C8 (0x00C8 - 0x0000)
struct UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Module_Text_C*                     CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUIW_Module_Text_C* SelfObj, bool IsFocused)> K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Module_Text_C*                     K2Node_CustomEvent_SelfObj;                        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsFocused;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUIW_Module_Text_C*>             K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Module_Text_C*                     CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0070(0x0058)(HasGetValueTypeHash)
};
static_assert(alignof(UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList) == 0x000008, "Wrong alignment on UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList");
static_assert(sizeof(UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList) == 0x0000C8, "Wrong size on UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList");
static_assert(offsetof(UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList, EntryPoint) == 0x000000, "Member 'UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList, Temp_int_Array_Index_Variable) == 0x000004, "Member 'UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList, CallFunc_Array_Get_Item) == 0x000010, "Member 'UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList, Temp_int_Array_Index_Variable_1) == 0x000020, "Member 'UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList, Temp_int_Loop_Counter_Variable_1) == 0x000034, "Member 'UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList, K2Node_CustomEvent_SelfObj) == 0x000038, "Member 'UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList::K2Node_CustomEvent_SelfObj' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList, K2Node_CustomEvent_IsFocused) == 0x000040, "Member 'UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList::K2Node_CustomEvent_IsFocused' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList, CallFunc_Less_IntInt_ReturnValue) == 0x000041, "Member 'UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList, K2Node_MakeArray_Array) == 0x000048, "Member 'UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000058, "Member 'UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList, CallFunc_Array_Length_ReturnValue_1) == 0x000068, "Member 'UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList, CallFunc_Less_IntInt_ReturnValue_1) == 0x00006C, "Member 'UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList, K2Node_MakeStruct_SlateFontInfo) == 0x000070, "Member 'UIW_Module_TextList_C_ExecuteUbergraph_UIW_Module_TextList::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");

// Function UIW_Module_TextList.UIW_Module_TextList_C.OnFocused
// 0x0010 (0x0010 - 0x0000)
struct UIW_Module_TextList_C_OnFocused final
{
public:
	class UUIW_Module_Text_C*                     SelfObj;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFocused;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Module_TextList_C_OnFocused) == 0x000008, "Wrong alignment on UIW_Module_TextList_C_OnFocused");
static_assert(sizeof(UIW_Module_TextList_C_OnFocused) == 0x000010, "Wrong size on UIW_Module_TextList_C_OnFocused");
static_assert(offsetof(UIW_Module_TextList_C_OnFocused, SelfObj) == 0x000000, "Member 'UIW_Module_TextList_C_OnFocused::SelfObj' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_OnFocused, IsFocused) == 0x000008, "Member 'UIW_Module_TextList_C_OnFocused::IsFocused' has a wrong offset!");

// Function UIW_Module_TextList.UIW_Module_TextList_C.SetListItem
// 0x0038 (0x0038 - 0x0000)
struct UIW_Module_TextList_C_SetListItem final
{
public:
	TArray<class FText>                           NameArr;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Module_Text_C*                     CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Module_TextList_C_SetListItem) == 0x000008, "Wrong alignment on UIW_Module_TextList_C_SetListItem");
static_assert(sizeof(UIW_Module_TextList_C_SetListItem) == 0x000038, "Wrong size on UIW_Module_TextList_C_SetListItem");
static_assert(offsetof(UIW_Module_TextList_C_SetListItem, NameArr) == 0x000000, "Member 'UIW_Module_TextList_C_SetListItem::NameArr' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_SetListItem, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'UIW_Module_TextList_C_SetListItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_SetListItem, Temp_int_Array_Index_Variable) == 0x000014, "Member 'UIW_Module_TextList_C_SetListItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_SetListItem, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'UIW_Module_TextList_C_SetListItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_SetListItem, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00001C, "Member 'UIW_Module_TextList_C_SetListItem::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_SetListItem, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'UIW_Module_TextList_C_SetListItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_SetListItem, CallFunc_Array_Get_Item) == 0x000028, "Member 'UIW_Module_TextList_C_SetListItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_SetListItem, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'UIW_Module_TextList_C_SetListItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function UIW_Module_TextList.UIW_Module_TextList_C.SetListData
// 0x0040 (0x0040 - 0x0000)
struct UIW_Module_TextList_C_SetListData final
{
public:
	TArray<class FString>                         StrArr;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          IsEnableSelect_0;                                  // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Module_Text_C*                     CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Module_TextList_C_SetListData) == 0x000008, "Wrong alignment on UIW_Module_TextList_C_SetListData");
static_assert(sizeof(UIW_Module_TextList_C_SetListData) == 0x000040, "Wrong size on UIW_Module_TextList_C_SetListData");
static_assert(offsetof(UIW_Module_TextList_C_SetListData, StrArr) == 0x000000, "Member 'UIW_Module_TextList_C_SetListData::StrArr' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_SetListData, IsEnableSelect_0) == 0x000010, "Member 'UIW_Module_TextList_C_SetListData::IsEnableSelect_0' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_SetListData, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'UIW_Module_TextList_C_SetListData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_SetListData, Temp_int_Array_Index_Variable) == 0x000018, "Member 'UIW_Module_TextList_C_SetListData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_SetListData, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'UIW_Module_TextList_C_SetListData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_SetListData, CallFunc_Array_Get_Item) == 0x000020, "Member 'UIW_Module_TextList_C_SetListData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_SetListData, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'UIW_Module_TextList_C_SetListData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_SetListData, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'UIW_Module_TextList_C_SetListData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_SetListData, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'UIW_Module_TextList_C_SetListData::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function UIW_Module_TextList.UIW_Module_TextList_C.SetSelect
// 0x0010 (0x0010 - 0x0000)
struct UIW_Module_TextList_C_SetSelect final
{
public:
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Module_Text_C*                     CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Module_TextList_C_SetSelect) == 0x000008, "Wrong alignment on UIW_Module_TextList_C_SetSelect");
static_assert(sizeof(UIW_Module_TextList_C_SetSelect) == 0x000010, "Wrong size on UIW_Module_TextList_C_SetSelect");
static_assert(offsetof(UIW_Module_TextList_C_SetSelect, CallFunc_Conv_StringToInt_ReturnValue) == 0x000000, "Member 'UIW_Module_TextList_C_SetSelect::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_SetSelect, CallFunc_Array_Get_Item) == 0x000008, "Member 'UIW_Module_TextList_C_SetSelect::CallFunc_Array_Get_Item' has a wrong offset!");

// Function UIW_Module_TextList.UIW_Module_TextList_C.FocusManage
// 0x0218 (0x0218 - 0x0000)
struct UIW_Module_TextList_C_FocusManage final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_FocusManage_ReturnValue;                  // 0x0160(0x00B8)()
};
static_assert(alignof(UIW_Module_TextList_C_FocusManage) == 0x000008, "Wrong alignment on UIW_Module_TextList_C_FocusManage");
static_assert(sizeof(UIW_Module_TextList_C_FocusManage) == 0x000218, "Wrong size on UIW_Module_TextList_C_FocusManage");
static_assert(offsetof(UIW_Module_TextList_C_FocusManage, MyGeometry) == 0x000000, "Member 'UIW_Module_TextList_C_FocusManage::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_FocusManage, MouseEvent) == 0x000038, "Member 'UIW_Module_TextList_C_FocusManage::MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_FocusManage, ReturnValue) == 0x0000A8, "Member 'UIW_Module_TextList_C_FocusManage::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_TextList_C_FocusManage, CallFunc_FocusManage_ReturnValue) == 0x000160, "Member 'UIW_Module_TextList_C_FocusManage::CallFunc_FocusManage_ReturnValue' has a wrong offset!");

}

