#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HUD_FrenzyUnit

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UIW_HUD_FrenzyUnit.UIW_HUD_FrenzyUnit_C.SetActive
// 0x0010 (0x0010 - 0x0000)
struct UIW_HUD_FrenzyUnit_C_SetActive final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HUD_FrenzyUnit_C_SetActive) == 0x000008, "Wrong alignment on UIW_HUD_FrenzyUnit_C_SetActive");
static_assert(sizeof(UIW_HUD_FrenzyUnit_C_SetActive) == 0x000010, "Wrong size on UIW_HUD_FrenzyUnit_C_SetActive");
static_assert(offsetof(UIW_HUD_FrenzyUnit_C_SetActive, IsActive) == 0x000000, "Member 'UIW_HUD_FrenzyUnit_C_SetActive::IsActive' has a wrong offset!");
static_assert(offsetof(UIW_HUD_FrenzyUnit_C_SetActive, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'UIW_HUD_FrenzyUnit_C_SetActive::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function UIW_HUD_FrenzyUnit.UIW_HUD_FrenzyUnit_C.SetUse
// 0x0034 (0x0034 - 0x0000)
struct UIW_HUD_FrenzyUnit_C_SetUse final
{
public:
	bool                                          IsUse;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTweenEase                             K2Node_MakeStruct_TweenEase;                       // 0x0004(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_1;                     // 0x0010(0x000C)(NoDestructor)
	float                                         CallFunc_BreakVector2D_X;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HUD_FrenzyUnit_C_SetUse) == 0x000004, "Wrong alignment on UIW_HUD_FrenzyUnit_C_SetUse");
static_assert(sizeof(UIW_HUD_FrenzyUnit_C_SetUse) == 0x000034, "Wrong size on UIW_HUD_FrenzyUnit_C_SetUse");
static_assert(offsetof(UIW_HUD_FrenzyUnit_C_SetUse, IsUse) == 0x000000, "Member 'UIW_HUD_FrenzyUnit_C_SetUse::IsUse' has a wrong offset!");
static_assert(offsetof(UIW_HUD_FrenzyUnit_C_SetUse, K2Node_MakeStruct_TweenEase) == 0x000004, "Member 'UIW_HUD_FrenzyUnit_C_SetUse::K2Node_MakeStruct_TweenEase' has a wrong offset!");
static_assert(offsetof(UIW_HUD_FrenzyUnit_C_SetUse, K2Node_MakeStruct_TweenEase_1) == 0x000010, "Member 'UIW_HUD_FrenzyUnit_C_SetUse::K2Node_MakeStruct_TweenEase_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_FrenzyUnit_C_SetUse, CallFunc_BreakVector2D_X) == 0x00001C, "Member 'UIW_HUD_FrenzyUnit_C_SetUse::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UIW_HUD_FrenzyUnit_C_SetUse, CallFunc_BreakVector2D_Y) == 0x000020, "Member 'UIW_HUD_FrenzyUnit_C_SetUse::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UIW_HUD_FrenzyUnit_C_SetUse, CallFunc_MakeVector2D_ReturnValue) == 0x000024, "Member 'UIW_HUD_FrenzyUnit_C_SetUse::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_FrenzyUnit_C_SetUse, CallFunc_MakeVector2D_ReturnValue_1) == 0x00002C, "Member 'UIW_HUD_FrenzyUnit_C_SetUse::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");

}

