#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ListItem_Tab

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UIW_ListItem_Tab.UIW_ListItem_Tab_C.ExecuteUbergraph_UIW_ListItem_Tab
// 0x0188 (0x0188 - 0x0000)
struct UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerInventory*                      CallFunc_GetPlayerInventory_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNotiCategory_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNotiCategory_ReturnValue_1;             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNotiCategory_ReturnValue_2;             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNotiCategory_ReturnValue_3;             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNotiCategory_ReturnValue_4;             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNotiCategory_ReturnValue_5;             // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_Default_C*               K2Node_DynamicCast_AsUIBP_List_Data_Default;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x003C(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0078(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00E8(0x0070)(ConstParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0158(0x0028)()
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab) == 0x000008, "Wrong alignment on UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab");
static_assert(sizeof(UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab) == 0x000188, "Wrong size on UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab");
static_assert(offsetof(UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab, EntryPoint) == 0x000000, "Member 'UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab, CallFunc_GetPlayerInventory_ReturnValue) == 0x000010, "Member 'UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab::CallFunc_GetPlayerInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab, CallFunc_IsNotiCategory_ReturnValue) == 0x000018, "Member 'UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab::CallFunc_IsNotiCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab, CallFunc_IsNotiCategory_ReturnValue_1) == 0x000019, "Member 'UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab::CallFunc_IsNotiCategory_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab, CallFunc_IsNotiCategory_ReturnValue_2) == 0x00001A, "Member 'UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab::CallFunc_IsNotiCategory_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab, CallFunc_IsNotiCategory_ReturnValue_3) == 0x00001B, "Member 'UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab::CallFunc_IsNotiCategory_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab, CallFunc_BooleanOR_ReturnValue) == 0x00001C, "Member 'UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab, CallFunc_IsNotiCategory_ReturnValue_4) == 0x00001D, "Member 'UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab::CallFunc_IsNotiCategory_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab, CallFunc_IsNotiCategory_ReturnValue_5) == 0x00001E, "Member 'UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab::CallFunc_IsNotiCategory_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab, K2Node_Event_bIsExpanded) == 0x00001F, "Member 'UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab, CallFunc_BooleanOR_ReturnValue_1) == 0x000020, "Member 'UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab, CallFunc_BooleanOR_ReturnValue_2) == 0x000021, "Member 'UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab, K2Node_Event_ListItemObject) == 0x000028, "Member 'UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab, K2Node_DynamicCast_AsUIBP_List_Data_Default) == 0x000030, "Member 'UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab::K2Node_DynamicCast_AsUIBP_List_Data_Default' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab, K2Node_Event_bIsSelected) == 0x000039, "Member 'UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab, K2Node_Event_MyGeometry) == 0x00003C, "Member 'UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab, K2Node_Event_MouseEvent_1) == 0x000078, "Member 'UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab, K2Node_Event_MouseEvent) == 0x0000E8, "Member 'UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab, K2Node_MakeStruct_SlateColor) == 0x000158, "Member 'UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab, K2Node_SwitchName_CmpSuccess) == 0x000180, "Member 'UIW_ListItem_Tab_C_ExecuteUbergraph_UIW_ListItem_Tab::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function UIW_ListItem_Tab.UIW_ListItem_Tab_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct UIW_ListItem_Tab_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIW_ListItem_Tab_C_OnMouseLeave) == 0x000008, "Wrong alignment on UIW_ListItem_Tab_C_OnMouseLeave");
static_assert(sizeof(UIW_ListItem_Tab_C_OnMouseLeave) == 0x000070, "Wrong size on UIW_ListItem_Tab_C_OnMouseLeave");
static_assert(offsetof(UIW_ListItem_Tab_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'UIW_ListItem_Tab_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function UIW_ListItem_Tab.UIW_ListItem_Tab_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct UIW_ListItem_Tab_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIW_ListItem_Tab_C_OnMouseEnter) == 0x000008, "Wrong alignment on UIW_ListItem_Tab_C_OnMouseEnter");
static_assert(sizeof(UIW_ListItem_Tab_C_OnMouseEnter) == 0x0000A8, "Wrong size on UIW_ListItem_Tab_C_OnMouseEnter");
static_assert(offsetof(UIW_ListItem_Tab_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'UIW_ListItem_Tab_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'UIW_ListItem_Tab_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function UIW_ListItem_Tab.UIW_ListItem_Tab_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_ListItem_Tab_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Tab_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on UIW_ListItem_Tab_C_BP_OnItemSelectionChanged");
static_assert(sizeof(UIW_ListItem_Tab_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on UIW_ListItem_Tab_C_BP_OnItemSelectionChanged");
static_assert(offsetof(UIW_ListItem_Tab_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'UIW_ListItem_Tab_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function UIW_ListItem_Tab.UIW_ListItem_Tab_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct UIW_ListItem_Tab_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ListItem_Tab_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on UIW_ListItem_Tab_C_OnListItemObjectSet");
static_assert(sizeof(UIW_ListItem_Tab_C_OnListItemObjectSet) == 0x000008, "Wrong size on UIW_ListItem_Tab_C_OnListItemObjectSet");
static_assert(offsetof(UIW_ListItem_Tab_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'UIW_ListItem_Tab_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function UIW_ListItem_Tab.UIW_ListItem_Tab_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_ListItem_Tab_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Tab_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on UIW_ListItem_Tab_C_BP_OnItemExpansionChanged");
static_assert(sizeof(UIW_ListItem_Tab_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on UIW_ListItem_Tab_C_BP_OnItemExpansionChanged");
static_assert(offsetof(UIW_ListItem_Tab_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'UIW_ListItem_Tab_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function UIW_ListItem_Tab.UIW_ListItem_Tab_C.OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct UIW_ListItem_Tab_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UIW_ListItem_Tab_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on UIW_ListItem_Tab_C_OnMouseButtonDown");
static_assert(sizeof(UIW_ListItem_Tab_C_OnMouseButtonDown) == 0x000218, "Wrong size on UIW_ListItem_Tab_C_OnMouseButtonDown");
static_assert(offsetof(UIW_ListItem_Tab_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'UIW_ListItem_Tab_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'UIW_ListItem_Tab_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'UIW_ListItem_Tab_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_OnMouseButtonDown, K2Node_MakeStruct_EventReply) == 0x000160, "Member 'UIW_ListItem_Tab_C_OnMouseButtonDown::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function UIW_ListItem_Tab.UIW_ListItem_Tab_C.OnMouseButtonUp
// 0x0218 (0x0218 - 0x0000)
struct UIW_ListItem_Tab_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UIW_ListItem_Tab_C_OnMouseButtonUp) == 0x000008, "Wrong alignment on UIW_ListItem_Tab_C_OnMouseButtonUp");
static_assert(sizeof(UIW_ListItem_Tab_C_OnMouseButtonUp) == 0x000218, "Wrong size on UIW_ListItem_Tab_C_OnMouseButtonUp");
static_assert(offsetof(UIW_ListItem_Tab_C_OnMouseButtonUp, MyGeometry) == 0x000000, "Member 'UIW_ListItem_Tab_C_OnMouseButtonUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_OnMouseButtonUp, MouseEvent) == 0x000038, "Member 'UIW_ListItem_Tab_C_OnMouseButtonUp::MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_OnMouseButtonUp, ReturnValue) == 0x0000A8, "Member 'UIW_ListItem_Tab_C_OnMouseButtonUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_OnMouseButtonUp, K2Node_MakeStruct_EventReply) == 0x000160, "Member 'UIW_ListItem_Tab_C_OnMouseButtonUp::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function UIW_ListItem_Tab.UIW_ListItem_Tab_C.SetHighlightLabel
// 0x0050 (0x0050 - 0x0000)
struct UIW_ListItem_Tab_C_SetHighlightLabel final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0028(0x0028)()
};
static_assert(alignof(UIW_ListItem_Tab_C_SetHighlightLabel) == 0x000008, "Wrong alignment on UIW_ListItem_Tab_C_SetHighlightLabel");
static_assert(sizeof(UIW_ListItem_Tab_C_SetHighlightLabel) == 0x000050, "Wrong size on UIW_ListItem_Tab_C_SetHighlightLabel");
static_assert(offsetof(UIW_ListItem_Tab_C_SetHighlightLabel, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'UIW_ListItem_Tab_C_SetHighlightLabel::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Tab_C_SetHighlightLabel, K2Node_MakeStruct_SlateColor_1) == 0x000028, "Member 'UIW_ListItem_Tab_C_SetHighlightLabel::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

}

