#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Loading

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "ProjectP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UIW_Loading.UIW_Loading_C.ExecuteUbergraph_UIW_Loading
// 0x00B8 (0x00B8 - 0x0000)
struct UIW_Loading_C_ExecuteUbergraph_UIW_Loading final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULWorldLoadSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULWorldLoadScreenInfo*                  CallFunc_GetWorldLoadScreenInfo_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULWorldLoadSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAsyncLoadPercentage_ReturnValue;       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_2;    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_3;    // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x004C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULUISystem*                             CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULUISystem*                             CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULUISystem*                             CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Loading_C_ExecuteUbergraph_UIW_Loading) == 0x000008, "Wrong alignment on UIW_Loading_C_ExecuteUbergraph_UIW_Loading");
static_assert(sizeof(UIW_Loading_C_ExecuteUbergraph_UIW_Loading) == 0x0000B8, "Wrong size on UIW_Loading_C_ExecuteUbergraph_UIW_Loading");
static_assert(offsetof(UIW_Loading_C_ExecuteUbergraph_UIW_Loading, EntryPoint) == 0x000000, "Member 'UIW_Loading_C_ExecuteUbergraph_UIW_Loading::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ExecuteUbergraph_UIW_Loading, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'UIW_Loading_C_ExecuteUbergraph_UIW_Loading::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ExecuteUbergraph_UIW_Loading, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000014, "Member 'UIW_Loading_C_ExecuteUbergraph_UIW_Loading::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ExecuteUbergraph_UIW_Loading, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'UIW_Loading_C_ExecuteUbergraph_UIW_Loading::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ExecuteUbergraph_UIW_Loading, CallFunc_GetWorldLoadScreenInfo_ReturnValue) == 0x000020, "Member 'UIW_Loading_C_ExecuteUbergraph_UIW_Loading::CallFunc_GetWorldLoadScreenInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ExecuteUbergraph_UIW_Loading, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000028, "Member 'UIW_Loading_C_ExecuteUbergraph_UIW_Loading::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ExecuteUbergraph_UIW_Loading, CallFunc_GetVisibility_ReturnValue) == 0x000030, "Member 'UIW_Loading_C_ExecuteUbergraph_UIW_Loading::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ExecuteUbergraph_UIW_Loading, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000038, "Member 'UIW_Loading_C_ExecuteUbergraph_UIW_Loading::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ExecuteUbergraph_UIW_Loading, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000040, "Member 'UIW_Loading_C_ExecuteUbergraph_UIW_Loading::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ExecuteUbergraph_UIW_Loading, CallFunc_GetAsyncLoadPercentage_ReturnValue) == 0x000044, "Member 'UIW_Loading_C_ExecuteUbergraph_UIW_Loading::CallFunc_GetAsyncLoadPercentage_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ExecuteUbergraph_UIW_Loading, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x000048, "Member 'UIW_Loading_C_ExecuteUbergraph_UIW_Loading::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ExecuteUbergraph_UIW_Loading, CallFunc_GreaterEqual_FloatFloat_ReturnValue_2) == 0x000049, "Member 'UIW_Loading_C_ExecuteUbergraph_UIW_Loading::CallFunc_GreaterEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ExecuteUbergraph_UIW_Loading, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00004A, "Member 'UIW_Loading_C_ExecuteUbergraph_UIW_Loading::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ExecuteUbergraph_UIW_Loading, CallFunc_GreaterEqual_FloatFloat_ReturnValue_3) == 0x00004B, "Member 'UIW_Loading_C_ExecuteUbergraph_UIW_Loading::CallFunc_GreaterEqual_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ExecuteUbergraph_UIW_Loading, K2Node_Event_MyGeometry) == 0x00004C, "Member 'UIW_Loading_C_ExecuteUbergraph_UIW_Loading::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ExecuteUbergraph_UIW_Loading, K2Node_Event_InDeltaTime) == 0x000084, "Member 'UIW_Loading_C_ExecuteUbergraph_UIW_Loading::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ExecuteUbergraph_UIW_Loading, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000088, "Member 'UIW_Loading_C_ExecuteUbergraph_UIW_Loading::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ExecuteUbergraph_UIW_Loading, CallFunc_FMin_ReturnValue) == 0x000090, "Member 'UIW_Loading_C_ExecuteUbergraph_UIW_Loading::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ExecuteUbergraph_UIW_Loading, CallFunc_FInterpTo_ReturnValue) == 0x000094, "Member 'UIW_Loading_C_ExecuteUbergraph_UIW_Loading::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ExecuteUbergraph_UIW_Loading, CallFunc_Add_FloatFloat_ReturnValue) == 0x000098, "Member 'UIW_Loading_C_ExecuteUbergraph_UIW_Loading::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ExecuteUbergraph_UIW_Loading, CallFunc_FMax_ReturnValue) == 0x00009C, "Member 'UIW_Loading_C_ExecuteUbergraph_UIW_Loading::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ExecuteUbergraph_UIW_Loading, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x0000A0, "Member 'UIW_Loading_C_ExecuteUbergraph_UIW_Loading::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ExecuteUbergraph_UIW_Loading, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x0000A8, "Member 'UIW_Loading_C_ExecuteUbergraph_UIW_Loading::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ExecuteUbergraph_UIW_Loading, CallFunc_BooleanOR_ReturnValue) == 0x0000B0, "Member 'UIW_Loading_C_ExecuteUbergraph_UIW_Loading::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function UIW_Loading.UIW_Loading_C.Tick
// 0x003C (0x003C - 0x0000)
struct UIW_Loading_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Loading_C_Tick) == 0x000004, "Wrong alignment on UIW_Loading_C_Tick");
static_assert(sizeof(UIW_Loading_C_Tick) == 0x00003C, "Wrong size on UIW_Loading_C_Tick");
static_assert(offsetof(UIW_Loading_C_Tick, MyGeometry) == 0x000000, "Member 'UIW_Loading_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_Tick, InDeltaTime) == 0x000038, "Member 'UIW_Loading_C_Tick::InDeltaTime' has a wrong offset!");

// Function UIW_Loading.UIW_Loading_C.SetGauge
// 0x00A8 (0x00A8 - 0x0000)
struct UIW_Loading_C_SetGauge final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0068(0x0018)()
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Loading_C_SetGauge) == 0x000008, "Wrong alignment on UIW_Loading_C_SetGauge");
static_assert(sizeof(UIW_Loading_C_SetGauge) == 0x0000A8, "Wrong size on UIW_Loading_C_SetGauge");
static_assert(offsetof(UIW_Loading_C_SetGauge, Value) == 0x000000, "Member 'UIW_Loading_C_SetGauge::Value' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_SetGauge, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000004, "Member 'UIW_Loading_C_SetGauge::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_SetGauge, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'UIW_Loading_C_SetGauge::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_SetGauge, CallFunc_Round_ReturnValue) == 0x00000C, "Member 'UIW_Loading_C_SetGauge::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_SetGauge, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'UIW_Loading_C_SetGauge::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_SetGauge, CallFunc_Max_ReturnValue) == 0x000014, "Member 'UIW_Loading_C_SetGauge::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_SetGauge, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'UIW_Loading_C_SetGauge::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_SetGauge, K2Node_MakeArray_Array) == 0x000058, "Member 'UIW_Loading_C_SetGauge::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_SetGauge, CallFunc_Format_ReturnValue) == 0x000068, "Member 'UIW_Loading_C_SetGauge::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_SetGauge, K2Node_DynamicCast_AsCanvas_Panel_Slot) == 0x000080, "Member 'UIW_Loading_C_SetGauge::K2Node_DynamicCast_AsCanvas_Panel_Slot' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_SetGauge, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'UIW_Loading_C_SetGauge::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_SetGauge, CallFunc_GetSize_ReturnValue) == 0x00008C, "Member 'UIW_Loading_C_SetGauge::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_SetGauge, CallFunc_BreakVector2D_X) == 0x000094, "Member 'UIW_Loading_C_SetGauge::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_SetGauge, CallFunc_BreakVector2D_Y) == 0x000098, "Member 'UIW_Loading_C_SetGauge::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_SetGauge, CallFunc_MakeVector2D_ReturnValue) == 0x00009C, "Member 'UIW_Loading_C_SetGauge::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function UIW_Loading.UIW_Loading_C.ReleaseKey
// 0x001C (0x001C - 0x0000)
struct UIW_Loading_C_ReleaseKey final
{
public:
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Loading_C_ReleaseKey) == 0x000004, "Wrong alignment on UIW_Loading_C_ReleaseKey");
static_assert(sizeof(UIW_Loading_C_ReleaseKey) == 0x00001C, "Wrong size on UIW_Loading_C_ReleaseKey");
static_assert(offsetof(UIW_Loading_C_ReleaseKey, CallFunc_BooleanOR_ReturnValue) == 0x000000, "Member 'UIW_Loading_C_ReleaseKey::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ReleaseKey, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'UIW_Loading_C_ReleaseKey::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ReleaseKey, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'UIW_Loading_C_ReleaseKey::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ReleaseKey, Temp_int_Variable) == 0x00000C, "Member 'UIW_Loading_C_ReleaseKey::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ReleaseKey, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'UIW_Loading_C_ReleaseKey::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ReleaseKey, CallFunc_Array_Length_ReturnValue_1) == 0x000014, "Member 'UIW_Loading_C_ReleaseKey::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_ReleaseKey, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000018, "Member 'UIW_Loading_C_ReleaseKey::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function UIW_Loading.UIW_Loading_C.InitLoadingWidget
// 0x0080 (0x0080 - 0x0000)
struct UIW_Loading_C_InitLoadingWidget final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0010(0x0018)()
	class FName                                   CallFunc_GetImageCodeName_ReturnValue;             // 0x0028(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLLoadingScreenImageTableRowType       CallFunc_GetDataTableRowFromName_OutRow;           // 0x0030(0x0030)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Loading_C_InitLoadingWidget) == 0x000008, "Wrong alignment on UIW_Loading_C_InitLoadingWidget");
static_assert(sizeof(UIW_Loading_C_InitLoadingWidget) == 0x000080, "Wrong size on UIW_Loading_C_InitLoadingWidget");
static_assert(offsetof(UIW_Loading_C_InitLoadingWidget, Temp_byte_Variable) == 0x000000, "Member 'UIW_Loading_C_InitLoadingWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_InitLoadingWidget, Temp_byte_Variable_1) == 0x000001, "Member 'UIW_Loading_C_InitLoadingWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_InitLoadingWidget, CallFunc_GetConsoleVariableIntValue_ReturnValue) == 0x000004, "Member 'UIW_Loading_C_InitLoadingWidget::CallFunc_GetConsoleVariableIntValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_InitLoadingWidget, Temp_int_Variable) == 0x000008, "Member 'UIW_Loading_C_InitLoadingWidget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_InitLoadingWidget, K2Node_Select_Default) == 0x00000C, "Member 'UIW_Loading_C_InitLoadingWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_InitLoadingWidget, CallFunc_GetGameStrWithName_ReturnValue) == 0x000010, "Member 'UIW_Loading_C_InitLoadingWidget::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_InitLoadingWidget, CallFunc_GetImageCodeName_ReturnValue) == 0x000028, "Member 'UIW_Loading_C_InitLoadingWidget::CallFunc_GetImageCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_InitLoadingWidget, CallFunc_GetDataTableRowFromName_OutRow) == 0x000030, "Member 'UIW_Loading_C_InitLoadingWidget::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_InitLoadingWidget, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000060, "Member 'UIW_Loading_C_InitLoadingWidget::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_InitLoadingWidget, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000068, "Member 'UIW_Loading_C_InitLoadingWidget::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_InitLoadingWidget, K2Node_DynamicCast_AsTexture_2D) == 0x000070, "Member 'UIW_Loading_C_InitLoadingWidget::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_InitLoadingWidget, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'UIW_Loading_C_InitLoadingWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UIW_Loading.UIW_Loading_C.PrintTipText
// 0x0040 (0x0040 - 0x0000)
struct UIW_Loading_C_PrintTipText final
{
public:
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0000(0x0018)()
	class FName                                   CallFunc_GetTextCodeName_ReturnValue;              // 0x0018(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0020(0x0018)()
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Loading_C_PrintTipText) == 0x000008, "Wrong alignment on UIW_Loading_C_PrintTipText");
static_assert(sizeof(UIW_Loading_C_PrintTipText) == 0x000040, "Wrong size on UIW_Loading_C_PrintTipText");
static_assert(offsetof(UIW_Loading_C_PrintTipText, CallFunc_MakeLiteralText_ReturnValue) == 0x000000, "Member 'UIW_Loading_C_PrintTipText::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_PrintTipText, CallFunc_GetTextCodeName_ReturnValue) == 0x000018, "Member 'UIW_Loading_C_PrintTipText::CallFunc_GetTextCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_PrintTipText, CallFunc_GetGameStrWithName_ReturnValue) == 0x000020, "Member 'UIW_Loading_C_PrintTipText::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Loading_C_PrintTipText, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000038, "Member 'UIW_Loading_C_PrintTipText::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

}

