#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Main

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"
#include "UIST_FloatArray_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Slate_structs.hpp"
#include "UIST_Sound_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UIW_Main.UIW_Main_C.OnVisibleWindow__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UIW_Main_C_OnVisibleWindow__DelegateSignature final
{
public:
	bool                                          IsOpened;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Main_C_OnVisibleWindow__DelegateSignature) == 0x000001, "Wrong alignment on UIW_Main_C_OnVisibleWindow__DelegateSignature");
static_assert(sizeof(UIW_Main_C_OnVisibleWindow__DelegateSignature) == 0x000001, "Wrong size on UIW_Main_C_OnVisibleWindow__DelegateSignature");
static_assert(offsetof(UIW_Main_C_OnVisibleWindow__DelegateSignature, IsOpened) == 0x000000, "Member 'UIW_Main_C_OnVisibleWindow__DelegateSignature::IsOpened' has a wrong offset!");

// Function UIW_Main.UIW_Main_C.OnVisibleMenu__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct UIW_Main_C_OnVisibleMenu__DelegateSignature final
{
public:
	bool                                          IsOpened;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          NeedCenterMouse;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Main_C_OnVisibleMenu__DelegateSignature) == 0x000001, "Wrong alignment on UIW_Main_C_OnVisibleMenu__DelegateSignature");
static_assert(sizeof(UIW_Main_C_OnVisibleMenu__DelegateSignature) == 0x000002, "Wrong size on UIW_Main_C_OnVisibleMenu__DelegateSignature");
static_assert(offsetof(UIW_Main_C_OnVisibleMenu__DelegateSignature, IsOpened) == 0x000000, "Member 'UIW_Main_C_OnVisibleMenu__DelegateSignature::IsOpened' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_OnVisibleMenu__DelegateSignature, NeedCenterMouse) == 0x000001, "Member 'UIW_Main_C_OnVisibleMenu__DelegateSignature::NeedCenterMouse' has a wrong offset!");

// Function UIW_Main.UIW_Main_C.RecordDispatcher__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UIW_Main_C_RecordDispatcher__DelegateSignature final
{
public:
	bool                                          IsPlay;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Main_C_RecordDispatcher__DelegateSignature) == 0x000001, "Wrong alignment on UIW_Main_C_RecordDispatcher__DelegateSignature");
static_assert(sizeof(UIW_Main_C_RecordDispatcher__DelegateSignature) == 0x000001, "Wrong size on UIW_Main_C_RecordDispatcher__DelegateSignature");
static_assert(offsetof(UIW_Main_C_RecordDispatcher__DelegateSignature, IsPlay) == 0x000000, "Member 'UIW_Main_C_RecordDispatcher__DelegateSignature::IsPlay' has a wrong offset!");

// Function UIW_Main.UIW_Main_C.PreviewHideDispatcher__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Main_C_PreviewHideDispatcher__DelegateSignature final
{
public:
	class FName                                   CollectionCodeName;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Main_C_PreviewHideDispatcher__DelegateSignature) == 0x000004, "Wrong alignment on UIW_Main_C_PreviewHideDispatcher__DelegateSignature");
static_assert(sizeof(UIW_Main_C_PreviewHideDispatcher__DelegateSignature) == 0x000008, "Wrong size on UIW_Main_C_PreviewHideDispatcher__DelegateSignature");
static_assert(offsetof(UIW_Main_C_PreviewHideDispatcher__DelegateSignature, CollectionCodeName) == 0x000000, "Member 'UIW_Main_C_PreviewHideDispatcher__DelegateSignature::CollectionCodeName' has a wrong offset!");

// Function UIW_Main.UIW_Main_C.ExecuteUbergraph_UIW_Main
// 0x0378 (0x0378 - 0x0000)
struct UIW_Main_C_ExecuteUbergraph_UIW_Main final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_HUD_Abnormal_Gauge_C*              CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_HUD_Abnormal_Item_C*               CallFunc_Create_ReturnValue_1;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULObjectManagementSystem*               CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_1;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_2;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        CallFunc_Array_Get_Item;                           // 0x0078(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 CallFunc_Conv_SoftObjPathToSoftObjRef_ReturnValue; // 0x0098(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C2[0x2];                                       // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName MainStateName)>    K2Node_CreateDelegate_OutputDelegate;              // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName CategoryName)>     K2Node_CreateDelegate_OutputDelegate_1;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& CommandName, bool CommandCondition)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable_1;                               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FE[0x2];                                       // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_AddWidget_Widget;                         // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool IsValid)>                 K2Node_CreateDelegate_OutputDelegate_3;            // 0x010C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool SyncStart)>               K2Node_CreateDelegate_OutputDelegate_4;            // 0x0120(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool SyncStart)>               K2Node_CreateDelegate_OutputDelegate_5;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName WidgetTableName)>  K2Node_CreateDelegate_OutputDelegate_6;            // 0x0140(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName WidgetTableName)>  K2Node_CreateDelegate_OutputDelegate_7;            // 0x0150(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0160(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0170(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool bGamePad)>                K2Node_CreateDelegate_OutputDelegate_10;           // 0x0180(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsOpened, bool NeedCenterMouse)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x0198(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName WidgetTableName)>  K2Node_CreateDelegate_OutputDelegate_12;           // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName WidgetTableName)>  K2Node_CreateDelegate_OutputDelegate_13;           // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x01D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01F8(0x0018)()
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULPlayInputSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_14;           // 0x0220(0x0010)(ZeroConstructor, NoDestructor)
	class UUIW_QA_ListItem_C*                     CallFunc_SpawnObject_ReturnValue;                  // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWrapBoxSlot*                           CallFunc_AddChildToWrapBox_ReturnValue;            // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULDevSystem*                            CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0258(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_15;           // 0x0270(0x0010)(ZeroConstructor, NoDestructor)
	struct FUIST_Sound                            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0280(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x3];                                      // 0x02C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULSaveGameSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_16;           // 0x02DC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULUISystem*                             CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item_2;                         // 0x02F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSoftObjectPath>                CallFunc_FindFiles_OutObjectPaths;                 // 0x0310(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x032D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32E[0x2];                                      // 0x032E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_2;         // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_3;         // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_6;                  // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_7;                  // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Main_C_ExecuteUbergraph_UIW_Main) == 0x000008, "Wrong alignment on UIW_Main_C_ExecuteUbergraph_UIW_Main");
static_assert(sizeof(UIW_Main_C_ExecuteUbergraph_UIW_Main) == 0x000378, "Wrong size on UIW_Main_C_ExecuteUbergraph_UIW_Main");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, EntryPoint) == 0x000000, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Create_ReturnValue) == 0x000008, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Create_ReturnValue_1) == 0x000010, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, K2Node_CustomEvent_Loaded_2) == 0x000018, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, Temp_object_Variable) == 0x000020, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000028, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, K2Node_CustomEvent_Loaded_1) == 0x000030, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, Temp_object_Variable_1) == 0x000040, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, K2Node_CustomEvent_Loaded) == 0x000048, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, Temp_object_Variable_2) == 0x000050, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, Temp_int_Array_Index_Variable) == 0x000058, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, Temp_int_Array_Index_Variable_1) == 0x00005C, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, Temp_int_Loop_Counter_Variable) == 0x000060, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, Temp_int_Array_Index_Variable_2) == 0x00006C, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, Temp_int_Variable) == 0x000070, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Array_Get_Item) == 0x000078, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Add_IntInt_ReturnValue_1) == 0x000090, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Conv_SoftObjPathToSoftObjRef_ReturnValue) == 0x000098, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Conv_SoftObjPathToSoftObjRef_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Conv_IntToByte_ReturnValue) == 0x0000C0, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x0000C1, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000C4, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, K2Node_CreateDelegate_OutputDelegate) == 0x0000C8, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000D8, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000E8, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, Temp_int_Variable_1) == 0x0000F8, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x0000FC, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_GetValidValue_ReturnValue) == 0x0000FD, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_AddWidget_Widget) == 0x000100, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_AddWidget_Widget' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000108, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000109, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, K2Node_CreateDelegate_OutputDelegate_3) == 0x00010C, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_BooleanAND_ReturnValue) == 0x00011C, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, K2Node_CreateDelegate_OutputDelegate_4) == 0x000120, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, K2Node_CreateDelegate_OutputDelegate_5) == 0x000130, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, K2Node_CreateDelegate_OutputDelegate_6) == 0x000140, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, K2Node_CreateDelegate_OutputDelegate_7) == 0x000150, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, K2Node_CreateDelegate_OutputDelegate_8) == 0x000160, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, K2Node_CreateDelegate_OutputDelegate_9) == 0x000170, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, K2Node_CreateDelegate_OutputDelegate_10) == 0x000180, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_GetPlayerController_ReturnValue) == 0x000190, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, K2Node_CreateDelegate_OutputDelegate_11) == 0x000198, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, K2Node_CreateDelegate_OutputDelegate_12) == 0x0001A8, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, K2Node_CreateDelegate_OutputDelegate_13) == 0x0001B8, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, K2Node_ComponentBoundEvent_Value) == 0x0001C8, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_K2_SetTimer_ReturnValue) == 0x0001D0, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Conv_FloatToString_ReturnValue) == 0x0001D8, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Concat_StrStr_ReturnValue) == 0x0001E8, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Conv_StringToText_ReturnValue) == 0x0001F8, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_IsVisible_ReturnValue) == 0x000210, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000218, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, K2Node_CreateDelegate_OutputDelegate_14) == 0x000220, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_SpawnObject_ReturnValue) == 0x000230, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_AddChildToWrapBox_ReturnValue) == 0x000238, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_AddChildToWrapBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000240, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000248, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_GetChildrenCount_ReturnValue) == 0x000250, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000258, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Array_Get_Item_1) == 0x000268, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, K2Node_CreateDelegate_OutputDelegate_15) == 0x000270, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_GetDataTableRowFromName_OutRow) == 0x000280, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0002C0, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Array_Length_ReturnValue_1) == 0x0002C4, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Array_Add_ReturnValue) == 0x0002C8, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Array_Add_ReturnValue_1) == 0x0002CC, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x0002D0, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Array_Add_ReturnValue_2) == 0x0002D8, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, K2Node_CreateDelegate_OutputDelegate_16) == 0x0002DC, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x0002F0, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Array_Get_Item_2) == 0x0002F8, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Array_AddUnique_ReturnValue) == 0x000308, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_FindFiles_OutObjectPaths) == 0x000310, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_FindFiles_OutObjectPaths' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Array_Length_ReturnValue_2) == 0x000320, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_MakeLiteralInt_ReturnValue) == 0x000324, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, Temp_int_Loop_Counter_Variable_1) == 0x000328, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Less_IntInt_ReturnValue_1) == 0x00032C, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Less_IntInt_ReturnValue_2) == 0x00032D, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Add_IntInt_ReturnValue_2) == 0x000330, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Array_Add_ReturnValue_3) == 0x000334, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000338, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_LoadAsset_Blocking_ReturnValue_1) == 0x000340, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_LoadAsset_Blocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_LoadAsset_Blocking_ReturnValue_2) == 0x000348, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_LoadAsset_Blocking_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_LoadAsset_Blocking_ReturnValue_3) == 0x000350, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_LoadAsset_Blocking_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, Temp_int_Loop_Counter_Variable_2) == 0x000358, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Array_Add_ReturnValue_4) == 0x00035C, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Less_IntInt_ReturnValue_3) == 0x000360, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Add_IntInt_ReturnValue_3) == 0x000364, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Array_Add_ReturnValue_5) == 0x000368, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Array_Add_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Array_Add_ReturnValue_6) == 0x00036C, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Array_Add_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_ExecuteUbergraph_UIW_Main, CallFunc_Array_Add_ReturnValue_7) == 0x000370, "Member 'UIW_Main_C_ExecuteUbergraph_UIW_Main::CallFunc_Array_Add_ReturnValue_7' has a wrong offset!");

// Function UIW_Main.UIW_Main_C.BndEvt__UIW_Main_Slider_QA_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UIW_Main_C_BndEvt__UIW_Main_Slider_QA_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Main_C_BndEvt__UIW_Main_Slider_QA_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong alignment on UIW_Main_C_BndEvt__UIW_Main_Slider_QA_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature");
static_assert(sizeof(UIW_Main_C_BndEvt__UIW_Main_Slider_QA_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature) == 0x000004, "Wrong size on UIW_Main_C_BndEvt__UIW_Main_Slider_QA_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature");
static_assert(offsetof(UIW_Main_C_BndEvt__UIW_Main_Slider_QA_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature, Value) == 0x000000, "Member 'UIW_Main_C_BndEvt__UIW_Main_Slider_QA_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature::Value' has a wrong offset!");

// Function UIW_Main.UIW_Main_C.OnLoaded_B02654034FFA4E6352D787860EA3CFF1
// 0x0008 (0x0008 - 0x0000)
struct UIW_Main_C_OnLoaded_B02654034FFA4E6352D787860EA3CFF1 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Main_C_OnLoaded_B02654034FFA4E6352D787860EA3CFF1) == 0x000008, "Wrong alignment on UIW_Main_C_OnLoaded_B02654034FFA4E6352D787860EA3CFF1");
static_assert(sizeof(UIW_Main_C_OnLoaded_B02654034FFA4E6352D787860EA3CFF1) == 0x000008, "Wrong size on UIW_Main_C_OnLoaded_B02654034FFA4E6352D787860EA3CFF1");
static_assert(offsetof(UIW_Main_C_OnLoaded_B02654034FFA4E6352D787860EA3CFF1, Loaded) == 0x000000, "Member 'UIW_Main_C_OnLoaded_B02654034FFA4E6352D787860EA3CFF1::Loaded' has a wrong offset!");

// Function UIW_Main.UIW_Main_C.OnLoaded_5660C9E5492071D2DD6456BECA8DED90
// 0x0008 (0x0008 - 0x0000)
struct UIW_Main_C_OnLoaded_5660C9E5492071D2DD6456BECA8DED90 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Main_C_OnLoaded_5660C9E5492071D2DD6456BECA8DED90) == 0x000008, "Wrong alignment on UIW_Main_C_OnLoaded_5660C9E5492071D2DD6456BECA8DED90");
static_assert(sizeof(UIW_Main_C_OnLoaded_5660C9E5492071D2DD6456BECA8DED90) == 0x000008, "Wrong size on UIW_Main_C_OnLoaded_5660C9E5492071D2DD6456BECA8DED90");
static_assert(offsetof(UIW_Main_C_OnLoaded_5660C9E5492071D2DD6456BECA8DED90, Loaded) == 0x000000, "Member 'UIW_Main_C_OnLoaded_5660C9E5492071D2DD6456BECA8DED90::Loaded' has a wrong offset!");

// Function UIW_Main.UIW_Main_C.OnLoaded_19CE33E441B1CF0573562AAA59BAE02E
// 0x0008 (0x0008 - 0x0000)
struct UIW_Main_C_OnLoaded_19CE33E441B1CF0573562AAA59BAE02E final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Main_C_OnLoaded_19CE33E441B1CF0573562AAA59BAE02E) == 0x000008, "Wrong alignment on UIW_Main_C_OnLoaded_19CE33E441B1CF0573562AAA59BAE02E");
static_assert(sizeof(UIW_Main_C_OnLoaded_19CE33E441B1CF0573562AAA59BAE02E) == 0x000008, "Wrong size on UIW_Main_C_OnLoaded_19CE33E441B1CF0573562AAA59BAE02E");
static_assert(offsetof(UIW_Main_C_OnLoaded_19CE33E441B1CF0573562AAA59BAE02E, Loaded) == 0x000000, "Member 'UIW_Main_C_OnLoaded_19CE33E441B1CF0573562AAA59BAE02E::Loaded' has a wrong offset!");

// Function UIW_Main.UIW_Main_C.OnDrop
// 0x00E0 (0x00E0 - 0x0000)
struct UIW_Main_C_OnDrop final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00A8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x00B0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_Drag_TestWindow_C*                K2Node_DynamicCast_AsUIBP_Drag_Test_Window;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue; // 0x00C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_AbsoluteToLocal_ReturnValue;              // 0x00CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x00D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Main_C_OnDrop) == 0x000008, "Wrong alignment on UIW_Main_C_OnDrop");
static_assert(sizeof(UIW_Main_C_OnDrop) == 0x0000E0, "Wrong size on UIW_Main_C_OnDrop");
static_assert(offsetof(UIW_Main_C_OnDrop, MyGeometry) == 0x000000, "Member 'UIW_Main_C_OnDrop::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_OnDrop, PointerEvent) == 0x000038, "Member 'UIW_Main_C_OnDrop::PointerEvent' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_OnDrop, Operation) == 0x0000A8, "Member 'UIW_Main_C_OnDrop::Operation' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_OnDrop, ReturnValue) == 0x0000B0, "Member 'UIW_Main_C_OnDrop::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_OnDrop, K2Node_DynamicCast_AsUIBP_Drag_Test_Window) == 0x0000B8, "Member 'UIW_Main_C_OnDrop::K2Node_DynamicCast_AsUIBP_Drag_Test_Window' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_OnDrop, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'UIW_Main_C_OnDrop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_OnDrop, CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue) == 0x0000C4, "Member 'UIW_Main_C_OnDrop::CallFunc_PointerEvent_GetScreenSpacePosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_OnDrop, CallFunc_AbsoluteToLocal_ReturnValue) == 0x0000CC, "Member 'UIW_Main_C_OnDrop::CallFunc_AbsoluteToLocal_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_OnDrop, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x0000D4, "Member 'UIW_Main_C_OnDrop::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");

// Function UIW_Main.UIW_Main_C.AddWidget
// 0x00D8 (0x00D8 - 0x0000)
struct UIW_Main_C_AddWidget final
{
public:
	class FName                                   RowName;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELWidgetDepth                                 CurrentDepth;                                      // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentZOrder;                                     // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           TargetContainer;                                   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CurrentAddWidget;                                  // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLWidgetTableRow                       CallFunc_GetDataTableRowFromName_OutRow;           // 0x0028(0x0040)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Window_C*                          K2Node_DynamicCast_AsUIW_Window;                   // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    CallFunc_Conv_SoftClassReferenceToClass_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenedWidget_IsOpened;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_IsOpenedWidget_UserWidget;                // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IsOpenedWidget_WidgetArrayIndex;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_ClassDynamicCast_AsLWidget;                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULWidget*                               CallFunc_Create_ReturnValue;                       // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x00B8(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Main_C_AddWidget) == 0x000008, "Wrong alignment on UIW_Main_C_AddWidget");
static_assert(sizeof(UIW_Main_C_AddWidget) == 0x0000D8, "Wrong size on UIW_Main_C_AddWidget");
static_assert(offsetof(UIW_Main_C_AddWidget, RowName) == 0x000000, "Member 'UIW_Main_C_AddWidget::RowName' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_AddWidget, Widget) == 0x000008, "Member 'UIW_Main_C_AddWidget::Widget' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_AddWidget, CurrentDepth) == 0x000010, "Member 'UIW_Main_C_AddWidget::CurrentDepth' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_AddWidget, CurrentZOrder) == 0x000014, "Member 'UIW_Main_C_AddWidget::CurrentZOrder' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_AddWidget, TargetContainer) == 0x000018, "Member 'UIW_Main_C_AddWidget::TargetContainer' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_AddWidget, CurrentAddWidget) == 0x000020, "Member 'UIW_Main_C_AddWidget::CurrentAddWidget' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_AddWidget, CallFunc_GetDataTableRowFromName_OutRow) == 0x000028, "Member 'UIW_Main_C_AddWidget::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_AddWidget, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000068, "Member 'UIW_Main_C_AddWidget::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_AddWidget, K2Node_DynamicCast_AsUIW_Window) == 0x000070, "Member 'UIW_Main_C_AddWidget::K2Node_DynamicCast_AsUIW_Window' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_AddWidget, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'UIW_Main_C_AddWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_AddWidget, CallFunc_Conv_SoftClassReferenceToClass_ReturnValue) == 0x000080, "Member 'UIW_Main_C_AddWidget::CallFunc_Conv_SoftClassReferenceToClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_AddWidget, CallFunc_IsOpenedWidget_IsOpened) == 0x000088, "Member 'UIW_Main_C_AddWidget::CallFunc_IsOpenedWidget_IsOpened' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_AddWidget, CallFunc_IsOpenedWidget_UserWidget) == 0x000090, "Member 'UIW_Main_C_AddWidget::CallFunc_IsOpenedWidget_UserWidget' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_AddWidget, CallFunc_IsOpenedWidget_WidgetArrayIndex) == 0x000098, "Member 'UIW_Main_C_AddWidget::CallFunc_IsOpenedWidget_WidgetArrayIndex' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_AddWidget, K2Node_ClassDynamicCast_AsLWidget) == 0x0000A0, "Member 'UIW_Main_C_AddWidget::K2Node_ClassDynamicCast_AsLWidget' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_AddWidget, K2Node_ClassDynamicCast_bSuccess) == 0x0000A8, "Member 'UIW_Main_C_AddWidget::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_AddWidget, CallFunc_Create_ReturnValue) == 0x0000B0, "Member 'UIW_Main_C_AddWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_AddWidget, K2Node_MakeStruct_Anchors) == 0x0000B8, "Member 'UIW_Main_C_AddWidget::K2Node_MakeStruct_Anchors' has a wrong offset!");
static_assert(offsetof(UIW_Main_C_AddWidget, CallFunc_Array_Add_ReturnValue) == 0x0000C8, "Member 'UIW_Main_C_AddWidget::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
