#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ContextMenu_Btn

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UIW_ContextMenu_Btn.UIW_ContextMenu_Btn_C.OnReleased__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_ContextMenu_Btn_C_OnReleased__DelegateSignature final
{
public:
	class FName                                   EventName_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ContextMenu_Btn_C_OnReleased__DelegateSignature) == 0x000004, "Wrong alignment on UIW_ContextMenu_Btn_C_OnReleased__DelegateSignature");
static_assert(sizeof(UIW_ContextMenu_Btn_C_OnReleased__DelegateSignature) == 0x000008, "Wrong size on UIW_ContextMenu_Btn_C_OnReleased__DelegateSignature");
static_assert(offsetof(UIW_ContextMenu_Btn_C_OnReleased__DelegateSignature, EventName_0) == 0x000000, "Member 'UIW_ContextMenu_Btn_C_OnReleased__DelegateSignature::EventName_0' has a wrong offset!");

// Function UIW_ContextMenu_Btn.UIW_ContextMenu_Btn_C.OnSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_ContextMenu_Btn_C_OnSelected__DelegateSignature final
{
public:
	class FName                                   EventName_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ContextMenu_Btn_C_OnSelected__DelegateSignature) == 0x000004, "Wrong alignment on UIW_ContextMenu_Btn_C_OnSelected__DelegateSignature");
static_assert(sizeof(UIW_ContextMenu_Btn_C_OnSelected__DelegateSignature) == 0x000008, "Wrong size on UIW_ContextMenu_Btn_C_OnSelected__DelegateSignature");
static_assert(offsetof(UIW_ContextMenu_Btn_C_OnSelected__DelegateSignature, EventName_0) == 0x000000, "Member 'UIW_ContextMenu_Btn_C_OnSelected__DelegateSignature::EventName_0' has a wrong offset!");

// Function UIW_ContextMenu_Btn.UIW_ContextMenu_Btn_C.ExecuteUbergraph_UIW_ContextMenu_Btn
// 0x0004 (0x0004 - 0x0000)
struct UIW_ContextMenu_Btn_C_ExecuteUbergraph_UIW_ContextMenu_Btn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ContextMenu_Btn_C_ExecuteUbergraph_UIW_ContextMenu_Btn) == 0x000004, "Wrong alignment on UIW_ContextMenu_Btn_C_ExecuteUbergraph_UIW_ContextMenu_Btn");
static_assert(sizeof(UIW_ContextMenu_Btn_C_ExecuteUbergraph_UIW_ContextMenu_Btn) == 0x000004, "Wrong size on UIW_ContextMenu_Btn_C_ExecuteUbergraph_UIW_ContextMenu_Btn");
static_assert(offsetof(UIW_ContextMenu_Btn_C_ExecuteUbergraph_UIW_ContextMenu_Btn, EntryPoint) == 0x000000, "Member 'UIW_ContextMenu_Btn_C_ExecuteUbergraph_UIW_ContextMenu_Btn::EntryPoint' has a wrong offset!");

// Function UIW_ContextMenu_Btn.UIW_ContextMenu_Btn_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct UIW_ContextMenu_Btn_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ContextMenu_Btn_C_OnFocusReceived) == 0x000008, "Wrong alignment on UIW_ContextMenu_Btn_C_OnFocusReceived");
static_assert(sizeof(UIW_ContextMenu_Btn_C_OnFocusReceived) == 0x0001B8, "Wrong size on UIW_ContextMenu_Btn_C_OnFocusReceived");
static_assert(offsetof(UIW_ContextMenu_Btn_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UIW_ContextMenu_Btn_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_Btn_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UIW_ContextMenu_Btn_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_Btn_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UIW_ContextMenu_Btn_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_Btn_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'UIW_ContextMenu_Btn_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ContextMenu_Btn_C_OnFocusReceived, CallFunc_GetMainWidget_MainWidget) == 0x0001B0, "Member 'UIW_ContextMenu_Btn_C_OnFocusReceived::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");

}

