#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ItemInfo_Compare

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"
#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UIW_ItemInfo_Compare.UIW_ItemInfo_Compare_C.GetWeaponDiff
// 0x0040 (0x0040 - 0x0000)
struct UIW_ItemInfo_Compare_C_GetWeaponDiff final
{
public:
	class ULWeaponItem*                           CurrentWeapon;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULWeaponItem*                           CompareWeapon;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELSecondStat                                  Stat;                                              // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Diff;                                              // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRawWeaponStat_ReturnValue;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWeaponStatBonus_ReturnValue;           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWeaponStatBonus_ReturnValue_1;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRawWeaponStat_ReturnValue_1;           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ItemInfo_Compare_C_GetWeaponDiff) == 0x000008, "Wrong alignment on UIW_ItemInfo_Compare_C_GetWeaponDiff");
static_assert(sizeof(UIW_ItemInfo_Compare_C_GetWeaponDiff) == 0x000040, "Wrong size on UIW_ItemInfo_Compare_C_GetWeaponDiff");
static_assert(offsetof(UIW_ItemInfo_Compare_C_GetWeaponDiff, CurrentWeapon) == 0x000000, "Member 'UIW_ItemInfo_Compare_C_GetWeaponDiff::CurrentWeapon' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_GetWeaponDiff, CompareWeapon) == 0x000008, "Member 'UIW_ItemInfo_Compare_C_GetWeaponDiff::CompareWeapon' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_GetWeaponDiff, Stat) == 0x000010, "Member 'UIW_ItemInfo_Compare_C_GetWeaponDiff::Stat' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_GetWeaponDiff, Diff) == 0x000014, "Member 'UIW_ItemInfo_Compare_C_GetWeaponDiff::Diff' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_GetWeaponDiff, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000018, "Member 'UIW_ItemInfo_Compare_C_GetWeaponDiff::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_GetWeaponDiff, CallFunc_GetRawWeaponStat_ReturnValue) == 0x000020, "Member 'UIW_ItemInfo_Compare_C_GetWeaponDiff::CallFunc_GetRawWeaponStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_GetWeaponDiff, CallFunc_GetWeaponStatBonus_ReturnValue) == 0x000024, "Member 'UIW_ItemInfo_Compare_C_GetWeaponDiff::CallFunc_GetWeaponStatBonus_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_GetWeaponDiff, CallFunc_GetWeaponStatBonus_ReturnValue_1) == 0x000028, "Member 'UIW_ItemInfo_Compare_C_GetWeaponDiff::CallFunc_GetWeaponStatBonus_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_GetWeaponDiff, CallFunc_GetRawWeaponStat_ReturnValue_1) == 0x00002C, "Member 'UIW_ItemInfo_Compare_C_GetWeaponDiff::CallFunc_GetRawWeaponStat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_GetWeaponDiff, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'UIW_ItemInfo_Compare_C_GetWeaponDiff::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_GetWeaponDiff, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'UIW_ItemInfo_Compare_C_GetWeaponDiff::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_GetWeaponDiff, CallFunc_Subtract_IntInt_ReturnValue) == 0x000038, "Member 'UIW_ItemInfo_Compare_C_GetWeaponDiff::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function UIW_ItemInfo_Compare.UIW_ItemInfo_Compare_C.SetItemCompare
// 0x0010 (0x0010 - 0x0000)
struct UIW_ItemInfo_Compare_C_SetItemCompare final
{
public:
	class ULItem*                                 LItem;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 CompareLItem;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ItemInfo_Compare_C_SetItemCompare) == 0x000008, "Wrong alignment on UIW_ItemInfo_Compare_C_SetItemCompare");
static_assert(sizeof(UIW_ItemInfo_Compare_C_SetItemCompare) == 0x000010, "Wrong size on UIW_ItemInfo_Compare_C_SetItemCompare");
static_assert(offsetof(UIW_ItemInfo_Compare_C_SetItemCompare, LItem) == 0x000000, "Member 'UIW_ItemInfo_Compare_C_SetItemCompare::LItem' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_SetItemCompare, CompareLItem) == 0x000008, "Member 'UIW_ItemInfo_Compare_C_SetItemCompare::CompareLItem' has a wrong offset!");

// Function UIW_ItemInfo_Compare.UIW_ItemInfo_Compare_C.RefreshWeaponInfo
// 0x0A90 (0x0A90 - 0x0000)
struct UIW_ItemInfo_Compare_C_RefreshWeaponInfo final
{
public:
	struct FSkillInfoPtr                          LocalSkillInfo;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor)
	class FName                                   LocalName;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalDiff;                                         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemHandleInfoPtr                     LocalCompareHandleInfo;                            // 0x0018(0x0008)(Edit, BlueprintVisible, NoDestructor)
	struct FItemBladeInfoPtr                      LocalCompareBladeInfo;                             // 0x0020(0x0008)(Edit, BlueprintVisible, NoDestructor)
	class ULWeaponItem*                           LocalCompareItem;                                  // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             LocalTexture2D;                                    // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<ELWeaponStyleType, class FName>          LocalStyleType;                                    // 0x0038(0x0050)(Edit, BlueprintVisible)
	ELSecondStat                                  LocalSecondStat;                                   // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ELFirstStat>                           LocalChaUpPreviewStat;                             // 0x0090(0x0010)(Edit, BlueprintVisible)
	bool                                          LocalHasReinforceData;                             // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemHandleInfoPtr                     LocalHandleInfo;                                   // 0x00A8(0x0008)(Edit, BlueprintVisible, NoDestructor)
	struct FItemCommonInfoPtr                     LocalHandleCommonInfo;                             // 0x00B0(0x0008)(Edit, BlueprintVisible, NoDestructor)
	struct FItemBladeInfoPtr                      LocalBladeInfo;                                    // 0x00B8(0x0008)(Edit, BlueprintVisible, NoDestructor)
	struct FItemCommonInfoPtr                     LocalBladeCommonInfo;                              // 0x00C0(0x0008)(Edit, BlueprintVisible, NoDestructor)
	TArray<class UUIBP_ListData_OneStat_C*>       LocalOneStatList;                                  // 0x00C8(0x0010)(Edit, BlueprintVisible)
	class ULWeaponItem*                           LocalLWeaponItem;                                  // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ELWeaponStyleType, class FName>          K2Node_MakeVariable_MakeVariableOutput;            // 0x00E8(0x0050)()
	struct FItemHandleInfoPtr                     CallFunc_GetHandleInfo_ReturnValue;                // 0x0138(0x0008)(NoDestructor)
	struct FItemBladeInfoPtr                      CallFunc_GetBladeInfo_ReturnValue;                 // 0x0140(0x0008)(NoDestructor)
	struct FItemCommonInfoPtr                     CallFunc_GetHandleCommonInfo_ReturnValue;          // 0x0148(0x0008)(NoDestructor)
	struct FItemCommonInfoPtr                     CallFunc_GetBladeCommonInfo_ReturnValue;           // 0x0150(0x0008)(NoDestructor)
	TSoftObjectPtr<class UObject>                 CallFunc_GetHandleImageResource_ReturnValue;       // 0x0158(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_GetBladeImageResource_ReturnValue;        // 0x0180(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_GetHandleImageResource_ReturnValue_1;     // 0x01A8(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_GetBladeImageResource_ReturnValue_1;      // 0x01D0(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_GetPulseRechargePointMax_ReturnValue;     // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHeroicWeapon_ReturnValue;               // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0208(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0210(0x0018)()
	struct FItemHandleInfoPtr                     CallFunc_GetHandleInfo_ReturnValue_1;              // 0x0228(0x0008)(NoDestructor)
	struct FItemBladeInfoPtr                      CallFunc_GetBladeInfo_ReturnValue_1;               // 0x0230(0x0008)(NoDestructor)
	class FText                                   CallFunc_GetEmptyText_ReturnValue_1;               // 0x0238(0x0018)()
	class FText                                   CallFunc_GetLocalTextTooltip2Localize_ReturnValue; // 0x0250(0x0018)()
	class FText                                   CallFunc_GetLocalTextTooltip1Localize_ReturnValue; // 0x0268(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_1;        // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_282[0x6];                                      // 0x0282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEmptyText_ReturnValue_2;               // 0x0288(0x0018)()
	class FText                                   CallFunc_GetEmptyText_ReturnValue_3;               // 0x02A0(0x0018)()
	class FText                                   CallFunc_GetLocalTextTooltip2Localize_ReturnValue_1; // 0x02B8(0x0018)()
	class FText                                   CallFunc_GetLocalTextTooltip1Localize_ReturnValue_1; // 0x02D0(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_2;        // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_3;        // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EA[0x6];                                      // 0x02EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x02F0(0x0018)()
	int32                                         CallFunc_GetRawWeaponStat_ReturnValue;             // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x030D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30E[0x2];                                      // 0x030E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue;                  // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHeroicWeapon_ReturnValue_1;             // 0x031C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 CallFunc_GetHeroicImageResource_ReturnValue;       // 0x0320(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_GetHeroicImageResource_ReturnValue_1;     // 0x0348(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	ELItemSecondCategory                          CallFunc_GetSecondCategory_ReturnValue;            // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetSecondCategoryLabel_Label;             // 0x0378(0x0018)()
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetFrenzySkillCodeName_ReturnValue;       // 0x0394(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39D[0x3];                                      // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSkillInfoPtr                          CallFunc_FindSkillInfoByNameBP_ReturnValue;        // 0x03A0(0x0008)(NoDestructor)
	ELActionCategory                              CallFunc_GetActionCategory_ReturnValue;            // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetIconFableArtsType_Img;                 // 0x03B0(0x0028)(HasGetValueTypeHash)
	class FName                                   CallFunc_GetFrenzySkillCodeName_ReturnValue_1;     // 0x03D8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_1;                // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSkillInfoPtr                          CallFunc_FindSkillInfoByNameBP_ReturnValue_1;      // 0x03F0(0x0008)(NoDestructor)
	ELActionCategory                              CallFunc_GetActionCategory_ReturnValue_1;          // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F9[0x7];                                      // 0x03F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_2;                // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetIconFableArtsType_Img_1;               // 0x0408(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x0438(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_2;         // 0x0450(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_3;         // 0x0468(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_4;         // 0x0480(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_5;         // 0x0498(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_6;         // 0x04B0(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_7;         // 0x04C8(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_8;         // 0x04E0(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_9;         // 0x04F8(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_10;        // 0x0510(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_11;        // 0x0528(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_12;        // 0x0540(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_13;        // 0x0558(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_14;        // 0x0570(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_15;        // 0x0588(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_16;        // 0x05A0(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_17;        // 0x05B8(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_18;        // 0x05D0(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_19;        // 0x05E8(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_20;        // 0x0600(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_21;        // 0x0618(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_22;        // 0x0630(0x0018)()
	int32                                         CallFunc_GetAttackGainFrenzyPointPassive_ReturnValue; // 0x0648(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAttackGainFrenzyPointPassive_ReturnValue_1; // 0x064C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_654[0x4];                                      // 0x0654(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0658(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_671[0x7];                                      // 0x0671(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_3;                // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_4;                // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetHandleCorrectionGrade_OutStackLevel;   // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELHandleCorrectResultGrade                    CallFunc_GetHandleCorrectionGrade_ReturnValue;     // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_691[0x3];                                      // 0x0691(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetHandleCorrectionGrade_OutStackLevel_1; // 0x0694(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELHandleCorrectResultGrade                    CallFunc_GetHandleCorrectionGrade_ReturnValue_1;   // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_699[0x3];                                      // 0x0699(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x069C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetHandleCorrectionGradeText_Text;        // 0x06A0(0x0018)()
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x06B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x06BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetHandleCorrectionGrade_OutStackLevel_2; // 0x06C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELHandleCorrectResultGrade                    CallFunc_GetHandleCorrectionGrade_ReturnValue_2;   // 0x06C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C5[0x3];                                      // 0x06C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_2;             // 0x06C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetHandleCorrectionGrade_OutStackLevel_3; // 0x06CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELHandleCorrectResultGrade                    CallFunc_GetHandleCorrectionGrade_ReturnValue_3;   // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D1[0x3];                                      // 0x06D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetHandleCorrectionGrade_OutStackLevel_4; // 0x06D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELHandleCorrectResultGrade                    CallFunc_GetHandleCorrectionGrade_ReturnValue_4;   // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D9[0x7];                                      // 0x06D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetHandleCorrectionGradeText_Text_1;      // 0x06E0(0x0018)()
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_3;             // 0x06F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_4;             // 0x06FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0700(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetHandleCorrectionGrade_OutStackLevel_5; // 0x0704(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELHandleCorrectResultGrade                    CallFunc_GetHandleCorrectionGrade_ReturnValue_5;   // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_709[0x7];                                      // 0x0709(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetHandleCorrectionGradeText_Text_2;      // 0x0710(0x0018)()
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_5;             // 0x0728(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x072C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_5;                // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_6;                // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetHaveThrustMotion_ReturnValue;          // 0x0740(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetHaveSwingMotion_ReturnValue;           // 0x0741(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_742[0x2];                                      // 0x0742(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPhysicalSubtypeWithThrustMod_ReturnValue; // 0x0744(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPhysicalSubtypeWithSwingMod_ReturnValue; // 0x0748(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x074C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x074D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x074E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x074F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_7;                // 0x0750(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_8;                // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0761(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0762(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0763(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetWeaponDiff_Diff;                       // 0x0764(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeWeaponStatText_Text;                  // 0x0768(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0781(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0782(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0783(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0784(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_785[0x3];                                      // 0x0785(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRequireFrenzyUnitCount_ReturnValue;    // 0x0788(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x078C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78D[0x3];                                      // 0x078D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0790(0x0018)()
	class FText                                   CallFunc_GetLocalTextSkillNameLocalize_ReturnValue; // 0x07A8(0x0018)()
	int32                                         CallFunc_GetGuardDamageReductionRatio_ReturnValue; // 0x07C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPulseRechargeAttack_ReturnValue;       // 0x07C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x07C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x07CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x07D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWeaponDiff_Diff_1;                     // 0x07D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWeight_ReturnValue;                    // 0x07D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7DC[0x4];                                      // 0x07DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeWeaponStatText_Text_1;                // 0x07E0(0x0018)()
	int32                                         CallFunc_GetMaxSharpnessPoint_ReturnValue;         // 0x07F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7FC[0x4];                                      // 0x07FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULWeaponItem*                           K2Node_DynamicCast_AsLWeapon_Item;                 // 0x0800(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0808(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_809[0x3];                                      // 0x0809(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMaxSharpnessPoint_ReturnValue_1;       // 0x080C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentSharpnessPoint_ReturnValue;     // 0x0810(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_4;            // 0x0814(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeValueText_Text;                       // 0x0818(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0830(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeValueText_Text_1;                     // 0x0840(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0858(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0868(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0878(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0888(0x0018)()
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_9;                // 0x08A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRequireFrenzyUnitCount_ReturnValue_1;  // 0x08A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8AC[0x4];                                      // 0x08AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x08B0(0x0018)()
	class FText                                   CallFunc_GetLocalTextSkillNameLocalize_ReturnValue_1; // 0x08C8(0x0018)()
	class FText                                   CallFunc_GetLocalTextItemNameLocalize_ReturnValue; // 0x08E0(0x0018)()
	class FText                                   CallFunc_GetLocalTextItemNameLocalize_ReturnValue_1; // 0x08F8(0x0018)()
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_10;               // 0x0910(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_11;               // 0x0918(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_12;               // 0x0920(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0928(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0930(0x0018)(ConstParm)
	int32                                         CallFunc_GetWeaponDiff_Diff_2;                     // 0x0948(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94C[0x4];                                      // 0x094C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeWeaponStatText_Text_2;                // 0x0950(0x0018)()
	int32                                         CallFunc_GetWeight_ReturnValue_1;                  // 0x0968(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHeroicWeapon_ReturnValue_2;             // 0x096C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_96D[0x3];                                      // 0x096D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeValueText_Text_2;                     // 0x0970(0x0018)()
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_5;            // 0x0988(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98C[0x4];                                      // 0x098C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0990(0x0018)()
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_13;               // 0x09A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_14;               // 0x09B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPulseRechargePointMax_ReturnValue_1;   // 0x09B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x09BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPulseRechargeAttack_ReturnValue_1;     // 0x09C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x09C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x09C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x09CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x09D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x09D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_2;          // 0x09D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x09DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x09E0(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x09F8(0x0018)(ConstParm)
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_15;               // 0x0A10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetGuardDamageReductionRatio_ReturnValue_1; // 0x0A18(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_6;            // 0x0A1C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeValueText_Text_3;                     // 0x0A20(0x0018)()
	class FName                                   Temp_name_Variable_1;                              // 0x0A38(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x0A40(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A44[0x4];                                      // 0x0A44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_16;               // 0x0A48(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_17;               // 0x0A50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELElementDamageType                           CallFunc_GetElementAttackType_ReturnValue;         // 0x0A58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A59[0x3];                                      // 0x0A59(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_6;                  // 0x0A5C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0A60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A61[0x3];                                      // 0x0A61(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_7;                  // 0x0A64(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0A68(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_18;               // 0x0A70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0A78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A79[0x7];                                      // 0x0A79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULWeaponItem*                           K2Node_DynamicCast_AsLWeapon_Item_1;               // 0x0A80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0A88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo) == 0x000008, "Wrong alignment on UIW_ItemInfo_Compare_C_RefreshWeaponInfo");
static_assert(sizeof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo) == 0x000A90, "Wrong size on UIW_ItemInfo_Compare_C_RefreshWeaponInfo");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, LocalSkillInfo) == 0x000000, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::LocalSkillInfo' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, LocalName) == 0x000008, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::LocalName' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, LocalDiff) == 0x000010, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::LocalDiff' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, LocalCompareHandleInfo) == 0x000018, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::LocalCompareHandleInfo' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, LocalCompareBladeInfo) == 0x000020, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::LocalCompareBladeInfo' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, LocalCompareItem) == 0x000028, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::LocalCompareItem' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, LocalTexture2D) == 0x000030, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::LocalTexture2D' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, LocalStyleType) == 0x000038, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::LocalStyleType' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, LocalSecondStat) == 0x000088, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::LocalSecondStat' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, LocalChaUpPreviewStat) == 0x000090, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::LocalChaUpPreviewStat' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, LocalHasReinforceData) == 0x0000A0, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::LocalHasReinforceData' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, LocalHandleInfo) == 0x0000A8, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::LocalHandleInfo' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, LocalHandleCommonInfo) == 0x0000B0, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::LocalHandleCommonInfo' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, LocalBladeInfo) == 0x0000B8, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::LocalBladeInfo' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, LocalBladeCommonInfo) == 0x0000C0, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::LocalBladeCommonInfo' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, LocalOneStatList) == 0x0000C8, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::LocalOneStatList' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, LocalLWeaponItem) == 0x0000D8, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::LocalLWeaponItem' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000E0, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, Temp_bool_Variable) == 0x0000E1, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, K2Node_MakeVariable_MakeVariableOutput) == 0x0000E8, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::K2Node_MakeVariable_MakeVariableOutput' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_GetHandleInfo_ReturnValue) == 0x000138, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_GetHandleInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_GetBladeInfo_ReturnValue) == 0x000140, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_GetBladeInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_GetHandleCommonInfo_ReturnValue) == 0x000148, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_GetHandleCommonInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_GetBladeCommonInfo_ReturnValue) == 0x000150, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_GetBladeCommonInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_GetHandleImageResource_ReturnValue) == 0x000158, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_GetHandleImageResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_GetBladeImageResource_ReturnValue) == 0x000180, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_GetBladeImageResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_GetHandleImageResource_ReturnValue_1) == 0x0001A8, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_GetHandleImageResource_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_GetBladeImageResource_ReturnValue_1) == 0x0001D0, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_GetBladeImageResource_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_GetPulseRechargePointMax_ReturnValue) == 0x0001F8, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_GetPulseRechargePointMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_IsHeroicWeapon_ReturnValue) == 0x0001FC, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_IsHeroicWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000200, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_K2_SetTimer_ReturnValue) == 0x000208, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_GetEmptyText_ReturnValue) == 0x000210, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_GetHandleInfo_ReturnValue_1) == 0x000228, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_GetHandleInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_GetBladeInfo_ReturnValue_1) == 0x000230, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_GetBladeInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_GetEmptyText_ReturnValue_1) == 0x000238, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_GetEmptyText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_GetLocalTextTooltip2Localize_ReturnValue) == 0x000250, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_GetLocalTextTooltip2Localize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_GetLocalTextTooltip1Localize_ReturnValue) == 0x000268, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_GetLocalTextTooltip1Localize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000280, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_EqualEqual_TextText_ReturnValue_1) == 0x000281, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_EqualEqual_TextText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_GetEmptyText_ReturnValue_2) == 0x000288, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_GetEmptyText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_GetEmptyText_ReturnValue_3) == 0x0002A0, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_GetEmptyText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_GetLocalTextTooltip2Localize_ReturnValue_1) == 0x0002B8, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_GetLocalTextTooltip2Localize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_GetLocalTextTooltip1Localize_ReturnValue_1) == 0x0002D0, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_GetLocalTextTooltip1Localize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_EqualEqual_TextText_ReturnValue_2) == 0x0002E8, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_EqualEqual_TextText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_EqualEqual_TextText_ReturnValue_3) == 0x0002E9, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_EqualEqual_TextText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_GetGameStrWithName_ReturnValue) == 0x0002F0, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_GetRawWeaponStat_ReturnValue) == 0x000308, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_GetRawWeaponStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ItemInfo_Compare_C_RefreshWeaponInfo, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00030C, "Member 'UIW_ItemInfo_Compare_C_RefreshWeaponInfo::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
