#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Module_CostGain

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UIW_Popup_Module_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Module_CostGain.UIW_Module_CostGain_C
// 0x0028 (0x02D8 - 0x02B0)
class UUIW_Module_CostGain_C final : public UUIW_Popup_Module_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UListView*                              List_Cost;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListView*                              List_Gain;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Cost;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Txt_Gain;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_Module_CostGain(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Module_CostGain_C">();
	}
	static class UUIW_Module_CostGain_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Module_CostGain_C>();
	}
};
static_assert(alignof(UUIW_Module_CostGain_C) == 0x000008, "Wrong alignment on UUIW_Module_CostGain_C");
static_assert(sizeof(UUIW_Module_CostGain_C) == 0x0002D8, "Wrong size on UUIW_Module_CostGain_C");
static_assert(offsetof(UUIW_Module_CostGain_C, UberGraphFrame) == 0x0002B0, "Member 'UUIW_Module_CostGain_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_Module_CostGain_C, List_Cost) == 0x0002B8, "Member 'UUIW_Module_CostGain_C::List_Cost' has a wrong offset!");
static_assert(offsetof(UUIW_Module_CostGain_C, List_Gain) == 0x0002C0, "Member 'UUIW_Module_CostGain_C::List_Gain' has a wrong offset!");
static_assert(offsetof(UUIW_Module_CostGain_C, Txt_Cost) == 0x0002C8, "Member 'UUIW_Module_CostGain_C::Txt_Cost' has a wrong offset!");
static_assert(offsetof(UUIW_Module_CostGain_C, Txt_Gain) == 0x0002D0, "Member 'UUIW_Module_CostGain_C::Txt_Gain' has a wrong offset!");

}

