#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_EndingCredit_Module

#include "Basic.hpp"

#include "ProjectP_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_EndingCredit_Module.UIW_EndingCredit_Module_C
// 0x0050 (0x02F8 - 0x02A8)
class UUIW_EndingCredit_Module_C final : public ULWidget
{
public:
	class FString                                 Data_0;                                            // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 Data_1;                                            // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 Data_2;                                            // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 Data_3;                                            // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 Data_4;                                            // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_EndingCredit_Module_C">();
	}
	static class UUIW_EndingCredit_Module_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_EndingCredit_Module_C>();
	}
};
static_assert(alignof(UUIW_EndingCredit_Module_C) == 0x000008, "Wrong alignment on UUIW_EndingCredit_Module_C");
static_assert(sizeof(UUIW_EndingCredit_Module_C) == 0x0002F8, "Wrong size on UUIW_EndingCredit_Module_C");
static_assert(offsetof(UUIW_EndingCredit_Module_C, Data_0) == 0x0002A8, "Member 'UUIW_EndingCredit_Module_C::Data_0' has a wrong offset!");
static_assert(offsetof(UUIW_EndingCredit_Module_C, Data_1) == 0x0002B8, "Member 'UUIW_EndingCredit_Module_C::Data_1' has a wrong offset!");
static_assert(offsetof(UUIW_EndingCredit_Module_C, Data_2) == 0x0002C8, "Member 'UUIW_EndingCredit_Module_C::Data_2' has a wrong offset!");
static_assert(offsetof(UUIW_EndingCredit_Module_C, Data_3) == 0x0002D8, "Member 'UUIW_EndingCredit_Module_C::Data_3' has a wrong offset!");
static_assert(offsetof(UUIW_EndingCredit_Module_C, Data_4) == 0x0002E8, "Member 'UUIW_EndingCredit_Module_C::Data_4' has a wrong offset!");

}

