#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_LetterPreview

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"
#include "UIEN_PreviewType_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_LetterPreview.UIW_LetterPreview_C
// 0x0070 (0x0318 - 0x02A8)
class UUIW_LetterPreview_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUIW_Btn_Key_C*                         Btn;                                               // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Title;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsOpenedMenu;                                      // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsOpenedWindow;                                    // 0x02D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D2[0x6];                                      // 0x02D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 LItem;                                             // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUIBP_PreviewQueue_C*>           PreviewQueue;                                      // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsShowPreview;                                     // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_PreviewQueue_C*                   CurrentQueueData;                                  // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHUDShow;                                         // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RemainHideTime;                                    // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHideTimeActivated;                               // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   PreviewAction;                                     // 0x030C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_LetterPreview(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__Btn_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature(class UUIW_Btn_Key_C* BtnKey);
	void Destruct();
	void Construct();
	void ShowGetItemCollectionPreview(class ULItem* LItem_0, int32 Count);
	void ShowGetItemSpecialPreview(class ULItem* LItem_0, int32 Count);
	void ShowPromoteDLC();
	void RefreshVisible();
	void VisibleMenu(bool IsOpened, bool NeedCenterMouse);
	void VisibleWindow(bool IsOpened);
	void CompleteTween(class FName CategoryName);
	void SetView(class ULItem* Item, const class FText& Title, const class FText& Description);
	void ShowPreview();
	void HidePreview(bool NeedTween);
	void EnqueuePreview(class ULItem* Item, const class FText& Title, const class FText& Description, EUIEN_PreviewType PreviewType);
	void DequeuePreview(bool* IsShow);
	void ClearQueue();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void SetHUDVisible(bool IsShow);
	void ListenPreviewAction();
	void HideNow(class FName CollectionName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_LetterPreview_C">();
	}
	static class UUIW_LetterPreview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_LetterPreview_C>();
	}
};
static_assert(alignof(UUIW_LetterPreview_C) == 0x000008, "Wrong alignment on UUIW_LetterPreview_C");
static_assert(sizeof(UUIW_LetterPreview_C) == 0x000318, "Wrong size on UUIW_LetterPreview_C");
static_assert(offsetof(UUIW_LetterPreview_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_LetterPreview_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_LetterPreview_C, Btn) == 0x0002B0, "Member 'UUIW_LetterPreview_C::Btn' has a wrong offset!");
static_assert(offsetof(UUIW_LetterPreview_C, Icon) == 0x0002B8, "Member 'UUIW_LetterPreview_C::Icon' has a wrong offset!");
static_assert(offsetof(UUIW_LetterPreview_C, Text) == 0x0002C0, "Member 'UUIW_LetterPreview_C::Text' has a wrong offset!");
static_assert(offsetof(UUIW_LetterPreview_C, Text_Title) == 0x0002C8, "Member 'UUIW_LetterPreview_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UUIW_LetterPreview_C, IsOpenedMenu) == 0x0002D0, "Member 'UUIW_LetterPreview_C::IsOpenedMenu' has a wrong offset!");
static_assert(offsetof(UUIW_LetterPreview_C, IsOpenedWindow) == 0x0002D1, "Member 'UUIW_LetterPreview_C::IsOpenedWindow' has a wrong offset!");
static_assert(offsetof(UUIW_LetterPreview_C, LItem) == 0x0002D8, "Member 'UUIW_LetterPreview_C::LItem' has a wrong offset!");
static_assert(offsetof(UUIW_LetterPreview_C, PreviewQueue) == 0x0002E0, "Member 'UUIW_LetterPreview_C::PreviewQueue' has a wrong offset!");
static_assert(offsetof(UUIW_LetterPreview_C, IsShowPreview) == 0x0002F0, "Member 'UUIW_LetterPreview_C::IsShowPreview' has a wrong offset!");
static_assert(offsetof(UUIW_LetterPreview_C, CurrentQueueData) == 0x0002F8, "Member 'UUIW_LetterPreview_C::CurrentQueueData' has a wrong offset!");
static_assert(offsetof(UUIW_LetterPreview_C, IsHUDShow) == 0x000300, "Member 'UUIW_LetterPreview_C::IsHUDShow' has a wrong offset!");
static_assert(offsetof(UUIW_LetterPreview_C, RemainHideTime) == 0x000304, "Member 'UUIW_LetterPreview_C::RemainHideTime' has a wrong offset!");
static_assert(offsetof(UUIW_LetterPreview_C, IsHideTimeActivated) == 0x000308, "Member 'UUIW_LetterPreview_C::IsHideTimeActivated' has a wrong offset!");
static_assert(offsetof(UUIW_LetterPreview_C, PreviewAction) == 0x00030C, "Member 'UUIW_LetterPreview_C::PreviewAction' has a wrong offset!");

}

