#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ComboBox_Item

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_ComboBox_Item.UIW_ComboBox_Item_C
// 0x0028 (0x0290 - 0x0268)
class UUIW_ComboBox_Item_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUIW_Fx_Listbar_C*                      Selected_L;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListView*                              OwnerListView;                                     // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UIW_ComboBox_Item(int32 EntryPoint);
	void BP_OnEntryReleased();
	void Construct();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void Destruct();
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void SetMoveFocusEffect();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void SetTextColor();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_ComboBox_Item_C">();
	}
	static class UUIW_ComboBox_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_ComboBox_Item_C>();
	}
};
static_assert(alignof(UUIW_ComboBox_Item_C) == 0x000008, "Wrong alignment on UUIW_ComboBox_Item_C");
static_assert(sizeof(UUIW_ComboBox_Item_C) == 0x000290, "Wrong size on UUIW_ComboBox_Item_C");
static_assert(offsetof(UUIW_ComboBox_Item_C, UberGraphFrame) == 0x000268, "Member 'UUIW_ComboBox_Item_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_ComboBox_Item_C, Selected_L) == 0x000270, "Member 'UUIW_ComboBox_Item_C::Selected_L' has a wrong offset!");
static_assert(offsetof(UUIW_ComboBox_Item_C, Text) == 0x000278, "Member 'UUIW_ComboBox_Item_C::Text' has a wrong offset!");
static_assert(offsetof(UUIW_ComboBox_Item_C, OwnerListView) == 0x000280, "Member 'UUIW_ComboBox_Item_C::OwnerListView' has a wrong offset!");
static_assert(offsetof(UUIW_ComboBox_Item_C, IsSelected) == 0x000288, "Member 'UUIW_ComboBox_Item_C::IsSelected' has a wrong offset!");

}

