#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Page_Indicator_Item

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Page_Indicator_Item.UIW_Page_Indicator_Item_C
// 0x0028 (0x0290 - 0x0268)
class UUIW_Page_Indicator_Item_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_On;                                            // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Img_On;                                            // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Sketch;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_UIW_Page_Indicator_Item(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Page_Indicator_Item_C">();
	}
	static class UUIW_Page_Indicator_Item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Page_Indicator_Item_C>();
	}
};
static_assert(alignof(UUIW_Page_Indicator_Item_C) == 0x000008, "Wrong alignment on UUIW_Page_Indicator_Item_C");
static_assert(sizeof(UUIW_Page_Indicator_Item_C) == 0x000290, "Wrong size on UUIW_Page_Indicator_Item_C");
static_assert(offsetof(UUIW_Page_Indicator_Item_C, UberGraphFrame) == 0x000268, "Member 'UUIW_Page_Indicator_Item_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_Page_Indicator_Item_C, Ani_On) == 0x000270, "Member 'UUIW_Page_Indicator_Item_C::Ani_On' has a wrong offset!");
static_assert(offsetof(UUIW_Page_Indicator_Item_C, Img_On) == 0x000278, "Member 'UUIW_Page_Indicator_Item_C::Img_On' has a wrong offset!");
static_assert(offsetof(UUIW_Page_Indicator_Item_C, Img_Sketch) == 0x000280, "Member 'UUIW_Page_Indicator_Item_C::Img_Sketch' has a wrong offset!");
static_assert(offsetof(UUIW_Page_Indicator_Item_C, IsSelected) == 0x000288, "Member 'UUIW_Page_Indicator_Item_C::IsSelected' has a wrong offset!");

}

