#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Btn_Arrow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UIEN_Direction_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Btn_Arrow.UIW_Btn_Arrow_C
// 0x0030 (0x0298 - 0x0268)
class UUIW_Btn_Arrow_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Btn;                                               // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Arrow;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EUIEN_Direction                               ArrowDirection;                                    // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                ArrowPadding;                                      // 0x0284(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_UIW_Btn_Arrow(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__H_Btn_Prev_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__H_Btn_Prev_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void SetArrowDirection(EUIEN_Direction Direction);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Btn_Arrow_C">();
	}
	static class UUIW_Btn_Arrow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Btn_Arrow_C>();
	}
};
static_assert(alignof(UUIW_Btn_Arrow_C) == 0x000008, "Wrong alignment on UUIW_Btn_Arrow_C");
static_assert(sizeof(UUIW_Btn_Arrow_C) == 0x000298, "Wrong size on UUIW_Btn_Arrow_C");
static_assert(offsetof(UUIW_Btn_Arrow_C, UberGraphFrame) == 0x000268, "Member 'UUIW_Btn_Arrow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_Btn_Arrow_C, Btn) == 0x000270, "Member 'UUIW_Btn_Arrow_C::Btn' has a wrong offset!");
static_assert(offsetof(UUIW_Btn_Arrow_C, Img_Arrow) == 0x000278, "Member 'UUIW_Btn_Arrow_C::Img_Arrow' has a wrong offset!");
static_assert(offsetof(UUIW_Btn_Arrow_C, ArrowDirection) == 0x000280, "Member 'UUIW_Btn_Arrow_C::ArrowDirection' has a wrong offset!");
static_assert(offsetof(UUIW_Btn_Arrow_C, ArrowPadding) == 0x000284, "Member 'UUIW_Btn_Arrow_C::ArrowPadding' has a wrong offset!");

}

