#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Module_ItemList

#include "Basic.hpp"


namespace SDK::Params
{

// Function UIW_Module_ItemList.UIW_Module_ItemList_C.ExecuteUbergraph_UIW_Module_ItemList
// 0x0018 (0x0018 - 0x0000)
struct UIW_Module_ItemList_C_ExecuteUbergraph_UIW_Module_ItemList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUIW_Module_Item_C*>             K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(UIW_Module_ItemList_C_ExecuteUbergraph_UIW_Module_ItemList) == 0x000008, "Wrong alignment on UIW_Module_ItemList_C_ExecuteUbergraph_UIW_Module_ItemList");
static_assert(sizeof(UIW_Module_ItemList_C_ExecuteUbergraph_UIW_Module_ItemList) == 0x000018, "Wrong size on UIW_Module_ItemList_C_ExecuteUbergraph_UIW_Module_ItemList");
static_assert(offsetof(UIW_Module_ItemList_C_ExecuteUbergraph_UIW_Module_ItemList, EntryPoint) == 0x000000, "Member 'UIW_Module_ItemList_C_ExecuteUbergraph_UIW_Module_ItemList::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_Module_ItemList_C_ExecuteUbergraph_UIW_Module_ItemList, K2Node_MakeArray_Array) == 0x000008, "Member 'UIW_Module_ItemList_C_ExecuteUbergraph_UIW_Module_ItemList::K2Node_MakeArray_Array' has a wrong offset!");

// Function UIW_Module_ItemList.UIW_Module_ItemList_C.SetListItem
// 0x0048 (0x0048 - 0x0000)
struct UIW_Module_ItemList_C_SetListItem final
{
public:
	TArray<class ULItem*>                         DataArr;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         LocalItemCount;                                    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Module_Item_C*                     CallFunc_Array_Get_Item_1;                         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Module_ItemList_C_SetListItem) == 0x000008, "Wrong alignment on UIW_Module_ItemList_C_SetListItem");
static_assert(sizeof(UIW_Module_ItemList_C_SetListItem) == 0x000048, "Wrong size on UIW_Module_ItemList_C_SetListItem");
static_assert(offsetof(UIW_Module_ItemList_C_SetListItem, DataArr) == 0x000000, "Member 'UIW_Module_ItemList_C_SetListItem::DataArr' has a wrong offset!");
static_assert(offsetof(UIW_Module_ItemList_C_SetListItem, LocalItemCount) == 0x000010, "Member 'UIW_Module_ItemList_C_SetListItem::LocalItemCount' has a wrong offset!");
static_assert(offsetof(UIW_Module_ItemList_C_SetListItem, Temp_int_Array_Index_Variable) == 0x000014, "Member 'UIW_Module_ItemList_C_SetListItem::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Module_ItemList_C_SetListItem, CallFunc_Array_Get_Item) == 0x000018, "Member 'UIW_Module_ItemList_C_SetListItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_Module_ItemList_C_SetListItem, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000020, "Member 'UIW_Module_ItemList_C_SetListItem::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_ItemList_C_SetListItem, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'UIW_Module_ItemList_C_SetListItem::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Module_ItemList_C_SetListItem, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'UIW_Module_ItemList_C_SetListItem::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_ItemList_C_SetListItem, CallFunc_Add_IntInt_ReturnValue_1) == 0x00002C, "Member 'UIW_Module_ItemList_C_SetListItem::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Module_ItemList_C_SetListItem, Temp_int_Variable) == 0x000030, "Member 'UIW_Module_ItemList_C_SetListItem::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Module_ItemList_C_SetListItem, CallFunc_Greater_IntInt_ReturnValue) == 0x000034, "Member 'UIW_Module_ItemList_C_SetListItem::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_ItemList_C_SetListItem, CallFunc_Array_Get_Item_1) == 0x000038, "Member 'UIW_Module_ItemList_C_SetListItem::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UIW_Module_ItemList_C_SetListItem, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'UIW_Module_ItemList_C_SetListItem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_ItemList_C_SetListItem, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'UIW_Module_ItemList_C_SetListItem::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

