#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ComboBox

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_ComboBox.UIW_ComboBox_C
// 0x0088 (0x0330 - 0x02A8)
class UUIW_ComboBox_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUIW_Btn_Arrow_C*                       Arrow;                                             // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Btn;                                               // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Group_SizeBox;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Fx_Listbar_C*                      Selected;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnSelectionChanged;                                // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsOpened;                                          // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectedIndex;                                     // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShowItemCount;                                     // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           OptionList;                                        // 0x02F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UUIW_ComboBox_List_C*                   ComboBoxList;                                      // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedGlobalFont;                                    // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnOpenAndClose;                                    // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FName                                   NameForCheck;                                      // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void OnSelectionChanged__DelegateSignature(int32 Index_0);
	void OnOpenAndClose__DelegateSignature(bool IsOpen, class UUIW_ComboBox_C* ComboBox);
	void ExecuteUbergraph_UIW_ComboBox(int32 EntryPoint);
	void BndEvt__UIW_ComboBox_Btn_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UIW_ComboBox_Btn_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Btn_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void SetStringOptions(TArray<class FString>& Options);
	void SetTextOptions(TArray<class FText>& Options);
	void GetSelectedIndex(int32* Index_0);
	void SetSelectedIndex(int32 Index_0);
	void CallbackComboBox(int32 Index_0);
	void Open();
	void Close();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_ComboBox_C">();
	}
	static class UUIW_ComboBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_ComboBox_C>();
	}
};
static_assert(alignof(UUIW_ComboBox_C) == 0x000008, "Wrong alignment on UUIW_ComboBox_C");
static_assert(sizeof(UUIW_ComboBox_C) == 0x000330, "Wrong size on UUIW_ComboBox_C");
static_assert(offsetof(UUIW_ComboBox_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_ComboBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_ComboBox_C, Arrow) == 0x0002B0, "Member 'UUIW_ComboBox_C::Arrow' has a wrong offset!");
static_assert(offsetof(UUIW_ComboBox_C, Btn) == 0x0002B8, "Member 'UUIW_ComboBox_C::Btn' has a wrong offset!");
static_assert(offsetof(UUIW_ComboBox_C, Group_SizeBox) == 0x0002C0, "Member 'UUIW_ComboBox_C::Group_SizeBox' has a wrong offset!");
static_assert(offsetof(UUIW_ComboBox_C, Selected) == 0x0002C8, "Member 'UUIW_ComboBox_C::Selected' has a wrong offset!");
static_assert(offsetof(UUIW_ComboBox_C, Text) == 0x0002D0, "Member 'UUIW_ComboBox_C::Text' has a wrong offset!");
static_assert(offsetof(UUIW_ComboBox_C, OnSelectionChanged) == 0x0002D8, "Member 'UUIW_ComboBox_C::OnSelectionChanged' has a wrong offset!");
static_assert(offsetof(UUIW_ComboBox_C, IsOpened) == 0x0002E8, "Member 'UUIW_ComboBox_C::IsOpened' has a wrong offset!");
static_assert(offsetof(UUIW_ComboBox_C, SelectedIndex) == 0x0002EC, "Member 'UUIW_ComboBox_C::SelectedIndex' has a wrong offset!");
static_assert(offsetof(UUIW_ComboBox_C, ShowItemCount) == 0x0002F0, "Member 'UUIW_ComboBox_C::ShowItemCount' has a wrong offset!");
static_assert(offsetof(UUIW_ComboBox_C, OptionList) == 0x0002F8, "Member 'UUIW_ComboBox_C::OptionList' has a wrong offset!");
static_assert(offsetof(UUIW_ComboBox_C, ComboBoxList) == 0x000308, "Member 'UUIW_ComboBox_C::ComboBoxList' has a wrong offset!");
static_assert(offsetof(UUIW_ComboBox_C, NeedGlobalFont) == 0x000310, "Member 'UUIW_ComboBox_C::NeedGlobalFont' has a wrong offset!");
static_assert(offsetof(UUIW_ComboBox_C, OnOpenAndClose) == 0x000318, "Member 'UUIW_ComboBox_C::OnOpenAndClose' has a wrong offset!");
static_assert(offsetof(UUIW_ComboBox_C, NameForCheck) == 0x000328, "Member 'UUIW_ComboBox_C::NameForCheck' has a wrong offset!");

}

