#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ListItem_Weapon

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UIW_ListItem_Weapon.UIW_ListItem_Weapon_C.ExecuteUbergraph_UIW_ListItem_Weapon
// 0x01A0 (0x01A0 - 0x0000)
struct UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_ListObject;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_Weapon_C*                K2Node_DynamicCast_AsUIBP_List_Data_Weapon;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x001C(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0058(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00C8(0x0070)(ConstParm)
	class UListViewBase*                          CallFunc_GetOwningListView_ReturnValue;            // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UListView*                              K2Node_DynamicCast_AsList_View;                    // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15A[0x2];                                      // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetReinforceLevel_ReturnValue;            // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0188(0x0018)()
};
static_assert(alignof(UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon) == 0x000008, "Wrong alignment on UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon");
static_assert(sizeof(UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon) == 0x0001A0, "Wrong size on UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon");
static_assert(offsetof(UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon, EntryPoint) == 0x000000, "Member 'UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon, K2Node_CustomEvent_ListObject) == 0x000008, "Member 'UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon::K2Node_CustomEvent_ListObject' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon, K2Node_DynamicCast_AsUIBP_List_Data_Weapon) == 0x000010, "Member 'UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon::K2Node_DynamicCast_AsUIBP_List_Data_Weapon' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon, K2Node_Event_MyGeometry) == 0x00001C, "Member 'UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon, K2Node_Event_MouseEvent_1) == 0x000058, "Member 'UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon, K2Node_Event_MouseEvent) == 0x0000C8, "Member 'UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon, CallFunc_GetOwningListView_ReturnValue) == 0x000138, "Member 'UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon::CallFunc_GetOwningListView_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon, K2Node_DynamicCast_AsList_View) == 0x000140, "Member 'UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon::K2Node_DynamicCast_AsList_View' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon, K2Node_DynamicCast_bSuccess_1) == 0x000148, "Member 'UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon, K2Node_Event_bIsSelected) == 0x000149, "Member 'UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon, K2Node_Event_ListItemObject) == 0x000150, "Member 'UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon, K2Node_Event_bIsExpanded) == 0x000158, "Member 'UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon, CallFunc_IsValid_ReturnValue) == 0x000159, "Member 'UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon, CallFunc_GetReinforceLevel_ReturnValue) == 0x00015C, "Member 'UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon::CallFunc_GetReinforceLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon, CallFunc_Conv_IntToString_ReturnValue) == 0x000160, "Member 'UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon, CallFunc_Greater_IntInt_ReturnValue) == 0x000170, "Member 'UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon, CallFunc_Concat_StrStr_ReturnValue) == 0x000178, "Member 'UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon, CallFunc_Conv_StringToText_ReturnValue) == 0x000188, "Member 'UIW_ListItem_Weapon_C_ExecuteUbergraph_UIW_ListItem_Weapon::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function UIW_ListItem_Weapon.UIW_ListItem_Weapon_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct UIW_ListItem_Weapon_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIW_ListItem_Weapon_C_OnMouseLeave) == 0x000008, "Wrong alignment on UIW_ListItem_Weapon_C_OnMouseLeave");
static_assert(sizeof(UIW_ListItem_Weapon_C_OnMouseLeave) == 0x000070, "Wrong size on UIW_ListItem_Weapon_C_OnMouseLeave");
static_assert(offsetof(UIW_ListItem_Weapon_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'UIW_ListItem_Weapon_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function UIW_ListItem_Weapon.UIW_ListItem_Weapon_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct UIW_ListItem_Weapon_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIW_ListItem_Weapon_C_OnMouseEnter) == 0x000008, "Wrong alignment on UIW_ListItem_Weapon_C_OnMouseEnter");
static_assert(sizeof(UIW_ListItem_Weapon_C_OnMouseEnter) == 0x0000A8, "Wrong size on UIW_ListItem_Weapon_C_OnMouseEnter");
static_assert(offsetof(UIW_ListItem_Weapon_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'UIW_ListItem_Weapon_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'UIW_ListItem_Weapon_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function UIW_ListItem_Weapon.UIW_ListItem_Weapon_C.Set Item
// 0x0008 (0x0008 - 0x0000)
struct UIW_ListItem_Weapon_C_Set_Item final
{
public:
	class UObject*                                ListObject;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ListItem_Weapon_C_Set_Item) == 0x000008, "Wrong alignment on UIW_ListItem_Weapon_C_Set_Item");
static_assert(sizeof(UIW_ListItem_Weapon_C_Set_Item) == 0x000008, "Wrong size on UIW_ListItem_Weapon_C_Set_Item");
static_assert(offsetof(UIW_ListItem_Weapon_C_Set_Item, ListObject) == 0x000000, "Member 'UIW_ListItem_Weapon_C_Set_Item::ListObject' has a wrong offset!");

// Function UIW_ListItem_Weapon.UIW_ListItem_Weapon_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_ListItem_Weapon_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Weapon_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on UIW_ListItem_Weapon_C_BP_OnItemSelectionChanged");
static_assert(sizeof(UIW_ListItem_Weapon_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on UIW_ListItem_Weapon_C_BP_OnItemSelectionChanged");
static_assert(offsetof(UIW_ListItem_Weapon_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'UIW_ListItem_Weapon_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function UIW_ListItem_Weapon.UIW_ListItem_Weapon_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct UIW_ListItem_Weapon_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ListItem_Weapon_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on UIW_ListItem_Weapon_C_OnListItemObjectSet");
static_assert(sizeof(UIW_ListItem_Weapon_C_OnListItemObjectSet) == 0x000008, "Wrong size on UIW_ListItem_Weapon_C_OnListItemObjectSet");
static_assert(offsetof(UIW_ListItem_Weapon_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'UIW_ListItem_Weapon_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function UIW_ListItem_Weapon.UIW_ListItem_Weapon_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_ListItem_Weapon_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Weapon_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on UIW_ListItem_Weapon_C_BP_OnItemExpansionChanged");
static_assert(sizeof(UIW_ListItem_Weapon_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on UIW_ListItem_Weapon_C_BP_OnItemExpansionChanged");
static_assert(offsetof(UIW_ListItem_Weapon_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'UIW_ListItem_Weapon_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function UIW_ListItem_Weapon.UIW_ListItem_Weapon_C.OnMouseButtonDown
// 0x0240 (0x0240 - 0x0000)
struct UIW_ListItem_Weapon_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0160(0x0018)(HasGetValueTypeHash)
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0188(0x00B8)()
};
static_assert(alignof(UIW_ListItem_Weapon_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on UIW_ListItem_Weapon_C_OnMouseButtonDown");
static_assert(sizeof(UIW_ListItem_Weapon_C_OnMouseButtonDown) == 0x000240, "Wrong size on UIW_ListItem_Weapon_C_OnMouseButtonDown");
static_assert(offsetof(UIW_ListItem_Weapon_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'UIW_ListItem_Weapon_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'UIW_ListItem_Weapon_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'UIW_ListItem_Weapon_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_OnMouseButtonDown, CallFunc_PointerEvent_GetEffectingButton_ReturnValue) == 0x000160, "Member 'UIW_ListItem_Weapon_C_OnMouseButtonDown::CallFunc_PointerEvent_GetEffectingButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_OnMouseButtonDown, CallFunc_GetListItemObject_ReturnValue) == 0x000178, "Member 'UIW_ListItem_Weapon_C_OnMouseButtonDown::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_OnMouseButtonDown, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000180, "Member 'UIW_ListItem_Weapon_C_OnMouseButtonDown::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_OnMouseButtonDown, K2Node_MakeStruct_EventReply) == 0x000188, "Member 'UIW_ListItem_Weapon_C_OnMouseButtonDown::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function UIW_ListItem_Weapon.UIW_ListItem_Weapon_C.OnFocusReceived
// 0x01E8 (0x01E8 - 0x0000)
struct UIW_ListItem_Weapon_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	class UObject*                                CallFunc_GetListItemObject_ReturnValue;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_Weapon_C*                K2Node_DynamicCast_AsUIBP_List_Data_Weapon;        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x0114(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_PixelPosition;            // 0x011C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_ViewportPosition;         // 0x0124(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0130(0x00B8)()
};
static_assert(alignof(UIW_ListItem_Weapon_C_OnFocusReceived) == 0x000008, "Wrong alignment on UIW_ListItem_Weapon_C_OnFocusReceived");
static_assert(sizeof(UIW_ListItem_Weapon_C_OnFocusReceived) == 0x0001E8, "Wrong size on UIW_ListItem_Weapon_C_OnFocusReceived");
static_assert(offsetof(UIW_ListItem_Weapon_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UIW_ListItem_Weapon_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UIW_ListItem_Weapon_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UIW_ListItem_Weapon_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_OnFocusReceived, CallFunc_GetListItemObject_ReturnValue) == 0x0000F8, "Member 'UIW_ListItem_Weapon_C_OnFocusReceived::CallFunc_GetListItemObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_OnFocusReceived, CallFunc_GetLocalSize_ReturnValue) == 0x000100, "Member 'UIW_ListItem_Weapon_C_OnFocusReceived::CallFunc_GetLocalSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_OnFocusReceived, K2Node_DynamicCast_AsUIBP_List_Data_Weapon) == 0x000108, "Member 'UIW_ListItem_Weapon_C_OnFocusReceived::K2Node_DynamicCast_AsUIBP_List_Data_Weapon' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_OnFocusReceived, K2Node_DynamicCast_bSuccess) == 0x000110, "Member 'UIW_ListItem_Weapon_C_OnFocusReceived::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_OnFocusReceived, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x000114, "Member 'UIW_ListItem_Weapon_C_OnFocusReceived::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_OnFocusReceived, CallFunc_LocalToViewport_PixelPosition) == 0x00011C, "Member 'UIW_ListItem_Weapon_C_OnFocusReceived::CallFunc_LocalToViewport_PixelPosition' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_OnFocusReceived, CallFunc_LocalToViewport_ViewportPosition) == 0x000124, "Member 'UIW_ListItem_Weapon_C_OnFocusReceived::CallFunc_LocalToViewport_ViewportPosition' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_OnFocusReceived, K2Node_MakeStruct_EventReply) == 0x000130, "Member 'UIW_ListItem_Weapon_C_OnFocusReceived::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function UIW_ListItem_Weapon.UIW_ListItem_Weapon_C.ShowFocus
// 0x0001 (0x0001 - 0x0000)
struct UIW_ListItem_Weapon_C_ShowFocus final
{
public:
	bool                                          IsShow;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Weapon_C_ShowFocus) == 0x000001, "Wrong alignment on UIW_ListItem_Weapon_C_ShowFocus");
static_assert(sizeof(UIW_ListItem_Weapon_C_ShowFocus) == 0x000001, "Wrong size on UIW_ListItem_Weapon_C_ShowFocus");
static_assert(offsetof(UIW_ListItem_Weapon_C_ShowFocus, IsShow) == 0x000000, "Member 'UIW_ListItem_Weapon_C_ShowFocus::IsShow' has a wrong offset!");

// Function UIW_ListItem_Weapon.UIW_ListItem_Weapon_C.SetSlotType
// 0x000C (0x000C - 0x0000)
struct UIW_ListItem_Weapon_C_SetSlotType final
{
public:
	class FName                                   ID;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Weapon_C_SetSlotType) == 0x000004, "Wrong alignment on UIW_ListItem_Weapon_C_SetSlotType");
static_assert(sizeof(UIW_ListItem_Weapon_C_SetSlotType) == 0x00000C, "Wrong size on UIW_ListItem_Weapon_C_SetSlotType");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetSlotType, ID) == 0x000000, "Member 'UIW_ListItem_Weapon_C_SetSlotType::ID' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetSlotType, K2Node_SwitchName_CmpSuccess) == 0x000008, "Member 'UIW_ListItem_Weapon_C_SetSlotType::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function UIW_ListItem_Weapon.UIW_ListItem_Weapon_C.Set Equipped
// 0x0004 (0x0004 - 0x0000)
struct UIW_ListItem_Weapon_C_Set_Equipped final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEquipped_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELEquipSlotType                               CallFunc_GetEquipSlotType_ReturnValue;             // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Weapon_C_Set_Equipped) == 0x000001, "Wrong alignment on UIW_ListItem_Weapon_C_Set_Equipped");
static_assert(sizeof(UIW_ListItem_Weapon_C_Set_Equipped) == 0x000004, "Wrong size on UIW_ListItem_Weapon_C_Set_Equipped");
static_assert(offsetof(UIW_ListItem_Weapon_C_Set_Equipped, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'UIW_ListItem_Weapon_C_Set_Equipped::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_Set_Equipped, CallFunc_IsEquipped_ReturnValue) == 0x000001, "Member 'UIW_ListItem_Weapon_C_Set_Equipped::CallFunc_IsEquipped_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_Set_Equipped, CallFunc_GetEquipSlotType_ReturnValue) == 0x000002, "Member 'UIW_ListItem_Weapon_C_Set_Equipped::CallFunc_GetEquipSlotType_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_Set_Equipped, K2Node_SwitchEnum_CmpSuccess) == 0x000003, "Member 'UIW_ListItem_Weapon_C_Set_Equipped::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function UIW_ListItem_Weapon.UIW_ListItem_Weapon_C.SetImage
// 0x00C0 (0x00C0 - 0x0000)
struct UIW_ListItem_Weapon_C_SetImage final
{
public:
	class UUIBP_ListData_Weapon_C*                WeaponListData;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Weapon_Equip_C*                    K2Node_DynamicCast_AsUIW_Weapon_Equip;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Equipment_C*                       K2Node_DynamicCast_AsUIW_Equipment;                // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UObject>                 CallFunc_GetHeroicImageResource_ReturnValue;       // 0x0030(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsHeroicWeapon_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemCommonInfoPtr                     CallFunc_GetHandleCommonInfo_ReturnValue;          // 0x0060(0x0008)(NoDestructor)
	TSoftObjectPtr<class UObject>                 CallFunc_GetImageResource_ReturnValue;             // 0x0068(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	struct FItemCommonInfoPtr                     CallFunc_GetBladeCommonInfo_ReturnValue;           // 0x0090(0x0008)(NoDestructor)
	TSoftObjectPtr<class UObject>                 CallFunc_GetImageResource_ReturnValue_1;           // 0x0098(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ListItem_Weapon_C_SetImage) == 0x000008, "Wrong alignment on UIW_ListItem_Weapon_C_SetImage");
static_assert(sizeof(UIW_ListItem_Weapon_C_SetImage) == 0x0000C0, "Wrong size on UIW_ListItem_Weapon_C_SetImage");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetImage, WeaponListData) == 0x000000, "Member 'UIW_ListItem_Weapon_C_SetImage::WeaponListData' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetImage, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'UIW_ListItem_Weapon_C_SetImage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetImage, K2Node_DynamicCast_AsUIW_Weapon_Equip) == 0x000010, "Member 'UIW_ListItem_Weapon_C_SetImage::K2Node_DynamicCast_AsUIW_Weapon_Equip' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetImage, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UIW_ListItem_Weapon_C_SetImage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetImage, K2Node_DynamicCast_AsUIW_Equipment) == 0x000020, "Member 'UIW_ListItem_Weapon_C_SetImage::K2Node_DynamicCast_AsUIW_Equipment' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetImage, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'UIW_ListItem_Weapon_C_SetImage::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetImage, CallFunc_GetHeroicImageResource_ReturnValue) == 0x000030, "Member 'UIW_ListItem_Weapon_C_SetImage::CallFunc_GetHeroicImageResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetImage, CallFunc_IsHeroicWeapon_ReturnValue) == 0x000058, "Member 'UIW_ListItem_Weapon_C_SetImage::CallFunc_IsHeroicWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetImage, CallFunc_GetHandleCommonInfo_ReturnValue) == 0x000060, "Member 'UIW_ListItem_Weapon_C_SetImage::CallFunc_GetHandleCommonInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetImage, CallFunc_GetImageResource_ReturnValue) == 0x000068, "Member 'UIW_ListItem_Weapon_C_SetImage::CallFunc_GetImageResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetImage, CallFunc_GetBladeCommonInfo_ReturnValue) == 0x000090, "Member 'UIW_ListItem_Weapon_C_SetImage::CallFunc_GetBladeCommonInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetImage, CallFunc_GetImageResource_ReturnValue_1) == 0x000098, "Member 'UIW_ListItem_Weapon_C_SetImage::CallFunc_GetImageResource_ReturnValue_1' has a wrong offset!");

// Function UIW_ListItem_Weapon.UIW_ListItem_Weapon_C.SetEquipPossible
// 0x0028 (0x0028 - 0x0000)
struct UIW_ListItem_Weapon_C_SetEquipPossible final
{
public:
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Equipment_C*                       K2Node_DynamicCast_AsUIW_Equipment;                // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckCanEquipItem_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Weapon_C_SetEquipPossible) == 0x000008, "Wrong alignment on UIW_ListItem_Weapon_C_SetEquipPossible");
static_assert(sizeof(UIW_ListItem_Weapon_C_SetEquipPossible) == 0x000028, "Wrong size on UIW_ListItem_Weapon_C_SetEquipPossible");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetEquipPossible, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'UIW_ListItem_Weapon_C_SetEquipPossible::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetEquipPossible, CallFunc_GetPlayerEquipment_ReturnValue) == 0x000008, "Member 'UIW_ListItem_Weapon_C_SetEquipPossible::CallFunc_GetPlayerEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetEquipPossible, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'UIW_ListItem_Weapon_C_SetEquipPossible::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetEquipPossible, K2Node_DynamicCast_AsUIW_Equipment) == 0x000018, "Member 'UIW_ListItem_Weapon_C_SetEquipPossible::K2Node_DynamicCast_AsUIW_Equipment' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetEquipPossible, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'UIW_ListItem_Weapon_C_SetEquipPossible::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetEquipPossible, CallFunc_CheckCanEquipItem_ReturnValue) == 0x000021, "Member 'UIW_ListItem_Weapon_C_SetEquipPossible::CallFunc_CheckCanEquipItem_ReturnValue' has a wrong offset!");

// Function UIW_ListItem_Weapon.UIW_ListItem_Weapon_C.SetMoveFocusEffect
// 0x0058 (0x0058 - 0x0000)
struct UIW_ListItem_Weapon_C_SetMoveFocusEffect final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBox*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UListViewBase*                          CallFunc_GetOwningListView_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScrollBox*                             K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTileView*                              K2Node_DynamicCast_AsTile_View;                    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetEntryHeight_ReturnValue;               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_MoveFocusOnList_SelectedWidget;           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ListItem_Weapon_C_SetMoveFocusEffect) == 0x000008, "Wrong alignment on UIW_ListItem_Weapon_C_SetMoveFocusEffect");
static_assert(sizeof(UIW_ListItem_Weapon_C_SetMoveFocusEffect) == 0x000058, "Wrong size on UIW_ListItem_Weapon_C_SetMoveFocusEffect");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetMoveFocusEffect, Temp_bool_Variable) == 0x000000, "Member 'UIW_ListItem_Weapon_C_SetMoveFocusEffect::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetMoveFocusEffect, Temp_object_Variable) == 0x000008, "Member 'UIW_ListItem_Weapon_C_SetMoveFocusEffect::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetMoveFocusEffect, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'UIW_ListItem_Weapon_C_SetMoveFocusEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetMoveFocusEffect, CallFunc_GetMainWidget_MainWidget) == 0x000018, "Member 'UIW_ListItem_Weapon_C_SetMoveFocusEffect::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetMoveFocusEffect, CallFunc_GetOwningListView_ReturnValue) == 0x000020, "Member 'UIW_ListItem_Weapon_C_SetMoveFocusEffect::CallFunc_GetOwningListView_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetMoveFocusEffect, K2Node_Select_Default) == 0x000028, "Member 'UIW_ListItem_Weapon_C_SetMoveFocusEffect::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetMoveFocusEffect, K2Node_DynamicCast_AsTile_View) == 0x000030, "Member 'UIW_ListItem_Weapon_C_SetMoveFocusEffect::K2Node_DynamicCast_AsTile_View' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetMoveFocusEffect, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'UIW_ListItem_Weapon_C_SetMoveFocusEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetMoveFocusEffect, CallFunc_GetEntryHeight_ReturnValue) == 0x00003C, "Member 'UIW_ListItem_Weapon_C_SetMoveFocusEffect::CallFunc_GetEntryHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetMoveFocusEffect, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000040, "Member 'UIW_ListItem_Weapon_C_SetMoveFocusEffect::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetMoveFocusEffect, CallFunc_MakeVector2D_ReturnValue) == 0x000044, "Member 'UIW_ListItem_Weapon_C_SetMoveFocusEffect::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetMoveFocusEffect, CallFunc_MoveFocusOnList_SelectedWidget) == 0x000050, "Member 'UIW_ListItem_Weapon_C_SetMoveFocusEffect::CallFunc_MoveFocusOnList_SelectedWidget' has a wrong offset!");

// Function UIW_ListItem_Weapon.UIW_ListItem_Weapon_C.SetHandleCorrection
// 0x0003 (0x0003 - 0x0000)
struct UIW_ListItem_Weapon_C_SetHandleCorrection final
{
public:
	ELStatCorrectChangeType                       CallFunc_GetChangedCorrectionType_ReturnValue;     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Weapon_C_SetHandleCorrection) == 0x000001, "Wrong alignment on UIW_ListItem_Weapon_C_SetHandleCorrection");
static_assert(sizeof(UIW_ListItem_Weapon_C_SetHandleCorrection) == 0x000003, "Wrong size on UIW_ListItem_Weapon_C_SetHandleCorrection");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetHandleCorrection, CallFunc_GetChangedCorrectionType_ReturnValue) == 0x000000, "Member 'UIW_ListItem_Weapon_C_SetHandleCorrection::CallFunc_GetChangedCorrectionType_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetHandleCorrection, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'UIW_ListItem_Weapon_C_SetHandleCorrection::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetHandleCorrection, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'UIW_ListItem_Weapon_C_SetHandleCorrection::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function UIW_ListItem_Weapon.UIW_ListItem_Weapon_C.SetNew
// 0x0038 (0x0038 - 0x0000)
struct UIW_ListItem_Weapon_C_SetNew final
{
public:
	class UUIW_Equipment_C*                       K2Node_DynamicCast_AsUIW_Equipment;                // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Inventory_C*                       K2Node_DynamicCast_AsUIW_Inventory;                // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerInventory*                      CallFunc_GetPlayerInventory_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNotiItem_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_Weapon_C_SetNew) == 0x000008, "Wrong alignment on UIW_ListItem_Weapon_C_SetNew");
static_assert(sizeof(UIW_ListItem_Weapon_C_SetNew) == 0x000038, "Wrong size on UIW_ListItem_Weapon_C_SetNew");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetNew, K2Node_DynamicCast_AsUIW_Equipment) == 0x000000, "Member 'UIW_ListItem_Weapon_C_SetNew::K2Node_DynamicCast_AsUIW_Equipment' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetNew, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'UIW_ListItem_Weapon_C_SetNew::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetNew, K2Node_DynamicCast_AsUIW_Inventory) == 0x000010, "Member 'UIW_ListItem_Weapon_C_SetNew::K2Node_DynamicCast_AsUIW_Inventory' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetNew, K2Node_DynamicCast_bSuccess_1) == 0x000018, "Member 'UIW_ListItem_Weapon_C_SetNew::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetNew, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'UIW_ListItem_Weapon_C_SetNew::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetNew, CallFunc_GetPlayerInventory_ReturnValue) == 0x000028, "Member 'UIW_ListItem_Weapon_C_SetNew::CallFunc_GetPlayerInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_SetNew, CallFunc_IsNotiItem_ReturnValue) == 0x000030, "Member 'UIW_ListItem_Weapon_C_SetNew::CallFunc_IsNotiItem_ReturnValue' has a wrong offset!");

// Function UIW_ListItem_Weapon.UIW_ListItem_Weapon_C.OnMouseButtonUp
// 0x0258 (0x0258 - 0x0000)
struct UIW_ListItem_Weapon_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0160(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenedWidget_IsOpened;                  // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_IsOpenedWidget_UserWidget;                // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IsOpenedWidget_WidgetArrayIndex;          // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x01A0(0x00B8)()
};
static_assert(alignof(UIW_ListItem_Weapon_C_OnMouseButtonUp) == 0x000008, "Wrong alignment on UIW_ListItem_Weapon_C_OnMouseButtonUp");
static_assert(sizeof(UIW_ListItem_Weapon_C_OnMouseButtonUp) == 0x000258, "Wrong size on UIW_ListItem_Weapon_C_OnMouseButtonUp");
static_assert(offsetof(UIW_ListItem_Weapon_C_OnMouseButtonUp, MyGeometry) == 0x000000, "Member 'UIW_ListItem_Weapon_C_OnMouseButtonUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_OnMouseButtonUp, MouseEvent) == 0x000038, "Member 'UIW_ListItem_Weapon_C_OnMouseButtonUp::MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_Weapon_C_OnMouseButtonUp, ReturnValue) == 0x0000A8, "Member 'UIW_ListItem_Weapon_C_OnMouseButtonUp::ReturnValue' has a wrong offset!");
