#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Module_HelpMate

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UIW_Module_HelpMate.UIW_Module_HelpMate_C.ExecuteUbergraph_UIW_Module_HelpMate
// 0x0030 (0x0030 - 0x0000)
struct UIW_Module_HelpMate_C_ExecuteUbergraph_UIW_Module_HelpMate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0008(0x0018)()
	TDelegate<void(class UUIW_Popup_C* Popup, class UUIW_Btn_Key_C* BtnKey)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(UIW_Module_HelpMate_C_ExecuteUbergraph_UIW_Module_HelpMate) == 0x000008, "Wrong alignment on UIW_Module_HelpMate_C_ExecuteUbergraph_UIW_Module_HelpMate");
static_assert(sizeof(UIW_Module_HelpMate_C_ExecuteUbergraph_UIW_Module_HelpMate) == 0x000030, "Wrong size on UIW_Module_HelpMate_C_ExecuteUbergraph_UIW_Module_HelpMate");
static_assert(offsetof(UIW_Module_HelpMate_C_ExecuteUbergraph_UIW_Module_HelpMate, EntryPoint) == 0x000000, "Member 'UIW_Module_HelpMate_C_ExecuteUbergraph_UIW_Module_HelpMate::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_ExecuteUbergraph_UIW_Module_HelpMate, CallFunc_GetGameStrWithName_ReturnValue) == 0x000008, "Member 'UIW_Module_HelpMate_C_ExecuteUbergraph_UIW_Module_HelpMate::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_ExecuteUbergraph_UIW_Module_HelpMate, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'UIW_Module_HelpMate_C_ExecuteUbergraph_UIW_Module_HelpMate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function UIW_Module_HelpMate.UIW_Module_HelpMate_C.SetData
// 0x01A0 (0x01A0 - 0x0000)
struct UIW_Module_HelpMate_C_SetData final
{
public:
	struct FItemCommonInfoPtr                     ItemCommonInfo;                                    // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor)
	TArray<class UUIBP_ListData_Resource_C*>      LocalListItems;                                    // 0x0008(0x0010)(Edit, BlueprintVisible)
	TMap<class FName, int32>                      LocalMap;                                          // 0x0018(0x0050)(Edit, BlueprintVisible)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerInventory*                      CallFunc_GetPlayerInventory_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_GetImageResource_ReturnValue;             // 0x0078(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalTextItemNameLocalize_ReturnValue; // 0x00A0(0x0018)()
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULCommonConstantValues*                 CallFunc_GetConstantValues_ReturnValue;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x00C8(0x0018)()
	class FName                                   CallFunc_GetHelpMateAwakeItem_ReturnValue;         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemTotalCountByCodeName_ReturnValue;  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLocalTextItemNameLocalize_ReturnValue_1; // 0x00F0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0108(0x0040)(HasGetValueTypeHash)
	class UUIBP_ListData_Resource_C*              CallFunc_SpawnObject_ReturnValue;                  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0150(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0160(0x0018)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULCommonConstantValues*                 CallFunc_GetConstantValues_ReturnValue_1;          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetHelpMateAwakeItem_ReturnValue_1;       // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemCommonInfoPtr                     CallFunc_FindItemCommonInfoByNameBP_ReturnValue;   // 0x0198(0x0008)(NoDestructor)
};
static_assert(alignof(UIW_Module_HelpMate_C_SetData) == 0x000008, "Wrong alignment on UIW_Module_HelpMate_C_SetData");
static_assert(sizeof(UIW_Module_HelpMate_C_SetData) == 0x0001A0, "Wrong size on UIW_Module_HelpMate_C_SetData");
static_assert(offsetof(UIW_Module_HelpMate_C_SetData, ItemCommonInfo) == 0x000000, "Member 'UIW_Module_HelpMate_C_SetData::ItemCommonInfo' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_SetData, LocalListItems) == 0x000008, "Member 'UIW_Module_HelpMate_C_SetData::LocalListItems' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_SetData, LocalMap) == 0x000018, "Member 'UIW_Module_HelpMate_C_SetData::LocalMap' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_SetData, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000068, "Member 'UIW_Module_HelpMate_C_SetData::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_SetData, CallFunc_GetPlayerInventory_ReturnValue) == 0x000070, "Member 'UIW_Module_HelpMate_C_SetData::CallFunc_GetPlayerInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_SetData, CallFunc_GetImageResource_ReturnValue) == 0x000078, "Member 'UIW_Module_HelpMate_C_SetData::CallFunc_GetImageResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_SetData, CallFunc_GetLocalTextItemNameLocalize_ReturnValue) == 0x0000A0, "Member 'UIW_Module_HelpMate_C_SetData::CallFunc_GetLocalTextItemNameLocalize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_SetData, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0000B8, "Member 'UIW_Module_HelpMate_C_SetData::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_SetData, CallFunc_GetConstantValues_ReturnValue) == 0x0000C0, "Member 'UIW_Module_HelpMate_C_SetData::CallFunc_GetConstantValues_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_SetData, CallFunc_GetGameStrWithName_ReturnValue) == 0x0000C8, "Member 'UIW_Module_HelpMate_C_SetData::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_SetData, CallFunc_GetHelpMateAwakeItem_ReturnValue) == 0x0000E0, "Member 'UIW_Module_HelpMate_C_SetData::CallFunc_GetHelpMateAwakeItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_SetData, CallFunc_GetItemTotalCountByCodeName_ReturnValue) == 0x0000E8, "Member 'UIW_Module_HelpMate_C_SetData::CallFunc_GetItemTotalCountByCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_SetData, CallFunc_GetLocalTextItemNameLocalize_ReturnValue_1) == 0x0000F0, "Member 'UIW_Module_HelpMate_C_SetData::CallFunc_GetLocalTextItemNameLocalize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_SetData, K2Node_MakeStruct_FormatArgumentData) == 0x000108, "Member 'UIW_Module_HelpMate_C_SetData::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_SetData, CallFunc_SpawnObject_ReturnValue) == 0x000148, "Member 'UIW_Module_HelpMate_C_SetData::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_SetData, K2Node_MakeArray_Array) == 0x000150, "Member 'UIW_Module_HelpMate_C_SetData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_SetData, CallFunc_Format_ReturnValue) == 0x000160, "Member 'UIW_Module_HelpMate_C_SetData::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_SetData, CallFunc_Array_Add_ReturnValue) == 0x000178, "Member 'UIW_Module_HelpMate_C_SetData::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_SetData, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000180, "Member 'UIW_Module_HelpMate_C_SetData::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_SetData, CallFunc_GetConstantValues_ReturnValue_1) == 0x000188, "Member 'UIW_Module_HelpMate_C_SetData::CallFunc_GetConstantValues_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_SetData, CallFunc_GetHelpMateAwakeItem_ReturnValue_1) == 0x000190, "Member 'UIW_Module_HelpMate_C_SetData::CallFunc_GetHelpMateAwakeItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_SetData, CallFunc_FindItemCommonInfoByNameBP_ReturnValue) == 0x000198, "Member 'UIW_Module_HelpMate_C_SetData::CallFunc_FindItemCommonInfoByNameBP_ReturnValue' has a wrong offset!");

// Function UIW_Module_HelpMate.UIW_Module_HelpMate_C.OnInput
// 0x0078 (0x0078 - 0x0000)
struct UIW_Module_HelpMate_C_OnInput final
{
public:
	class UUIW_Popup_C*                           Popup;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0010(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerInventory*                      CallFunc_GetPlayerInventory_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULCommonConstantValues*                 CallFunc_GetConstantValues_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULUISystem*                             CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetHelpMateAwakeItem_ReturnValue;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemTotalCountByCodeName_ReturnValue;  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Module_HelpMate_C_OnInput) == 0x000008, "Wrong alignment on UIW_Module_HelpMate_C_OnInput");
static_assert(sizeof(UIW_Module_HelpMate_C_OnInput) == 0x000078, "Wrong size on UIW_Module_HelpMate_C_OnInput");
static_assert(offsetof(UIW_Module_HelpMate_C_OnInput, Popup) == 0x000000, "Member 'UIW_Module_HelpMate_C_OnInput::Popup' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_OnInput, BtnKey) == 0x000008, "Member 'UIW_Module_HelpMate_C_OnInput::BtnKey' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_OnInput, CallFunc_GetGameStrWithName_ReturnValue) == 0x000010, "Member 'UIW_Module_HelpMate_C_OnInput::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_OnInput, K2Node_SwitchEnum_CmpSuccess) == 0x000028, "Member 'UIW_Module_HelpMate_C_OnInput::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_OnInput, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'UIW_Module_HelpMate_C_OnInput::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_OnInput, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000038, "Member 'UIW_Module_HelpMate_C_OnInput::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_OnInput, CallFunc_GetPlayerInventory_ReturnValue) == 0x000040, "Member 'UIW_Module_HelpMate_C_OnInput::CallFunc_GetPlayerInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_OnInput, CallFunc_GetConstantValues_ReturnValue) == 0x000048, "Member 'UIW_Module_HelpMate_C_OnInput::CallFunc_GetConstantValues_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_OnInput, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000050, "Member 'UIW_Module_HelpMate_C_OnInput::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_OnInput, CallFunc_GetHelpMateAwakeItem_ReturnValue) == 0x000058, "Member 'UIW_Module_HelpMate_C_OnInput::CallFunc_GetHelpMateAwakeItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_OnInput, CallFunc_GetItemTotalCountByCodeName_ReturnValue) == 0x000060, "Member 'UIW_Module_HelpMate_C_OnInput::CallFunc_GetItemTotalCountByCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_OnInput, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000068, "Member 'UIW_Module_HelpMate_C_OnInput::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_Module_HelpMate_C_OnInput, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000070, "Member 'UIW_Module_HelpMate_C_OnInput::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

}

