#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HUD_Gauge_Frenzy

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_HUD_Gauge_Frenzy.UIW_HUD_Gauge_Frenzy_C
// 0x0058 (0x0300 - 0x02A8)
class UUIW_HUD_Gauge_Frenzy_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         Group_Unit;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_HUD_Gauge_FrenzyItem_C*            Unit_0;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_HUD_Gauge_FrenzyItem_C*            Unit_1;                                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_HUD_Gauge_FrenzyItem_C*            Unit_2;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_HUD_Gauge_FrenzyItem_C*            Unit_3;                                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_HUD_Gauge_FrenzyItem_C*            Unit_4;                                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_HUD_Gauge_FrenzyItem_C*            Unit_5;                                            // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UUIW_HUD_Gauge_FrenzyItem_C*>    UnitList;                                          // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         PrevUnitCount;                                     // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_HUD_Gauge_Frenzy(int32 EntryPoint);
	void Destruct();
	void Construct();
	void UpdateFrenzyPoint(int32 Current, int32 Max, int32 UnitCount, int32 ConsumeUnitCount, ELFrenzyConsumeReason FrenzyPointConsumeReason);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_HUD_Gauge_Frenzy_C">();
	}
	static class UUIW_HUD_Gauge_Frenzy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_HUD_Gauge_Frenzy_C>();
	}
};
static_assert(alignof(UUIW_HUD_Gauge_Frenzy_C) == 0x000008, "Wrong alignment on UUIW_HUD_Gauge_Frenzy_C");
static_assert(sizeof(UUIW_HUD_Gauge_Frenzy_C) == 0x000300, "Wrong size on UUIW_HUD_Gauge_Frenzy_C");
static_assert(offsetof(UUIW_HUD_Gauge_Frenzy_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_HUD_Gauge_Frenzy_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_Frenzy_C, Group_Unit) == 0x0002B0, "Member 'UUIW_HUD_Gauge_Frenzy_C::Group_Unit' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_Frenzy_C, Unit_0) == 0x0002B8, "Member 'UUIW_HUD_Gauge_Frenzy_C::Unit_0' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_Frenzy_C, Unit_1) == 0x0002C0, "Member 'UUIW_HUD_Gauge_Frenzy_C::Unit_1' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_Frenzy_C, Unit_2) == 0x0002C8, "Member 'UUIW_HUD_Gauge_Frenzy_C::Unit_2' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_Frenzy_C, Unit_3) == 0x0002D0, "Member 'UUIW_HUD_Gauge_Frenzy_C::Unit_3' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_Frenzy_C, Unit_4) == 0x0002D8, "Member 'UUIW_HUD_Gauge_Frenzy_C::Unit_4' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_Frenzy_C, Unit_5) == 0x0002E0, "Member 'UUIW_HUD_Gauge_Frenzy_C::Unit_5' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_Frenzy_C, UnitList) == 0x0002E8, "Member 'UUIW_HUD_Gauge_Frenzy_C::UnitList' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Gauge_Frenzy_C, PrevUnitCount) == 0x0002F8, "Member 'UUIW_HUD_Gauge_Frenzy_C::PrevUnitCount' has a wrong offset!");

}

