#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Alert_GetHumanity

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Alert_GetHumanity.UIW_Alert_GetHumanity_C
// 0x0058 (0x0300 - 0x02A8)
class UUIW_Alert_GetHumanity_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Start;                                         // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Img_Heart;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Title;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Title_Deco;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           XXXX_Text_Deco_Canvas;                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           XXXX_Text_Title_Canvas;                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           EffectTimer;                                       // 0x02E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         SpreadValue_Text;                                  // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpreadValue_Deco;                                  // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         SpreadValue_Text_Gap;                              // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastRightPosition;                                 // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        GetHumanitySound;                                  // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_Alert_GetHumanity(int32 EntryPoint);
	void WidgetAnimationEvt_Ani_Start_K2Node_WidgetAnimationEvent_1();
	void Destruct();
	void Construct();
	void SequenceEvent_0();
	void Show(class FName CodeName);
	void SequenceEvent__ENTRYPOINTUIW_Alert_GetHumanity_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Alert_GetHumanity_C">();
	}
	static class UUIW_Alert_GetHumanity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Alert_GetHumanity_C>();
	}
};
static_assert(alignof(UUIW_Alert_GetHumanity_C) == 0x000008, "Wrong alignment on UUIW_Alert_GetHumanity_C");
static_assert(sizeof(UUIW_Alert_GetHumanity_C) == 0x000300, "Wrong size on UUIW_Alert_GetHumanity_C");
static_assert(offsetof(UUIW_Alert_GetHumanity_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_Alert_GetHumanity_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_GetHumanity_C, Ani_Start) == 0x0002B0, "Member 'UUIW_Alert_GetHumanity_C::Ani_Start' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_GetHumanity_C, Img_Heart) == 0x0002B8, "Member 'UUIW_Alert_GetHumanity_C::Img_Heart' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_GetHumanity_C, Text_Title) == 0x0002C0, "Member 'UUIW_Alert_GetHumanity_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_GetHumanity_C, Text_Title_Deco) == 0x0002C8, "Member 'UUIW_Alert_GetHumanity_C::Text_Title_Deco' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_GetHumanity_C, XXXX_Text_Deco_Canvas) == 0x0002D0, "Member 'UUIW_Alert_GetHumanity_C::XXXX_Text_Deco_Canvas' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_GetHumanity_C, XXXX_Text_Title_Canvas) == 0x0002D8, "Member 'UUIW_Alert_GetHumanity_C::XXXX_Text_Title_Canvas' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_GetHumanity_C, EffectTimer) == 0x0002E0, "Member 'UUIW_Alert_GetHumanity_C::EffectTimer' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_GetHumanity_C, SpreadValue_Text) == 0x0002E8, "Member 'UUIW_Alert_GetHumanity_C::SpreadValue_Text' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_GetHumanity_C, SpreadValue_Deco) == 0x0002EC, "Member 'UUIW_Alert_GetHumanity_C::SpreadValue_Deco' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_GetHumanity_C, SpreadValue_Text_Gap) == 0x0002F0, "Member 'UUIW_Alert_GetHumanity_C::SpreadValue_Text_Gap' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_GetHumanity_C, LastRightPosition) == 0x0002F4, "Member 'UUIW_Alert_GetHumanity_C::LastRightPosition' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_GetHumanity_C, GetHumanitySound) == 0x0002F8, "Member 'UUIW_Alert_GetHumanity_C::GetHumanitySound' has a wrong offset!");

}

