#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ProfileItem_Level

#include "Basic.hpp"


namespace SDK::Params
{

// Function UIW_ProfileItem_Level.UIW_ProfileItem_Level_C.ExecuteUbergraph_UIW_ProfileItem_Level
// 0x0050 (0x0050 - 0x0000)
struct UIW_ProfileItem_Level_C_ExecuteUbergraph_UIW_ProfileItem_Level final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0020(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x0038(0x0018)()
};
static_assert(alignof(UIW_ProfileItem_Level_C_ExecuteUbergraph_UIW_ProfileItem_Level) == 0x000008, "Wrong alignment on UIW_ProfileItem_Level_C_ExecuteUbergraph_UIW_ProfileItem_Level");
static_assert(sizeof(UIW_ProfileItem_Level_C_ExecuteUbergraph_UIW_ProfileItem_Level) == 0x000050, "Wrong size on UIW_ProfileItem_Level_C_ExecuteUbergraph_UIW_ProfileItem_Level");
static_assert(offsetof(UIW_ProfileItem_Level_C_ExecuteUbergraph_UIW_ProfileItem_Level, EntryPoint) == 0x000000, "Member 'UIW_ProfileItem_Level_C_ExecuteUbergraph_UIW_ProfileItem_Level::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Level_C_ExecuteUbergraph_UIW_ProfileItem_Level, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000008, "Member 'UIW_ProfileItem_Level_C_ExecuteUbergraph_UIW_ProfileItem_Level::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Level_C_ExecuteUbergraph_UIW_ProfileItem_Level, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'UIW_ProfileItem_Level_C_ExecuteUbergraph_UIW_ProfileItem_Level::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Level_C_ExecuteUbergraph_UIW_ProfileItem_Level, CallFunc_GetGameStrWithName_ReturnValue) == 0x000020, "Member 'UIW_ProfileItem_Level_C_ExecuteUbergraph_UIW_ProfileItem_Level::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Level_C_ExecuteUbergraph_UIW_ProfileItem_Level, CallFunc_GetGameStrWithName_ReturnValue_1) == 0x000038, "Member 'UIW_ProfileItem_Level_C_ExecuteUbergraph_UIW_ProfileItem_Level::CallFunc_GetGameStrWithName_ReturnValue_1' has a wrong offset!");

// Function UIW_ProfileItem_Level.UIW_ProfileItem_Level_C.RefreshData
// 0x0048 (0x0048 - 0x0000)
struct UIW_ProfileItem_Level_C_RefreshData final
{
public:
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharacterLevel_ReturnValue;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLevelUpRequireErgo_ReturnValue;        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0030(0x0018)()
};
static_assert(alignof(UIW_ProfileItem_Level_C_RefreshData) == 0x000008, "Wrong alignment on UIW_ProfileItem_Level_C_RefreshData");
static_assert(sizeof(UIW_ProfileItem_Level_C_RefreshData) == 0x000048, "Wrong size on UIW_ProfileItem_Level_C_RefreshData");
static_assert(offsetof(UIW_ProfileItem_Level_C_RefreshData, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'UIW_ProfileItem_Level_C_RefreshData::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Level_C_RefreshData, CallFunc_GetCharacterLevel_ReturnValue) == 0x000008, "Member 'UIW_ProfileItem_Level_C_RefreshData::CallFunc_GetCharacterLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Level_C_RefreshData, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'UIW_ProfileItem_Level_C_RefreshData::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Level_C_RefreshData, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'UIW_ProfileItem_Level_C_RefreshData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Level_C_RefreshData, CallFunc_GetLevelUpRequireErgo_ReturnValue) == 0x00002C, "Member 'UIW_ProfileItem_Level_C_RefreshData::CallFunc_GetLevelUpRequireErgo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ProfileItem_Level_C_RefreshData, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000030, "Member 'UIW_ProfileItem_Level_C_RefreshData::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");

}

