#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Quartz_Listbar

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UIW_Quartz_Listbar.UIW_Quartz_Listbar_C.OnFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Quartz_Listbar_C_OnFocused__DelegateSignature final
{
public:
	class UUIW_Quartz_Listbar_C*                  QuartzListBar;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Quartz_Listbar_C_OnFocused__DelegateSignature) == 0x000008, "Wrong alignment on UIW_Quartz_Listbar_C_OnFocused__DelegateSignature");
static_assert(sizeof(UIW_Quartz_Listbar_C_OnFocused__DelegateSignature) == 0x000008, "Wrong size on UIW_Quartz_Listbar_C_OnFocused__DelegateSignature");
static_assert(offsetof(UIW_Quartz_Listbar_C_OnFocused__DelegateSignature, QuartzListBar) == 0x000000, "Member 'UIW_Quartz_Listbar_C_OnFocused__DelegateSignature::QuartzListBar' has a wrong offset!");

// Function UIW_Quartz_Listbar.UIW_Quartz_Listbar_C.OnDoubleClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Quartz_Listbar_C_OnDoubleClicked__DelegateSignature final
{
public:
	class UUIW_Quartz_Listbar_C*                  QuartzListBar;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Quartz_Listbar_C_OnDoubleClicked__DelegateSignature) == 0x000008, "Wrong alignment on UIW_Quartz_Listbar_C_OnDoubleClicked__DelegateSignature");
static_assert(sizeof(UIW_Quartz_Listbar_C_OnDoubleClicked__DelegateSignature) == 0x000008, "Wrong size on UIW_Quartz_Listbar_C_OnDoubleClicked__DelegateSignature");
static_assert(offsetof(UIW_Quartz_Listbar_C_OnDoubleClicked__DelegateSignature, QuartzListBar) == 0x000000, "Member 'UIW_Quartz_Listbar_C_OnDoubleClicked__DelegateSignature::QuartzListBar' has a wrong offset!");

// Function UIW_Quartz_Listbar.UIW_Quartz_Listbar_C.ExecuteUbergraph_UIW_Quartz_Listbar
// 0x0128 (0x0128 - 0x0000)
struct UIW_Quartz_Listbar_C_ExecuteUbergraph_UIW_Quartz_Listbar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0040(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00B0(0x0070)(ConstParm)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0120(0x0008)(NoDestructor)
};
static_assert(alignof(UIW_Quartz_Listbar_C_ExecuteUbergraph_UIW_Quartz_Listbar) == 0x000008, "Wrong alignment on UIW_Quartz_Listbar_C_ExecuteUbergraph_UIW_Quartz_Listbar");
static_assert(sizeof(UIW_Quartz_Listbar_C_ExecuteUbergraph_UIW_Quartz_Listbar) == 0x000128, "Wrong size on UIW_Quartz_Listbar_C_ExecuteUbergraph_UIW_Quartz_Listbar");
static_assert(offsetof(UIW_Quartz_Listbar_C_ExecuteUbergraph_UIW_Quartz_Listbar, EntryPoint) == 0x000000, "Member 'UIW_Quartz_Listbar_C_ExecuteUbergraph_UIW_Quartz_Listbar::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Listbar_C_ExecuteUbergraph_UIW_Quartz_Listbar, K2Node_Event_MyGeometry) == 0x000004, "Member 'UIW_Quartz_Listbar_C_ExecuteUbergraph_UIW_Quartz_Listbar::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Listbar_C_ExecuteUbergraph_UIW_Quartz_Listbar, K2Node_Event_MouseEvent_1) == 0x000040, "Member 'UIW_Quartz_Listbar_C_ExecuteUbergraph_UIW_Quartz_Listbar::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Listbar_C_ExecuteUbergraph_UIW_Quartz_Listbar, K2Node_Event_MouseEvent) == 0x0000B0, "Member 'UIW_Quartz_Listbar_C_ExecuteUbergraph_UIW_Quartz_Listbar::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Listbar_C_ExecuteUbergraph_UIW_Quartz_Listbar, K2Node_Event_InFocusEvent) == 0x000120, "Member 'UIW_Quartz_Listbar_C_ExecuteUbergraph_UIW_Quartz_Listbar::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function UIW_Quartz_Listbar.UIW_Quartz_Listbar_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct UIW_Quartz_Listbar_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIW_Quartz_Listbar_C_OnMouseLeave) == 0x000008, "Wrong alignment on UIW_Quartz_Listbar_C_OnMouseLeave");
static_assert(sizeof(UIW_Quartz_Listbar_C_OnMouseLeave) == 0x000070, "Wrong size on UIW_Quartz_Listbar_C_OnMouseLeave");
static_assert(offsetof(UIW_Quartz_Listbar_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'UIW_Quartz_Listbar_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function UIW_Quartz_Listbar.UIW_Quartz_Listbar_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct UIW_Quartz_Listbar_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIW_Quartz_Listbar_C_OnMouseEnter) == 0x000008, "Wrong alignment on UIW_Quartz_Listbar_C_OnMouseEnter");
static_assert(sizeof(UIW_Quartz_Listbar_C_OnMouseEnter) == 0x0000A8, "Wrong size on UIW_Quartz_Listbar_C_OnMouseEnter");
static_assert(offsetof(UIW_Quartz_Listbar_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'UIW_Quartz_Listbar_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Listbar_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'UIW_Quartz_Listbar_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function UIW_Quartz_Listbar.UIW_Quartz_Listbar_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct UIW_Quartz_Listbar_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UIW_Quartz_Listbar_C_OnFocusLost) == 0x000004, "Wrong alignment on UIW_Quartz_Listbar_C_OnFocusLost");
static_assert(sizeof(UIW_Quartz_Listbar_C_OnFocusLost) == 0x000008, "Wrong size on UIW_Quartz_Listbar_C_OnFocusLost");
static_assert(offsetof(UIW_Quartz_Listbar_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'UIW_Quartz_Listbar_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function UIW_Quartz_Listbar.UIW_Quartz_Listbar_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct UIW_Quartz_Listbar_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0100(0x00B8)()
};
static_assert(alignof(UIW_Quartz_Listbar_C_OnFocusReceived) == 0x000008, "Wrong alignment on UIW_Quartz_Listbar_C_OnFocusReceived");
static_assert(sizeof(UIW_Quartz_Listbar_C_OnFocusReceived) == 0x0001B8, "Wrong size on UIW_Quartz_Listbar_C_OnFocusReceived");
static_assert(offsetof(UIW_Quartz_Listbar_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UIW_Quartz_Listbar_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Listbar_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UIW_Quartz_Listbar_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Listbar_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UIW_Quartz_Listbar_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Listbar_C_OnFocusReceived, CallFunc_GetMainWidget_MainWidget) == 0x0000F8, "Member 'UIW_Quartz_Listbar_C_OnFocusReceived::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Listbar_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000100, "Member 'UIW_Quartz_Listbar_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UIW_Quartz_Listbar.UIW_Quartz_Listbar_C.OnMouseButtonDoubleClick
// 0x0218 (0x0218 - 0x0000)
struct UIW_Quartz_Listbar_C_OnMouseButtonDoubleClick final
{
public:
	struct FGeometry                              InMyGeometry;                                      // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InMouseEvent;                                      // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UIW_Quartz_Listbar_C_OnMouseButtonDoubleClick) == 0x000008, "Wrong alignment on UIW_Quartz_Listbar_C_OnMouseButtonDoubleClick");
static_assert(sizeof(UIW_Quartz_Listbar_C_OnMouseButtonDoubleClick) == 0x000218, "Wrong size on UIW_Quartz_Listbar_C_OnMouseButtonDoubleClick");
static_assert(offsetof(UIW_Quartz_Listbar_C_OnMouseButtonDoubleClick, InMyGeometry) == 0x000000, "Member 'UIW_Quartz_Listbar_C_OnMouseButtonDoubleClick::InMyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Listbar_C_OnMouseButtonDoubleClick, InMouseEvent) == 0x000038, "Member 'UIW_Quartz_Listbar_C_OnMouseButtonDoubleClick::InMouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Listbar_C_OnMouseButtonDoubleClick, ReturnValue) == 0x0000A8, "Member 'UIW_Quartz_Listbar_C_OnMouseButtonDoubleClick::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Listbar_C_OnMouseButtonDoubleClick, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'UIW_Quartz_Listbar_C_OnMouseButtonDoubleClick::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UIW_Quartz_Listbar.UIW_Quartz_Listbar_C.OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct UIW_Quartz_Listbar_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UIW_Quartz_Listbar_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on UIW_Quartz_Listbar_C_OnMouseButtonDown");
static_assert(sizeof(UIW_Quartz_Listbar_C_OnMouseButtonDown) == 0x000218, "Wrong size on UIW_Quartz_Listbar_C_OnMouseButtonDown");
static_assert(offsetof(UIW_Quartz_Listbar_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'UIW_Quartz_Listbar_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Listbar_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'UIW_Quartz_Listbar_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Listbar_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'UIW_Quartz_Listbar_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Listbar_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'UIW_Quartz_Listbar_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UIW_Quartz_Listbar.UIW_Quartz_Listbar_C.SetData
// 0x0088 (0x0088 - 0x0000)
struct UIW_Quartz_Listbar_C_SetData final
{
public:
	struct FLQuartzSlot                           SlotData;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0010(0x0018)()
	ELQuartzEffectType                            CallFunc_GetEffectType_ReturnValue;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumberOverlappingEffect_ReturnValue;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetSpecialBuffCodeName_ReturnValue;       // 0x0030(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetSpecialBuffLocalText_OutName;          // 0x0038(0x0018)()
	class FText                                   CallFunc_GetSpecialBuffLocalText_OutTooltip;       // 0x0050(0x0018)()
	class FText                                   CallFunc_GetSynergyNameWithNumber_ReturnValue;     // 0x0068(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Quartz_Listbar_C_SetData) == 0x000008, "Wrong alignment on UIW_Quartz_Listbar_C_SetData");
static_assert(sizeof(UIW_Quartz_Listbar_C_SetData) == 0x000088, "Wrong size on UIW_Quartz_Listbar_C_SetData");
static_assert(offsetof(UIW_Quartz_Listbar_C_SetData, SlotData) == 0x000000, "Member 'UIW_Quartz_Listbar_C_SetData::SlotData' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Listbar_C_SetData, CallFunc_GetGameStrWithName_ReturnValue) == 0x000010, "Member 'UIW_Quartz_Listbar_C_SetData::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Listbar_C_SetData, CallFunc_GetEffectType_ReturnValue) == 0x000028, "Member 'UIW_Quartz_Listbar_C_SetData::CallFunc_GetEffectType_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Listbar_C_SetData, K2Node_SwitchEnum_CmpSuccess) == 0x000029, "Member 'UIW_Quartz_Listbar_C_SetData::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Listbar_C_SetData, CallFunc_GetNumberOverlappingEffect_ReturnValue) == 0x00002C, "Member 'UIW_Quartz_Listbar_C_SetData::CallFunc_GetNumberOverlappingEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Listbar_C_SetData, CallFunc_GetSpecialBuffCodeName_ReturnValue) == 0x000030, "Member 'UIW_Quartz_Listbar_C_SetData::CallFunc_GetSpecialBuffCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Listbar_C_SetData, CallFunc_GetSpecialBuffLocalText_OutName) == 0x000038, "Member 'UIW_Quartz_Listbar_C_SetData::CallFunc_GetSpecialBuffLocalText_OutName' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Listbar_C_SetData, CallFunc_GetSpecialBuffLocalText_OutTooltip) == 0x000050, "Member 'UIW_Quartz_Listbar_C_SetData::CallFunc_GetSpecialBuffLocalText_OutTooltip' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Listbar_C_SetData, CallFunc_GetSynergyNameWithNumber_ReturnValue) == 0x000068, "Member 'UIW_Quartz_Listbar_C_SetData::CallFunc_GetSynergyNameWithNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Quartz_Listbar_C_SetData, K2Node_SwitchEnum_CmpSuccess_1) == 0x000080, "Member 'UIW_Quartz_Listbar_C_SetData::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

}

