#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ListItem_ResourceListBar

#include "Basic.hpp"

#include "UIST_Color_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UIW_ListItem_ResourceListBar.UIW_ListItem_ResourceListBar_C.ExecuteUbergraph_UIW_ListItem_ResourceListBar
// 0x0020 (0x0020 - 0x0000)
struct UIW_ListItem_ResourceListBar_C_ExecuteUbergraph_UIW_ListItem_ResourceListBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_Resource_C*              K2Node_DynamicCast_AsUIBP_List_Data_Resource;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSelected;                          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_ResourceListBar_C_ExecuteUbergraph_UIW_ListItem_ResourceListBar) == 0x000008, "Wrong alignment on UIW_ListItem_ResourceListBar_C_ExecuteUbergraph_UIW_ListItem_ResourceListBar");
static_assert(sizeof(UIW_ListItem_ResourceListBar_C_ExecuteUbergraph_UIW_ListItem_ResourceListBar) == 0x000020, "Wrong size on UIW_ListItem_ResourceListBar_C_ExecuteUbergraph_UIW_ListItem_ResourceListBar");
static_assert(offsetof(UIW_ListItem_ResourceListBar_C_ExecuteUbergraph_UIW_ListItem_ResourceListBar, EntryPoint) == 0x000000, "Member 'UIW_ListItem_ResourceListBar_C_ExecuteUbergraph_UIW_ListItem_ResourceListBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ResourceListBar_C_ExecuteUbergraph_UIW_ListItem_ResourceListBar, K2Node_Event_ListItemObject) == 0x000008, "Member 'UIW_ListItem_ResourceListBar_C_ExecuteUbergraph_UIW_ListItem_ResourceListBar::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ResourceListBar_C_ExecuteUbergraph_UIW_ListItem_ResourceListBar, K2Node_DynamicCast_AsUIBP_List_Data_Resource) == 0x000010, "Member 'UIW_ListItem_ResourceListBar_C_ExecuteUbergraph_UIW_ListItem_ResourceListBar::K2Node_DynamicCast_AsUIBP_List_Data_Resource' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ResourceListBar_C_ExecuteUbergraph_UIW_ListItem_ResourceListBar, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UIW_ListItem_ResourceListBar_C_ExecuteUbergraph_UIW_ListItem_ResourceListBar::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ResourceListBar_C_ExecuteUbergraph_UIW_ListItem_ResourceListBar, K2Node_Event_bIsExpanded) == 0x000019, "Member 'UIW_ListItem_ResourceListBar_C_ExecuteUbergraph_UIW_ListItem_ResourceListBar::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ResourceListBar_C_ExecuteUbergraph_UIW_ListItem_ResourceListBar, K2Node_Event_bIsSelected) == 0x00001A, "Member 'UIW_ListItem_ResourceListBar_C_ExecuteUbergraph_UIW_ListItem_ResourceListBar::K2Node_Event_bIsSelected' has a wrong offset!");

// Function UIW_ListItem_ResourceListBar.UIW_ListItem_ResourceListBar_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct UIW_ListItem_ResourceListBar_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ListItem_ResourceListBar_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on UIW_ListItem_ResourceListBar_C_OnListItemObjectSet");
static_assert(sizeof(UIW_ListItem_ResourceListBar_C_OnListItemObjectSet) == 0x000008, "Wrong size on UIW_ListItem_ResourceListBar_C_OnListItemObjectSet");
static_assert(offsetof(UIW_ListItem_ResourceListBar_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'UIW_ListItem_ResourceListBar_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function UIW_ListItem_ResourceListBar.UIW_ListItem_ResourceListBar_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_ListItem_ResourceListBar_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_ResourceListBar_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on UIW_ListItem_ResourceListBar_C_BP_OnItemSelectionChanged");
static_assert(sizeof(UIW_ListItem_ResourceListBar_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on UIW_ListItem_ResourceListBar_C_BP_OnItemSelectionChanged");
static_assert(offsetof(UIW_ListItem_ResourceListBar_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'UIW_ListItem_ResourceListBar_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function UIW_ListItem_ResourceListBar.UIW_ListItem_ResourceListBar_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_ListItem_ResourceListBar_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_ResourceListBar_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on UIW_ListItem_ResourceListBar_C_BP_OnItemExpansionChanged");
static_assert(sizeof(UIW_ListItem_ResourceListBar_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on UIW_ListItem_ResourceListBar_C_BP_OnItemExpansionChanged");
static_assert(offsetof(UIW_ListItem_ResourceListBar_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'UIW_ListItem_ResourceListBar_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function UIW_ListItem_ResourceListBar.UIW_ListItem_ResourceListBar_C.SetData
// 0x00F0 (0x00F0 - 0x0000)
struct UIW_ListItem_ResourceListBar_C_SetData final
{
public:
	class FText                                   ItemName;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	TSoftObjectPtr<class UObject>                 Icon;                                              // 0x0018(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	int32                                         HasCount;                                          // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RequireCount;                                      // 0x0044(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0050(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0070(0x0018)()
	struct FUIST_Color                            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0090(0x0028)()
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x00C8(0x0028)()
};
static_assert(alignof(UIW_ListItem_ResourceListBar_C_SetData) == 0x000008, "Wrong alignment on UIW_ListItem_ResourceListBar_C_SetData");
static_assert(sizeof(UIW_ListItem_ResourceListBar_C_SetData) == 0x0000F0, "Wrong size on UIW_ListItem_ResourceListBar_C_SetData");
static_assert(offsetof(UIW_ListItem_ResourceListBar_C_SetData, ItemName) == 0x000000, "Member 'UIW_ListItem_ResourceListBar_C_SetData::ItemName' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ResourceListBar_C_SetData, Icon) == 0x000018, "Member 'UIW_ListItem_ResourceListBar_C_SetData::Icon' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ResourceListBar_C_SetData, HasCount) == 0x000040, "Member 'UIW_ListItem_ResourceListBar_C_SetData::HasCount' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ResourceListBar_C_SetData, RequireCount) == 0x000044, "Member 'UIW_ListItem_ResourceListBar_C_SetData::RequireCount' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ResourceListBar_C_SetData, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000048, "Member 'UIW_ListItem_ResourceListBar_C_SetData::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ResourceListBar_C_SetData, CallFunc_Conv_IntToText_ReturnValue) == 0x000050, "Member 'UIW_ListItem_ResourceListBar_C_SetData::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ResourceListBar_C_SetData, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'UIW_ListItem_ResourceListBar_C_SetData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ResourceListBar_C_SetData, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000070, "Member 'UIW_ListItem_ResourceListBar_C_SetData::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ResourceListBar_C_SetData, CallFunc_GetDataTableRowFromName_OutRow) == 0x000088, "Member 'UIW_ListItem_ResourceListBar_C_SetData::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ResourceListBar_C_SetData, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x00008C, "Member 'UIW_ListItem_ResourceListBar_C_SetData::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ResourceListBar_C_SetData, K2Node_MakeStruct_SlateColor) == 0x000090, "Member 'UIW_ListItem_ResourceListBar_C_SetData::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ResourceListBar_C_SetData, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x0000B8, "Member 'UIW_ListItem_ResourceListBar_C_SetData::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_ResourceListBar_C_SetData, K2Node_MakeStruct_SlateColor_1) == 0x0000C8, "Member 'UIW_ListItem_ResourceListBar_C_SetData::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

}

