#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ListItem_BladeReinforced

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"


namespace SDK::Params
{

// Function UIW_ListItem_BladeReinforced.UIW_ListItem_BladeReinforced_C.ExecuteUbergraph_UIW_ListItem_BladeReinforced
// 0x0050 (0x0050 - 0x0000)
struct UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanReinforce_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsReinforced_ReturnValue;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemWeaponReinforceInfoPtr            CallFunc_GetNextReinforceInfo_ReturnValue;         // 0x0008(0x0008)(NoDestructor)
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNeedErgo_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentErgo_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNeedItemNum_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetNeedItemCodeName_ReturnValue;          // 0x0028(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_ListItem;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerInventory*                      CallFunc_GetPlayerInventory_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemTotalCountByCodeName_ReturnValue;  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced) == 0x000008, "Wrong alignment on UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced");
static_assert(sizeof(UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced) == 0x000050, "Wrong size on UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced");
static_assert(offsetof(UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced, EntryPoint) == 0x000000, "Member 'UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced, CallFunc_CanReinforce_ReturnValue) == 0x000004, "Member 'UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced::CallFunc_CanReinforce_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced, CallFunc_IsReinforced_ReturnValue) == 0x000005, "Member 'UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced::CallFunc_IsReinforced_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced, CallFunc_GetNextReinforceInfo_ReturnValue) == 0x000008, "Member 'UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced::CallFunc_GetNextReinforceInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced, CallFunc_GetNeedErgo_ReturnValue) == 0x000018, "Member 'UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced::CallFunc_GetNeedErgo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced, CallFunc_GetCurrentErgo_ReturnValue) == 0x00001C, "Member 'UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced::CallFunc_GetCurrentErgo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced, CallFunc_GetNeedItemNum_ReturnValue) == 0x000020, "Member 'UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced::CallFunc_GetNeedItemNum_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000024, "Member 'UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced, CallFunc_GetNeedItemCodeName_ReturnValue) == 0x000028, "Member 'UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced::CallFunc_GetNeedItemCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced, K2Node_Event_ListItem) == 0x000030, "Member 'UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced::K2Node_Event_ListItem' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000038, "Member 'UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced, CallFunc_GetPlayerInventory_ReturnValue) == 0x000040, "Member 'UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced::CallFunc_GetPlayerInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced, CallFunc_GetItemTotalCountByCodeName_ReturnValue) == 0x000048, "Member 'UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced::CallFunc_GetItemTotalCountByCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced, CallFunc_GreaterEqual_IntInt_ReturnValue_1) == 0x00004C, "Member 'UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced::CallFunc_GreaterEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced, CallFunc_BooleanAND_ReturnValue) == 0x00004D, "Member 'UIW_ListItem_BladeReinforced_C_ExecuteUbergraph_UIW_ListItem_BladeReinforced::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function UIW_ListItem_BladeReinforced.UIW_ListItem_BladeReinforced_C.Set Item
// 0x0008 (0x0008 - 0x0000)
struct UIW_ListItem_BladeReinforced_C_Set_Item final
{
public:
	class UObject*                                ListItem;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ListItem_BladeReinforced_C_Set_Item) == 0x000008, "Wrong alignment on UIW_ListItem_BladeReinforced_C_Set_Item");
static_assert(sizeof(UIW_ListItem_BladeReinforced_C_Set_Item) == 0x000008, "Wrong size on UIW_ListItem_BladeReinforced_C_Set_Item");
static_assert(offsetof(UIW_ListItem_BladeReinforced_C_Set_Item, ListItem) == 0x000000, "Member 'UIW_ListItem_BladeReinforced_C_Set_Item::ListItem' has a wrong offset!");

}

