#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_CharacterDetailAbility

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_CharacterDetailAbility.UIW_CharacterDetailAbility_C
// 0x0178 (0x03E0 - 0x0268)
class UUIW_CharacterDetailAbility_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpacer*                                CharacterUpgrade_Space;                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Group_Base;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Group_Weight;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULListView*                             List_Attack;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULListView*                             List_Base;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULListView*                             List_Defence_0;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULListView*                             List_Defence_1;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULListView*                             List_Defence_2;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULListView*                             List_Normal_1;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULListView*                             List_Normal_2;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULListView*                             List_SlaveArm;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Page1;                                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Page2;                                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Page_Indicator_C*                  Page_Indicator;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer;                                            // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_SubTitle_C*                        SubTitle_Base;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_SubTitle_C*                        SubTitle_Defence;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_SubTitle_C*                        SubTitle_Normal;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_SubTitle_C*                        SubTitle_SlaveArm;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_SubTitle_C*                        SubTitle_Weapon;                                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Warning;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsUpgrade;                                         // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          EnabledPage;                                       // 0x0319(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          EnabledOnOff;                                      // 0x031A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_31B[0x1];                                      // 0x031B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentPage;                                       // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALPCCharacter*                          LPCCharacter;                                      // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULStatComponent*                        LStatComponent;                                    // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLSecondStatDiffData>           DiffList;                                          // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FLSecondStatDiffData>           Weapon1DiffList;                                   // 0x0340(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FLSecondStatDiffData>           Weapon2DiffList;                                   // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FLSecondStatDiffData>           Weapon3DiffList;                                   // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FLSecondStatDiffData>           SlaveArm1DiffList;                                 // 0x0370(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FLSecondStatDiffData>           SlaveArm2DiffList;                                 // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FLSecondStatDiffData>           SlaveArm3DiffList;                                 // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ULWeaponItem*                           Weapon1;                                           // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULWeaponItem*                           Weapon2;                                           // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULWeaponItem*                           Weapon3;                                           // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 SlaveArm;                                          // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 SlaveArm2;                                         // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 SlaveArm3;                                         // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_NextPage;                                      // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Weapon3Unlock;                                     // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SlaveArm2Unlock;                                   // 0x03D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          SlaveArm3Unlock;                                   // 0x03DA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UIW_CharacterDetailAbility(int32 EntryPoint);
	void Destruct();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void RefreshData(TArray<struct FLSecondStatDiffData>& DiffList_0, TArray<struct FLSecondStatDiffData>& Weapon1DiffList_0, TArray<struct FLSecondStatDiffData>& Weapon2DiffList_0, TArray<struct FLSecondStatDiffData>& Weapon3DiffList_0, TArray<struct FLSecondStatDiffData>& SlaveArm1DiffList_0, TArray<struct FLSecondStatDiffData>& SlaveArm2DiffList_0, TArray<struct FLSecondStatDiffData>& SlaveArm3DiffList_0);
	void RefreshPage1();
	void RefreshPage2();
	void NextPage();
	void OnChangeEquipItem(ELEquipSlotType EquipSlot, class ULItem* OldItem, class ULItem* NewItem);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void ResetPageIndicator();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_CharacterDetailAbility_C">();
	}
	static class UUIW_CharacterDetailAbility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_CharacterDetailAbility_C>();
	}
};
static_assert(alignof(UUIW_CharacterDetailAbility_C) == 0x000008, "Wrong alignment on UUIW_CharacterDetailAbility_C");
static_assert(sizeof(UUIW_CharacterDetailAbility_C) == 0x0003E0, "Wrong size on UUIW_CharacterDetailAbility_C");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, UberGraphFrame) == 0x000268, "Member 'UUIW_CharacterDetailAbility_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, CharacterUpgrade_Space) == 0x000270, "Member 'UUIW_CharacterDetailAbility_C::CharacterUpgrade_Space' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, Group_Base) == 0x000278, "Member 'UUIW_CharacterDetailAbility_C::Group_Base' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, Group_Weight) == 0x000280, "Member 'UUIW_CharacterDetailAbility_C::Group_Weight' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, List_Attack) == 0x000288, "Member 'UUIW_CharacterDetailAbility_C::List_Attack' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, List_Base) == 0x000290, "Member 'UUIW_CharacterDetailAbility_C::List_Base' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, List_Defence_0) == 0x000298, "Member 'UUIW_CharacterDetailAbility_C::List_Defence_0' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, List_Defence_1) == 0x0002A0, "Member 'UUIW_CharacterDetailAbility_C::List_Defence_1' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, List_Defence_2) == 0x0002A8, "Member 'UUIW_CharacterDetailAbility_C::List_Defence_2' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, List_Normal_1) == 0x0002B0, "Member 'UUIW_CharacterDetailAbility_C::List_Normal_1' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, List_Normal_2) == 0x0002B8, "Member 'UUIW_CharacterDetailAbility_C::List_Normal_2' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, List_SlaveArm) == 0x0002C0, "Member 'UUIW_CharacterDetailAbility_C::List_SlaveArm' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, Page1) == 0x0002C8, "Member 'UUIW_CharacterDetailAbility_C::Page1' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, Page2) == 0x0002D0, "Member 'UUIW_CharacterDetailAbility_C::Page2' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, Page_Indicator) == 0x0002D8, "Member 'UUIW_CharacterDetailAbility_C::Page_Indicator' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, Spacer) == 0x0002E0, "Member 'UUIW_CharacterDetailAbility_C::Spacer' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, SubTitle_Base) == 0x0002E8, "Member 'UUIW_CharacterDetailAbility_C::SubTitle_Base' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, SubTitle_Defence) == 0x0002F0, "Member 'UUIW_CharacterDetailAbility_C::SubTitle_Defence' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, SubTitle_Normal) == 0x0002F8, "Member 'UUIW_CharacterDetailAbility_C::SubTitle_Normal' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, SubTitle_SlaveArm) == 0x000300, "Member 'UUIW_CharacterDetailAbility_C::SubTitle_SlaveArm' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, SubTitle_Weapon) == 0x000308, "Member 'UUIW_CharacterDetailAbility_C::SubTitle_Weapon' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, Text_Warning) == 0x000310, "Member 'UUIW_CharacterDetailAbility_C::Text_Warning' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, IsUpgrade) == 0x000318, "Member 'UUIW_CharacterDetailAbility_C::IsUpgrade' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, EnabledPage) == 0x000319, "Member 'UUIW_CharacterDetailAbility_C::EnabledPage' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, EnabledOnOff) == 0x00031A, "Member 'UUIW_CharacterDetailAbility_C::EnabledOnOff' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, CurrentPage) == 0x00031C, "Member 'UUIW_CharacterDetailAbility_C::CurrentPage' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, LPCCharacter) == 0x000320, "Member 'UUIW_CharacterDetailAbility_C::LPCCharacter' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, LStatComponent) == 0x000328, "Member 'UUIW_CharacterDetailAbility_C::LStatComponent' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, DiffList) == 0x000330, "Member 'UUIW_CharacterDetailAbility_C::DiffList' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, Weapon1DiffList) == 0x000340, "Member 'UUIW_CharacterDetailAbility_C::Weapon1DiffList' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, Weapon2DiffList) == 0x000350, "Member 'UUIW_CharacterDetailAbility_C::Weapon2DiffList' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, Weapon3DiffList) == 0x000360, "Member 'UUIW_CharacterDetailAbility_C::Weapon3DiffList' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, SlaveArm1DiffList) == 0x000370, "Member 'UUIW_CharacterDetailAbility_C::SlaveArm1DiffList' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, SlaveArm2DiffList) == 0x000380, "Member 'UUIW_CharacterDetailAbility_C::SlaveArm2DiffList' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, SlaveArm3DiffList) == 0x000390, "Member 'UUIW_CharacterDetailAbility_C::SlaveArm3DiffList' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, Weapon1) == 0x0003A0, "Member 'UUIW_CharacterDetailAbility_C::Weapon1' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, Weapon2) == 0x0003A8, "Member 'UUIW_CharacterDetailAbility_C::Weapon2' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, Weapon3) == 0x0003B0, "Member 'UUIW_CharacterDetailAbility_C::Weapon3' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, SlaveArm) == 0x0003B8, "Member 'UUIW_CharacterDetailAbility_C::SlaveArm' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, SlaveArm2) == 0x0003C0, "Member 'UUIW_CharacterDetailAbility_C::SlaveArm2' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, SlaveArm3) == 0x0003C8, "Member 'UUIW_CharacterDetailAbility_C::SlaveArm3' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, Btn_NextPage) == 0x0003D0, "Member 'UUIW_CharacterDetailAbility_C::Btn_NextPage' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, Weapon3Unlock) == 0x0003D8, "Member 'UUIW_CharacterDetailAbility_C::Weapon3Unlock' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, SlaveArm2Unlock) == 0x0003D9, "Member 'UUIW_CharacterDetailAbility_C::SlaveArm2Unlock' has a wrong offset!");
static_assert(offsetof(UUIW_CharacterDetailAbility_C, SlaveArm3Unlock) == 0x0003DA, "Member 'UUIW_CharacterDetailAbility_C::SlaveArm3Unlock' has a wrong offset!");

}

