#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Quartz_Listbar

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Quartz_Listbar.UIW_Quartz_Listbar_C
// 0x0060 (0x02C8 - 0x0268)
class UUIW_Quartz_Listbar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_ListbarFx;                                     // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Img_Icon;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Fx_Listbar_C*                      Selected_1;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Info;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Title;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnFocused;                                         // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnDoubleClicked;                                   // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         SlotIndex;                                         // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELQuartzSlotStatusType                        SlotStatus;                                        // 0x02BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuartzEffectInfoPtr                   QuartzEffectInfo;                                  // 0x02C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void OnFocused__DelegateSignature(class UUIW_Quartz_Listbar_C* QuartzListBar);
	void OnDoubleClicked__DelegateSignature(class UUIW_Quartz_Listbar_C* QuartzListBar);
	void ExecuteUbergraph_UIW_Quartz_Listbar(int32 EntryPoint);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnMouseButtonDoubleClick(const struct FGeometry& InMyGeometry, const struct FPointerEvent& InMouseEvent);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void SetData(const struct FLQuartzSlot& SlotData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Quartz_Listbar_C">();
	}
	static class UUIW_Quartz_Listbar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Quartz_Listbar_C>();
	}
};
static_assert(alignof(UUIW_Quartz_Listbar_C) == 0x000008, "Wrong alignment on UUIW_Quartz_Listbar_C");
static_assert(sizeof(UUIW_Quartz_Listbar_C) == 0x0002C8, "Wrong size on UUIW_Quartz_Listbar_C");
static_assert(offsetof(UUIW_Quartz_Listbar_C, UberGraphFrame) == 0x000268, "Member 'UUIW_Quartz_Listbar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Listbar_C, Ani_ListbarFx) == 0x000270, "Member 'UUIW_Quartz_Listbar_C::Ani_ListbarFx' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Listbar_C, Img_Icon) == 0x000278, "Member 'UUIW_Quartz_Listbar_C::Img_Icon' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Listbar_C, Selected_1) == 0x000280, "Member 'UUIW_Quartz_Listbar_C::Selected_1' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Listbar_C, Text_Info) == 0x000288, "Member 'UUIW_Quartz_Listbar_C::Text_Info' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Listbar_C, Text_Title) == 0x000290, "Member 'UUIW_Quartz_Listbar_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Listbar_C, OnFocused) == 0x000298, "Member 'UUIW_Quartz_Listbar_C::OnFocused' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Listbar_C, OnDoubleClicked) == 0x0002A8, "Member 'UUIW_Quartz_Listbar_C::OnDoubleClicked' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Listbar_C, SlotIndex) == 0x0002B8, "Member 'UUIW_Quartz_Listbar_C::SlotIndex' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Listbar_C, SlotStatus) == 0x0002BC, "Member 'UUIW_Quartz_Listbar_C::SlotStatus' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Listbar_C, QuartzEffectInfo) == 0x0002C0, "Member 'UUIW_Quartz_Listbar_C::QuartzEffectInfo' has a wrong offset!");

}

