#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ListItem_Controller

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_ListItem_Controller.UIW_ListItem_Controller_C
// 0x0068 (0x0310 - 0x02A8)
class UUIW_ListItem_Controller_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Activation;                                    // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bg_Activation;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bg_Activation_Ani;                                 // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Group_BlankOverlap;                                // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_BlankBox;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Fx_Listbar_C*                      Selected;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListView*                              OwnerListView;                                     // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UListView*                              Tt;                                                // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_ListItem_Controller(int32 EntryPoint);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void Construct();
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();
	void SetMoveFocusEffect();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void SetSelected(bool IsSelected_0);
	void OnChanging(bool IsChanging);
	void OnOverlap(bool IsOverlap);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_ListItem_Controller_C">();
	}
	static class UUIW_ListItem_Controller_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_ListItem_Controller_C>();
	}
};
static_assert(alignof(UUIW_ListItem_Controller_C) == 0x000008, "Wrong alignment on UUIW_ListItem_Controller_C");
static_assert(sizeof(UUIW_ListItem_Controller_C) == 0x000310, "Wrong size on UUIW_ListItem_Controller_C");
static_assert(offsetof(UUIW_ListItem_Controller_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_ListItem_Controller_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Controller_C, Ani_Activation) == 0x0002B0, "Member 'UUIW_ListItem_Controller_C::Ani_Activation' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Controller_C, BG) == 0x0002B8, "Member 'UUIW_ListItem_Controller_C::BG' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Controller_C, Bg_Activation) == 0x0002C0, "Member 'UUIW_ListItem_Controller_C::Bg_Activation' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Controller_C, Bg_Activation_Ani) == 0x0002C8, "Member 'UUIW_ListItem_Controller_C::Bg_Activation_Ani' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Controller_C, Group_BlankOverlap) == 0x0002D0, "Member 'UUIW_ListItem_Controller_C::Group_BlankOverlap' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Controller_C, Icon) == 0x0002D8, "Member 'UUIW_ListItem_Controller_C::Icon' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Controller_C, Icon_BlankBox) == 0x0002E0, "Member 'UUIW_ListItem_Controller_C::Icon_BlankBox' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Controller_C, Selected) == 0x0002E8, "Member 'UUIW_ListItem_Controller_C::Selected' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Controller_C, Text) == 0x0002F0, "Member 'UUIW_ListItem_Controller_C::Text' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Controller_C, OwnerListView) == 0x0002F8, "Member 'UUIW_ListItem_Controller_C::OwnerListView' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Controller_C, IsSelected) == 0x000300, "Member 'UUIW_ListItem_Controller_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Controller_C, Tt) == 0x000308, "Member 'UUIW_ListItem_Controller_C::Tt' has a wrong offset!");

}

