#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_OnOffButton

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_OnOffButton.UIW_OnOffButton_C
// 0x00B8 (0x0360 - 0x02A8)
class UUIW_OnOffButton_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Btn_OFF;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Btn_ON;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_BG_Select_OFF;                                 // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_BG_Select_ON;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Fx_Btn_Bg_C*                       Select_OFF;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Fx_Btn_Bg_C*                       Select_ON;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_OFF;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ON;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnToggleStateChanged;                              // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsInit;                                            // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FLinearColor>        TextColor;                                         // 0x0310(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void OnToggleStateChanged__DelegateSignature(bool IsSelected_0);
	void ExecuteUbergraph_UIW_OnOffButton(int32 EntryPoint);
	void BndEvt__UIW_OnOffButton_Btn_OFF_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UIW_OnOffButton_Btn_ON_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UIW_OnOffButton_Btn_Right_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UIW_OnOffButton_Btn_Right_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UIW_OnOffButton_Btn_Left_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UIW_OnOffButton_Btn_Left_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	void GetToggle(bool* IsSelected_0);
	void SetToggle(bool IsSelected_0);
	void ReversedToggle();
	void ReturnToggle(bool IsSelected_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_OnOffButton_C">();
	}
	static class UUIW_OnOffButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_OnOffButton_C>();
	}
};
static_assert(alignof(UUIW_OnOffButton_C) == 0x000008, "Wrong alignment on UUIW_OnOffButton_C");
static_assert(sizeof(UUIW_OnOffButton_C) == 0x000360, "Wrong size on UUIW_OnOffButton_C");
static_assert(offsetof(UUIW_OnOffButton_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_OnOffButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_OnOffButton_C, Btn_OFF) == 0x0002B0, "Member 'UUIW_OnOffButton_C::Btn_OFF' has a wrong offset!");
static_assert(offsetof(UUIW_OnOffButton_C, Btn_ON) == 0x0002B8, "Member 'UUIW_OnOffButton_C::Btn_ON' has a wrong offset!");
static_assert(offsetof(UUIW_OnOffButton_C, Img_BG_Select_OFF) == 0x0002C0, "Member 'UUIW_OnOffButton_C::Img_BG_Select_OFF' has a wrong offset!");
static_assert(offsetof(UUIW_OnOffButton_C, Img_BG_Select_ON) == 0x0002C8, "Member 'UUIW_OnOffButton_C::Img_BG_Select_ON' has a wrong offset!");
static_assert(offsetof(UUIW_OnOffButton_C, Select_OFF) == 0x0002D0, "Member 'UUIW_OnOffButton_C::Select_OFF' has a wrong offset!");
static_assert(offsetof(UUIW_OnOffButton_C, Select_ON) == 0x0002D8, "Member 'UUIW_OnOffButton_C::Select_ON' has a wrong offset!");
static_assert(offsetof(UUIW_OnOffButton_C, Text_OFF) == 0x0002E0, "Member 'UUIW_OnOffButton_C::Text_OFF' has a wrong offset!");
static_assert(offsetof(UUIW_OnOffButton_C, Text_ON) == 0x0002E8, "Member 'UUIW_OnOffButton_C::Text_ON' has a wrong offset!");
static_assert(offsetof(UUIW_OnOffButton_C, IsSelected) == 0x0002F0, "Member 'UUIW_OnOffButton_C::IsSelected' has a wrong offset!");
static_assert(offsetof(UUIW_OnOffButton_C, OnToggleStateChanged) == 0x0002F8, "Member 'UUIW_OnOffButton_C::OnToggleStateChanged' has a wrong offset!");
static_assert(offsetof(UUIW_OnOffButton_C, IsInit) == 0x000308, "Member 'UUIW_OnOffButton_C::IsInit' has a wrong offset!");
static_assert(offsetof(UUIW_OnOffButton_C, TextColor) == 0x000310, "Member 'UUIW_OnOffButton_C::TextColor' has a wrong offset!");

}

