#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Gauge_Fx_Paralyze

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Gauge_Fx_Paralyze.UIW_Gauge_Fx_Paralyze_C
// 0x0038 (0x02A0 - 0x0268)
class UUIW_Gauge_Fx_Paralyze_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_End_Success;                                   // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_End_Fail;                                      // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Idle;                                          // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Start;                                         // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           Group_Paralyze;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       CurrentAnimation;                                  // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_Gauge_Fx_Paralyze(int32 EntryPoint);
	void WidgetAnimationEvt_Ani_Start_K2Node_WidgetAnimationEvent_0();
	void AnimParalize(int32 Phase);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Gauge_Fx_Paralyze_C">();
	}
	static class UUIW_Gauge_Fx_Paralyze_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Gauge_Fx_Paralyze_C>();
	}
};
static_assert(alignof(UUIW_Gauge_Fx_Paralyze_C) == 0x000008, "Wrong alignment on UUIW_Gauge_Fx_Paralyze_C");
static_assert(sizeof(UUIW_Gauge_Fx_Paralyze_C) == 0x0002A0, "Wrong size on UUIW_Gauge_Fx_Paralyze_C");
static_assert(offsetof(UUIW_Gauge_Fx_Paralyze_C, UberGraphFrame) == 0x000268, "Member 'UUIW_Gauge_Fx_Paralyze_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_Gauge_Fx_Paralyze_C, Ani_End_Success) == 0x000270, "Member 'UUIW_Gauge_Fx_Paralyze_C::Ani_End_Success' has a wrong offset!");
static_assert(offsetof(UUIW_Gauge_Fx_Paralyze_C, Ani_End_Fail) == 0x000278, "Member 'UUIW_Gauge_Fx_Paralyze_C::Ani_End_Fail' has a wrong offset!");
static_assert(offsetof(UUIW_Gauge_Fx_Paralyze_C, Ani_Idle) == 0x000280, "Member 'UUIW_Gauge_Fx_Paralyze_C::Ani_Idle' has a wrong offset!");
static_assert(offsetof(UUIW_Gauge_Fx_Paralyze_C, Ani_Start) == 0x000288, "Member 'UUIW_Gauge_Fx_Paralyze_C::Ani_Start' has a wrong offset!");
static_assert(offsetof(UUIW_Gauge_Fx_Paralyze_C, Group_Paralyze) == 0x000290, "Member 'UUIW_Gauge_Fx_Paralyze_C::Group_Paralyze' has a wrong offset!");
static_assert(offsetof(UUIW_Gauge_Fx_Paralyze_C, CurrentAnimation) == 0x000298, "Member 'UUIW_Gauge_Fx_Paralyze_C::CurrentAnimation' has a wrong offset!");

}

