#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Locker_Slot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Locker_Slot.UIW_Locker_Slot_C
// 0x0028 (0x0290 - 0x0268)
class UUIW_Locker_Slot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ULTileView*                             List_Item;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULTileView*                             List_Weapon;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_NoContents_C*                      NoContents;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListView*                              CurrentListView;                                   // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_Locker_Slot(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Locker_Slot_C">();
	}
	static class UUIW_Locker_Slot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Locker_Slot_C>();
	}
};
static_assert(alignof(UUIW_Locker_Slot_C) == 0x000008, "Wrong alignment on UUIW_Locker_Slot_C");
static_assert(sizeof(UUIW_Locker_Slot_C) == 0x000290, "Wrong size on UUIW_Locker_Slot_C");
static_assert(offsetof(UUIW_Locker_Slot_C, UberGraphFrame) == 0x000268, "Member 'UUIW_Locker_Slot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_Locker_Slot_C, List_Item) == 0x000270, "Member 'UUIW_Locker_Slot_C::List_Item' has a wrong offset!");
static_assert(offsetof(UUIW_Locker_Slot_C, List_Weapon) == 0x000278, "Member 'UUIW_Locker_Slot_C::List_Weapon' has a wrong offset!");
static_assert(offsetof(UUIW_Locker_Slot_C, NoContents) == 0x000280, "Member 'UUIW_Locker_Slot_C::NoContents' has a wrong offset!");
static_assert(offsetof(UUIW_Locker_Slot_C, CurrentListView) == 0x000288, "Member 'UUIW_Locker_Slot_C::CurrentListView' has a wrong offset!");

}

