#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_CharacterDetailAbility

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"
#include "UIST_FirstStatInfo_structs.hpp"
#include "ProjectP_structs.hpp"
#include "UIST_Float_structs.hpp"


namespace SDK::Params
{

// Function UIW_CharacterDetailAbility.UIW_CharacterDetailAbility_C.ExecuteUbergraph_UIW_CharacterDetailAbility
// 0x0268 (0x0268 - 0x0000)
struct UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALCharacter*                            K2Node_DynamicCast_AsLCharacter;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ELEquipSlotType EquipSlot, class ULItem* OldItem, class ULItem* NewItem)> K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue_1;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEquipItemSlot_bFound;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLEquipItemSlot                        CallFunc_GetEquipItemSlot_ReturnValue;             // 0x0088(0x0018)(NoDestructor)
	bool                                          CallFunc_GetEquipItemSlot_bFound_1;                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLEquipItemSlot                        CallFunc_GetEquipItemSlot_ReturnValue_1;           // 0x00A8(0x0018)(NoDestructor)
	class ULItem*                                 K2Node_Select_Default;                             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 K2Node_Select_Default_1;                           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 CallFunc_GetEquipItem_ReturnValue;                 // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetEquipItemSlot_bFound_2;                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLEquipItemSlot                        CallFunc_GetEquipItemSlot_ReturnValue_2;           // 0x00E0(0x0018)(NoDestructor)
	class ULItem*                                 CallFunc_GetEquipItem_ReturnValue_1;               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULWeaponItem*                           K2Node_DynamicCast_AsLWeapon_Item;                 // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULWeaponItem*                           K2Node_DynamicCast_AsLWeapon_Item_1;               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 CallFunc_GetEquipItem_ReturnValue_2;               // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULWeaponItem*                           K2Node_DynamicCast_AsLWeapon_Item_2;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0138(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x0170(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_2;         // 0x0188(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_3;         // 0x01D0(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_4;         // 0x0208(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0220(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_5;         // 0x0238(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_6;         // 0x0250(0x0018)()
};
static_assert(alignof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility) == 0x000008, "Wrong alignment on UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility");
static_assert(sizeof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility) == 0x000268, "Wrong size on UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, EntryPoint) == 0x000000, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, Temp_object_Variable) == 0x000008, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, Temp_bool_Variable) == 0x000010, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, Temp_object_Variable_1) == 0x000018, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000020, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, Temp_bool_Variable_1) == 0x000028, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, K2Node_DynamicCast_AsLCharacter) == 0x000030, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::K2Node_DynamicCast_AsLCharacter' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, K2Node_DynamicCast_AsLPCCharacter) == 0x000040, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::K2Node_DynamicCast_AsLPCCharacter' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, K2Node_Event_IsDesignTime) == 0x000049, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000050, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_GetPlayerEquipment_ReturnValue) == 0x000058, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_GetPlayerEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000060, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_GetPlayerEquipment_ReturnValue_1) == 0x000078, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_GetPlayerEquipment_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_GetEquipItemSlot_bFound) == 0x000080, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_GetEquipItemSlot_bFound' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_GetEquipItemSlot_ReturnValue) == 0x000088, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_GetEquipItemSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_GetEquipItemSlot_bFound_1) == 0x0000A0, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_GetEquipItemSlot_bFound_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_GetEquipItemSlot_ReturnValue_1) == 0x0000A8, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_GetEquipItemSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, K2Node_Select_Default) == 0x0000C0, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, K2Node_Select_Default_1) == 0x0000C8, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_GetEquipItem_ReturnValue) == 0x0000D0, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_GetEquipItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_GetEquipItemSlot_bFound_2) == 0x0000D8, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_GetEquipItemSlot_bFound_2' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_GetEquipItemSlot_ReturnValue_2) == 0x0000E0, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_GetEquipItemSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_GetEquipItem_ReturnValue_1) == 0x0000F8, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_GetEquipItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, K2Node_DynamicCast_AsLWeapon_Item) == 0x000100, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::K2Node_DynamicCast_AsLWeapon_Item' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, K2Node_DynamicCast_bSuccess_2) == 0x000108, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, K2Node_DynamicCast_AsLWeapon_Item_1) == 0x000110, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::K2Node_DynamicCast_AsLWeapon_Item_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, K2Node_DynamicCast_bSuccess_3) == 0x000118, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_GetEquipItem_ReturnValue_2) == 0x000120, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_GetEquipItem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, K2Node_DynamicCast_AsLWeapon_Item_2) == 0x000128, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::K2Node_DynamicCast_AsLWeapon_Item_2' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, K2Node_DynamicCast_bSuccess_4) == 0x000130, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_GetGameStrWithName_ReturnValue) == 0x000138, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_Conv_TextToString_ReturnValue) == 0x000150, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_Concat_StrStr_ReturnValue) == 0x000160, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_GetGameStrWithName_ReturnValue_1) == 0x000170, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_GetGameStrWithName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_GetGameStrWithName_ReturnValue_2) == 0x000188, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_GetGameStrWithName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0001A0, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_Conv_TextToString_ReturnValue_2) == 0x0001B0, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0001C0, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_GetGameStrWithName_ReturnValue_3) == 0x0001D0, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_GetGameStrWithName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0001E8, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0001F8, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_GetGameStrWithName_ReturnValue_4) == 0x000208, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_GetGameStrWithName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_Conv_StringToText_ReturnValue) == 0x000220, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_GetGameStrWithName_ReturnValue_5) == 0x000238, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_GetGameStrWithName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility, CallFunc_GetGameStrWithName_ReturnValue_6) == 0x000250, "Member 'UIW_CharacterDetailAbility_C_ExecuteUbergraph_UIW_CharacterDetailAbility::CallFunc_GetGameStrWithName_ReturnValue_6' has a wrong offset!");

// Function UIW_CharacterDetailAbility.UIW_CharacterDetailAbility_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UIW_CharacterDetailAbility_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_CharacterDetailAbility_C_PreConstruct) == 0x000001, "Wrong alignment on UIW_CharacterDetailAbility_C_PreConstruct");
static_assert(sizeof(UIW_CharacterDetailAbility_C_PreConstruct) == 0x000001, "Wrong size on UIW_CharacterDetailAbility_C_PreConstruct");
static_assert(offsetof(UIW_CharacterDetailAbility_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UIW_CharacterDetailAbility_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UIW_CharacterDetailAbility.UIW_CharacterDetailAbility_C.RefreshData
// 0x00A0 (0x00A0 - 0x0000)
struct UIW_CharacterDetailAbility_C_RefreshData final
{
public:
	TArray<struct FLSecondStatDiffData>           DiffList_0;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FLSecondStatDiffData>           Weapon1DiffList_0;                                 // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FLSecondStatDiffData>           Weapon2DiffList_0;                                 // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FLSecondStatDiffData>           Weapon3DiffList_0;                                 // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FLSecondStatDiffData>           SlaveArm1DiffList_0;                               // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FLSecondStatDiffData>           SlaveArm2DiffList_0;                               // 0x0050(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FLSecondStatDiffData>           SlaveArm3DiffList_0;                               // 0x0060(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<ELFirstStat>                           LocalChaUpPreviewStat;                             // 0x0070(0x0010)(Edit, BlueprintVisible)
	TArray<class UUIBP_ListData_ThreeStat_C*>     LocalThreeStatList;                                // 0x0080(0x0010)(Edit, BlueprintVisible)
	TArray<class UUIBP_ListData_OneStat_C*>       LocalOneStatList;                                  // 0x0090(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(UIW_CharacterDetailAbility_C_RefreshData) == 0x000008, "Wrong alignment on UIW_CharacterDetailAbility_C_RefreshData");
static_assert(sizeof(UIW_CharacterDetailAbility_C_RefreshData) == 0x0000A0, "Wrong size on UIW_CharacterDetailAbility_C_RefreshData");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshData, DiffList_0) == 0x000000, "Member 'UIW_CharacterDetailAbility_C_RefreshData::DiffList_0' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshData, Weapon1DiffList_0) == 0x000010, "Member 'UIW_CharacterDetailAbility_C_RefreshData::Weapon1DiffList_0' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshData, Weapon2DiffList_0) == 0x000020, "Member 'UIW_CharacterDetailAbility_C_RefreshData::Weapon2DiffList_0' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshData, Weapon3DiffList_0) == 0x000030, "Member 'UIW_CharacterDetailAbility_C_RefreshData::Weapon3DiffList_0' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshData, SlaveArm1DiffList_0) == 0x000040, "Member 'UIW_CharacterDetailAbility_C_RefreshData::SlaveArm1DiffList_0' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshData, SlaveArm2DiffList_0) == 0x000050, "Member 'UIW_CharacterDetailAbility_C_RefreshData::SlaveArm2DiffList_0' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshData, SlaveArm3DiffList_0) == 0x000060, "Member 'UIW_CharacterDetailAbility_C_RefreshData::SlaveArm3DiffList_0' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshData, LocalChaUpPreviewStat) == 0x000070, "Member 'UIW_CharacterDetailAbility_C_RefreshData::LocalChaUpPreviewStat' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshData, LocalThreeStatList) == 0x000080, "Member 'UIW_CharacterDetailAbility_C_RefreshData::LocalThreeStatList' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshData, LocalOneStatList) == 0x000090, "Member 'UIW_CharacterDetailAbility_C_RefreshData::LocalOneStatList' has a wrong offset!");

// Function UIW_CharacterDetailAbility.UIW_CharacterDetailAbility_C.RefreshPage1
// 0x0550 (0x0550 - 0x0000)
struct UIW_CharacterDetailAbility_C_RefreshPage1 final
{
public:
	TArray<ELFirstStat>                           LocalChaUpPreviewStat;                             // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<class UUIBP_ListData_TwoStat_C*>       LocalTwoStatList;                                  // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<class UUIBP_ListData_OneStat_C*>       LocalOneStatList;                                  // 0x0020(0x0010)(Edit, BlueprintVisible)
	struct FUIST_Float                            CallFunc_GetDataTableRowFromName_OutRow;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetStatDiff_IsDiff;                       // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetStatDiff_Diff_Value;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharacterStat_ReturnValue;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeightPenaltyInfoPtr                  CallFunc_GetWeightPenaltyInGivenMaxWeight_ReturnValue; // 0x0058(0x0008)(NoDestructor)
	int32                                         CallFunc_GetCharacterStat_ReturnValue_1;           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPanaltyAbnormalstate_ReturnValue;      // 0x0064(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0070(0x0018)()
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetWaringMsg_ReturnValue;                 // 0x008C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0098(0x0018)()
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue;                  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ELFirstStat, struct FUIST_FirstStatInfo> CallFunc_GetFirstStatInfo_FirstStatInfo;           // 0x00C0(0x0050)()
	TMap<ELFirstStat, struct FUIST_FirstStatInfo> CallFunc_GetFirstStatInfo_FirstStatInfo_1;         // 0x0110(0x0050)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x0160(0x0018)()
	TArray<ELFirstStat>                           CallFunc_Map_Keys_Keys;                            // 0x0178(0x0010)(ReferenceParm)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_2;         // 0x0188(0x0018)()
	ELFirstStat                                   CallFunc_Array_Get_Item;                           // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFirstStat_ReturnValue;                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x01B0(0x0018)()
	struct FUIST_FirstStatInfo                    CallFunc_Map_Find_Value;                           // 0x01C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_3;         // 0x01E0(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_4;         // 0x01F8(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_5;         // 0x0210(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_6;         // 0x0228(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_7;         // 0x0240(0x0018)()
	TArray<ELFirstStat>                           K2Node_MakeArray_Array;                            // 0x0258(0x0010)(ReferenceParm)
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_1;                // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0278(0x0028)()
	class UUIBP_ListData_TwoStat_C*               CallFunc_SpawnObject_ReturnValue_2;                // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetStatDiff_IsDiff_1;                     // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetStatDiff_Diff_Value_1;                 // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharacterStat_ReturnValue_2;           // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharacterStat_ReturnValue_3;           // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeValueText_Text;                       // 0x02C0(0x0018)()
	class FText                                   CallFunc_MakeValueText_Text_1;                     // 0x02D8(0x0018)()
	TArray<ELFirstStat>                           K2Node_MakeArray_Array_1;                          // 0x02F0(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetStatDiff_IsDiff_2;                     // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetStatDiff_Diff_Value_2;                 // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<ELFirstStat>                           K2Node_MakeArray_Array_2;                          // 0x0308(0x0010)(ReferenceParm)
	TArray<ELFirstStat>                           K2Node_MakeArray_Array_3;                          // 0x0318(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetStatDiff_IsDiff_3;                     // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetStatDiff_Diff_Value_3;                 // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetStatDiff_IsDiff_4;                     // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetStatDiff_Diff_Value_4;                 // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetStatDiff_IsDiff_5;                     // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x3];                                      // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetStatDiff_Diff_Value_5;                 // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<ELFirstStat>                           K2Node_MakeArray_Array_4;                          // 0x0340(0x0010)(ReferenceParm)
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_3;                // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharacterStat_ReturnValue_4;           // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0360(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharacterStat_ReturnValue_5;           // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0368(0x0028)()
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0398(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x03B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x03C8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x03E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x03F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0400(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0410(0x0018)()
	class UUIBP_ListData_TwoStat_C*               CallFunc_SpawnObject_ReturnValue_4;                // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_TwoStat_C*               CallFunc_SpawnObject_ReturnValue_5;                // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x043C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0440(0x0028)()
	class UUIBP_ListData_TwoStat_C*               CallFunc_SpawnObject_ReturnValue_6;                // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_6;                  // 0x0470(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharacterStat_ReturnValue_6;           // 0x0474(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharacterStat_ReturnValue_7;           // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_484[0x4];                                      // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0488(0x0018)()
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharacterStat_ReturnValue_8;           // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AC[0x4];                                      // 0x04AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_1;           // 0x04B0(0x0018)()
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharacterStat_ReturnValue_9;           // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D4[0x4];                                      // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue_2;           // 0x04D8(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x04F0(0x0018)()
	class FName                                   Temp_name_Variable;                                // 0x0508(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharacterStat_ReturnValue_10;          // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0514(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCharacterStat_ReturnValue_11;          // 0x0518(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51C[0x4];                                      // 0x051C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_4;             // 0x0520(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_5;             // 0x0538(0x0018)()
};
static_assert(alignof(UIW_CharacterDetailAbility_C_RefreshPage1) == 0x000008, "Wrong alignment on UIW_CharacterDetailAbility_C_RefreshPage1");
static_assert(sizeof(UIW_CharacterDetailAbility_C_RefreshPage1) == 0x000550, "Wrong size on UIW_CharacterDetailAbility_C_RefreshPage1");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, LocalChaUpPreviewStat) == 0x000000, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::LocalChaUpPreviewStat' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, LocalTwoStatList) == 0x000010, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::LocalTwoStatList' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, LocalOneStatList) == 0x000020, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::LocalOneStatList' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_GetDataTableRowFromName_OutRow) == 0x000030, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000034, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, Temp_int_Array_Index_Variable) == 0x000038, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_GetStatDiff_IsDiff) == 0x000044, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_GetStatDiff_IsDiff' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_GetStatDiff_Diff_Value) == 0x000048, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_GetStatDiff_Diff_Value' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_GetCharacterStat_ReturnValue) == 0x00004C, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_GetCharacterStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_Add_IntInt_ReturnValue_1) == 0x000050, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_GetWeightPenaltyInGivenMaxWeight_ReturnValue) == 0x000058, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_GetWeightPenaltyInGivenMaxWeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_GetCharacterStat_ReturnValue_1) == 0x000060, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_GetCharacterStat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_GetPanaltyAbnormalstate_ReturnValue) == 0x000064, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_GetPanaltyAbnormalstate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_Conv_IntToText_ReturnValue) == 0x000070, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, K2Node_SwitchName_CmpSuccess) == 0x000088, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_GetWaringMsg_ReturnValue) == 0x00008C, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_GetWaringMsg_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_GetGameStrWithName_ReturnValue) == 0x000098, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_SpawnObject_ReturnValue) == 0x0000B0, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_Array_Add_ReturnValue) == 0x0000B8, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_GetFirstStatInfo_FirstStatInfo) == 0x0000C0, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_GetFirstStatInfo_FirstStatInfo' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_GetFirstStatInfo_FirstStatInfo_1) == 0x000110, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_GetFirstStatInfo_FirstStatInfo_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_GetGameStrWithName_ReturnValue_1) == 0x000160, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_GetGameStrWithName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_Map_Keys_Keys) == 0x000178, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_GetGameStrWithName_ReturnValue_2) == 0x000188, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_GetGameStrWithName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_Array_Get_Item) == 0x0001A0, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_Array_Length_ReturnValue) == 0x0001A4, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_GetFirstStat_ReturnValue) == 0x0001A8, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_GetFirstStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_Less_IntInt_ReturnValue) == 0x0001AC, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0001B0, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_Map_Find_Value) == 0x0001C8, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_Map_Find_ReturnValue) == 0x0001D8, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_GetGameStrWithName_ReturnValue_3) == 0x0001E0, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_GetGameStrWithName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_GetGameStrWithName_ReturnValue_4) == 0x0001F8, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_GetGameStrWithName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_GetGameStrWithName_ReturnValue_5) == 0x000210, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_GetGameStrWithName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_GetGameStrWithName_ReturnValue_6) == 0x000228, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_GetGameStrWithName_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_GetGameStrWithName_ReturnValue_7) == 0x000240, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_GetGameStrWithName_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, K2Node_MakeArray_Array) == 0x000258, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_SpawnObject_ReturnValue_1) == 0x000268, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, CallFunc_Array_Add_ReturnValue_1) == 0x000270, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_CharacterDetailAbility_C_RefreshPage1, K2Node_MakeStruct_SlateColor) == 0x000278, "Member 'UIW_CharacterDetailAbility_C_RefreshPage1::K2Node_MakeStruct_SlateColor' has a wrong offset!");
