#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Window

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Window.UIW_Window_C
// 0x00A8 (0x0350 - 0x02A8)
class UUIW_Window_C : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsEnabledWindow;                                   // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        ArrEnabledList;                                    // 0x02B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FName                                   WidgetRowName;                                     // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class FText>                ContextMenuList;                                   // 0x02D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FDataTableRowHandle                    OpenSound;                                         // 0x0320(0x0010)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)
	struct FDataTableRowHandle                    CloseSound;                                        // 0x0330(0x0010)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)
	struct FVector2D                              ContextMenuPosition;                               // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsClosing;                                         // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsMouseDown;                                       // 0x0349(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UIW_Window(int32 EntryPoint);
	void Destruct();
	void Construct();
	void OnReady();
	void SetEnabledWindow(bool IsEnabled);
	struct FEventReply FocusManage(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void RequestCloseWindow();
	void Request_Open_Context_Menu(const struct FVector2D& Position);
	void CallbackContextMenu(class FName EventName);
	void AddEventBinding();
	void ClearEventBinding();
	void OnCompleteTweenEvent(class FName Name_0);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Window_C">();
	}
	static class UUIW_Window_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Window_C>();
	}
};
static_assert(alignof(UUIW_Window_C) == 0x000008, "Wrong alignment on UUIW_Window_C");
static_assert(sizeof(UUIW_Window_C) == 0x000350, "Wrong size on UUIW_Window_C");
static_assert(offsetof(UUIW_Window_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_Window_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_Window_C, IsEnabledWindow) == 0x0002B0, "Member 'UUIW_Window_C::IsEnabledWindow' has a wrong offset!");
static_assert(offsetof(UUIW_Window_C, ArrEnabledList) == 0x0002B8, "Member 'UUIW_Window_C::ArrEnabledList' has a wrong offset!");
static_assert(offsetof(UUIW_Window_C, WidgetRowName) == 0x0002C8, "Member 'UUIW_Window_C::WidgetRowName' has a wrong offset!");
static_assert(offsetof(UUIW_Window_C, ContextMenuList) == 0x0002D0, "Member 'UUIW_Window_C::ContextMenuList' has a wrong offset!");
static_assert(offsetof(UUIW_Window_C, OpenSound) == 0x000320, "Member 'UUIW_Window_C::OpenSound' has a wrong offset!");
static_assert(offsetof(UUIW_Window_C, CloseSound) == 0x000330, "Member 'UUIW_Window_C::CloseSound' has a wrong offset!");
static_assert(offsetof(UUIW_Window_C, ContextMenuPosition) == 0x000340, "Member 'UUIW_Window_C::ContextMenuPosition' has a wrong offset!");
static_assert(offsetof(UUIW_Window_C, IsClosing) == 0x000348, "Member 'UUIW_Window_C::IsClosing' has a wrong offset!");
static_assert(offsetof(UUIW_Window_C, IsMouseDown) == 0x000349, "Member 'UUIW_Window_C::IsMouseDown' has a wrong offset!");

}

