#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ListItem_SaveData

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_ListItem_SaveData.UIW_ListItem_SaveData_C
// 0x00C0 (0x0368 - 0x02A8)
class UUIW_ListItem_SaveData_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border;                                            // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Group_Hovered;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Group_Round;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Latest;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Map;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Selected;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Paper_Round_2;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Paper_Round_3;                                     // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Paper_Round_4;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Slot_Blank;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Level;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_LevelValue;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Location;                                     // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PlayTime;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PlayTimeValue;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Round;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_SaveTime;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_SlotNum;                                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListView*                              OwnerListView;                                     // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UImage*>                         RoundImg;                                          // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         Int;                                               // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x0364(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UIW_ListItem_SaveData(int32 EntryPoint);
	void Destruct();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void Construct();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();
	void SetMoveFocusEffect();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_ListItem_SaveData_C">();
	}
	static class UUIW_ListItem_SaveData_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_ListItem_SaveData_C>();
	}
};
static_assert(alignof(UUIW_ListItem_SaveData_C) == 0x000008, "Wrong alignment on UUIW_ListItem_SaveData_C");
static_assert(sizeof(UUIW_ListItem_SaveData_C) == 0x000368, "Wrong size on UUIW_ListItem_SaveData_C");
static_assert(offsetof(UUIW_ListItem_SaveData_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_ListItem_SaveData_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_SaveData_C, Border) == 0x0002B0, "Member 'UUIW_ListItem_SaveData_C::Border' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_SaveData_C, CanvasPanel) == 0x0002B8, "Member 'UUIW_ListItem_SaveData_C::CanvasPanel' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_SaveData_C, Group_Hovered) == 0x0002C0, "Member 'UUIW_ListItem_SaveData_C::Group_Hovered' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_SaveData_C, Group_Round) == 0x0002C8, "Member 'UUIW_ListItem_SaveData_C::Group_Round' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_SaveData_C, Img_Latest) == 0x0002D0, "Member 'UUIW_ListItem_SaveData_C::Img_Latest' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_SaveData_C, Img_Map) == 0x0002D8, "Member 'UUIW_ListItem_SaveData_C::Img_Map' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_SaveData_C, Img_Selected) == 0x0002E0, "Member 'UUIW_ListItem_SaveData_C::Img_Selected' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_SaveData_C, Paper_Round_2) == 0x0002E8, "Member 'UUIW_ListItem_SaveData_C::Paper_Round_2' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_SaveData_C, Paper_Round_3) == 0x0002F0, "Member 'UUIW_ListItem_SaveData_C::Paper_Round_3' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_SaveData_C, Paper_Round_4) == 0x0002F8, "Member 'UUIW_ListItem_SaveData_C::Paper_Round_4' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_SaveData_C, Slot_Blank) == 0x000300, "Member 'UUIW_ListItem_SaveData_C::Slot_Blank' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_SaveData_C, Text_Level) == 0x000308, "Member 'UUIW_ListItem_SaveData_C::Text_Level' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_SaveData_C, Text_LevelValue) == 0x000310, "Member 'UUIW_ListItem_SaveData_C::Text_LevelValue' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_SaveData_C, Text_Location) == 0x000318, "Member 'UUIW_ListItem_SaveData_C::Text_Location' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_SaveData_C, Text_PlayTime) == 0x000320, "Member 'UUIW_ListItem_SaveData_C::Text_PlayTime' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_SaveData_C, Text_PlayTimeValue) == 0x000328, "Member 'UUIW_ListItem_SaveData_C::Text_PlayTimeValue' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_SaveData_C, Text_Round) == 0x000330, "Member 'UUIW_ListItem_SaveData_C::Text_Round' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_SaveData_C, Text_SaveTime) == 0x000338, "Member 'UUIW_ListItem_SaveData_C::Text_SaveTime' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_SaveData_C, Text_SlotNum) == 0x000340, "Member 'UUIW_ListItem_SaveData_C::Text_SlotNum' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_SaveData_C, OwnerListView) == 0x000348, "Member 'UUIW_ListItem_SaveData_C::OwnerListView' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_SaveData_C, RoundImg) == 0x000350, "Member 'UUIW_ListItem_SaveData_C::RoundImg' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_SaveData_C, Int) == 0x000360, "Member 'UUIW_ListItem_SaveData_C::Int' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_SaveData_C, IsSelected) == 0x000364, "Member 'UUIW_ListItem_SaveData_C::IsSelected' has a wrong offset!");

}

