#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ActionType

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UIW_ActionType.UIW_ActionType_C.OnSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_ActionType_C_OnSelected__DelegateSignature final
{
public:
	class UUIW_ActionType_C*                      ActionType;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_ActionType_C_OnSelected__DelegateSignature) == 0x000008, "Wrong alignment on UIW_ActionType_C_OnSelected__DelegateSignature");
static_assert(sizeof(UIW_ActionType_C_OnSelected__DelegateSignature) == 0x000008, "Wrong size on UIW_ActionType_C_OnSelected__DelegateSignature");
static_assert(offsetof(UIW_ActionType_C_OnSelected__DelegateSignature, ActionType) == 0x000000, "Member 'UIW_ActionType_C_OnSelected__DelegateSignature::ActionType' has a wrong offset!");

// Function UIW_ActionType.UIW_ActionType_C.ExecuteUbergraph_UIW_ActionType
// 0x0140 (0x0140 - 0x0000)
struct UIW_ActionType_C_ExecuteUbergraph_UIW_ActionType final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0004(0x0008)(NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x000C(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0048(0x0070)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00C0(0x0070)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ActionType_C_ExecuteUbergraph_UIW_ActionType) == 0x000008, "Wrong alignment on UIW_ActionType_C_ExecuteUbergraph_UIW_ActionType");
static_assert(sizeof(UIW_ActionType_C_ExecuteUbergraph_UIW_ActionType) == 0x000140, "Wrong size on UIW_ActionType_C_ExecuteUbergraph_UIW_ActionType");
static_assert(offsetof(UIW_ActionType_C_ExecuteUbergraph_UIW_ActionType, EntryPoint) == 0x000000, "Member 'UIW_ActionType_C_ExecuteUbergraph_UIW_ActionType::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_ExecuteUbergraph_UIW_ActionType, K2Node_Event_InFocusEvent) == 0x000004, "Member 'UIW_ActionType_C_ExecuteUbergraph_UIW_ActionType::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_ExecuteUbergraph_UIW_ActionType, K2Node_Event_MyGeometry) == 0x00000C, "Member 'UIW_ActionType_C_ExecuteUbergraph_UIW_ActionType::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_ExecuteUbergraph_UIW_ActionType, K2Node_Event_MouseEvent_1) == 0x000048, "Member 'UIW_ActionType_C_ExecuteUbergraph_UIW_ActionType::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_ExecuteUbergraph_UIW_ActionType, CallFunc_PlayAnimation_ReturnValue) == 0x0000B8, "Member 'UIW_ActionType_C_ExecuteUbergraph_UIW_ActionType::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_ExecuteUbergraph_UIW_ActionType, K2Node_Event_MouseEvent) == 0x0000C0, "Member 'UIW_ActionType_C_ExecuteUbergraph_UIW_ActionType::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_ExecuteUbergraph_UIW_ActionType, CallFunc_PlayAnimation_ReturnValue_1) == 0x000130, "Member 'UIW_ActionType_C_ExecuteUbergraph_UIW_ActionType::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_ExecuteUbergraph_UIW_ActionType, CallFunc_IsVisible_ReturnValue) == 0x000138, "Member 'UIW_ActionType_C_ExecuteUbergraph_UIW_ActionType::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_ExecuteUbergraph_UIW_ActionType, CallFunc_IsVisible_ReturnValue_1) == 0x000139, "Member 'UIW_ActionType_C_ExecuteUbergraph_UIW_ActionType::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");

// Function UIW_ActionType.UIW_ActionType_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct UIW_ActionType_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIW_ActionType_C_OnMouseLeave) == 0x000008, "Wrong alignment on UIW_ActionType_C_OnMouseLeave");
static_assert(sizeof(UIW_ActionType_C_OnMouseLeave) == 0x000070, "Wrong size on UIW_ActionType_C_OnMouseLeave");
static_assert(offsetof(UIW_ActionType_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'UIW_ActionType_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function UIW_ActionType.UIW_ActionType_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct UIW_ActionType_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(UIW_ActionType_C_OnMouseEnter) == 0x000008, "Wrong alignment on UIW_ActionType_C_OnMouseEnter");
static_assert(sizeof(UIW_ActionType_C_OnMouseEnter) == 0x0000A8, "Wrong size on UIW_ActionType_C_OnMouseEnter");
static_assert(offsetof(UIW_ActionType_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'UIW_ActionType_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'UIW_ActionType_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function UIW_ActionType.UIW_ActionType_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct UIW_ActionType_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(UIW_ActionType_C_OnFocusLost) == 0x000004, "Wrong alignment on UIW_ActionType_C_OnFocusLost");
static_assert(sizeof(UIW_ActionType_C_OnFocusLost) == 0x000008, "Wrong size on UIW_ActionType_C_OnFocusLost");
static_assert(offsetof(UIW_ActionType_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'UIW_ActionType_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function UIW_ActionType.UIW_ActionType_C.OnFocusReceived
// 0x01E0 (0x01E0 - 0x0000)
struct UIW_ActionType_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0114(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0128(0x00B8)()
};
static_assert(alignof(UIW_ActionType_C_OnFocusReceived) == 0x000008, "Wrong alignment on UIW_ActionType_C_OnFocusReceived");
static_assert(sizeof(UIW_ActionType_C_OnFocusReceived) == 0x0001E0, "Wrong size on UIW_ActionType_C_OnFocusReceived");
static_assert(offsetof(UIW_ActionType_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'UIW_ActionType_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'UIW_ActionType_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'UIW_ActionType_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_OnFocusReceived, CallFunc_GetLocalSize_ReturnValue) == 0x0000F8, "Member 'UIW_ActionType_C_OnFocusReceived::CallFunc_GetLocalSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_OnFocusReceived, CallFunc_GetMainWidget_MainWidget) == 0x000100, "Member 'UIW_ActionType_C_OnFocusReceived::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_OnFocusReceived, CallFunc_BreakVector2D_X) == 0x000108, "Member 'UIW_ActionType_C_OnFocusReceived::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_OnFocusReceived, CallFunc_BreakVector2D_Y) == 0x00010C, "Member 'UIW_ActionType_C_OnFocusReceived::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_OnFocusReceived, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000110, "Member 'UIW_ActionType_C_OnFocusReceived::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_OnFocusReceived, CallFunc_MakeVector2D_ReturnValue) == 0x000114, "Member 'UIW_ActionType_C_OnFocusReceived::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_OnFocusReceived, CallFunc_PlayAnimation_ReturnValue) == 0x000120, "Member 'UIW_ActionType_C_OnFocusReceived::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x000128, "Member 'UIW_ActionType_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function UIW_ActionType.UIW_ActionType_C.SetData
// 0x04D8 (0x04D8 - 0x0000)
struct UIW_ActionType_C_SetData final
{
public:
	class FName                                   TypeName_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemCommonInfoPtr                     LocalHandleInfo;                                   // 0x0008(0x0008)(Edit, BlueprintVisible, NoDestructor)
	struct FItemCommonInfoPtr                     LocalBladeInfo;                                    // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor)
	TArray<ELFirstStat>                           LocalChaUpPreviewStat;                             // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<class UUIBP_ListData_OneStat_C*>       LocalOneStatList;                                  // 0x0028(0x0010)(Edit, BlueprintVisible)
	class UTexture2D*                             LocaTexure;                                        // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LocalDesc;                                         // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LocalTitle;                                        // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_GetImageResource_ReturnValue;             // 0x0050(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_GetImageResource_ReturnValue_1;           // 0x0078(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_GetAdvance_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00A8(0x0018)()
	int32                                         CallFunc_GetTechnique_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x00C8(0x0018)()
	int32                                         CallFunc_GetMotivity_ReturnValue;                  // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x00E8(0x0018)()
	int32                                         CallFunc_GetCapacity_ReturnValue;                  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x0108(0x0018)()
	int32                                         CallFunc_GetVigor_ReturnValue;                     // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_4;             // 0x0128(0x0018)()
	int32                                         CallFunc_GetVitality_ReturnValue;                  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_5;             // 0x0148(0x0018)()
	struct FDefaultStatInfoPtr                    CallFunc_FindDefaultStatInfoByNameBP_ReturnValue;  // 0x0160(0x0008)(NoDestructor)
	int32                                         CallFunc_GetCharacterStat_ReturnValue;             // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_6;             // 0x0170(0x0018)()
	int32                                         CallFunc_GetCharacterStat_ReturnValue_1;           // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_7;             // 0x0190(0x0018)()
	int32                                         CallFunc_GetCharacterStat_ReturnValue_2;           // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeValueText_Text;                       // 0x01B0(0x0018)()
	int32                                         CallFunc_GetCharacterStat_ReturnValue_3;           // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_8;             // 0x01D0(0x0018)()
	int32                                         CallFunc_GetCharacterStat_ReturnValue_4;           // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_9;             // 0x01F0(0x0018)()
	int32                                         CallFunc_GetCharacterStat_ReturnValue_5;           // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_10;            // 0x0210(0x0018)()
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0230(0x0018)()
	class ALPCCharacter*                          K2Node_DynamicCast_AsLPCCharacter;                 // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x0258(0x0018)()
	class ULStatComponent*                        CallFunc_GetDefaultStatComponent_ReturnValue;      // 0x0270(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_2;         // 0x0278(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_3;         // 0x0290(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_4;         // 0x02A8(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_5;         // 0x02C0(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_6;         // 0x02D8(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_7;         // 0x02F0(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_8;         // 0x0308(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_9;         // 0x0320(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_10;        // 0x0338(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_11;        // 0x0350(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_12;        // 0x0368(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_13;        // 0x0380(0x0018)()
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue;                  // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_1;                // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_2;                // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C4[0x4];                                      // 0x03C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_3;                // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_4;                // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x03E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_5;                // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x03F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_6;                // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_6;                  // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_7;                // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_7;                  // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_8;                // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_8;                  // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_9;                // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_9;                  // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_10;               // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_10;                 // 0x0440(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_OneStat_C*               CallFunc_SpawnObject_ReturnValue_11;               // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULCommonConstantValues*                 CallFunc_GetConstantValues_ReturnValue;            // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPCActionTypeHnd3_ReturnValue;          // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPCActionTypeHnd2_ReturnValue;          // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemCommonInfoPtr                     CallFunc_FindItemCommonInfoByNameBP_ReturnValue;   // 0x0470(0x0008)(NoDestructor)
	struct FItemCommonInfoPtr                     CallFunc_FindItemCommonInfoByNameBP_ReturnValue_1; // 0x0478(0x0008)(NoDestructor)
	class FName                                   CallFunc_GetPCActionTypeHnd1_ReturnValue;          // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPCActionTypeBld3_ReturnValue;          // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemCommonInfoPtr                     CallFunc_FindItemCommonInfoByNameBP_ReturnValue_2; // 0x0490(0x0008)(NoDestructor)
	struct FItemCommonInfoPtr                     CallFunc_FindItemCommonInfoByNameBP_ReturnValue_3; // 0x0498(0x0008)(NoDestructor)
	class FName                                   CallFunc_GetPCActionTypeBld2_ReturnValue;          // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetPCActionTypeBld1_ReturnValue;          // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemCommonInfoPtr                     CallFunc_FindItemCommonInfoByNameBP_ReturnValue_4; // 0x04B0(0x0008)(NoDestructor)
	struct FItemCommonInfoPtr                     CallFunc_FindItemCommonInfoByNameBP_ReturnValue_5; // 0x04B8(0x0008)(NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue_11;                 // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ActionType_C_SetData) == 0x000008, "Wrong alignment on UIW_ActionType_C_SetData");
static_assert(sizeof(UIW_ActionType_C_SetData) == 0x0004D8, "Wrong size on UIW_ActionType_C_SetData");
static_assert(offsetof(UIW_ActionType_C_SetData, TypeName_0) == 0x000000, "Member 'UIW_ActionType_C_SetData::TypeName_0' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, LocalHandleInfo) == 0x000008, "Member 'UIW_ActionType_C_SetData::LocalHandleInfo' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, LocalBladeInfo) == 0x000010, "Member 'UIW_ActionType_C_SetData::LocalBladeInfo' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, LocalChaUpPreviewStat) == 0x000018, "Member 'UIW_ActionType_C_SetData::LocalChaUpPreviewStat' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, LocalOneStatList) == 0x000028, "Member 'UIW_ActionType_C_SetData::LocalOneStatList' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, LocaTexure) == 0x000038, "Member 'UIW_ActionType_C_SetData::LocaTexure' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, LocalDesc) == 0x000040, "Member 'UIW_ActionType_C_SetData::LocalDesc' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, LocalTitle) == 0x000048, "Member 'UIW_ActionType_C_SetData::LocalTitle' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetImageResource_ReturnValue) == 0x000050, "Member 'UIW_ActionType_C_SetData::CallFunc_GetImageResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetImageResource_ReturnValue_1) == 0x000078, "Member 'UIW_ActionType_C_SetData::CallFunc_GetImageResource_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetAdvance_ReturnValue) == 0x0000A0, "Member 'UIW_ActionType_C_SetData::CallFunc_GetAdvance_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_Conv_IntToText_ReturnValue) == 0x0000A8, "Member 'UIW_ActionType_C_SetData::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetTechnique_ReturnValue) == 0x0000C0, "Member 'UIW_ActionType_C_SetData::CallFunc_GetTechnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0000C8, "Member 'UIW_ActionType_C_SetData::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetMotivity_ReturnValue) == 0x0000E0, "Member 'UIW_ActionType_C_SetData::CallFunc_GetMotivity_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_Conv_IntToText_ReturnValue_2) == 0x0000E8, "Member 'UIW_ActionType_C_SetData::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetCapacity_ReturnValue) == 0x000100, "Member 'UIW_ActionType_C_SetData::CallFunc_GetCapacity_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_Conv_IntToText_ReturnValue_3) == 0x000108, "Member 'UIW_ActionType_C_SetData::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetVigor_ReturnValue) == 0x000120, "Member 'UIW_ActionType_C_SetData::CallFunc_GetVigor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_Conv_IntToText_ReturnValue_4) == 0x000128, "Member 'UIW_ActionType_C_SetData::CallFunc_Conv_IntToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetVitality_ReturnValue) == 0x000140, "Member 'UIW_ActionType_C_SetData::CallFunc_GetVitality_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_Conv_IntToText_ReturnValue_5) == 0x000148, "Member 'UIW_ActionType_C_SetData::CallFunc_Conv_IntToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_FindDefaultStatInfoByNameBP_ReturnValue) == 0x000160, "Member 'UIW_ActionType_C_SetData::CallFunc_FindDefaultStatInfoByNameBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetCharacterStat_ReturnValue) == 0x000168, "Member 'UIW_ActionType_C_SetData::CallFunc_GetCharacterStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_Conv_IntToText_ReturnValue_6) == 0x000170, "Member 'UIW_ActionType_C_SetData::CallFunc_Conv_IntToText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetCharacterStat_ReturnValue_1) == 0x000188, "Member 'UIW_ActionType_C_SetData::CallFunc_GetCharacterStat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_Conv_IntToText_ReturnValue_7) == 0x000190, "Member 'UIW_ActionType_C_SetData::CallFunc_Conv_IntToText_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetCharacterStat_ReturnValue_2) == 0x0001A8, "Member 'UIW_ActionType_C_SetData::CallFunc_GetCharacterStat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_MakeValueText_Text) == 0x0001B0, "Member 'UIW_ActionType_C_SetData::CallFunc_MakeValueText_Text' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetCharacterStat_ReturnValue_3) == 0x0001C8, "Member 'UIW_ActionType_C_SetData::CallFunc_GetCharacterStat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_Conv_IntToText_ReturnValue_8) == 0x0001D0, "Member 'UIW_ActionType_C_SetData::CallFunc_Conv_IntToText_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetCharacterStat_ReturnValue_4) == 0x0001E8, "Member 'UIW_ActionType_C_SetData::CallFunc_GetCharacterStat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_Conv_IntToText_ReturnValue_9) == 0x0001F0, "Member 'UIW_ActionType_C_SetData::CallFunc_Conv_IntToText_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetCharacterStat_ReturnValue_5) == 0x000208, "Member 'UIW_ActionType_C_SetData::CallFunc_GetCharacterStat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_Conv_IntToText_ReturnValue_10) == 0x000210, "Member 'UIW_ActionType_C_SetData::CallFunc_Conv_IntToText_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000228, "Member 'UIW_ActionType_C_SetData::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetGameStrWithName_ReturnValue) == 0x000230, "Member 'UIW_ActionType_C_SetData::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, K2Node_DynamicCast_AsLPCCharacter) == 0x000248, "Member 'UIW_ActionType_C_SetData::K2Node_DynamicCast_AsLPCCharacter' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, K2Node_DynamicCast_bSuccess) == 0x000250, "Member 'UIW_ActionType_C_SetData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetGameStrWithName_ReturnValue_1) == 0x000258, "Member 'UIW_ActionType_C_SetData::CallFunc_GetGameStrWithName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetDefaultStatComponent_ReturnValue) == 0x000270, "Member 'UIW_ActionType_C_SetData::CallFunc_GetDefaultStatComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetGameStrWithName_ReturnValue_2) == 0x000278, "Member 'UIW_ActionType_C_SetData::CallFunc_GetGameStrWithName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetGameStrWithName_ReturnValue_3) == 0x000290, "Member 'UIW_ActionType_C_SetData::CallFunc_GetGameStrWithName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetGameStrWithName_ReturnValue_4) == 0x0002A8, "Member 'UIW_ActionType_C_SetData::CallFunc_GetGameStrWithName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetGameStrWithName_ReturnValue_5) == 0x0002C0, "Member 'UIW_ActionType_C_SetData::CallFunc_GetGameStrWithName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetGameStrWithName_ReturnValue_6) == 0x0002D8, "Member 'UIW_ActionType_C_SetData::CallFunc_GetGameStrWithName_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetGameStrWithName_ReturnValue_7) == 0x0002F0, "Member 'UIW_ActionType_C_SetData::CallFunc_GetGameStrWithName_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetGameStrWithName_ReturnValue_8) == 0x000308, "Member 'UIW_ActionType_C_SetData::CallFunc_GetGameStrWithName_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetGameStrWithName_ReturnValue_9) == 0x000320, "Member 'UIW_ActionType_C_SetData::CallFunc_GetGameStrWithName_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetGameStrWithName_ReturnValue_10) == 0x000338, "Member 'UIW_ActionType_C_SetData::CallFunc_GetGameStrWithName_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetGameStrWithName_ReturnValue_11) == 0x000350, "Member 'UIW_ActionType_C_SetData::CallFunc_GetGameStrWithName_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetGameStrWithName_ReturnValue_12) == 0x000368, "Member 'UIW_ActionType_C_SetData::CallFunc_GetGameStrWithName_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetGameStrWithName_ReturnValue_13) == 0x000380, "Member 'UIW_ActionType_C_SetData::CallFunc_GetGameStrWithName_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_SpawnObject_ReturnValue) == 0x000398, "Member 'UIW_ActionType_C_SetData::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_Array_Add_ReturnValue) == 0x0003A0, "Member 'UIW_ActionType_C_SetData::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_SpawnObject_ReturnValue_1) == 0x0003A8, "Member 'UIW_ActionType_C_SetData::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_Array_Add_ReturnValue_1) == 0x0003B0, "Member 'UIW_ActionType_C_SetData::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_SpawnObject_ReturnValue_2) == 0x0003B8, "Member 'UIW_ActionType_C_SetData::CallFunc_SpawnObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_Array_Add_ReturnValue_2) == 0x0003C0, "Member 'UIW_ActionType_C_SetData::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_SpawnObject_ReturnValue_3) == 0x0003C8, "Member 'UIW_ActionType_C_SetData::CallFunc_SpawnObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_Array_Add_ReturnValue_3) == 0x0003D0, "Member 'UIW_ActionType_C_SetData::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_SpawnObject_ReturnValue_4) == 0x0003D8, "Member 'UIW_ActionType_C_SetData::CallFunc_SpawnObject_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_Array_Add_ReturnValue_4) == 0x0003E0, "Member 'UIW_ActionType_C_SetData::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_SpawnObject_ReturnValue_5) == 0x0003E8, "Member 'UIW_ActionType_C_SetData::CallFunc_SpawnObject_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_Array_Add_ReturnValue_5) == 0x0003F0, "Member 'UIW_ActionType_C_SetData::CallFunc_Array_Add_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_SpawnObject_ReturnValue_6) == 0x0003F8, "Member 'UIW_ActionType_C_SetData::CallFunc_SpawnObject_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_Array_Add_ReturnValue_6) == 0x000400, "Member 'UIW_ActionType_C_SetData::CallFunc_Array_Add_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_SpawnObject_ReturnValue_7) == 0x000408, "Member 'UIW_ActionType_C_SetData::CallFunc_SpawnObject_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_Array_Add_ReturnValue_7) == 0x000410, "Member 'UIW_ActionType_C_SetData::CallFunc_Array_Add_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_SpawnObject_ReturnValue_8) == 0x000418, "Member 'UIW_ActionType_C_SetData::CallFunc_SpawnObject_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_Array_Add_ReturnValue_8) == 0x000420, "Member 'UIW_ActionType_C_SetData::CallFunc_Array_Add_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_SpawnObject_ReturnValue_9) == 0x000428, "Member 'UIW_ActionType_C_SetData::CallFunc_SpawnObject_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_Array_Add_ReturnValue_9) == 0x000430, "Member 'UIW_ActionType_C_SetData::CallFunc_Array_Add_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_SpawnObject_ReturnValue_10) == 0x000438, "Member 'UIW_ActionType_C_SetData::CallFunc_SpawnObject_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_Array_Add_ReturnValue_10) == 0x000440, "Member 'UIW_ActionType_C_SetData::CallFunc_Array_Add_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_SpawnObject_ReturnValue_11) == 0x000448, "Member 'UIW_ActionType_C_SetData::CallFunc_SpawnObject_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000450, "Member 'UIW_ActionType_C_SetData::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetConstantValues_ReturnValue) == 0x000458, "Member 'UIW_ActionType_C_SetData::CallFunc_GetConstantValues_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetPCActionTypeHnd3_ReturnValue) == 0x000460, "Member 'UIW_ActionType_C_SetData::CallFunc_GetPCActionTypeHnd3_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetPCActionTypeHnd2_ReturnValue) == 0x000468, "Member 'UIW_ActionType_C_SetData::CallFunc_GetPCActionTypeHnd2_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_FindItemCommonInfoByNameBP_ReturnValue) == 0x000470, "Member 'UIW_ActionType_C_SetData::CallFunc_FindItemCommonInfoByNameBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_FindItemCommonInfoByNameBP_ReturnValue_1) == 0x000478, "Member 'UIW_ActionType_C_SetData::CallFunc_FindItemCommonInfoByNameBP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetPCActionTypeHnd1_ReturnValue) == 0x000480, "Member 'UIW_ActionType_C_SetData::CallFunc_GetPCActionTypeHnd1_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetPCActionTypeBld3_ReturnValue) == 0x000488, "Member 'UIW_ActionType_C_SetData::CallFunc_GetPCActionTypeBld3_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_FindItemCommonInfoByNameBP_ReturnValue_2) == 0x000490, "Member 'UIW_ActionType_C_SetData::CallFunc_FindItemCommonInfoByNameBP_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_FindItemCommonInfoByNameBP_ReturnValue_3) == 0x000498, "Member 'UIW_ActionType_C_SetData::CallFunc_FindItemCommonInfoByNameBP_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetPCActionTypeBld2_ReturnValue) == 0x0004A0, "Member 'UIW_ActionType_C_SetData::CallFunc_GetPCActionTypeBld2_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetPCActionTypeBld1_ReturnValue) == 0x0004A8, "Member 'UIW_ActionType_C_SetData::CallFunc_GetPCActionTypeBld1_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_FindItemCommonInfoByNameBP_ReturnValue_4) == 0x0004B0, "Member 'UIW_ActionType_C_SetData::CallFunc_FindItemCommonInfoByNameBP_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_FindItemCommonInfoByNameBP_ReturnValue_5) == 0x0004B8, "Member 'UIW_ActionType_C_SetData::CallFunc_FindItemCommonInfoByNameBP_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_Array_Add_ReturnValue_11) == 0x0004C0, "Member 'UIW_ActionType_C_SetData::CallFunc_Array_Add_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0004C8, "Member 'UIW_ActionType_C_SetData::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_SetData, K2Node_SwitchName_CmpSuccess) == 0x0004D0, "Member 'UIW_ActionType_C_SetData::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function UIW_ActionType.UIW_ActionType_C.NextPage
// 0x0001 (0x0001 - 0x0000)
struct UIW_ActionType_C_NextPage final
{
public:
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_ActionType_C_NextPage) == 0x000001, "Wrong alignment on UIW_ActionType_C_NextPage");
static_assert(sizeof(UIW_ActionType_C_NextPage) == 0x000001, "Wrong size on UIW_ActionType_C_NextPage");
static_assert(offsetof(UIW_ActionType_C_NextPage, K2Node_SwitchInteger_CmpSuccess) == 0x000000, "Member 'UIW_ActionType_C_NextPage::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function UIW_ActionType.UIW_ActionType_C.OnMouseButtonDoubleClick
// 0x0218 (0x0218 - 0x0000)
struct UIW_ActionType_C_OnMouseButtonDoubleClick final
{
public:
	struct FGeometry                              InMyGeometry;                                      // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InMouseEvent;                                      // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(UIW_ActionType_C_OnMouseButtonDoubleClick) == 0x000008, "Wrong alignment on UIW_ActionType_C_OnMouseButtonDoubleClick");
static_assert(sizeof(UIW_ActionType_C_OnMouseButtonDoubleClick) == 0x000218, "Wrong size on UIW_ActionType_C_OnMouseButtonDoubleClick");
static_assert(offsetof(UIW_ActionType_C_OnMouseButtonDoubleClick, InMyGeometry) == 0x000000, "Member 'UIW_ActionType_C_OnMouseButtonDoubleClick::InMyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_OnMouseButtonDoubleClick, InMouseEvent) == 0x000038, "Member 'UIW_ActionType_C_OnMouseButtonDoubleClick::InMouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_ActionType_C_OnMouseButtonDoubleClick, ReturnValue) == 0x0000A8, "Member 'UIW_ActionType_C_OnMouseButtonDoubleClick::ReturnValue' has a wrong offset!");
