#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Quartz_Pocket

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Quartz_Pocket.UIW_Quartz_Pocket_C
// 0x0148 (0x03B0 - 0x0268)
class UUIW_Quartz_Pocket_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_ActiveNormal;                                  // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Active;                                        // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Normal;                                        // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Unlock;                                        // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Lock;                                          // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Btn;                                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FX_Active;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FX_ActiveNormal;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FX_Circle;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Hover;                                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_PocketIcon;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_ProgressCircle;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Quartz_Slot_C*                     Slot01;                                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Quartz_Slot_C*                     Slot02;                                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Quartz_Slot_C*                     Slot03;                                            // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Quartz_Slot_C*                     Slot04;                                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsEnabled;                                         // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSynergyActived;                                  // 0x0301(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_302[0x2];                                      // 0x0302(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   PocketID;                                          // 0x0304(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULQuartzPocket*                         QuartzPocketData;                                  // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Quartz_Pocket_C*                   LeftPocket;                                        // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Quartz_Pocket_C*                   RightPocket;                                       // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Quartz_Pocket_C*                   UpPocket;                                          // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Quartz_Pocket_C*                   DownPocket;                                        // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SlotCount;                                         // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector2D                              SlotPosition1;                                     // 0x033C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector2D                              SlotPosition2;                                     // 0x0344(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector2D                              SlotPosition3;                                     // 0x034C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector2D                              SlotPosition4;                                     // 0x0354(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUIW_Quartz_Slot_C*>             SlotMap;                                           // 0x0360(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	FMulticastInlineDelegateProperty_             OnUnlocked;                                        // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         Slot_Angle_1;                                      // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Slot_Angle_2;                                      // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Slot_Angle_3;                                      // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Slot_Angle_4;                                      // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Angle_SLotFill;                                    // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnDoubleClicked;                                   // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UUIW_Quartz_C*                          OwnWindodw;                                        // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnClicked__DelegateSignature(class UUIW_Quartz_Pocket_C* Pocket, bool WithTween, bool ForceUpdate);
	void OnUnlocked__DelegateSignature();
	void OnDoubleClicked__DelegateSignature(class UUIW_Quartz_Pocket_C* SelfPocket);
	void ExecuteUbergraph_UIW_Quartz_Pocket(int32 EntryPoint);
	void WidgetAnimationEvt_Ani_Unlock_K2Node_WidgetAnimationEvent_0();
	void PreConstruct(bool IsDesignTime);
	void BndEvt__UIW_Quartz_Pocket_Btn_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__UIW_Quartz_Pocket_Btn_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UIW_Quartz_Pocket_Btn_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UIW_Quartz_Pocket_Btn_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void SetData(int32 NowInstallIndex);
	void RefreshSlot(int32 NowInstallIndex);
	struct FEventReply OnMouseButtonDoubleClick(const struct FGeometry& InMyGeometry, const struct FPointerEvent& InMouseEvent);
	void SetBtnMode(bool BtnOn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Quartz_Pocket_C">();
	}
	static class UUIW_Quartz_Pocket_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Quartz_Pocket_C>();
	}
};
static_assert(alignof(UUIW_Quartz_Pocket_C) == 0x000008, "Wrong alignment on UUIW_Quartz_Pocket_C");
static_assert(sizeof(UUIW_Quartz_Pocket_C) == 0x0003B0, "Wrong size on UUIW_Quartz_Pocket_C");
static_assert(offsetof(UUIW_Quartz_Pocket_C, UberGraphFrame) == 0x000268, "Member 'UUIW_Quartz_Pocket_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, Ani_ActiveNormal) == 0x000270, "Member 'UUIW_Quartz_Pocket_C::Ani_ActiveNormal' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, Ani_Active) == 0x000278, "Member 'UUIW_Quartz_Pocket_C::Ani_Active' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, Ani_Normal) == 0x000280, "Member 'UUIW_Quartz_Pocket_C::Ani_Normal' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, Ani_Unlock) == 0x000288, "Member 'UUIW_Quartz_Pocket_C::Ani_Unlock' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, Ani_Lock) == 0x000290, "Member 'UUIW_Quartz_Pocket_C::Ani_Lock' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, Btn) == 0x000298, "Member 'UUIW_Quartz_Pocket_C::Btn' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, FX_Active) == 0x0002A0, "Member 'UUIW_Quartz_Pocket_C::FX_Active' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, FX_ActiveNormal) == 0x0002A8, "Member 'UUIW_Quartz_Pocket_C::FX_ActiveNormal' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, FX_Circle) == 0x0002B0, "Member 'UUIW_Quartz_Pocket_C::FX_Circle' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, Hover) == 0x0002B8, "Member 'UUIW_Quartz_Pocket_C::Hover' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, Img_PocketIcon) == 0x0002C0, "Member 'UUIW_Quartz_Pocket_C::Img_PocketIcon' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, Img_ProgressCircle) == 0x0002C8, "Member 'UUIW_Quartz_Pocket_C::Img_ProgressCircle' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, Slot01) == 0x0002D0, "Member 'UUIW_Quartz_Pocket_C::Slot01' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, Slot02) == 0x0002D8, "Member 'UUIW_Quartz_Pocket_C::Slot02' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, Slot03) == 0x0002E0, "Member 'UUIW_Quartz_Pocket_C::Slot03' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, Slot04) == 0x0002E8, "Member 'UUIW_Quartz_Pocket_C::Slot04' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, OnClicked) == 0x0002F0, "Member 'UUIW_Quartz_Pocket_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, IsEnabled) == 0x000300, "Member 'UUIW_Quartz_Pocket_C::IsEnabled' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, IsSynergyActived) == 0x000301, "Member 'UUIW_Quartz_Pocket_C::IsSynergyActived' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, PocketID) == 0x000304, "Member 'UUIW_Quartz_Pocket_C::PocketID' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, QuartzPocketData) == 0x000310, "Member 'UUIW_Quartz_Pocket_C::QuartzPocketData' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, LeftPocket) == 0x000318, "Member 'UUIW_Quartz_Pocket_C::LeftPocket' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, RightPocket) == 0x000320, "Member 'UUIW_Quartz_Pocket_C::RightPocket' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, UpPocket) == 0x000328, "Member 'UUIW_Quartz_Pocket_C::UpPocket' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, DownPocket) == 0x000330, "Member 'UUIW_Quartz_Pocket_C::DownPocket' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, SlotCount) == 0x000338, "Member 'UUIW_Quartz_Pocket_C::SlotCount' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, SlotPosition1) == 0x00033C, "Member 'UUIW_Quartz_Pocket_C::SlotPosition1' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, SlotPosition2) == 0x000344, "Member 'UUIW_Quartz_Pocket_C::SlotPosition2' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, SlotPosition3) == 0x00034C, "Member 'UUIW_Quartz_Pocket_C::SlotPosition3' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, SlotPosition4) == 0x000354, "Member 'UUIW_Quartz_Pocket_C::SlotPosition4' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, SlotMap) == 0x000360, "Member 'UUIW_Quartz_Pocket_C::SlotMap' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, OnUnlocked) == 0x000370, "Member 'UUIW_Quartz_Pocket_C::OnUnlocked' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, Slot_Angle_1) == 0x000380, "Member 'UUIW_Quartz_Pocket_C::Slot_Angle_1' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, Slot_Angle_2) == 0x000384, "Member 'UUIW_Quartz_Pocket_C::Slot_Angle_2' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, Slot_Angle_3) == 0x000388, "Member 'UUIW_Quartz_Pocket_C::Slot_Angle_3' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, Slot_Angle_4) == 0x00038C, "Member 'UUIW_Quartz_Pocket_C::Slot_Angle_4' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, Angle_SLotFill) == 0x000390, "Member 'UUIW_Quartz_Pocket_C::Angle_SLotFill' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, OnDoubleClicked) == 0x000398, "Member 'UUIW_Quartz_Pocket_C::OnDoubleClicked' has a wrong offset!");
static_assert(offsetof(UUIW_Quartz_Pocket_C, OwnWindodw) == 0x0003A8, "Member 'UUIW_Quartz_Pocket_C::OwnWindodw' has a wrong offset!");

}

