#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Tutorial_List

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Tutorial_List.UIW_Tutorial_List_C
// 0x0028 (0x02D0 - 0x02A8)
class UUIW_Tutorial_List_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUIW_Fx_Listbar_C*                      Selected;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListView*                              OwnerListView;                                     // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelected;                                        // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UIW_Tutorial_List(int32 EntryPoint);
	void BP_OnEntryReleased();
	void Destruct();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void Construct();
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void SetMoveFocusEffect();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Tutorial_List_C">();
	}
	static class UUIW_Tutorial_List_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Tutorial_List_C>();
	}
};
static_assert(alignof(UUIW_Tutorial_List_C) == 0x000008, "Wrong alignment on UUIW_Tutorial_List_C");
static_assert(sizeof(UUIW_Tutorial_List_C) == 0x0002D0, "Wrong size on UUIW_Tutorial_List_C");
static_assert(offsetof(UUIW_Tutorial_List_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_Tutorial_List_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_Tutorial_List_C, Selected) == 0x0002B0, "Member 'UUIW_Tutorial_List_C::Selected' has a wrong offset!");
static_assert(offsetof(UUIW_Tutorial_List_C, Text) == 0x0002B8, "Member 'UUIW_Tutorial_List_C::Text' has a wrong offset!");
static_assert(offsetof(UUIW_Tutorial_List_C, OwnerListView) == 0x0002C0, "Member 'UUIW_Tutorial_List_C::OwnerListView' has a wrong offset!");
static_assert(offsetof(UUIW_Tutorial_List_C, IsSelected) == 0x0002C8, "Member 'UUIW_Tutorial_List_C::IsSelected' has a wrong offset!");

}

