#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Stepper

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Stepper.UIW_Stepper_C
// 0x0080 (0x0328 - 0x02A8)
class UUIW_Stepper_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUIW_Btn_Arrow_C*                       H_Btn_Next;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Arrow_C*                       H_Btn_Prev;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             H_Text;                                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Horizontal;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Arrow_C*                       V_Btn_Next;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Arrow_C*                       V_Btn_Prev;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             V_Text;                                            // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Vertical;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EOrientation                                  Orientation;                                       // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Data_Rotation;                                     // 0x02F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_2F2[0x2];                                      // 0x02F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectedIndex;                                     // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnOptionChanged;                                   // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class FText>                           DataList;                                          // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsInit;                                            // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void OnOptionChanged__DelegateSignature(int32 SelectedIndex_0);
	void ExecuteUbergraph_UIW_Stepper(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void GetSelectedIndex(int32* Index_0);
	void GetSelectedPrev(int32* Index_0);
	void SetSelectedIndex(int32 Index_0);
	void SetSelectedPrev();
	void GetSelectedNext(int32* Index_0);
	void SetSelectedNext();
	void SetOrientation();
	void SetList(TArray<class FText>& List);
	void ChangeValue();
	void ReturnSelectedIndex(int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Stepper_C">();
	}
	static class UUIW_Stepper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Stepper_C>();
	}
};
static_assert(alignof(UUIW_Stepper_C) == 0x000008, "Wrong alignment on UUIW_Stepper_C");
static_assert(sizeof(UUIW_Stepper_C) == 0x000328, "Wrong size on UUIW_Stepper_C");
static_assert(offsetof(UUIW_Stepper_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_Stepper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_Stepper_C, H_Btn_Next) == 0x0002B0, "Member 'UUIW_Stepper_C::H_Btn_Next' has a wrong offset!");
static_assert(offsetof(UUIW_Stepper_C, H_Btn_Prev) == 0x0002B8, "Member 'UUIW_Stepper_C::H_Btn_Prev' has a wrong offset!");
static_assert(offsetof(UUIW_Stepper_C, H_Text) == 0x0002C0, "Member 'UUIW_Stepper_C::H_Text' has a wrong offset!");
static_assert(offsetof(UUIW_Stepper_C, Horizontal) == 0x0002C8, "Member 'UUIW_Stepper_C::Horizontal' has a wrong offset!");
static_assert(offsetof(UUIW_Stepper_C, V_Btn_Next) == 0x0002D0, "Member 'UUIW_Stepper_C::V_Btn_Next' has a wrong offset!");
static_assert(offsetof(UUIW_Stepper_C, V_Btn_Prev) == 0x0002D8, "Member 'UUIW_Stepper_C::V_Btn_Prev' has a wrong offset!");
static_assert(offsetof(UUIW_Stepper_C, V_Text) == 0x0002E0, "Member 'UUIW_Stepper_C::V_Text' has a wrong offset!");
static_assert(offsetof(UUIW_Stepper_C, Vertical) == 0x0002E8, "Member 'UUIW_Stepper_C::Vertical' has a wrong offset!");
static_assert(offsetof(UUIW_Stepper_C, Orientation) == 0x0002F0, "Member 'UUIW_Stepper_C::Orientation' has a wrong offset!");
static_assert(offsetof(UUIW_Stepper_C, Data_Rotation) == 0x0002F1, "Member 'UUIW_Stepper_C::Data_Rotation' has a wrong offset!");
static_assert(offsetof(UUIW_Stepper_C, SelectedIndex) == 0x0002F4, "Member 'UUIW_Stepper_C::SelectedIndex' has a wrong offset!");
static_assert(offsetof(UUIW_Stepper_C, Text) == 0x0002F8, "Member 'UUIW_Stepper_C::Text' has a wrong offset!");
static_assert(offsetof(UUIW_Stepper_C, OnOptionChanged) == 0x000300, "Member 'UUIW_Stepper_C::OnOptionChanged' has a wrong offset!");
static_assert(offsetof(UUIW_Stepper_C, DataList) == 0x000310, "Member 'UUIW_Stepper_C::DataList' has a wrong offset!");
static_assert(offsetof(UUIW_Stepper_C, IsInit) == 0x000320, "Member 'UUIW_Stepper_C::IsInit' has a wrong offset!");

}

