#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ListItem_Lie_High

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_ListItem_Lie_High.UIW_ListItem_Lie_High_C
// 0x0060 (0x0308 - 0x02A8)
class UUIW_ListItem_Lie_High_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Focus;                                         // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             Label;                                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Selected;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Selected_2;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             On_Focused;                                        // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             On_Clicked;                                        // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsHoveredByAngle;                                  // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_NPCDialog_C*                       NPCDialog;                                         // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void On_Focused__DelegateSignature(int32 Index_0);
	void On_Clicked__DelegateSignature(int32 Index_0);
	void ExecuteUbergraph_UIW_ListItem_Lie_High(int32 EntryPoint);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void SetData(class UUIBP_ListData_IsNew_C* Data);
	void SetSelected(bool bIsSelected);
	void Destruct();
	void OnSelectedLie(int32 Index_0);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_ListItem_Lie_High_C">();
	}
	static class UUIW_ListItem_Lie_High_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_ListItem_Lie_High_C>();
	}
};
static_assert(alignof(UUIW_ListItem_Lie_High_C) == 0x000008, "Wrong alignment on UUIW_ListItem_Lie_High_C");
static_assert(sizeof(UUIW_ListItem_Lie_High_C) == 0x000308, "Wrong size on UUIW_ListItem_Lie_High_C");
static_assert(offsetof(UUIW_ListItem_Lie_High_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_ListItem_Lie_High_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Lie_High_C, Ani_Focus) == 0x0002B0, "Member 'UUIW_ListItem_Lie_High_C::Ani_Focus' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Lie_High_C, Label) == 0x0002B8, "Member 'UUIW_ListItem_Lie_High_C::Label' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Lie_High_C, Selected) == 0x0002C0, "Member 'UUIW_ListItem_Lie_High_C::Selected' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Lie_High_C, Selected_2) == 0x0002C8, "Member 'UUIW_ListItem_Lie_High_C::Selected_2' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Lie_High_C, Index_0) == 0x0002D0, "Member 'UUIW_ListItem_Lie_High_C::Index_0' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Lie_High_C, On_Focused) == 0x0002D8, "Member 'UUIW_ListItem_Lie_High_C::On_Focused' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Lie_High_C, On_Clicked) == 0x0002E8, "Member 'UUIW_ListItem_Lie_High_C::On_Clicked' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Lie_High_C, IsHoveredByAngle) == 0x0002F8, "Member 'UUIW_ListItem_Lie_High_C::IsHoveredByAngle' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_Lie_High_C, NPCDialog) == 0x000300, "Member 'UUIW_ListItem_Lie_High_C::NPCDialog' has a wrong offset!");

}

