#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_SlaveArm_ReinforceSlot

#include "Basic.hpp"


namespace SDK::Params
{

// Function UIW_SlaveArm_ReinforceSlot.UIW_SlaveArm_ReinforceSlot_C.ExecuteUbergraph_UIW_SlaveArm_ReinforceSlot
// 0x0004 (0x0004 - 0x0000)
struct UIW_SlaveArm_ReinforceSlot_C_ExecuteUbergraph_UIW_SlaveArm_ReinforceSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_SlaveArm_ReinforceSlot_C_ExecuteUbergraph_UIW_SlaveArm_ReinforceSlot) == 0x000004, "Wrong alignment on UIW_SlaveArm_ReinforceSlot_C_ExecuteUbergraph_UIW_SlaveArm_ReinforceSlot");
static_assert(sizeof(UIW_SlaveArm_ReinforceSlot_C_ExecuteUbergraph_UIW_SlaveArm_ReinforceSlot) == 0x000004, "Wrong size on UIW_SlaveArm_ReinforceSlot_C_ExecuteUbergraph_UIW_SlaveArm_ReinforceSlot");
static_assert(offsetof(UIW_SlaveArm_ReinforceSlot_C_ExecuteUbergraph_UIW_SlaveArm_ReinforceSlot, EntryPoint) == 0x000000, "Member 'UIW_SlaveArm_ReinforceSlot_C_ExecuteUbergraph_UIW_SlaveArm_ReinforceSlot::EntryPoint' has a wrong offset!");

// Function UIW_SlaveArm_ReinforceSlot.UIW_SlaveArm_ReinforceSlot_C.SetData
// 0x0030 (0x0030 - 0x0000)
struct UIW_SlaveArm_ReinforceSlot_C_SetData final
{
public:
	class ULSlaveArmTree*                         SlotData_0;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_GetIcon_ReturnValue;                      // 0x0008(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(UIW_SlaveArm_ReinforceSlot_C_SetData) == 0x000008, "Wrong alignment on UIW_SlaveArm_ReinforceSlot_C_SetData");
static_assert(sizeof(UIW_SlaveArm_ReinforceSlot_C_SetData) == 0x000030, "Wrong size on UIW_SlaveArm_ReinforceSlot_C_SetData");
static_assert(offsetof(UIW_SlaveArm_ReinforceSlot_C_SetData, SlotData_0) == 0x000000, "Member 'UIW_SlaveArm_ReinforceSlot_C_SetData::SlotData_0' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_ReinforceSlot_C_SetData, CallFunc_GetIcon_ReturnValue) == 0x000008, "Member 'UIW_SlaveArm_ReinforceSlot_C_SetData::CallFunc_GetIcon_ReturnValue' has a wrong offset!");

}

