#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_PackageDownload

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_PackageDownload.UIW_PackageDownload_C
// 0x0028 (0x0290 - 0x0268)
class UUIW_PackageDownload_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Progress;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Percent;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Title;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           DownloadTimer;                                     // 0x0288(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_PackageDownload(int32 EntryPoint);
	void Destruct();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void SetProgress(float Value);
	void OnVisibillityChanged(ESlateVisibility InVisibility);
	void RefreshDownload();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_PackageDownload_C">();
	}
	static class UUIW_PackageDownload_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_PackageDownload_C>();
	}
};
static_assert(alignof(UUIW_PackageDownload_C) == 0x000008, "Wrong alignment on UUIW_PackageDownload_C");
static_assert(sizeof(UUIW_PackageDownload_C) == 0x000290, "Wrong size on UUIW_PackageDownload_C");
static_assert(offsetof(UUIW_PackageDownload_C, UberGraphFrame) == 0x000268, "Member 'UUIW_PackageDownload_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_PackageDownload_C, Progress) == 0x000270, "Member 'UUIW_PackageDownload_C::Progress' has a wrong offset!");
static_assert(offsetof(UUIW_PackageDownload_C, Text_Percent) == 0x000278, "Member 'UUIW_PackageDownload_C::Text_Percent' has a wrong offset!");
static_assert(offsetof(UUIW_PackageDownload_C, Text_Title) == 0x000280, "Member 'UUIW_PackageDownload_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UUIW_PackageDownload_C, DownloadTimer) == 0x000288, "Member 'UUIW_PackageDownload_C::DownloadTimer' has a wrong offset!");

}

