#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_NPCDialog_GoldenTree

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_NPCDialog_GoldenTree.UIW_NPCDialog_GoldenTree_C
// 0x00F8 (0x0360 - 0x0268)
class UUIW_NPCDialog_GoldenTree_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           BoosterGroup;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Full;                                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_Full_Wave_0;                                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fx_Full_Wave_1;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIParticleEmitter*                     FX_Particle_Full;                                  // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_NPCDialog_GoldenTree_Item_C*       GoldenTree_Item_10;                                // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_NPCDialog_GoldenTree_Item_C*       GoldenTree_Item_11;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_NPCDialog_GoldenTree_Item_C*       GoldenTree_Item_12;                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_NPCDialog_GoldenTree_Item_C*       GoldenTree_Item_13;                                // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_NPCDialog_GoldenTree_Item_C*       GoldenTree_Item_14;                                // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_NPCDialog_GoldenTree_Item_C*       GoldenTree_Item_01;                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_NPCDialog_GoldenTree_Item_C*       GoldenTree_Item_02;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_NPCDialog_GoldenTree_Item_C*       GoldenTree_Item_03;                                // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_NPCDialog_GoldenTree_Item_C*       GoldenTree_Item_04;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_NPCDialog_GoldenTree_Item_C*       GoldenTree_Item_05;                                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_NPCDialog_GoldenTree_Item_C*       GoldenTree_Item_06;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_NPCDialog_GoldenTree_Item_C*       GoldenTree_Item_07;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_NPCDialog_GoldenTree_Item_C*       GoldenTree_Item_08;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_NPCDialog_GoldenTree_Item_C*       GoldenTree_Item_09;                                // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                GoldenTree_Status_Group;                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           Progress_BoosterTime;                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_BoosterTime;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_GoldenTree_Count;                             // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_GoldenTree_Full;                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_GoldenTree_Timer;                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_GoldenTree_Title;                             // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_GoldenTree_Title_1;                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIBP_NPCDialog_GoldenTree_C*           BP_WidgetController;                               // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUIW_NPCDialog_GoldenTree_Item_C*> CoinArr;                                           // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_UIW_NPCDialog_GoldenTree(int32 EntryPoint);
	void SetView_Full(bool IsFull);
	void SetView_Boost(bool IsBoost, float Percent, const class FText& TimeText);
	void SetView_Show(bool IsShow);
	void OnReady();
	void SetView_CoinCount(bool IsFull, const class FText& CountText, const class FText& TimeText, int32 Count);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_NPCDialog_GoldenTree_C">();
	}
	static class UUIW_NPCDialog_GoldenTree_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_NPCDialog_GoldenTree_C>();
	}
};
static_assert(alignof(UUIW_NPCDialog_GoldenTree_C) == 0x000008, "Wrong alignment on UUIW_NPCDialog_GoldenTree_C");
static_assert(sizeof(UUIW_NPCDialog_GoldenTree_C) == 0x000360, "Wrong size on UUIW_NPCDialog_GoldenTree_C");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, UberGraphFrame) == 0x000268, "Member 'UUIW_NPCDialog_GoldenTree_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, BoosterGroup) == 0x000270, "Member 'UUIW_NPCDialog_GoldenTree_C::BoosterGroup' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, Full) == 0x000278, "Member 'UUIW_NPCDialog_GoldenTree_C::Full' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, Fx_Full_Wave_0) == 0x000280, "Member 'UUIW_NPCDialog_GoldenTree_C::Fx_Full_Wave_0' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, Fx_Full_Wave_1) == 0x000288, "Member 'UUIW_NPCDialog_GoldenTree_C::Fx_Full_Wave_1' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, FX_Particle_Full) == 0x000290, "Member 'UUIW_NPCDialog_GoldenTree_C::FX_Particle_Full' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, GoldenTree_Item_10) == 0x000298, "Member 'UUIW_NPCDialog_GoldenTree_C::GoldenTree_Item_10' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, GoldenTree_Item_11) == 0x0002A0, "Member 'UUIW_NPCDialog_GoldenTree_C::GoldenTree_Item_11' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, GoldenTree_Item_12) == 0x0002A8, "Member 'UUIW_NPCDialog_GoldenTree_C::GoldenTree_Item_12' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, GoldenTree_Item_13) == 0x0002B0, "Member 'UUIW_NPCDialog_GoldenTree_C::GoldenTree_Item_13' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, GoldenTree_Item_14) == 0x0002B8, "Member 'UUIW_NPCDialog_GoldenTree_C::GoldenTree_Item_14' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, GoldenTree_Item_01) == 0x0002C0, "Member 'UUIW_NPCDialog_GoldenTree_C::GoldenTree_Item_01' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, GoldenTree_Item_02) == 0x0002C8, "Member 'UUIW_NPCDialog_GoldenTree_C::GoldenTree_Item_02' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, GoldenTree_Item_03) == 0x0002D0, "Member 'UUIW_NPCDialog_GoldenTree_C::GoldenTree_Item_03' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, GoldenTree_Item_04) == 0x0002D8, "Member 'UUIW_NPCDialog_GoldenTree_C::GoldenTree_Item_04' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, GoldenTree_Item_05) == 0x0002E0, "Member 'UUIW_NPCDialog_GoldenTree_C::GoldenTree_Item_05' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, GoldenTree_Item_06) == 0x0002E8, "Member 'UUIW_NPCDialog_GoldenTree_C::GoldenTree_Item_06' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, GoldenTree_Item_07) == 0x0002F0, "Member 'UUIW_NPCDialog_GoldenTree_C::GoldenTree_Item_07' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, GoldenTree_Item_08) == 0x0002F8, "Member 'UUIW_NPCDialog_GoldenTree_C::GoldenTree_Item_08' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, GoldenTree_Item_09) == 0x000300, "Member 'UUIW_NPCDialog_GoldenTree_C::GoldenTree_Item_09' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, GoldenTree_Status_Group) == 0x000308, "Member 'UUIW_NPCDialog_GoldenTree_C::GoldenTree_Status_Group' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, Progress_BoosterTime) == 0x000310, "Member 'UUIW_NPCDialog_GoldenTree_C::Progress_BoosterTime' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, Text_BoosterTime) == 0x000318, "Member 'UUIW_NPCDialog_GoldenTree_C::Text_BoosterTime' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, Text_GoldenTree_Count) == 0x000320, "Member 'UUIW_NPCDialog_GoldenTree_C::Text_GoldenTree_Count' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, Text_GoldenTree_Full) == 0x000328, "Member 'UUIW_NPCDialog_GoldenTree_C::Text_GoldenTree_Full' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, Text_GoldenTree_Timer) == 0x000330, "Member 'UUIW_NPCDialog_GoldenTree_C::Text_GoldenTree_Timer' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, Text_GoldenTree_Title) == 0x000338, "Member 'UUIW_NPCDialog_GoldenTree_C::Text_GoldenTree_Title' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, Text_GoldenTree_Title_1) == 0x000340, "Member 'UUIW_NPCDialog_GoldenTree_C::Text_GoldenTree_Title_1' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, BP_WidgetController) == 0x000348, "Member 'UUIW_NPCDialog_GoldenTree_C::BP_WidgetController' has a wrong offset!");
static_assert(offsetof(UUIW_NPCDialog_GoldenTree_C, CoinArr) == 0x000350, "Member 'UUIW_NPCDialog_GoldenTree_C::CoinArr' has a wrong offset!");

}

