#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_LoadLevel

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UIST_Time_structs.hpp"


namespace SDK::Params
{

// Function UIW_LoadLevel.UIW_LoadLevel_C.ExecuteUbergraph_UIW_LoadLevel
// 0x06F0 (0x06F0 - 0x0000)
struct UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_2;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_1;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUIW_Popup_C* Popup, class UUIW_Btn_Key_C* BtnKey)> K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class UUIW_Popup_C*                           CallFunc_AddPopupWidget_Widget;                    // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item_1;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_SaveData_C*              K2Node_DynamicCast_AsUIBP_List_Data_Save_Data;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget_1;               // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenedWidget_IsOpened;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_IsOpenedWidget_UserWidget;                // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IsOpenedWidget_WidgetArrayIndex;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x00A0(0x0018)()
	class UUIW_TitleScreen_C*                     K2Node_DynamicCast_AsUIW_Title_Screen;             // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScrollBarStyle                        CallFunc_GetScrollBarStyle_ScrollBarStyle;         // 0x00C8(0x04D0)()
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULSoundSystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLCharacterStorageData                 CallFunc_Array_Get_Item;                           // 0x05A8(0x00C8)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0670(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0674(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_675[0x3];                                      // 0x0675(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLCharacterStorageData>         CallFunc_GetSaveData_outCharacterList;             // 0x0680(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetSaveData_ReturnValue;                  // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidStarterPackSelectCharacter_ReturnValue; // 0x0691(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_692[0x6];                                      // 0x0692(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x0698(0x0018)()
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLastPlayCharacter_ReturnValue;          // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x06B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6BA[0x6];                                      // 0x06BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIST_Time                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x06C0(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D9[0x7];                                      // 0x06D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Popup_C*                           K2Node_CustomEvent_Popup;                          // 0x06E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_CustomEvent_BtnKey;                         // 0x06E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel) == 0x000008, "Wrong alignment on UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel");
static_assert(sizeof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel) == 0x0006F0, "Wrong size on UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, EntryPoint) == 0x000000, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, Temp_int_Array_Index_Variable) == 0x000004, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, K2Node_ComponentBoundEvent_BtnKey_2) == 0x000010, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::K2Node_ComponentBoundEvent_BtnKey_2' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, K2Node_MakeArray_Array) == 0x000018, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, K2Node_ComponentBoundEvent_BtnKey_1) == 0x000028, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::K2Node_ComponentBoundEvent_BtnKey_1' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, K2Node_ComponentBoundEvent_BtnKey) == 0x000030, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::K2Node_ComponentBoundEvent_BtnKey' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, CallFunc_GetMainWidget_MainWidget) == 0x000038, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, CallFunc_AddPopupWidget_Widget) == 0x000050, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::CallFunc_AddPopupWidget_Widget' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, K2Node_ComponentBoundEvent_Item_1) == 0x000058, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::K2Node_ComponentBoundEvent_Item_1' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, K2Node_ComponentBoundEvent_bIsSelected) == 0x000060, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::K2Node_ComponentBoundEvent_bIsSelected' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, K2Node_DynamicCast_AsUIBP_List_Data_Save_Data) == 0x000068, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::K2Node_DynamicCast_AsUIBP_List_Data_Save_Data' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, CallFunc_GetIndexForItem_ReturnValue) == 0x000074, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, K2Node_ComponentBoundEvent_Item) == 0x000078, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, CallFunc_GetMainWidget_MainWidget_1) == 0x000080, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::CallFunc_GetMainWidget_MainWidget_1' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, CallFunc_IsOpenedWidget_IsOpened) == 0x000088, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::CallFunc_IsOpenedWidget_IsOpened' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, CallFunc_IsOpenedWidget_UserWidget) == 0x000090, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::CallFunc_IsOpenedWidget_UserWidget' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, CallFunc_IsOpenedWidget_WidgetArrayIndex) == 0x000098, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::CallFunc_IsOpenedWidget_WidgetArrayIndex' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, CallFunc_GetGameStrWithName_ReturnValue) == 0x0000A0, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, K2Node_DynamicCast_AsUIW_Title_Screen) == 0x0000B8, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::K2Node_DynamicCast_AsUIW_Title_Screen' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, CallFunc_GetScrollBarStyle_ScrollBarStyle) == 0x0000C8, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::CallFunc_GetScrollBarStyle_ScrollBarStyle' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000598, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0005A0, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, CallFunc_Array_Get_Item) == 0x0005A8, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, CallFunc_Array_Length_ReturnValue) == 0x000670, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, CallFunc_Less_IntInt_ReturnValue) == 0x000674, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000678, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, CallFunc_GetSaveData_outCharacterList) == 0x000680, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::CallFunc_GetSaveData_outCharacterList' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, CallFunc_GetSaveData_ReturnValue) == 0x000690, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::CallFunc_GetSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, CallFunc_IsValidStarterPackSelectCharacter_ReturnValue) == 0x000691, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::CallFunc_IsValidStarterPackSelectCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, CallFunc_GetGameStrWithName_ReturnValue_1) == 0x000698, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::CallFunc_GetGameStrWithName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x0006B0, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, CallFunc_IsLastPlayCharacter_ReturnValue) == 0x0006B8, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::CallFunc_IsLastPlayCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, CallFunc_IsVisible_ReturnValue) == 0x0006B9, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, CallFunc_GetDataTableRowFromName_OutRow) == 0x0006C0, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0006D8, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, K2Node_CustomEvent_Popup) == 0x0006E0, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::K2Node_CustomEvent_Popup' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel, K2Node_CustomEvent_BtnKey) == 0x0006E8, "Member 'UIW_LoadLevel_C_ExecuteUbergraph_UIW_LoadLevel::K2Node_CustomEvent_BtnKey' has a wrong offset!");

// Function UIW_LoadLevel.UIW_LoadLevel_C.OnDownloadPackagePopup
// 0x0010 (0x0010 - 0x0000)
struct UIW_LoadLevel_C_OnDownloadPackagePopup final
{
public:
	class UUIW_Popup_C*                           Popup;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_LoadLevel_C_OnDownloadPackagePopup) == 0x000008, "Wrong alignment on UIW_LoadLevel_C_OnDownloadPackagePopup");
static_assert(sizeof(UIW_LoadLevel_C_OnDownloadPackagePopup) == 0x000010, "Wrong size on UIW_LoadLevel_C_OnDownloadPackagePopup");
static_assert(offsetof(UIW_LoadLevel_C_OnDownloadPackagePopup, Popup) == 0x000000, "Member 'UIW_LoadLevel_C_OnDownloadPackagePopup::Popup' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_OnDownloadPackagePopup, BtnKey) == 0x000008, "Member 'UIW_LoadLevel_C_OnDownloadPackagePopup::BtnKey' has a wrong offset!");

// Function UIW_LoadLevel.UIW_LoadLevel_C.BndEvt__List_K2Node_ComponentBoundEvent_5_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_LoadLevel_C_BndEvt__List_K2Node_ComponentBoundEvent_5_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_LoadLevel_C_BndEvt__List_K2Node_ComponentBoundEvent_5_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong alignment on UIW_LoadLevel_C_BndEvt__List_K2Node_ComponentBoundEvent_5_SimpleListItemEventDynamic__DelegateSignature");
static_assert(sizeof(UIW_LoadLevel_C_BndEvt__List_K2Node_ComponentBoundEvent_5_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong size on UIW_LoadLevel_C_BndEvt__List_K2Node_ComponentBoundEvent_5_SimpleListItemEventDynamic__DelegateSignature");
static_assert(offsetof(UIW_LoadLevel_C_BndEvt__List_K2Node_ComponentBoundEvent_5_SimpleListItemEventDynamic__DelegateSignature, Item) == 0x000000, "Member 'UIW_LoadLevel_C_BndEvt__List_K2Node_ComponentBoundEvent_5_SimpleListItemEventDynamic__DelegateSignature::Item' has a wrong offset!");

// Function UIW_LoadLevel.UIW_LoadLevel_C.BndEvt__List_K2Node_ComponentBoundEvent_3_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UIW_LoadLevel_C_BndEvt__List_K2Node_ComponentBoundEvent_3_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_LoadLevel_C_BndEvt__List_K2Node_ComponentBoundEvent_3_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on UIW_LoadLevel_C_BndEvt__List_K2Node_ComponentBoundEvent_3_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(sizeof(UIW_LoadLevel_C_BndEvt__List_K2Node_ComponentBoundEvent_3_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000010, "Wrong size on UIW_LoadLevel_C_BndEvt__List_K2Node_ComponentBoundEvent_3_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(offsetof(UIW_LoadLevel_C_BndEvt__List_K2Node_ComponentBoundEvent_3_OnListItemSelectionChangedDynamic__DelegateSignature, Item) == 0x000000, "Member 'UIW_LoadLevel_C_BndEvt__List_K2Node_ComponentBoundEvent_3_OnListItemSelectionChangedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_BndEvt__List_K2Node_ComponentBoundEvent_3_OnListItemSelectionChangedDynamic__DelegateSignature, bIsSelected) == 0x000008, "Member 'UIW_LoadLevel_C_BndEvt__List_K2Node_ComponentBoundEvent_3_OnListItemSelectionChangedDynamic__DelegateSignature::bIsSelected' has a wrong offset!");

// Function UIW_LoadLevel.UIW_LoadLevel_C.BndEvt__Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_LoadLevel_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_LoadLevel_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_LoadLevel_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature");
static_assert(sizeof(UIW_LoadLevel_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_LoadLevel_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature");
static_assert(offsetof(UIW_LoadLevel_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_LoadLevel_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_LoadLevel.UIW_LoadLevel_C.BndEvt__Btn_Delete_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_LoadLevel_C_BndEvt__Btn_Delete_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_LoadLevel_C_BndEvt__Btn_Delete_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_LoadLevel_C_BndEvt__Btn_Delete_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature");
static_assert(sizeof(UIW_LoadLevel_C_BndEvt__Btn_Delete_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_LoadLevel_C_BndEvt__Btn_Delete_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature");
static_assert(offsetof(UIW_LoadLevel_C_BndEvt__Btn_Delete_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_LoadLevel_C_BndEvt__Btn_Delete_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_LoadLevel.UIW_LoadLevel_C.BndEvt__Btn_Select_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_LoadLevel_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_LoadLevel_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_LoadLevel_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature");
static_assert(sizeof(UIW_LoadLevel_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_LoadLevel_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature");
static_assert(offsetof(UIW_LoadLevel_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_LoadLevel_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_LoadLevel.UIW_LoadLevel_C.RefreshSaveData
// 0x00F0 (0x00F0 - 0x0000)
struct UIW_LoadLevel_C_RefreshSaveData final
{
public:
	int32                                         LocalIndex;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUIBP_ListData_SaveData_C*>      LocalListData;                                     // 0x0008(0x0010)(Edit, BlueprintVisible)
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLCharacterStorageData>         CallFunc_GetSaveData_outCharacterList;             // 0x0028(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetSaveData_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_SaveData_C*              CallFunc_SpawnObject_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0048(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_SaveData_C*              CallFunc_SpawnObject_ReturnValue_1;                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00C8(0x0018)()
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_LoadLevel_C_RefreshSaveData) == 0x000008, "Wrong alignment on UIW_LoadLevel_C_RefreshSaveData");
static_assert(sizeof(UIW_LoadLevel_C_RefreshSaveData) == 0x0000F0, "Wrong size on UIW_LoadLevel_C_RefreshSaveData");
static_assert(offsetof(UIW_LoadLevel_C_RefreshSaveData, LocalIndex) == 0x000000, "Member 'UIW_LoadLevel_C_RefreshSaveData::LocalIndex' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_RefreshSaveData, LocalListData) == 0x000008, "Member 'UIW_LoadLevel_C_RefreshSaveData::LocalListData' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_RefreshSaveData, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'UIW_LoadLevel_C_RefreshSaveData::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_RefreshSaveData, Temp_int_Variable) == 0x000020, "Member 'UIW_LoadLevel_C_RefreshSaveData::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_RefreshSaveData, CallFunc_GetSaveData_outCharacterList) == 0x000028, "Member 'UIW_LoadLevel_C_RefreshSaveData::CallFunc_GetSaveData_outCharacterList' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_RefreshSaveData, CallFunc_GetSaveData_ReturnValue) == 0x000038, "Member 'UIW_LoadLevel_C_RefreshSaveData::CallFunc_GetSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_RefreshSaveData, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000039, "Member 'UIW_LoadLevel_C_RefreshSaveData::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_RefreshSaveData, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'UIW_LoadLevel_C_RefreshSaveData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_RefreshSaveData, CallFunc_SpawnObject_ReturnValue) == 0x000040, "Member 'UIW_LoadLevel_C_RefreshSaveData::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_RefreshSaveData, CallFunc_GetGameStrWithName_ReturnValue) == 0x000048, "Member 'UIW_LoadLevel_C_RefreshSaveData::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_RefreshSaveData, CallFunc_Conv_TextToString_ReturnValue) == 0x000060, "Member 'UIW_LoadLevel_C_RefreshSaveData::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_RefreshSaveData, CallFunc_Concat_StrStr_ReturnValue) == 0x000070, "Member 'UIW_LoadLevel_C_RefreshSaveData::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_RefreshSaveData, CallFunc_Array_Add_ReturnValue) == 0x000080, "Member 'UIW_LoadLevel_C_RefreshSaveData::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_RefreshSaveData, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000084, "Member 'UIW_LoadLevel_C_RefreshSaveData::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_RefreshSaveData, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'UIW_LoadLevel_C_RefreshSaveData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_RefreshSaveData, CallFunc_SpawnObject_ReturnValue_1) == 0x000090, "Member 'UIW_LoadLevel_C_RefreshSaveData::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_RefreshSaveData, CallFunc_Conv_IntToString_ReturnValue) == 0x000098, "Member 'UIW_LoadLevel_C_RefreshSaveData::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_RefreshSaveData, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000A8, "Member 'UIW_LoadLevel_C_RefreshSaveData::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_RefreshSaveData, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000B8, "Member 'UIW_LoadLevel_C_RefreshSaveData::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_RefreshSaveData, CallFunc_Conv_StringToText_ReturnValue) == 0x0000C8, "Member 'UIW_LoadLevel_C_RefreshSaveData::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_RefreshSaveData, CallFunc_Array_Add_ReturnValue_1) == 0x0000E0, "Member 'UIW_LoadLevel_C_RefreshSaveData::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_RefreshSaveData, CallFunc_Array_LastIndex_ReturnValue) == 0x0000E4, "Member 'UIW_LoadLevel_C_RefreshSaveData::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_RefreshSaveData, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0000E8, "Member 'UIW_LoadLevel_C_RefreshSaveData::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function UIW_LoadLevel.UIW_LoadLevel_C.FocusManage
// 0x02D0 (0x02D0 - 0x0000)
struct UIW_LoadLevel_C_FocusManage final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_FocusManage_ReturnValue;                  // 0x0160(0x00B8)()
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0218(0x00B8)()
};
static_assert(alignof(UIW_LoadLevel_C_FocusManage) == 0x000008, "Wrong alignment on UIW_LoadLevel_C_FocusManage");
static_assert(sizeof(UIW_LoadLevel_C_FocusManage) == 0x0002D0, "Wrong size on UIW_LoadLevel_C_FocusManage");
static_assert(offsetof(UIW_LoadLevel_C_FocusManage, MyGeometry) == 0x000000, "Member 'UIW_LoadLevel_C_FocusManage::MyGeometry' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_FocusManage, MouseEvent) == 0x000038, "Member 'UIW_LoadLevel_C_FocusManage::MouseEvent' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_FocusManage, ReturnValue) == 0x0000A8, "Member 'UIW_LoadLevel_C_FocusManage::ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_FocusManage, CallFunc_FocusManage_ReturnValue) == 0x000160, "Member 'UIW_LoadLevel_C_FocusManage::CallFunc_FocusManage_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_FocusManage, K2Node_MakeStruct_EventReply) == 0x000218, "Member 'UIW_LoadLevel_C_FocusManage::K2Node_MakeStruct_EventReply' has a wrong offset!");

// Function UIW_LoadLevel.UIW_LoadLevel_C.CallbackDeleteSaveData
// 0x0038 (0x0038 - 0x0000)
struct UIW_LoadLevel_C_CallbackDeleteSaveData final
{
public:
	class UUIW_Popup_C*                           Popup;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_SaveData_C*              K2Node_DynamicCast_AsUIBP_List_Data_Save_Data;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_LoadLevel_C_CallbackDeleteSaveData) == 0x000008, "Wrong alignment on UIW_LoadLevel_C_CallbackDeleteSaveData");
static_assert(sizeof(UIW_LoadLevel_C_CallbackDeleteSaveData) == 0x000038, "Wrong size on UIW_LoadLevel_C_CallbackDeleteSaveData");
static_assert(offsetof(UIW_LoadLevel_C_CallbackDeleteSaveData, Popup) == 0x000000, "Member 'UIW_LoadLevel_C_CallbackDeleteSaveData::Popup' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_CallbackDeleteSaveData, BtnKey) == 0x000008, "Member 'UIW_LoadLevel_C_CallbackDeleteSaveData::BtnKey' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_CallbackDeleteSaveData, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x000010, "Member 'UIW_LoadLevel_C_CallbackDeleteSaveData::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_CallbackDeleteSaveData, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'UIW_LoadLevel_C_CallbackDeleteSaveData::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_CallbackDeleteSaveData, K2Node_DynamicCast_AsUIBP_List_Data_Save_Data) == 0x000020, "Member 'UIW_LoadLevel_C_CallbackDeleteSaveData::K2Node_DynamicCast_AsUIBP_List_Data_Save_Data' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_CallbackDeleteSaveData, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'UIW_LoadLevel_C_CallbackDeleteSaveData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_CallbackDeleteSaveData, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'UIW_LoadLevel_C_CallbackDeleteSaveData::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function UIW_LoadLevel.UIW_LoadLevel_C.AddEventBinding
// 0x0018 (0x0018 - 0x0000)
struct UIW_LoadLevel_C_AddEventBinding final
{
public:
	TDelegate<void(ELLobbyMenu LobbyMenu, bool ProcessResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_LoadLevel_C_AddEventBinding) == 0x000008, "Wrong alignment on UIW_LoadLevel_C_AddEventBinding");
static_assert(sizeof(UIW_LoadLevel_C_AddEventBinding) == 0x000018, "Wrong size on UIW_LoadLevel_C_AddEventBinding");
static_assert(offsetof(UIW_LoadLevel_C_AddEventBinding, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'UIW_LoadLevel_C_AddEventBinding::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_AddEventBinding, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'UIW_LoadLevel_C_AddEventBinding::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function UIW_LoadLevel.UIW_LoadLevel_C.ClearEventBinding
// 0x0018 (0x0018 - 0x0000)
struct UIW_LoadLevel_C_ClearEventBinding final
{
public:
	TDelegate<void(ELLobbyMenu LobbyMenu, bool ProcessResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_LoadLevel_C_ClearEventBinding) == 0x000008, "Wrong alignment on UIW_LoadLevel_C_ClearEventBinding");
static_assert(sizeof(UIW_LoadLevel_C_ClearEventBinding) == 0x000018, "Wrong size on UIW_LoadLevel_C_ClearEventBinding");
static_assert(offsetof(UIW_LoadLevel_C_ClearEventBinding, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'UIW_LoadLevel_C_ClearEventBinding::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ClearEventBinding, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'UIW_LoadLevel_C_ClearEventBinding::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function UIW_LoadLevel.UIW_LoadLevel_C.OnLobbyProcessEnd
// 0x0050 (0x0050 - 0x0000)
struct UIW_LoadLevel_C_OnLobbyProcessEnd final
{
public:
	ELLobbyMenu                                   LobbyMenu;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ProcessResult;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0008(0x0018)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULUISystem*                             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLCharacterStorageData>         CallFunc_GetSaveData_outCharacterList;             // 0x0038(0x0010)(ReferenceParm)
	bool                                          CallFunc_GetSaveData_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_LoadLevel_C_OnLobbyProcessEnd) == 0x000008, "Wrong alignment on UIW_LoadLevel_C_OnLobbyProcessEnd");
static_assert(sizeof(UIW_LoadLevel_C_OnLobbyProcessEnd) == 0x000050, "Wrong size on UIW_LoadLevel_C_OnLobbyProcessEnd");
static_assert(offsetof(UIW_LoadLevel_C_OnLobbyProcessEnd, LobbyMenu) == 0x000000, "Member 'UIW_LoadLevel_C_OnLobbyProcessEnd::LobbyMenu' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_OnLobbyProcessEnd, ProcessResult) == 0x000001, "Member 'UIW_LoadLevel_C_OnLobbyProcessEnd::ProcessResult' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_OnLobbyProcessEnd, CallFunc_GetGameStrWithName_ReturnValue) == 0x000008, "Member 'UIW_LoadLevel_C_OnLobbyProcessEnd::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_OnLobbyProcessEnd, K2Node_SwitchEnum_CmpSuccess) == 0x000020, "Member 'UIW_LoadLevel_C_OnLobbyProcessEnd::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_OnLobbyProcessEnd, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000028, "Member 'UIW_LoadLevel_C_OnLobbyProcessEnd::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_OnLobbyProcessEnd, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000030, "Member 'UIW_LoadLevel_C_OnLobbyProcessEnd::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_OnLobbyProcessEnd, CallFunc_GetSaveData_outCharacterList) == 0x000038, "Member 'UIW_LoadLevel_C_OnLobbyProcessEnd::CallFunc_GetSaveData_outCharacterList' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_OnLobbyProcessEnd, CallFunc_GetSaveData_ReturnValue) == 0x000048, "Member 'UIW_LoadLevel_C_OnLobbyProcessEnd::CallFunc_GetSaveData_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_OnLobbyProcessEnd, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000049, "Member 'UIW_LoadLevel_C_OnLobbyProcessEnd::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function UIW_LoadLevel.UIW_LoadLevel_C.ShowDownloadingPopup
// 0x0038 (0x0038 - 0x0000)
struct UIW_LoadLevel_C_ShowDownloadingPopup final
{
public:
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0000(0x0018)()
	TDelegate<void(class UUIW_Popup_C* Popup, class UUIW_Btn_Key_C* BtnKey)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Popup_C*                           CallFunc_AddPopupWidget_Widget;                    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_LoadLevel_C_ShowDownloadingPopup) == 0x000008, "Wrong alignment on UIW_LoadLevel_C_ShowDownloadingPopup");
static_assert(sizeof(UIW_LoadLevel_C_ShowDownloadingPopup) == 0x000038, "Wrong size on UIW_LoadLevel_C_ShowDownloadingPopup");
static_assert(offsetof(UIW_LoadLevel_C_ShowDownloadingPopup, CallFunc_GetGameStrWithName_ReturnValue) == 0x000000, "Member 'UIW_LoadLevel_C_ShowDownloadingPopup::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ShowDownloadingPopup, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'UIW_LoadLevel_C_ShowDownloadingPopup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ShowDownloadingPopup, CallFunc_GetMainWidget_MainWidget) == 0x000028, "Member 'UIW_LoadLevel_C_ShowDownloadingPopup::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_ShowDownloadingPopup, CallFunc_AddPopupWidget_Widget) == 0x000030, "Member 'UIW_LoadLevel_C_ShowDownloadingPopup::CallFunc_AddPopupWidget_Widget' has a wrong offset!");

// Function UIW_LoadLevel.UIW_LoadLevel_C.NavToEnd
// 0x0010 (0x0010 - 0x0000)
struct UIW_LoadLevel_C_NavToEnd final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_LoadLevel_C_NavToEnd) == 0x000008, "Wrong alignment on UIW_LoadLevel_C_NavToEnd");
static_assert(sizeof(UIW_LoadLevel_C_NavToEnd) == 0x000010, "Wrong size on UIW_LoadLevel_C_NavToEnd");
static_assert(offsetof(UIW_LoadLevel_C_NavToEnd, Navigation_0) == 0x000000, "Member 'UIW_LoadLevel_C_NavToEnd::Navigation_0' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_NavToEnd, ReturnValue) == 0x000008, "Member 'UIW_LoadLevel_C_NavToEnd::ReturnValue' has a wrong offset!");

// Function UIW_LoadLevel.UIW_LoadLevel_C.NavToStart
// 0x0010 (0x0010 - 0x0000)
struct UIW_LoadLevel_C_NavToStart final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_LoadLevel_C_NavToStart) == 0x000008, "Wrong alignment on UIW_LoadLevel_C_NavToStart");
static_assert(sizeof(UIW_LoadLevel_C_NavToStart) == 0x000010, "Wrong size on UIW_LoadLevel_C_NavToStart");
static_assert(offsetof(UIW_LoadLevel_C_NavToStart, Navigation_0) == 0x000000, "Member 'UIW_LoadLevel_C_NavToStart::Navigation_0' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_NavToStart, ReturnValue) == 0x000008, "Member 'UIW_LoadLevel_C_NavToStart::ReturnValue' has a wrong offset!");

// Function UIW_LoadLevel.UIW_LoadLevel_C.SetRequesting
// 0x0010 (0x0010 - 0x0000)
struct UIW_LoadLevel_C_SetRequesting final
{
public:
	bool                                          IsRequesting_0;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_LoadLevel_C_SetRequesting) == 0x000008, "Wrong alignment on UIW_LoadLevel_C_SetRequesting");
static_assert(sizeof(UIW_LoadLevel_C_SetRequesting) == 0x000010, "Wrong size on UIW_LoadLevel_C_SetRequesting");
static_assert(offsetof(UIW_LoadLevel_C_SetRequesting, IsRequesting_0) == 0x000000, "Member 'UIW_LoadLevel_C_SetRequesting::IsRequesting_0' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_SetRequesting, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'UIW_LoadLevel_C_SetRequesting::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function UIW_LoadLevel.UIW_LoadLevel_C.FailRequest
// 0x0020 (0x0020 - 0x0000)
struct UIW_LoadLevel_C_FailRequest final
{
public:
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0000(0x0018)()
	class ULUISystem*                             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_LoadLevel_C_FailRequest) == 0x000008, "Wrong alignment on UIW_LoadLevel_C_FailRequest");
static_assert(sizeof(UIW_LoadLevel_C_FailRequest) == 0x000020, "Wrong size on UIW_LoadLevel_C_FailRequest");
static_assert(offsetof(UIW_LoadLevel_C_FailRequest, CallFunc_GetGameStrWithName_ReturnValue) == 0x000000, "Member 'UIW_LoadLevel_C_FailRequest::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_LoadLevel_C_FailRequest, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000018, "Member 'UIW_LoadLevel_C_FailRequest::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function UIW_LoadLevel.UIW_LoadLevel_C.SetEnabledWindow
// 0x0001 (0x0001 - 0x0000)
struct UIW_LoadLevel_C_SetEnabledWindow final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_LoadLevel_C_SetEnabledWindow) == 0x000001, "Wrong alignment on UIW_LoadLevel_C_SetEnabledWindow");
static_assert(sizeof(UIW_LoadLevel_C_SetEnabledWindow) == 0x000001, "Wrong size on UIW_LoadLevel_C_SetEnabledWindow");
static_assert(offsetof(UIW_LoadLevel_C_SetEnabledWindow, IsEnabled) == 0x000000, "Member 'UIW_LoadLevel_C_SetEnabledWindow::IsEnabled' has a wrong offset!");

}

