#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HelpMate

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_HelpMate.UIW_HelpMate_C
// 0x0050 (0x02F8 - 0x02A8)
class UUIW_HelpMate_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         AbnormalBox;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_HUD_Gauge_HP_C*                    Gauge_HP;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Name;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           RefreshTimer;                                      // 0x02C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ALNPCCharacter*                         NPCActor;                                          // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PrevHP;                                            // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PrevRegainHP;                                      // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULAbnormalComponent*                    AbnormalComponent;                                 // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUIW_HUD_Abnormal_Item_C*>       Pool;                                              // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_UIW_HelpMate(int32 EntryPoint);
	void Destruct();
	void Construct();
	void ShowHelpmateHPBar(class ALNPCCharacter* NPCActor_0, bool IsVisible_0);
	void OnTweenComplete(class FName CategoryName);
	void RefreshHP();
	void SetHP(float HPPrecent);
	void OnHelpmateAbnormal(class FName AbnormalName, int64 AbnormalUniqueId, bool Visible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_HelpMate_C">();
	}
	static class UUIW_HelpMate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_HelpMate_C>();
	}
};
static_assert(alignof(UUIW_HelpMate_C) == 0x000008, "Wrong alignment on UUIW_HelpMate_C");
static_assert(sizeof(UUIW_HelpMate_C) == 0x0002F8, "Wrong size on UUIW_HelpMate_C");
static_assert(offsetof(UUIW_HelpMate_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_HelpMate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_HelpMate_C, AbnormalBox) == 0x0002B0, "Member 'UUIW_HelpMate_C::AbnormalBox' has a wrong offset!");
static_assert(offsetof(UUIW_HelpMate_C, Gauge_HP) == 0x0002B8, "Member 'UUIW_HelpMate_C::Gauge_HP' has a wrong offset!");
static_assert(offsetof(UUIW_HelpMate_C, Text_Name) == 0x0002C0, "Member 'UUIW_HelpMate_C::Text_Name' has a wrong offset!");
static_assert(offsetof(UUIW_HelpMate_C, RefreshTimer) == 0x0002C8, "Member 'UUIW_HelpMate_C::RefreshTimer' has a wrong offset!");
static_assert(offsetof(UUIW_HelpMate_C, NPCActor) == 0x0002D0, "Member 'UUIW_HelpMate_C::NPCActor' has a wrong offset!");
static_assert(offsetof(UUIW_HelpMate_C, PrevHP) == 0x0002D8, "Member 'UUIW_HelpMate_C::PrevHP' has a wrong offset!");
static_assert(offsetof(UUIW_HelpMate_C, PrevRegainHP) == 0x0002DC, "Member 'UUIW_HelpMate_C::PrevRegainHP' has a wrong offset!");
static_assert(offsetof(UUIW_HelpMate_C, AbnormalComponent) == 0x0002E0, "Member 'UUIW_HelpMate_C::AbnormalComponent' has a wrong offset!");
static_assert(offsetof(UUIW_HelpMate_C, Pool) == 0x0002E8, "Member 'UUIW_HelpMate_C::Pool' has a wrong offset!");

}

