#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_SlaveArm_Reinforce

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UIST_Color_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function UIW_SlaveArm_Reinforce.UIW_SlaveArm_Reinforce_C.ExecuteUbergraph_UIW_SlaveArm_Reinforce
// 0x01B0 (0x01B0 - 0x0000)
struct UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_1;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULSlaveArmReinforcementSystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget_1;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUIW_Popup_C* Popup, class UUIW_Btn_Key_C* BtnKey)> K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class UUIW_Popup_C*                           CallFunc_AddPopupWidget_Widget;                    // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UListView*                              CallFunc_GetResourceListView_ListView;             // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerInventory*                      CallFunc_GetPlayerInventory_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_Resource_C*              CallFunc_SpawnObject_ReturnValue;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        K2Node_MakeArray_Array_1;                          // 0x0080(0x0010)(ReferenceParm)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerInventory*                      CallFunc_GetPlayerInventory_ReturnValue_1;         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x00A0(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x00B8(0x0018)()
	class FName                                   CallFunc_GetRequireItemCodeName_ReturnValue;       // 0x00D0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRequireItemCount_ReturnValue;          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemTotalCountByCodeName_ReturnValue;  // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetRequireItemCodeName_ReturnValue_1;     // 0x00E0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRequireItemCount_ReturnValue_1;        // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetItemTotalCountByCodeName_ReturnValue_1; // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemCommonInfoPtr                     CallFunc_FindItemCommonInfoByNameBP_ReturnValue;   // 0x00F8(0x0008)(NoDestructor)
	TSoftObjectPtr<class UObject>                 CallFunc_GetImageResource_ReturnValue;             // 0x0100(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalTextNameLocalize_ReturnValue;     // 0x0128(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0140(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0180(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0190(0x0018)()
	class ULUISystem*                             CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce) == 0x000008, "Wrong alignment on UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce");
static_assert(sizeof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce) == 0x0001B0, "Wrong size on UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, EntryPoint) == 0x000000, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, CallFunc_GetMainWidget_MainWidget) == 0x000008, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, K2Node_ComponentBoundEvent_BtnKey_1) == 0x000010, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::K2Node_ComponentBoundEvent_BtnKey_1' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, K2Node_MakeArray_Array) == 0x000018, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, K2Node_ComponentBoundEvent_BtnKey) == 0x000028, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::K2Node_ComponentBoundEvent_BtnKey' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000038, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, CallFunc_GetMainWidget_MainWidget_1) == 0x000040, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::CallFunc_GetMainWidget_MainWidget_1' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, CallFunc_AddPopupWidget_Widget) == 0x000058, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::CallFunc_AddPopupWidget_Widget' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x000060, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, CallFunc_GetResourceListView_ListView) == 0x000068, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::CallFunc_GetResourceListView_ListView' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, CallFunc_GetPlayerInventory_ReturnValue) == 0x000070, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::CallFunc_GetPlayerInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, CallFunc_SpawnObject_ReturnValue) == 0x000078, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, K2Node_MakeArray_Array_1) == 0x000080, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x000090, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, CallFunc_GetPlayerInventory_ReturnValue_1) == 0x000098, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::CallFunc_GetPlayerInventory_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, CallFunc_GetGameStrWithName_ReturnValue) == 0x0000A0, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, CallFunc_GetGameStrWithName_ReturnValue_1) == 0x0000B8, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::CallFunc_GetGameStrWithName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, CallFunc_GetRequireItemCodeName_ReturnValue) == 0x0000D0, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::CallFunc_GetRequireItemCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, CallFunc_GetRequireItemCount_ReturnValue) == 0x0000D8, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::CallFunc_GetRequireItemCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, CallFunc_GetItemTotalCountByCodeName_ReturnValue) == 0x0000DC, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::CallFunc_GetItemTotalCountByCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, CallFunc_GetRequireItemCodeName_ReturnValue_1) == 0x0000E0, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::CallFunc_GetRequireItemCodeName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, CallFunc_GetRequireItemCount_ReturnValue_1) == 0x0000E8, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::CallFunc_GetRequireItemCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, CallFunc_GetItemTotalCountByCodeName_ReturnValue_1) == 0x0000EC, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::CallFunc_GetItemTotalCountByCodeName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, CallFunc_Greater_IntInt_ReturnValue) == 0x0000F0, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, CallFunc_FindItemCommonInfoByNameBP_ReturnValue) == 0x0000F8, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::CallFunc_FindItemCommonInfoByNameBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, CallFunc_GetImageResource_ReturnValue) == 0x000100, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::CallFunc_GetImageResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, CallFunc_GetLocalTextNameLocalize_ReturnValue) == 0x000128, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::CallFunc_GetLocalTextNameLocalize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, K2Node_MakeStruct_FormatArgumentData) == 0x000140, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, K2Node_MakeArray_Array_2) == 0x000180, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, CallFunc_Format_ReturnValue) == 0x000190, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x0001A8, "Member 'UIW_SlaveArm_Reinforce_C_ExecuteUbergraph_UIW_SlaveArm_Reinforce::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");

// Function UIW_SlaveArm_Reinforce.UIW_SlaveArm_Reinforce_C.BndEvt__UIW_SlaveArm_Btn_Upgrade_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_SlaveArm_Reinforce_C_BndEvt__UIW_SlaveArm_Btn_Upgrade_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_SlaveArm_Reinforce_C_BndEvt__UIW_SlaveArm_Btn_Upgrade_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_SlaveArm_Reinforce_C_BndEvt__UIW_SlaveArm_Btn_Upgrade_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature");
static_assert(sizeof(UIW_SlaveArm_Reinforce_C_BndEvt__UIW_SlaveArm_Btn_Upgrade_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_SlaveArm_Reinforce_C_BndEvt__UIW_SlaveArm_Btn_Upgrade_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_BndEvt__UIW_SlaveArm_Btn_Upgrade_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_SlaveArm_Reinforce_C_BndEvt__UIW_SlaveArm_Btn_Upgrade_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_SlaveArm_Reinforce.UIW_SlaveArm_Reinforce_C.BndEvt__UIW_SlaveArm_Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_SlaveArm_Reinforce_C_BndEvt__UIW_SlaveArm_Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_SlaveArm_Reinforce_C_BndEvt__UIW_SlaveArm_Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_SlaveArm_Reinforce_C_BndEvt__UIW_SlaveArm_Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature");
static_assert(sizeof(UIW_SlaveArm_Reinforce_C_BndEvt__UIW_SlaveArm_Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_SlaveArm_Reinforce_C_BndEvt__UIW_SlaveArm_Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_BndEvt__UIW_SlaveArm_Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_SlaveArm_Reinforce_C_BndEvt__UIW_SlaveArm_Btn_Back_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_SlaveArm_Reinforce.UIW_SlaveArm_Reinforce_C.OnReady
// 0x00D8 (0x00D8 - 0x0000)
struct UIW_SlaveArm_Reinforce_C_OnReady final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBinkMediaTexture*                      K2Node_DynamicCast_AsBink_Media_Texture;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUIW_SlaveArm_ReinforceSlot_C*>  K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0040(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UUIW_ListItem_SlaveArm_ReinforceInfo_C* Slot)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0078(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void(class UObject* Item, bool bIsSelected)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_ListItem_SlaveArm_ReinforceInfo_C* K2Node_DynamicCast_AsUIW_List_Item_Slave_Arm_Reinforce_Info; // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UUIW_Btn_Key_C* BtnKey)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UUIW_Btn_Key_C* BtnKey)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(UIW_SlaveArm_Reinforce_C_OnReady) == 0x000008, "Wrong alignment on UIW_SlaveArm_Reinforce_C_OnReady");
static_assert(sizeof(UIW_SlaveArm_Reinforce_C_OnReady) == 0x0000D8, "Wrong size on UIW_SlaveArm_Reinforce_C_OnReady");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_OnReady, Temp_int_Array_Index_Variable) == 0x000000, "Member 'UIW_SlaveArm_Reinforce_C_OnReady::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_OnReady, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UIW_SlaveArm_Reinforce_C_OnReady::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_OnReady, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UIW_SlaveArm_Reinforce_C_OnReady::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_OnReady, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'UIW_SlaveArm_Reinforce_C_OnReady::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_OnReady, CallFunc_K2_GetTextureParameterValue_ReturnValue) == 0x000018, "Member 'UIW_SlaveArm_Reinforce_C_OnReady::CallFunc_K2_GetTextureParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_OnReady, K2Node_DynamicCast_AsBink_Media_Texture) == 0x000020, "Member 'UIW_SlaveArm_Reinforce_C_OnReady::K2Node_DynamicCast_AsBink_Media_Texture' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_OnReady, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'UIW_SlaveArm_Reinforce_C_OnReady::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_OnReady, K2Node_MakeArray_Array) == 0x000030, "Member 'UIW_SlaveArm_Reinforce_C_OnReady::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_OnReady, CallFunc_GetGameStrWithName_ReturnValue) == 0x000040, "Member 'UIW_SlaveArm_Reinforce_C_OnReady::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_OnReady, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'UIW_SlaveArm_Reinforce_C_OnReady::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_OnReady, K2Node_CreateDelegate_OutputDelegate_1) == 0x000068, "Member 'UIW_SlaveArm_Reinforce_C_OnReady::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_OnReady, CallFunc_GetAllChildren_ReturnValue) == 0x000078, "Member 'UIW_SlaveArm_Reinforce_C_OnReady::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_OnReady, K2Node_CreateDelegate_OutputDelegate_2) == 0x000088, "Member 'UIW_SlaveArm_Reinforce_C_OnReady::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_OnReady, CallFunc_Array_Get_Item) == 0x000098, "Member 'UIW_SlaveArm_Reinforce_C_OnReady::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_OnReady, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'UIW_SlaveArm_Reinforce_C_OnReady::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_OnReady, K2Node_DynamicCast_AsUIW_List_Item_Slave_Arm_Reinforce_Info) == 0x0000A8, "Member 'UIW_SlaveArm_Reinforce_C_OnReady::K2Node_DynamicCast_AsUIW_List_Item_Slave_Arm_Reinforce_Info' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_OnReady, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'UIW_SlaveArm_Reinforce_C_OnReady::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_OnReady, CallFunc_Less_IntInt_ReturnValue) == 0x0000B1, "Member 'UIW_SlaveArm_Reinforce_C_OnReady::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_OnReady, CallFunc_Array_Add_ReturnValue) == 0x0000B4, "Member 'UIW_SlaveArm_Reinforce_C_OnReady::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_OnReady, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000B8, "Member 'UIW_SlaveArm_Reinforce_C_OnReady::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_OnReady, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000C8, "Member 'UIW_SlaveArm_Reinforce_C_OnReady::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

// Function UIW_SlaveArm_Reinforce.UIW_SlaveArm_Reinforce_C.MoveLeftTab
// 0x0008 (0x0008 - 0x0000)
struct UIW_SlaveArm_Reinforce_C_MoveLeftTab final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_SlaveArm_Reinforce_C_MoveLeftTab) == 0x000008, "Wrong alignment on UIW_SlaveArm_Reinforce_C_MoveLeftTab");
static_assert(sizeof(UIW_SlaveArm_Reinforce_C_MoveLeftTab) == 0x000008, "Wrong size on UIW_SlaveArm_Reinforce_C_MoveLeftTab");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_MoveLeftTab, BtnKey) == 0x000000, "Member 'UIW_SlaveArm_Reinforce_C_MoveLeftTab::BtnKey' has a wrong offset!");

// Function UIW_SlaveArm_Reinforce.UIW_SlaveArm_Reinforce_C.MoveRightTab
// 0x0008 (0x0008 - 0x0000)
struct UIW_SlaveArm_Reinforce_C_MoveRightTab final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_SlaveArm_Reinforce_C_MoveRightTab) == 0x000008, "Wrong alignment on UIW_SlaveArm_Reinforce_C_MoveRightTab");
static_assert(sizeof(UIW_SlaveArm_Reinforce_C_MoveRightTab) == 0x000008, "Wrong size on UIW_SlaveArm_Reinforce_C_MoveRightTab");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_MoveRightTab, BtnKey) == 0x000000, "Member 'UIW_SlaveArm_Reinforce_C_MoveRightTab::BtnKey' has a wrong offset!");

// Function UIW_SlaveArm_Reinforce.UIW_SlaveArm_Reinforce_C.ChangeTab
// 0x0068 (0x0068 - 0x0000)
struct UIW_SlaveArm_Reinforce_C_ChangeTab final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_Default_C*               K2Node_DynamicCast_AsUIBP_List_Data_Default;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCodeName_ReturnValue;                  // 0x001C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0028(0x0018)()
	class ULSlaveArmReinforcementSystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULSlaveArmPage*                         CallFunc_GetSlaveArmPageBySlaveArmCodeName_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULSlaveArmReinforcementSystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ULSlaveArmTree*>                 CallFunc_GetSlaveArmTreeListByPageCodeName_ReturnValue; // 0x0058(0x0010)(ReferenceParm)
};
static_assert(alignof(UIW_SlaveArm_Reinforce_C_ChangeTab) == 0x000008, "Wrong alignment on UIW_SlaveArm_Reinforce_C_ChangeTab");
static_assert(sizeof(UIW_SlaveArm_Reinforce_C_ChangeTab) == 0x000068, "Wrong size on UIW_SlaveArm_Reinforce_C_ChangeTab");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ChangeTab, Item) == 0x000000, "Member 'UIW_SlaveArm_Reinforce_C_ChangeTab::Item' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ChangeTab, bIsSelected) == 0x000008, "Member 'UIW_SlaveArm_Reinforce_C_ChangeTab::bIsSelected' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ChangeTab, K2Node_DynamicCast_AsUIBP_List_Data_Default) == 0x000010, "Member 'UIW_SlaveArm_Reinforce_C_ChangeTab::K2Node_DynamicCast_AsUIBP_List_Data_Default' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ChangeTab, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UIW_SlaveArm_Reinforce_C_ChangeTab::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ChangeTab, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000019, "Member 'UIW_SlaveArm_Reinforce_C_ChangeTab::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ChangeTab, CallFunc_GetCodeName_ReturnValue) == 0x00001C, "Member 'UIW_SlaveArm_Reinforce_C_ChangeTab::CallFunc_GetCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ChangeTab, CallFunc_GetGameStrWithName_ReturnValue) == 0x000028, "Member 'UIW_SlaveArm_Reinforce_C_ChangeTab::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ChangeTab, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000040, "Member 'UIW_SlaveArm_Reinforce_C_ChangeTab::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ChangeTab, CallFunc_GetSlaveArmPageBySlaveArmCodeName_ReturnValue) == 0x000048, "Member 'UIW_SlaveArm_Reinforce_C_ChangeTab::CallFunc_GetSlaveArmPageBySlaveArmCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ChangeTab, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000050, "Member 'UIW_SlaveArm_Reinforce_C_ChangeTab::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_ChangeTab, CallFunc_GetSlaveArmTreeListByPageCodeName_ReturnValue) == 0x000058, "Member 'UIW_SlaveArm_Reinforce_C_ChangeTab::CallFunc_GetSlaveArmTreeListByPageCodeName_ReturnValue' has a wrong offset!");

// Function UIW_SlaveArm_Reinforce.UIW_SlaveArm_Reinforce_C.RefreshTab
// 0x00C8 (0x00C8 - 0x0000)
struct UIW_SlaveArm_Reinforce_C_RefreshTab final
{
public:
	TArray<class ULSlaveArmPage*>                 LocalSlaveArmPage;                                 // 0x0000(0x0010)(Edit, BlueprintVisible)
	class FName                                   LocalName;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LocalIndex;                                        // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUIBP_ListData_Default_C*>       LocalListData;                                     // 0x0020(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULSlaveArmReinforcementSystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ULSlaveArmPage*>                 CallFunc_GetSlaveArmPageList_ReturnValue;          // 0x0048(0x0010)(ReferenceParm)
	class UUIBP_ListData_Default_C*               CallFunc_SpawnObject_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLEquipItemSlot                        CallFunc_GetChosenSlaveArmItem_ReturnValue;        // 0x0070(0x0018)(NoDestructor)
	class ULSlaveArmPage*                         CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCodeName_ReturnValue;                  // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetActivateRequireItemCodeName_ReturnValue; // 0x0098(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULSlaveArmReinforcementSystem*          CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULSlaveArmPage*                         CallFunc_GetSlaveArmPageBySlaveArmCodeName_ReturnValue; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x00C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_SlaveArm_Reinforce_C_RefreshTab) == 0x000008, "Wrong alignment on UIW_SlaveArm_Reinforce_C_RefreshTab");
static_assert(sizeof(UIW_SlaveArm_Reinforce_C_RefreshTab) == 0x0000C8, "Wrong size on UIW_SlaveArm_Reinforce_C_RefreshTab");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTab, LocalSlaveArmPage) == 0x000000, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTab::LocalSlaveArmPage' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTab, LocalName) == 0x000010, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTab::LocalName' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTab, LocalIndex) == 0x000018, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTab::LocalIndex' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTab, LocalListData) == 0x000020, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTab::LocalListData' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTab, Temp_int_Array_Index_Variable) == 0x000030, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTab::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTab, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTab::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTab, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTab::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTab, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000040, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTab::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTab, CallFunc_GetSlaveArmPageList_ReturnValue) == 0x000048, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTab::CallFunc_GetSlaveArmPageList_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTab, CallFunc_SpawnObject_ReturnValue) == 0x000058, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTab::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTab, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000060, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTab::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTab, CallFunc_GetPlayerEquipment_ReturnValue) == 0x000068, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTab::CallFunc_GetPlayerEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTab, CallFunc_GetChosenSlaveArmItem_ReturnValue) == 0x000070, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTab::CallFunc_GetChosenSlaveArmItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTab, CallFunc_Array_Get_Item) == 0x000088, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTab::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTab, CallFunc_GetCodeName_ReturnValue) == 0x000090, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTab::CallFunc_GetCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTab, CallFunc_GetActivateRequireItemCodeName_ReturnValue) == 0x000098, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTab::CallFunc_GetActivateRequireItemCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTab, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000A0, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTab::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTab, CallFunc_Array_Length_ReturnValue) == 0x0000A4, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTab::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTab, CallFunc_Less_IntInt_ReturnValue) == 0x0000A8, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTab::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTab, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x0000B0, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTab::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTab, CallFunc_GetSlaveArmPageBySlaveArmCodeName_ReturnValue) == 0x0000B8, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTab::CallFunc_GetSlaveArmPageBySlaveArmCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTab, Temp_bool_Variable) == 0x0000C0, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTab::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTab, CallFunc_IsValid_ReturnValue) == 0x0000C1, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTab::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTab, Temp_bool_Variable_1) == 0x0000C2, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTab::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTab, K2Node_Select_Default) == 0x0000C3, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTab::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTab, CallFunc_Array_Add_ReturnValue) == 0x0000C4, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTab::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function UIW_SlaveArm_Reinforce.UIW_SlaveArm_Reinforce_C.RefreshTree
// 0x0098 (0x0098 - 0x0000)
struct UIW_SlaveArm_Reinforce_C_RefreshTree final
{
public:
	bool                                          LocalAllActivated;                                 // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_ListItem_SlaveArm_ReinforceInfo_C* LocalSlot;                                         // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetDepth_ReturnValue;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0038(0x0018)()
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x0050(0x0018)()
	class UUIW_SlaveArm_ReinforceSlot_C*          CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_ListItem_SlaveArm_ReinforceInfo_C* CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_SlaveArm_ReinforceSlot_C*          CallFunc_Array_Get_Item_2;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULSlaveArmTree*                         CallFunc_Array_Get_Item_3;                         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_SlaveArm_Reinforce_C_RefreshTree) == 0x000008, "Wrong alignment on UIW_SlaveArm_Reinforce_C_RefreshTree");
static_assert(sizeof(UIW_SlaveArm_Reinforce_C_RefreshTree) == 0x000098, "Wrong size on UIW_SlaveArm_Reinforce_C_RefreshTree");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTree, LocalAllActivated) == 0x000000, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTree::LocalAllActivated' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTree, LocalSlot) == 0x000008, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTree::LocalSlot' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTree, Temp_bool_True_if_break_was_hit_Variable) == 0x000010, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTree::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTree, Temp_int_Array_Index_Variable) == 0x000014, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTree::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTree, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTree::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTree, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTree::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTree, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTree::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTree, Temp_int_Loop_Counter_Variable_1) == 0x000024, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTree::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTree, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTree::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTree, Temp_int_Array_Index_Variable_1) == 0x00002C, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTree::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTree, CallFunc_GetDepth_ReturnValue) == 0x000030, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTree::CallFunc_GetDepth_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTree, CallFunc_Not_PreBool_ReturnValue_1) == 0x000034, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTree::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTree, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000035, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTree::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTree, CallFunc_BooleanAND_ReturnValue) == 0x000036, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTree::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTree, CallFunc_BooleanAND_ReturnValue_1) == 0x000037, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTree::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTree, CallFunc_GetGameStrWithName_ReturnValue) == 0x000038, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTree::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTree, CallFunc_GetGameStrWithName_ReturnValue_1) == 0x000050, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTree::CallFunc_GetGameStrWithName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTree, CallFunc_Array_Get_Item) == 0x000068, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTree::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTree, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTree::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTree, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTree::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTree, CallFunc_BooleanAND_ReturnValue_2) == 0x000075, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTree::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTree, CallFunc_Array_Get_Item_1) == 0x000078, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTree::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTree, CallFunc_Array_Get_Item_2) == 0x000080, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTree::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTree, CallFunc_Array_Get_Item_3) == 0x000088, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTree::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTree, CallFunc_Array_Length_ReturnValue_1) == 0x000090, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTree::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_SlaveArm_Reinforce_C_RefreshTree, CallFunc_Less_IntInt_ReturnValue_1) == 0x000094, "Member 'UIW_SlaveArm_Reinforce_C_RefreshTree::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function UIW_SlaveArm_Reinforce.UIW_SlaveArm_Reinforce_C.OnFocusedSlot
// 0x00E0 (0x00E0 - 0x0000)
struct UIW_SlaveArm_Reinforce_C_OnFocusedSlot final
{
public:
	class UUIW_ListItem_SlaveArm_ReinforceInfo_C* Slot_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   LocalTooltipText;                                  // 0x0008(0x0018)(Edit, BlueprintVisible)
	int32                                         CallFunc_GetDepth_ReturnValue;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetPrerequisiteTreeCodeName_ReturnValue;  // 0x002C(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetRequireItemCodeName_ReturnValue;       // 0x0038(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
