#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HUD_FadeInOut

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_HUD_FadeInOut.UIW_HUD_FadeInOut_C
// 0x0048 (0x02B0 - 0x0268)
class UUIW_HUD_FadeInOut_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Black_Off;                                     // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Black_On;                                      // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Hide;                                          // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Show;                                          // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Black;                                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 D_Black_Center;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsOnFadeToBlackPure;                               // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FadeToBlackPureCurrTime;                           // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeToBlackPureMaxTime;                            // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_HUD_FadeInOut(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void WidgetAnimationEvt_Ani_Black_Off_K2Node_WidgetAnimationEvent_7();
	void WidgetAnimationEvt_Ani_Black_Off_K2Node_WidgetAnimationEvent_6();
	void WidgetAnimationEvt_Ani_Black_On_K2Node_WidgetAnimationEvent_5();
	void WidgetAnimationEvt_Ani_Black_On_K2Node_WidgetAnimationEvent_4();
	void WidgetAnimationEvt_Ani_Show_K2Node_WidgetAnimationEvent_1();
	void WidgetAnimationEvt_Ani_Hide_K2Node_WidgetAnimationEvent_3();
	void WidgetAnimationEvt_Ani_Hide_K2Node_WidgetAnimationEvent_2();
	void WidgetAnimationEvt_Ani_Show_K2Node_WidgetAnimationEvent_0();
	void Destruct();
	void Construct();
	void SoundFadeInEvent();
	void OnFadeIn();
	void OnFadeOut();
	void OnFadeBlackOn();
	void OnFadeBlackOff();
	void OnFadeToBlackPure(float FloatData);
	void OnCheckShowControlGuide();
	void SequenceEvent__ENTRYPOINTUIW_HUD_FadeInOut_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_HUD_FadeInOut_C">();
	}
	static class UUIW_HUD_FadeInOut_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_HUD_FadeInOut_C>();
	}
};
static_assert(alignof(UUIW_HUD_FadeInOut_C) == 0x000008, "Wrong alignment on UUIW_HUD_FadeInOut_C");
static_assert(sizeof(UUIW_HUD_FadeInOut_C) == 0x0002B0, "Wrong size on UUIW_HUD_FadeInOut_C");
static_assert(offsetof(UUIW_HUD_FadeInOut_C, UberGraphFrame) == 0x000268, "Member 'UUIW_HUD_FadeInOut_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_FadeInOut_C, Ani_Black_Off) == 0x000270, "Member 'UUIW_HUD_FadeInOut_C::Ani_Black_Off' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_FadeInOut_C, Ani_Black_On) == 0x000278, "Member 'UUIW_HUD_FadeInOut_C::Ani_Black_On' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_FadeInOut_C, Ani_Hide) == 0x000280, "Member 'UUIW_HUD_FadeInOut_C::Ani_Hide' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_FadeInOut_C, Ani_Show) == 0x000288, "Member 'UUIW_HUD_FadeInOut_C::Ani_Show' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_FadeInOut_C, Black) == 0x000290, "Member 'UUIW_HUD_FadeInOut_C::Black' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_FadeInOut_C, D_Black_Center) == 0x000298, "Member 'UUIW_HUD_FadeInOut_C::D_Black_Center' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_FadeInOut_C, IsOnFadeToBlackPure) == 0x0002A0, "Member 'UUIW_HUD_FadeInOut_C::IsOnFadeToBlackPure' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_FadeInOut_C, FadeToBlackPureCurrTime) == 0x0002A4, "Member 'UUIW_HUD_FadeInOut_C::FadeToBlackPureCurrTime' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_FadeInOut_C, FadeToBlackPureMaxTime) == 0x0002A8, "Member 'UUIW_HUD_FadeInOut_C::FadeToBlackPureMaxTime' has a wrong offset!");

}

