#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HUD_QuickSlot

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "ProjectP_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK::Params
{

// Function UIW_HUD_QuickSlot.UIW_HUD_QuickSlot_C.ExecuteUbergraph_UIW_HUD_QuickSlot
// 0x0248 (0x0248 - 0x0000)
struct UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0008(0x0018)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FLUseItemSlot& UseSlot)> K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool IsFirstLine, int32 SlotIndex, class FName OldItemCodeName, class FName NewItemCodeName)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool IsValid)>                 K2Node_CreateDelegate_OutputDelegate_2;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUIW_DPad_Item_C*>               K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void(ELAssistUseItemSlotType SlotType, class FName OldItemCodeName, class FName NewItemCodeName)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool IsValid)>                 K2Node_CreateDelegate_OutputDelegate_4;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ELShotGunAmmoType Type)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FLEquipItemSlot& SlaveArmSlot)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x00B0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName MainItemCodeName, class FName UnitItemCodeName)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName CategoryName)>     K2Node_CreateDelegate_OutputDelegate_8;            // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue_1;         // 0x00E0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUIW_DPad_Item_C*                       CallFunc_Array_Get_Item;                           // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0128(0x0018)()
	class UUIW_DPad_Item_C*                       CallFunc_Array_Get_Item_1;                         // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_DPad_Item_C*                       CallFunc_Array_Get_Item_2;                         // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsEnabled)>               K2Node_CreateDelegate_OutputDelegate_9;            // 0x015C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16D[0x3];                                      // 0x016D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsEnabled)>               K2Node_CreateDelegate_OutputDelegate_10;           // 0x0174(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsEnabled)>               K2Node_CreateDelegate_OutputDelegate_11;           // 0x018C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULPlayInputSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePadMode_ReturnValue;                // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULPlayInputSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUIW_DPad_Item_C*>               K2Node_MakeArray_Array_1;                          // 0x01B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UUIW_DPad_Item_C*>               K2Node_MakeArray_Array_2;                          // 0x01C8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerInventory*                      CallFunc_GetPlayerInventory_ReturnValue;           // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue;           // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ULItem* Item)>           K2Node_CreateDelegate_OutputDelegate_12;           // 0x01F8(0x0010)(ZeroConstructor, NoDestructor)
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bGamePad)>                K2Node_CreateDelegate_OutputDelegate_13;           // 0x0210(0x0010)(ZeroConstructor, NoDestructor)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue_1;         // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLUseItemSlot                          CallFunc_GetChosenUseItem_ReturnValue;             // 0x0230(0x0014)(NoDestructor)
};
static_assert(alignof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot) == 0x000008, "Wrong alignment on UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot");
static_assert(sizeof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot) == 0x000248, "Wrong size on UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, EntryPoint) == 0x000000, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_GetGameStrWithName_ReturnValue) == 0x000008, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, Temp_int_Array_Index_Variable) == 0x000020, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, Temp_int_Array_Index_Variable_2) == 0x000030, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, K2Node_CreateDelegate_OutputDelegate_1) == 0x000044, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, K2Node_CreateDelegate_OutputDelegate_2) == 0x000054, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, K2Node_MakeArray_Array) == 0x000068, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, K2Node_CreateDelegate_OutputDelegate_3) == 0x000078, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, K2Node_CreateDelegate_OutputDelegate_4) == 0x000088, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, Temp_int_Loop_Counter_Variable_1) == 0x000098, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, K2Node_CreateDelegate_OutputDelegate_5) == 0x00009C, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000AC, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000B0, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000C0, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000D0, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_GetGameStrWithName_ReturnValue_1) == 0x0000E0, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_GetGameStrWithName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_Conv_TextToString_ReturnValue) == 0x0000F8, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_Array_Get_Item) == 0x000108, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_Concat_StrStr_ReturnValue) == 0x000110, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_Array_Length_ReturnValue) == 0x000120, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_Conv_StringToText_ReturnValue) == 0x000128, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_Array_Get_Item_1) == 0x000140, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_Array_Length_ReturnValue_1) == 0x000148, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_Less_IntInt_ReturnValue) == 0x00014C, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_Array_Get_Item_2) == 0x000150, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_Array_Length_ReturnValue_2) == 0x000158, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, K2Node_CreateDelegate_OutputDelegate_9) == 0x00015C, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_Less_IntInt_ReturnValue_1) == 0x00016C, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, Temp_int_Loop_Counter_Variable_2) == 0x000170, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, K2Node_CreateDelegate_OutputDelegate_10) == 0x000174, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_Less_IntInt_ReturnValue_2) == 0x000184, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_Add_IntInt_ReturnValue_2) == 0x000188, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, K2Node_CreateDelegate_OutputDelegate_11) == 0x00018C, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0001A0, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_IsGamePadMode_ReturnValue) == 0x0001A8, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_IsGamePadMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0001B0, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, K2Node_MakeArray_Array_1) == 0x0001B8, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, K2Node_MakeArray_Array_2) == 0x0001C8, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_GetGameInstanceSubsystem_ReturnValue_2) == 0x0001D8, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_GetGameInstanceSubsystem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_GetGameInstanceSubsystem_ReturnValue_3) == 0x0001E0, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_GetGameInstanceSubsystem_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_GetPlayerInventory_ReturnValue) == 0x0001E8, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_GetPlayerInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_GetPlayerEquipment_ReturnValue) == 0x0001F0, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_GetPlayerEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, K2Node_CreateDelegate_OutputDelegate_12) == 0x0001F8, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_GetGameInstanceSubsystem_ReturnValue_4) == 0x000208, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_GetGameInstanceSubsystem_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, K2Node_CreateDelegate_OutputDelegate_13) == 0x000210, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_GetGameInstanceSubsystem_ReturnValue_5) == 0x000220, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_GetGameInstanceSubsystem_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_GetPlayerEquipment_ReturnValue_1) == 0x000228, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_GetPlayerEquipment_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot, CallFunc_GetChosenUseItem_ReturnValue) == 0x000230, "Member 'UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot::CallFunc_GetChosenUseItem_ReturnValue' has a wrong offset!");

// Function UIW_HUD_QuickSlot.UIW_HUD_QuickSlot_C.OnChooseItem
// 0x0014 (0x0014 - 0x0000)
struct UIW_HUD_QuickSlot_C_OnChooseItem final
{
public:
	struct FLUseItemSlot                          UseSlot;                                           // 0x0000(0x0014)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(UIW_HUD_QuickSlot_C_OnChooseItem) == 0x000004, "Wrong alignment on UIW_HUD_QuickSlot_C_OnChooseItem");
static_assert(sizeof(UIW_HUD_QuickSlot_C_OnChooseItem) == 0x000014, "Wrong size on UIW_HUD_QuickSlot_C_OnChooseItem");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnChooseItem, UseSlot) == 0x000000, "Member 'UIW_HUD_QuickSlot_C_OnChooseItem::UseSlot' has a wrong offset!");

// Function UIW_HUD_QuickSlot.UIW_HUD_QuickSlot_C.OnChangeItem
// 0x001C (0x001C - 0x0000)
struct UIW_HUD_QuickSlot_C_OnChangeItem final
{
public:
	bool                                          IsFirstLine;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SlotIndex;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   OldItemCodeName;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NewItemCodeName;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_HUD_QuickSlot_C_OnChangeItem) == 0x000004, "Wrong alignment on UIW_HUD_QuickSlot_C_OnChangeItem");
static_assert(sizeof(UIW_HUD_QuickSlot_C_OnChangeItem) == 0x00001C, "Wrong size on UIW_HUD_QuickSlot_C_OnChangeItem");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnChangeItem, IsFirstLine) == 0x000000, "Member 'UIW_HUD_QuickSlot_C_OnChangeItem::IsFirstLine' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnChangeItem, SlotIndex) == 0x000004, "Member 'UIW_HUD_QuickSlot_C_OnChangeItem::SlotIndex' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnChangeItem, OldItemCodeName) == 0x000008, "Member 'UIW_HUD_QuickSlot_C_OnChangeItem::OldItemCodeName' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnChangeItem, NewItemCodeName) == 0x000010, "Member 'UIW_HUD_QuickSlot_C_OnChangeItem::NewItemCodeName' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnChangeItem, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'UIW_HUD_QuickSlot_C_OnChangeItem::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnChangeItem, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000019, "Member 'UIW_HUD_QuickSlot_C_OnChangeItem::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnChangeItem, CallFunc_BooleanAND_ReturnValue) == 0x00001A, "Member 'UIW_HUD_QuickSlot_C_OnChangeItem::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function UIW_HUD_QuickSlot.UIW_HUD_QuickSlot_C.RefreshBelt
// 0x00C0 (0x00C0 - 0x0000)
struct UIW_HUD_QuickSlot_C_RefreshBelt final
{
public:
	TArray<struct FLUseItemSlot>                  LocalUseItemSlotList;                              // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsEnabled)>               K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool IsEnabled)>               K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLUseItemSlot>                  CallFunc_GetUseSlotsLine_ReturnValue;              // 0x0050(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue_1;         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLUseItemSlot>                  CallFunc_GetUseSlotsLine_ReturnValue_1;            // 0x0080(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_DPad_Item_C*                       CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_DPad_Item_C*                       CallFunc_Array_Get_Item_1;                         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_HUD_QuickSlot_C_RefreshBelt) == 0x000008, "Wrong alignment on UIW_HUD_QuickSlot_C_RefreshBelt");
static_assert(sizeof(UIW_HUD_QuickSlot_C_RefreshBelt) == 0x0000C0, "Wrong size on UIW_HUD_QuickSlot_C_RefreshBelt");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshBelt, LocalUseItemSlotList) == 0x000000, "Member 'UIW_HUD_QuickSlot_C_RefreshBelt::LocalUseItemSlotList' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshBelt, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'UIW_HUD_QuickSlot_C_RefreshBelt::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshBelt, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'UIW_HUD_QuickSlot_C_RefreshBelt::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshBelt, Temp_int_Array_Index_Variable) == 0x000018, "Member 'UIW_HUD_QuickSlot_C_RefreshBelt::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshBelt, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'UIW_HUD_QuickSlot_C_RefreshBelt::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshBelt, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'UIW_HUD_QuickSlot_C_RefreshBelt::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshBelt, Temp_int_Array_Index_Variable_1) == 0x00003C, "Member 'UIW_HUD_QuickSlot_C_RefreshBelt::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshBelt, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000040, "Member 'UIW_HUD_QuickSlot_C_RefreshBelt::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshBelt, CallFunc_GetPlayerEquipment_ReturnValue) == 0x000048, "Member 'UIW_HUD_QuickSlot_C_RefreshBelt::CallFunc_GetPlayerEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshBelt, CallFunc_GetUseSlotsLine_ReturnValue) == 0x000050, "Member 'UIW_HUD_QuickSlot_C_RefreshBelt::CallFunc_GetUseSlotsLine_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshBelt, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000060, "Member 'UIW_HUD_QuickSlot_C_RefreshBelt::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshBelt, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000068, "Member 'UIW_HUD_QuickSlot_C_RefreshBelt::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshBelt, CallFunc_GetPlayerEquipment_ReturnValue_1) == 0x000070, "Member 'UIW_HUD_QuickSlot_C_RefreshBelt::CallFunc_GetPlayerEquipment_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshBelt, Temp_int_Loop_Counter_Variable_1) == 0x000078, "Member 'UIW_HUD_QuickSlot_C_RefreshBelt::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshBelt, CallFunc_GetUseSlotsLine_ReturnValue_1) == 0x000080, "Member 'UIW_HUD_QuickSlot_C_RefreshBelt::CallFunc_GetUseSlotsLine_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshBelt, CallFunc_Add_IntInt_ReturnValue_1) == 0x000090, "Member 'UIW_HUD_QuickSlot_C_RefreshBelt::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshBelt, CallFunc_Array_Get_Item) == 0x000098, "Member 'UIW_HUD_QuickSlot_C_RefreshBelt::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshBelt, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x0000A0, "Member 'UIW_HUD_QuickSlot_C_RefreshBelt::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshBelt, CallFunc_Array_Length_ReturnValue) == 0x0000A4, "Member 'UIW_HUD_QuickSlot_C_RefreshBelt::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshBelt, CallFunc_Less_IntInt_ReturnValue) == 0x0000A8, "Member 'UIW_HUD_QuickSlot_C_RefreshBelt::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshBelt, CallFunc_Array_Length_ReturnValue_1) == 0x0000AC, "Member 'UIW_HUD_QuickSlot_C_RefreshBelt::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshBelt, CallFunc_Array_Get_Item_1) == 0x0000B0, "Member 'UIW_HUD_QuickSlot_C_RefreshBelt::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshBelt, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000B8, "Member 'UIW_HUD_QuickSlot_C_RefreshBelt::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function UIW_HUD_QuickSlot.UIW_HUD_QuickSlot_C.RefreshPouch
// 0x0070 (0x0070 - 0x0000)
struct UIW_HUD_QuickSlot_C_RefreshPouch final
{
public:
	TArray<ELAssistUseItemSlotType>               LocalPouchSlotType;                                // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ELAssistUseItemSlotType>               K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
	TDelegate<void(bool IsEnabled)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELAssistUseItemSlotType                       CallFunc_Array_Get_Item;                           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetAssistUseItemCodeName_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_DPad_Item_C*                       CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HUD_QuickSlot_C_RefreshPouch) == 0x000008, "Wrong alignment on UIW_HUD_QuickSlot_C_RefreshPouch");
static_assert(sizeof(UIW_HUD_QuickSlot_C_RefreshPouch) == 0x000070, "Wrong size on UIW_HUD_QuickSlot_C_RefreshPouch");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshPouch, LocalPouchSlotType) == 0x000000, "Member 'UIW_HUD_QuickSlot_C_RefreshPouch::LocalPouchSlotType' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshPouch, Temp_int_Array_Index_Variable) == 0x000010, "Member 'UIW_HUD_QuickSlot_C_RefreshPouch::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshPouch, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'UIW_HUD_QuickSlot_C_RefreshPouch::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshPouch, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'UIW_HUD_QuickSlot_C_RefreshPouch::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshPouch, K2Node_MakeArray_Array) == 0x000020, "Member 'UIW_HUD_QuickSlot_C_RefreshPouch::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshPouch, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'UIW_HUD_QuickSlot_C_RefreshPouch::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshPouch, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000040, "Member 'UIW_HUD_QuickSlot_C_RefreshPouch::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshPouch, CallFunc_GetPlayerEquipment_ReturnValue) == 0x000048, "Member 'UIW_HUD_QuickSlot_C_RefreshPouch::CallFunc_GetPlayerEquipment_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshPouch, CallFunc_Array_Get_Item) == 0x000050, "Member 'UIW_HUD_QuickSlot_C_RefreshPouch::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshPouch, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'UIW_HUD_QuickSlot_C_RefreshPouch::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshPouch, CallFunc_GetAssistUseItemCodeName_ReturnValue) == 0x000058, "Member 'UIW_HUD_QuickSlot_C_RefreshPouch::CallFunc_GetAssistUseItemCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshPouch, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'UIW_HUD_QuickSlot_C_RefreshPouch::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_RefreshPouch, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'UIW_HUD_QuickSlot_C_RefreshPouch::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function UIW_HUD_QuickSlot.UIW_HUD_QuickSlot_C.OnPressPouchKey
// 0x015C (0x015C - 0x0000)
struct UIW_HUD_QuickSlot_C_OnPressPouchKey final
{
public:
	bool                                          IsValid;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTweenEase                             K2Node_MakeStruct_TweenEase;                       // 0x0004(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_1;                     // 0x0010(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_2;                     // 0x001C(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_3;                     // 0x0028(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_4;                     // 0x0034(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_5;                     // 0x0040(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_6;                     // 0x004C(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_7;                     // 0x0058(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_8;                     // 0x0064(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_9;                     // 0x0070(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_10;                    // 0x007C(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_11;                    // 0x0088(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_12;                    // 0x0094(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_13;                    // 0x00A0(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_14;                    // 0x00AC(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_15;                    // 0x00B8(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_16;                    // 0x00C4(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_17;                    // 0x00D0(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_18;                    // 0x00DC(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_19;                    // 0x00E8(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_20;                    // 0x00F4(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_21;                    // 0x0100(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_22;                    // 0x010C(0x000C)(NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_23;                    // 0x011C(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_24;                    // 0x0128(0x000C)(NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_25;                    // 0x0138(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_26;                    // 0x0144(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_27;                    // 0x0150(0x000C)(NoDestructor)
};
static_assert(alignof(UIW_HUD_QuickSlot_C_OnPressPouchKey) == 0x000004, "Wrong alignment on UIW_HUD_QuickSlot_C_OnPressPouchKey");
static_assert(sizeof(UIW_HUD_QuickSlot_C_OnPressPouchKey) == 0x00015C, "Wrong size on UIW_HUD_QuickSlot_C_OnPressPouchKey");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, IsValid) == 0x000000, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::IsValid' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase) == 0x000004, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase_1) == 0x000010, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase_2) == 0x00001C, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase_3) == 0x000028, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase_3' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase_4) == 0x000034, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase_4' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase_5) == 0x000040, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase_5' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase_6) == 0x00004C, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase_6' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase_7) == 0x000058, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase_7' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase_8) == 0x000064, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase_8' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase_9) == 0x000070, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase_9' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase_10) == 0x00007C, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase_10' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase_11) == 0x000088, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase_11' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase_12) == 0x000094, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase_12' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase_13) == 0x0000A0, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase_13' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase_14) == 0x0000AC, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase_14' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase_15) == 0x0000B8, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase_15' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase_16) == 0x0000C4, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase_16' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase_17) == 0x0000D0, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase_17' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase_18) == 0x0000DC, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase_18' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase_19) == 0x0000E8, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase_19' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase_20) == 0x0000F4, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase_20' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase_21) == 0x000100, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase_21' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase_22) == 0x00010C, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase_22' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, CallFunc_IsVisible_ReturnValue) == 0x000118, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase_23) == 0x00011C, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase_23' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase_24) == 0x000128, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase_24' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000134, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase_25) == 0x000138, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase_25' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase_26) == 0x000144, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase_26' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressPouchKey, K2Node_MakeStruct_TweenEase_27) == 0x000150, "Member 'UIW_HUD_QuickSlot_C_OnPressPouchKey::K2Node_MakeStruct_TweenEase_27' has a wrong offset!");

// Function UIW_HUD_QuickSlot.UIW_HUD_QuickSlot_C.OnPressShotgunAmmo
// 0x00F8 (0x00F8 - 0x0000)
struct UIW_HUD_QuickSlot_C_OnPressShotgunAmmo final
{
public:
	bool                                          IsValid;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTweenEase                             K2Node_MakeStruct_TweenEase;                       // 0x0004(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_1;                     // 0x0010(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_2;                     // 0x001C(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_3;                     // 0x0028(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_4;                     // 0x0034(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_5;                     // 0x0040(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_6;                     // 0x004C(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_7;                     // 0x0058(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_8;                     // 0x0064(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_9;                     // 0x0070(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_10;                    // 0x007C(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_11;                    // 0x0088(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_12;                    // 0x0094(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_13;                    // 0x00A0(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_14;                    // 0x00AC(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_15;                    // 0x00B8(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_16;                    // 0x00C4(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_17;                    // 0x00D0(0x000C)(NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_18;                    // 0x00E0(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_19;                    // 0x00EC(0x000C)(NoDestructor)
};
static_assert(alignof(UIW_HUD_QuickSlot_C_OnPressShotgunAmmo) == 0x000004, "Wrong alignment on UIW_HUD_QuickSlot_C_OnPressShotgunAmmo");
static_assert(sizeof(UIW_HUD_QuickSlot_C_OnPressShotgunAmmo) == 0x0000F8, "Wrong size on UIW_HUD_QuickSlot_C_OnPressShotgunAmmo");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressShotgunAmmo, IsValid) == 0x000000, "Member 'UIW_HUD_QuickSlot_C_OnPressShotgunAmmo::IsValid' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressShotgunAmmo, K2Node_MakeStruct_TweenEase) == 0x000004, "Member 'UIW_HUD_QuickSlot_C_OnPressShotgunAmmo::K2Node_MakeStruct_TweenEase' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressShotgunAmmo, K2Node_MakeStruct_TweenEase_1) == 0x000010, "Member 'UIW_HUD_QuickSlot_C_OnPressShotgunAmmo::K2Node_MakeStruct_TweenEase_1' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressShotgunAmmo, K2Node_MakeStruct_TweenEase_2) == 0x00001C, "Member 'UIW_HUD_QuickSlot_C_OnPressShotgunAmmo::K2Node_MakeStruct_TweenEase_2' has a wrong offset!");
static_assert(offsetof(UIW_HUD_QuickSlot_C_OnPressShotgunAmmo, K2Node_MakeStruct_TweenEase_3) == 0x000028, "Member 'UIW_HUD_QuickSlot_C_OnPressShotgunAmmo::K2Node_MakeStruct_TweenEase_3' has a wrong offset!");
