#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Alert_GetItem

#include "Basic.hpp"

#include "UIST_GetItem_structs.hpp"
#include "UIST_Time_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"
#include "UIST_FirstCategoryInfo_structs.hpp"
#include "ProjectP_structs.hpp"


namespace SDK::Params
{

// Function UIW_Alert_GetItem.UIW_Alert_GetItem_C.ExecuteUbergraph_UIW_Alert_GetItem
// 0x0070 (0x0070 - 0x0000)
struct UIW_Alert_GetItem_C_ExecuteUbergraph_UIW_Alert_GetItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIST_Time                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName CategoryName)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase;                       // 0x0040(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_1;                     // 0x004C(0x000C)(NoDestructor)
	class FName                                   K2Node_CustomEvent_CategoryName;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Alert_GetItem_C_ExecuteUbergraph_UIW_Alert_GetItem) == 0x000008, "Wrong alignment on UIW_Alert_GetItem_C_ExecuteUbergraph_UIW_Alert_GetItem");
static_assert(sizeof(UIW_Alert_GetItem_C_ExecuteUbergraph_UIW_Alert_GetItem) == 0x000070, "Wrong size on UIW_Alert_GetItem_C_ExecuteUbergraph_UIW_Alert_GetItem");
static_assert(offsetof(UIW_Alert_GetItem_C_ExecuteUbergraph_UIW_Alert_GetItem, EntryPoint) == 0x000000, "Member 'UIW_Alert_GetItem_C_ExecuteUbergraph_UIW_Alert_GetItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetItem_C_ExecuteUbergraph_UIW_Alert_GetItem, CallFunc_GetDataTableRowFromName_OutRow) == 0x000008, "Member 'UIW_Alert_GetItem_C_ExecuteUbergraph_UIW_Alert_GetItem::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetItem_C_ExecuteUbergraph_UIW_Alert_GetItem, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000020, "Member 'UIW_Alert_GetItem_C_ExecuteUbergraph_UIW_Alert_GetItem::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetItem_C_ExecuteUbergraph_UIW_Alert_GetItem, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'UIW_Alert_GetItem_C_ExecuteUbergraph_UIW_Alert_GetItem::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetItem_C_ExecuteUbergraph_UIW_Alert_GetItem, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'UIW_Alert_GetItem_C_ExecuteUbergraph_UIW_Alert_GetItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetItem_C_ExecuteUbergraph_UIW_Alert_GetItem, K2Node_MakeStruct_TweenEase) == 0x000040, "Member 'UIW_Alert_GetItem_C_ExecuteUbergraph_UIW_Alert_GetItem::K2Node_MakeStruct_TweenEase' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetItem_C_ExecuteUbergraph_UIW_Alert_GetItem, K2Node_MakeStruct_TweenEase_1) == 0x00004C, "Member 'UIW_Alert_GetItem_C_ExecuteUbergraph_UIW_Alert_GetItem::K2Node_MakeStruct_TweenEase_1' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetItem_C_ExecuteUbergraph_UIW_Alert_GetItem, K2Node_CustomEvent_CategoryName) == 0x000058, "Member 'UIW_Alert_GetItem_C_ExecuteUbergraph_UIW_Alert_GetItem::K2Node_CustomEvent_CategoryName' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetItem_C_ExecuteUbergraph_UIW_Alert_GetItem, K2Node_SwitchName_CmpSuccess) == 0x000060, "Member 'UIW_Alert_GetItem_C_ExecuteUbergraph_UIW_Alert_GetItem::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetItem_C_ExecuteUbergraph_UIW_Alert_GetItem, CallFunc_PlayAnimation_ReturnValue_1) == 0x000068, "Member 'UIW_Alert_GetItem_C_ExecuteUbergraph_UIW_Alert_GetItem::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function UIW_Alert_GetItem.UIW_Alert_GetItem_C.CompleteTween
// 0x0008 (0x0008 - 0x0000)
struct UIW_Alert_GetItem_C_CompleteTween final
{
public:
	class FName                                   CategoryName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Alert_GetItem_C_CompleteTween) == 0x000004, "Wrong alignment on UIW_Alert_GetItem_C_CompleteTween");
static_assert(sizeof(UIW_Alert_GetItem_C_CompleteTween) == 0x000008, "Wrong size on UIW_Alert_GetItem_C_CompleteTween");
static_assert(offsetof(UIW_Alert_GetItem_C_CompleteTween, CategoryName) == 0x000000, "Member 'UIW_Alert_GetItem_C_CompleteTween::CategoryName' has a wrong offset!");

// Function UIW_Alert_GetItem.UIW_Alert_GetItem_C.SetItem
// 0x0180 (0x0180 - 0x0000)
struct UIW_Alert_GetItem_C_SetItem final
{
public:
	struct FUIST_GetItem                          GetItem;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWeapon_ReturnValue;                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULWeaponItem*                           K2Node_DynamicCast_AsLWeapon_Item;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELItemFirstCategory                           CallFunc_GetFirstCategory_ReturnValue;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemCommonInfoPtr                     CallFunc_GetHandleCommonInfo_ReturnValue;          // 0x0040(0x0008)(NoDestructor)
	struct FItemCommonInfoPtr                     CallFunc_GetBladeCommonInfo_ReturnValue;           // 0x0048(0x0008)(NoDestructor)
	TSoftObjectPtr<class UObject>                 CallFunc_GetImageResource_ReturnValue;             // 0x0050(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_GetImageResource_ReturnValue_1;           // 0x0078(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_GetHeroicImageResource_ReturnValue;       // 0x00A0(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsHeroicWeapon_ReturnValue;               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemCommonInfoPtr                     CallFunc_GetCommonInfo_ReturnValue;                // 0x00D0(0x0008)(NoDestructor)
	class FText                                   CallFunc_GetLocalTextItemNameLocalize_ReturnValue; // 0x00D8(0x0018)()
	TSoftObjectPtr<class UObject>                 CallFunc_GetImageResource_ReturnValue_2;           // 0x00F0(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	TMap<ELItemFirstCategory, struct FUIST_FirstCategoryInfo> CallFunc_GetFirstCategoryInfo_FirstCategoryInfo;   // 0x0118(0x0050)()
	struct FUIST_FirstCategoryInfo                CallFunc_Map_Find_Value;                           // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Alert_GetItem_C_SetItem) == 0x000008, "Wrong alignment on UIW_Alert_GetItem_C_SetItem");
static_assert(sizeof(UIW_Alert_GetItem_C_SetItem) == 0x000180, "Wrong size on UIW_Alert_GetItem_C_SetItem");
static_assert(offsetof(UIW_Alert_GetItem_C_SetItem, GetItem) == 0x000000, "Member 'UIW_Alert_GetItem_C_SetItem::GetItem' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetItem_C_SetItem, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'UIW_Alert_GetItem_C_SetItem::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetItem_C_SetItem, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'UIW_Alert_GetItem_C_SetItem::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetItem_C_SetItem, CallFunc_IsWeapon_ReturnValue) == 0x000029, "Member 'UIW_Alert_GetItem_C_SetItem::CallFunc_IsWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetItem_C_SetItem, K2Node_DynamicCast_AsLWeapon_Item) == 0x000030, "Member 'UIW_Alert_GetItem_C_SetItem::K2Node_DynamicCast_AsLWeapon_Item' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetItem_C_SetItem, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'UIW_Alert_GetItem_C_SetItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetItem_C_SetItem, CallFunc_GetFirstCategory_ReturnValue) == 0x000039, "Member 'UIW_Alert_GetItem_C_SetItem::CallFunc_GetFirstCategory_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetItem_C_SetItem, CallFunc_GetHandleCommonInfo_ReturnValue) == 0x000040, "Member 'UIW_Alert_GetItem_C_SetItem::CallFunc_GetHandleCommonInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetItem_C_SetItem, CallFunc_GetBladeCommonInfo_ReturnValue) == 0x000048, "Member 'UIW_Alert_GetItem_C_SetItem::CallFunc_GetBladeCommonInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetItem_C_SetItem, CallFunc_GetImageResource_ReturnValue) == 0x000050, "Member 'UIW_Alert_GetItem_C_SetItem::CallFunc_GetImageResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetItem_C_SetItem, CallFunc_GetImageResource_ReturnValue_1) == 0x000078, "Member 'UIW_Alert_GetItem_C_SetItem::CallFunc_GetImageResource_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetItem_C_SetItem, CallFunc_GetHeroicImageResource_ReturnValue) == 0x0000A0, "Member 'UIW_Alert_GetItem_C_SetItem::CallFunc_GetHeroicImageResource_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetItem_C_SetItem, CallFunc_IsHeroicWeapon_ReturnValue) == 0x0000C8, "Member 'UIW_Alert_GetItem_C_SetItem::CallFunc_IsHeroicWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetItem_C_SetItem, CallFunc_GetCommonInfo_ReturnValue) == 0x0000D0, "Member 'UIW_Alert_GetItem_C_SetItem::CallFunc_GetCommonInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetItem_C_SetItem, CallFunc_GetLocalTextItemNameLocalize_ReturnValue) == 0x0000D8, "Member 'UIW_Alert_GetItem_C_SetItem::CallFunc_GetLocalTextItemNameLocalize_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetItem_C_SetItem, CallFunc_GetImageResource_ReturnValue_2) == 0x0000F0, "Member 'UIW_Alert_GetItem_C_SetItem::CallFunc_GetImageResource_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetItem_C_SetItem, CallFunc_GetFirstCategoryInfo_FirstCategoryInfo) == 0x000118, "Member 'UIW_Alert_GetItem_C_SetItem::CallFunc_GetFirstCategoryInfo_FirstCategoryInfo' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetItem_C_SetItem, CallFunc_Map_Find_Value) == 0x000168, "Member 'UIW_Alert_GetItem_C_SetItem::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UIW_Alert_GetItem_C_SetItem, CallFunc_Map_Find_ReturnValue) == 0x000178, "Member 'UIW_Alert_GetItem_C_SetItem::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

}

