#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ListItem_CommandBook

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_ListItem_CommandBook.UIW_ListItem_CommandBook_C
// 0x0040 (0x02A8 - 0x0268)
class UUIW_ListItem_CommandBook_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Line;                                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Fx_Btn_Bg_C*                       Selected;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Key;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Label;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FString>                         CommandLines;                                      // 0x0290(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UUIW_CommandBook_C*                     CommandBook;                                       // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_ListItem_CommandBook(int32 EntryPoint);
	void OnDragEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void OnDragLeave(const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();
	void SetData(const class FString& Label, TArray<class FString>& CommandLines_0);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnDragDetected(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation** Operation);
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_ListItem_CommandBook_C">();
	}
	static class UUIW_ListItem_CommandBook_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_ListItem_CommandBook_C>();
	}
};
static_assert(alignof(UUIW_ListItem_CommandBook_C) == 0x000008, "Wrong alignment on UUIW_ListItem_CommandBook_C");
static_assert(sizeof(UUIW_ListItem_CommandBook_C) == 0x0002A8, "Wrong size on UUIW_ListItem_CommandBook_C");
static_assert(offsetof(UUIW_ListItem_CommandBook_C, UberGraphFrame) == 0x000268, "Member 'UUIW_ListItem_CommandBook_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_CommandBook_C, Line) == 0x000270, "Member 'UUIW_ListItem_CommandBook_C::Line' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_CommandBook_C, Selected) == 0x000278, "Member 'UUIW_ListItem_CommandBook_C::Selected' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_CommandBook_C, Text_Key) == 0x000280, "Member 'UUIW_ListItem_CommandBook_C::Text_Key' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_CommandBook_C, Text_Label) == 0x000288, "Member 'UUIW_ListItem_CommandBook_C::Text_Label' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_CommandBook_C, CommandLines) == 0x000290, "Member 'UUIW_ListItem_CommandBook_C::CommandLines' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_CommandBook_C, CommandBook) == 0x0002A0, "Member 'UUIW_ListItem_CommandBook_C::CommandBook' has a wrong offset!");

}

