#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_PackageDownload

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UIW_PackageDownload.UIW_PackageDownload_C.ExecuteUbergraph_UIW_PackageDownload
// 0x0030 (0x0030 - 0x0000)
struct UIW_PackageDownload_C_ExecuteUbergraph_UIW_PackageDownload final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0008(0x0018)()
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(UIW_PackageDownload_C_ExecuteUbergraph_UIW_PackageDownload) == 0x000008, "Wrong alignment on UIW_PackageDownload_C_ExecuteUbergraph_UIW_PackageDownload");
static_assert(sizeof(UIW_PackageDownload_C_ExecuteUbergraph_UIW_PackageDownload) == 0x000030, "Wrong size on UIW_PackageDownload_C_ExecuteUbergraph_UIW_PackageDownload");
static_assert(offsetof(UIW_PackageDownload_C_ExecuteUbergraph_UIW_PackageDownload, EntryPoint) == 0x000000, "Member 'UIW_PackageDownload_C_ExecuteUbergraph_UIW_PackageDownload::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_PackageDownload_C_ExecuteUbergraph_UIW_PackageDownload, K2Node_Event_IsDesignTime) == 0x000004, "Member 'UIW_PackageDownload_C_ExecuteUbergraph_UIW_PackageDownload::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UIW_PackageDownload_C_ExecuteUbergraph_UIW_PackageDownload, CallFunc_GetGameStrWithName_ReturnValue) == 0x000008, "Member 'UIW_PackageDownload_C_ExecuteUbergraph_UIW_PackageDownload::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_PackageDownload_C_ExecuteUbergraph_UIW_PackageDownload, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'UIW_PackageDownload_C_ExecuteUbergraph_UIW_PackageDownload::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function UIW_PackageDownload.UIW_PackageDownload_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UIW_PackageDownload_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_PackageDownload_C_PreConstruct) == 0x000001, "Wrong alignment on UIW_PackageDownload_C_PreConstruct");
static_assert(sizeof(UIW_PackageDownload_C_PreConstruct) == 0x000001, "Wrong size on UIW_PackageDownload_C_PreConstruct");
static_assert(offsetof(UIW_PackageDownload_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UIW_PackageDownload_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UIW_PackageDownload.UIW_PackageDownload_C.SetProgress
// 0x0038 (0x0038 - 0x0000)
struct UIW_PackageDownload_C_SetProgress final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_AsPercent_Float_ReturnValue;              // 0x0008(0x0018)()
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_PackageDownload_C_SetProgress) == 0x000008, "Wrong alignment on UIW_PackageDownload_C_SetProgress");
static_assert(sizeof(UIW_PackageDownload_C_SetProgress) == 0x000038, "Wrong size on UIW_PackageDownload_C_SetProgress");
static_assert(offsetof(UIW_PackageDownload_C_SetProgress, Value) == 0x000000, "Member 'UIW_PackageDownload_C_SetProgress::Value' has a wrong offset!");
static_assert(offsetof(UIW_PackageDownload_C_SetProgress, CallFunc_AsPercent_Float_ReturnValue) == 0x000008, "Member 'UIW_PackageDownload_C_SetProgress::CallFunc_AsPercent_Float_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_PackageDownload_C_SetProgress, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000020, "Member 'UIW_PackageDownload_C_SetProgress::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_PackageDownload_C_SetProgress, CallFunc_MakeVector2D_ReturnValue) == 0x000024, "Member 'UIW_PackageDownload_C_SetProgress::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_PackageDownload_C_SetProgress, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000030, "Member 'UIW_PackageDownload_C_SetProgress::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");

// Function UIW_PackageDownload.UIW_PackageDownload_C.OnVisibillityChanged
// 0x0010 (0x0010 - 0x0000)
struct UIW_PackageDownload_C_OnVisibillityChanged final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_PackageDownload_C_OnVisibillityChanged) == 0x000008, "Wrong alignment on UIW_PackageDownload_C_OnVisibillityChanged");
static_assert(sizeof(UIW_PackageDownload_C_OnVisibillityChanged) == 0x000010, "Wrong size on UIW_PackageDownload_C_OnVisibillityChanged");
static_assert(offsetof(UIW_PackageDownload_C_OnVisibillityChanged, InVisibility) == 0x000000, "Member 'UIW_PackageDownload_C_OnVisibillityChanged::InVisibility' has a wrong offset!");
static_assert(offsetof(UIW_PackageDownload_C_OnVisibillityChanged, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'UIW_PackageDownload_C_OnVisibillityChanged::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_PackageDownload_C_OnVisibillityChanged, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'UIW_PackageDownload_C_OnVisibillityChanged::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function UIW_PackageDownload.UIW_PackageDownload_C.RefreshDownload
// 0x0010 (0x0010 - 0x0000)
struct UIW_PackageDownload_C_RefreshDownload final
{
public:
	class ULPlatformSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChunkInstallComplete_ReturnValue;       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetChunkInstallProgress_ReturnValue;      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_PackageDownload_C_RefreshDownload) == 0x000008, "Wrong alignment on UIW_PackageDownload_C_RefreshDownload");
static_assert(sizeof(UIW_PackageDownload_C_RefreshDownload) == 0x000010, "Wrong size on UIW_PackageDownload_C_RefreshDownload");
static_assert(offsetof(UIW_PackageDownload_C_RefreshDownload, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000000, "Member 'UIW_PackageDownload_C_RefreshDownload::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_PackageDownload_C_RefreshDownload, CallFunc_IsChunkInstallComplete_ReturnValue) == 0x000008, "Member 'UIW_PackageDownload_C_RefreshDownload::CallFunc_IsChunkInstallComplete_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_PackageDownload_C_RefreshDownload, CallFunc_GetChunkInstallProgress_ReturnValue) == 0x00000C, "Member 'UIW_PackageDownload_C_RefreshDownload::CallFunc_GetChunkInstallProgress_ReturnValue' has a wrong offset!");

}

