#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Window_Tutorial

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UIW_Window_Tutorial.UIW_Window_Tutorial_C.ExecuteUbergraph_UIW_Window_Tutorial
// 0x00A8 (0x00A8 - 0x0000)
struct UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULTutorialSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName CategoryName)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_CategoryName;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLastPage_IsLastPage;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0090(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ULTutorialSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial) == 0x000008, "Wrong alignment on UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial");
static_assert(sizeof(UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial) == 0x0000A8, "Wrong size on UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial");
static_assert(offsetof(UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial, EntryPoint) == 0x000000, "Member 'UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial, K2Node_ComponentBoundEvent_BtnKey) == 0x000010, "Member 'UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial::K2Node_ComponentBoundEvent_BtnKey' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial, K2Node_MakeArray_Array) == 0x000018, "Member 'UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000030, "Member 'UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial, K2Node_CustomEvent_CategoryName) == 0x000048, "Member 'UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial::K2Node_CustomEvent_CategoryName' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000050, "Member 'UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial, CallFunc_Array_Get_Item) == 0x000058, "Member 'UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial, CallFunc_IsLastPage_IsLastPage) == 0x000060, "Member 'UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial::CallFunc_IsLastPage_IsLastPage' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial, K2Node_CreateDelegate_OutputDelegate_1) == 0x00006C, "Member 'UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial, K2Node_CreateDelegate_OutputDelegate_2) == 0x00007C, "Member 'UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000090, "Member 'UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000098, "Member 'UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x0000A0, "Member 'UIW_Window_Tutorial_C_ExecuteUbergraph_UIW_Window_Tutorial::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");

// Function UIW_Window_Tutorial.UIW_Window_Tutorial_C.OnCloseTweenComplete
// 0x0008 (0x0008 - 0x0000)
struct UIW_Window_Tutorial_C_OnCloseTweenComplete final
{
public:
	class FName                                   CategoryName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Window_Tutorial_C_OnCloseTweenComplete) == 0x000004, "Wrong alignment on UIW_Window_Tutorial_C_OnCloseTweenComplete");
static_assert(sizeof(UIW_Window_Tutorial_C_OnCloseTweenComplete) == 0x000008, "Wrong size on UIW_Window_Tutorial_C_OnCloseTweenComplete");
static_assert(offsetof(UIW_Window_Tutorial_C_OnCloseTweenComplete, CategoryName) == 0x000000, "Member 'UIW_Window_Tutorial_C_OnCloseTweenComplete::CategoryName' has a wrong offset!");

// Function UIW_Window_Tutorial.UIW_Window_Tutorial_C.BndEvt__UIW_Popup_Tutorial_Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_Window_Tutorial_C_BndEvt__UIW_Popup_Tutorial_Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Window_Tutorial_C_BndEvt__UIW_Popup_Tutorial_Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_Window_Tutorial_C_BndEvt__UIW_Popup_Tutorial_Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature");
static_assert(sizeof(UIW_Window_Tutorial_C_BndEvt__UIW_Popup_Tutorial_Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_Window_Tutorial_C_BndEvt__UIW_Popup_Tutorial_Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature");
static_assert(offsetof(UIW_Window_Tutorial_C_BndEvt__UIW_Popup_Tutorial_Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_Window_Tutorial_C_BndEvt__UIW_Popup_Tutorial_Btn_Back_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_Window_Tutorial.UIW_Window_Tutorial_C.OnReady
// 0x0030 (0x0030 - 0x0000)
struct UIW_Window_Tutorial_C_OnReady final
{
public:
	class FName                                   Temp_name_Variable;                                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULTutorialSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetWindowTutorialCodeName_ReturnValue;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLastPage_IsLastPage;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Window_Tutorial_C_OnReady) == 0x000008, "Wrong alignment on UIW_Window_Tutorial_C_OnReady");
static_assert(sizeof(UIW_Window_Tutorial_C_OnReady) == 0x000030, "Wrong size on UIW_Window_Tutorial_C_OnReady");
static_assert(offsetof(UIW_Window_Tutorial_C_OnReady, Temp_name_Variable) == 0x000000, "Member 'UIW_Window_Tutorial_C_OnReady::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_OnReady, Temp_name_Variable_1) == 0x000008, "Member 'UIW_Window_Tutorial_C_OnReady::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_OnReady, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'UIW_Window_Tutorial_C_OnReady::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_OnReady, CallFunc_GetWindowTutorialCodeName_ReturnValue) == 0x000018, "Member 'UIW_Window_Tutorial_C_OnReady::CallFunc_GetWindowTutorialCodeName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_OnReady, CallFunc_IsLastPage_IsLastPage) == 0x000020, "Member 'UIW_Window_Tutorial_C_OnReady::CallFunc_IsLastPage_IsLastPage' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_OnReady, Temp_bool_Variable) == 0x000021, "Member 'UIW_Window_Tutorial_C_OnReady::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_OnReady, K2Node_Select_Default) == 0x000024, "Member 'UIW_Window_Tutorial_C_OnReady::K2Node_Select_Default' has a wrong offset!");

// Function UIW_Window_Tutorial.UIW_Window_Tutorial_C.OnPrev
// 0x0020 (0x0020 - 0x0000)
struct UIW_Window_Tutorial_C_OnPrev final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLastPage_IsLastPage;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Window_Tutorial_C_OnPrev) == 0x000004, "Wrong alignment on UIW_Window_Tutorial_C_OnPrev");
static_assert(sizeof(UIW_Window_Tutorial_C_OnPrev) == 0x000020, "Wrong size on UIW_Window_Tutorial_C_OnPrev");
static_assert(offsetof(UIW_Window_Tutorial_C_OnPrev, Temp_bool_Variable) == 0x000000, "Member 'UIW_Window_Tutorial_C_OnPrev::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_OnPrev, Temp_name_Variable) == 0x000004, "Member 'UIW_Window_Tutorial_C_OnPrev::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_OnPrev, Temp_name_Variable_1) == 0x00000C, "Member 'UIW_Window_Tutorial_C_OnPrev::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_OnPrev, CallFunc_IsLastPage_IsLastPage) == 0x000014, "Member 'UIW_Window_Tutorial_C_OnPrev::CallFunc_IsLastPage_IsLastPage' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_OnPrev, K2Node_Select_Default) == 0x000018, "Member 'UIW_Window_Tutorial_C_OnPrev::K2Node_Select_Default' has a wrong offset!");

// Function UIW_Window_Tutorial.UIW_Window_Tutorial_C.OnNext
// 0x0020 (0x0020 - 0x0000)
struct UIW_Window_Tutorial_C_OnNext final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLastPage_IsLastPage;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Window_Tutorial_C_OnNext) == 0x000004, "Wrong alignment on UIW_Window_Tutorial_C_OnNext");
static_assert(sizeof(UIW_Window_Tutorial_C_OnNext) == 0x000020, "Wrong size on UIW_Window_Tutorial_C_OnNext");
static_assert(offsetof(UIW_Window_Tutorial_C_OnNext, Temp_bool_Variable) == 0x000000, "Member 'UIW_Window_Tutorial_C_OnNext::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_OnNext, Temp_name_Variable) == 0x000004, "Member 'UIW_Window_Tutorial_C_OnNext::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_OnNext, Temp_name_Variable_1) == 0x00000C, "Member 'UIW_Window_Tutorial_C_OnNext::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_OnNext, CallFunc_IsLastPage_IsLastPage) == 0x000014, "Member 'UIW_Window_Tutorial_C_OnNext::CallFunc_IsLastPage_IsLastPage' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_OnNext, K2Node_Select_Default) == 0x000018, "Member 'UIW_Window_Tutorial_C_OnNext::K2Node_Select_Default' has a wrong offset!");

// Function UIW_Window_Tutorial.UIW_Window_Tutorial_C.OnNavigate
// 0x0004 (0x0004 - 0x0000)
struct UIW_Window_Tutorial_C_OnNavigate final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputEvent                                   EventType;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_Window_Tutorial_C_OnNavigate) == 0x000001, "Wrong alignment on UIW_Window_Tutorial_C_OnNavigate");
static_assert(sizeof(UIW_Window_Tutorial_C_OnNavigate) == 0x000004, "Wrong size on UIW_Window_Tutorial_C_OnNavigate");
static_assert(offsetof(UIW_Window_Tutorial_C_OnNavigate, Navigation_0) == 0x000000, "Member 'UIW_Window_Tutorial_C_OnNavigate::Navigation_0' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_OnNavigate, EventType) == 0x000001, "Member 'UIW_Window_Tutorial_C_OnNavigate::EventType' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_OnNavigate, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'UIW_Window_Tutorial_C_OnNavigate::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_OnNavigate, K2Node_SwitchEnum_CmpSuccess_1) == 0x000003, "Member 'UIW_Window_Tutorial_C_OnNavigate::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

// Function UIW_Window_Tutorial.UIW_Window_Tutorial_C.AddEventBinding
// 0x0018 (0x0018 - 0x0000)
struct UIW_Window_Tutorial_C_AddEventBinding final
{
public:
	TDelegate<void(EUINavigation Navigation, EInputEvent EventType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class ULPlayInputSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Window_Tutorial_C_AddEventBinding) == 0x000008, "Wrong alignment on UIW_Window_Tutorial_C_AddEventBinding");
static_assert(sizeof(UIW_Window_Tutorial_C_AddEventBinding) == 0x000018, "Wrong size on UIW_Window_Tutorial_C_AddEventBinding");
static_assert(offsetof(UIW_Window_Tutorial_C_AddEventBinding, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'UIW_Window_Tutorial_C_AddEventBinding::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_AddEventBinding, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'UIW_Window_Tutorial_C_AddEventBinding::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

// Function UIW_Window_Tutorial.UIW_Window_Tutorial_C.ClearEventBinding
// 0x0018 (0x0018 - 0x0000)
struct UIW_Window_Tutorial_C_ClearEventBinding final
{
public:
	TDelegate<void(EUINavigation Navigation, EInputEvent EventType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class ULPlayInputSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_Window_Tutorial_C_ClearEventBinding) == 0x000008, "Wrong alignment on UIW_Window_Tutorial_C_ClearEventBinding");
static_assert(sizeof(UIW_Window_Tutorial_C_ClearEventBinding) == 0x000018, "Wrong size on UIW_Window_Tutorial_C_ClearEventBinding");
static_assert(offsetof(UIW_Window_Tutorial_C_ClearEventBinding, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'UIW_Window_Tutorial_C_ClearEventBinding::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_Window_Tutorial_C_ClearEventBinding, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'UIW_Window_Tutorial_C_ClearEventBinding::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");

}

