#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HUD_Narration

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_HUD_Narration.UIW_HUD_Narration_C
// 0x0028 (0x0290 - 0x0268)
class UUIW_HUD_Narration_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_End;                                           // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Start;                                         // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUIBP_LRichKeyTextBlock_C*              KeyBindText;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandle;                                       // 0x0288(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_HUD_Narration(int32 EntryPoint);
	void WidgetAnimationEvt_Ani_End_K2Node_WidgetAnimationEvent_0();
	void Destruct();
	void Construct();
	void Show();
	void Hide();
	void OnVisibleGuide(bool IsValid, const class FText& MsgText);
	void OnTimerGuide(float VisibleTime, const class FText& MsgText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_HUD_Narration_C">();
	}
	static class UUIW_HUD_Narration_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_HUD_Narration_C>();
	}
};
static_assert(alignof(UUIW_HUD_Narration_C) == 0x000008, "Wrong alignment on UUIW_HUD_Narration_C");
static_assert(sizeof(UUIW_HUD_Narration_C) == 0x000290, "Wrong size on UUIW_HUD_Narration_C");
static_assert(offsetof(UUIW_HUD_Narration_C, UberGraphFrame) == 0x000268, "Member 'UUIW_HUD_Narration_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Narration_C, Ani_End) == 0x000270, "Member 'UUIW_HUD_Narration_C::Ani_End' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Narration_C, Ani_Start) == 0x000278, "Member 'UUIW_HUD_Narration_C::Ani_Start' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Narration_C, KeyBindText) == 0x000280, "Member 'UUIW_HUD_Narration_C::KeyBindText' has a wrong offset!");
static_assert(offsetof(UUIW_HUD_Narration_C, TimerHandle) == 0x000288, "Member 'UUIW_HUD_Narration_C::TimerHandle' has a wrong offset!");

}

