#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ComboBox_List

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UIW_Window_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_ComboBox_List.UIW_ComboBox_List_C
// 0x0030 (0x0380 - 0x0350)
class UUIW_ComboBox_List_C final : public UUIW_Window_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UIW_ComboBox_List_C;                // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               BG_Group;                                          // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULListView*                             List;                                              // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay;                                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_ComboBox_C*                        Owner;                                             // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PrevSelectedIndex;                                 // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTweening;                                        // 0x037C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UIW_ComboBox_List(int32 EntryPoint);
	void Destruct();
	void Construct();
	void BndEvt__List_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void SetComboBoxList(class UUIW_ComboBox_C* Owner_0, TArray<class FText>& Options, int32 SelectedIndex, bool IsGlobal);
	void Active();
	void Close();
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void CompleteTween(class FName CategoryName);
	void OpenTween();
	void SetPosition();
	void RequestCloseWindow();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_ComboBox_List_C">();
	}
	static class UUIW_ComboBox_List_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_ComboBox_List_C>();
	}
};
static_assert(alignof(UUIW_ComboBox_List_C) == 0x000008, "Wrong alignment on UUIW_ComboBox_List_C");
static_assert(sizeof(UUIW_ComboBox_List_C) == 0x000380, "Wrong size on UUIW_ComboBox_List_C");
static_assert(offsetof(UUIW_ComboBox_List_C, UberGraphFrame_UIW_ComboBox_List_C) == 0x000350, "Member 'UUIW_ComboBox_List_C::UberGraphFrame_UIW_ComboBox_List_C' has a wrong offset!");
static_assert(offsetof(UUIW_ComboBox_List_C, BG_Group) == 0x000358, "Member 'UUIW_ComboBox_List_C::BG_Group' has a wrong offset!");
static_assert(offsetof(UUIW_ComboBox_List_C, List) == 0x000360, "Member 'UUIW_ComboBox_List_C::List' has a wrong offset!");
static_assert(offsetof(UUIW_ComboBox_List_C, Overlay) == 0x000368, "Member 'UUIW_ComboBox_List_C::Overlay' has a wrong offset!");
static_assert(offsetof(UUIW_ComboBox_List_C, Owner) == 0x000370, "Member 'UUIW_ComboBox_List_C::Owner' has a wrong offset!");
static_assert(offsetof(UUIW_ComboBox_List_C, PrevSelectedIndex) == 0x000378, "Member 'UUIW_ComboBox_List_C::PrevSelectedIndex' has a wrong offset!");
static_assert(offsetof(UUIW_ComboBox_List_C, IsTweening) == 0x00037C, "Member 'UUIW_ComboBox_List_C::IsTweening' has a wrong offset!");

}

