#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ListItem_ItemLarge

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_ListItem_ItemLarge.UIW_ListItem_ItemLarge_C
// 0x0068 (0x0310 - 0x02A8)
class UUIW_ListItem_ItemLarge_C : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Img_Equip;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Icon;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_New_Dot;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_X;                                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Fx_ListBtn_Bg_C*                   Selected;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIBP_ListData_Item_C*                  ListData;                                          // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 LItem;                                             // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Window_C*                          OwnerWindow;                                       // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UListView*                              OwnerListView;                                     // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SlotID;                                            // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             SlotTexture;                                       // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsUnlcked;                                         // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UIW_ListItem_ItemLarge(int32 EntryPoint);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void Set_Item(class UObject* ListItem);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void ShowFocus(bool IsShow);
	void SetEquiped();
	void SetImage();
	void SetEquipPossible();
	void SetMoveFocusEffect();
	void SetNew();
	void SetSlotType(class FName ID);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_ListItem_ItemLarge_C">();
	}
	static class UUIW_ListItem_ItemLarge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_ListItem_ItemLarge_C>();
	}
};
static_assert(alignof(UUIW_ListItem_ItemLarge_C) == 0x000008, "Wrong alignment on UUIW_ListItem_ItemLarge_C");
static_assert(sizeof(UUIW_ListItem_ItemLarge_C) == 0x000310, "Wrong size on UUIW_ListItem_ItemLarge_C");
static_assert(offsetof(UUIW_ListItem_ItemLarge_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_ListItem_ItemLarge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ItemLarge_C, Img_Equip) == 0x0002B0, "Member 'UUIW_ListItem_ItemLarge_C::Img_Equip' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ItemLarge_C, Img_Icon) == 0x0002B8, "Member 'UUIW_ListItem_ItemLarge_C::Img_Icon' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ItemLarge_C, Img_New_Dot) == 0x0002C0, "Member 'UUIW_ListItem_ItemLarge_C::Img_New_Dot' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ItemLarge_C, Img_X) == 0x0002C8, "Member 'UUIW_ListItem_ItemLarge_C::Img_X' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ItemLarge_C, Selected) == 0x0002D0, "Member 'UUIW_ListItem_ItemLarge_C::Selected' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ItemLarge_C, ListData) == 0x0002D8, "Member 'UUIW_ListItem_ItemLarge_C::ListData' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ItemLarge_C, LItem) == 0x0002E0, "Member 'UUIW_ListItem_ItemLarge_C::LItem' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ItemLarge_C, OwnerWindow) == 0x0002E8, "Member 'UUIW_ListItem_ItemLarge_C::OwnerWindow' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ItemLarge_C, OwnerListView) == 0x0002F0, "Member 'UUIW_ListItem_ItemLarge_C::OwnerListView' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ItemLarge_C, SlotID) == 0x0002F8, "Member 'UUIW_ListItem_ItemLarge_C::SlotID' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ItemLarge_C, SlotTexture) == 0x000300, "Member 'UUIW_ListItem_ItemLarge_C::SlotTexture' has a wrong offset!");
static_assert(offsetof(UUIW_ListItem_ItemLarge_C, IsUnlcked) == 0x000308, "Member 'UUIW_ListItem_ItemLarge_C::IsUnlcked' has a wrong offset!");

}

