#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HandleCorrection

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"
#include "Engine_structs.hpp"
#include "ProjectP_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UIST_Color_structs.hpp"


namespace SDK::Params
{

// Function UIW_HandleCorrection.UIW_HandleCorrection_C.ExecuteUbergraph_UIW_HandleCorrection
// 0x00D0 (0x00D0 - 0x0000)
struct UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_7;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_6;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckCondition_CanCorrection;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_1;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_5;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_4;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_3;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_2;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsSelected;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey_1;               // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         K2Node_ComponentBoundEvent_BtnKey;                 // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue;           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_ReturnValue_1;            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumItems_ReturnValue_1;                // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BP_GetSelectedItem_ReturnValue_1;         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_ReturnValue_2;            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULGameDataSystem*                       CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue_1;                      // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection) == 0x000008, "Wrong alignment on UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection");
static_assert(sizeof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection) == 0x0000D0, "Wrong size on UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, EntryPoint) == 0x000000, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::EntryPoint' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, K2Node_ComponentBoundEvent_BtnKey_7) == 0x000008, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::K2Node_ComponentBoundEvent_BtnKey_7' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, K2Node_ComponentBoundEvent_BtnKey_6) == 0x000010, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::K2Node_ComponentBoundEvent_BtnKey_6' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, CallFunc_CheckCondition_CanCorrection) == 0x000018, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::CallFunc_CheckCondition_CanCorrection' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, K2Node_ComponentBoundEvent_Item_1) == 0x000020, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::K2Node_ComponentBoundEvent_Item_1' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, K2Node_ComponentBoundEvent_BtnKey_5) == 0x000028, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::K2Node_ComponentBoundEvent_BtnKey_5' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, K2Node_ComponentBoundEvent_BtnKey_4) == 0x000030, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::K2Node_ComponentBoundEvent_BtnKey_4' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, K2Node_ComponentBoundEvent_BtnKey_3) == 0x000038, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::K2Node_ComponentBoundEvent_BtnKey_3' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, K2Node_ComponentBoundEvent_BtnKey_2) == 0x000040, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::K2Node_ComponentBoundEvent_BtnKey_2' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, CallFunc_GetMainWidget_MainWidget) == 0x000048, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, K2Node_ComponentBoundEvent_Item) == 0x000050, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::K2Node_ComponentBoundEvent_Item' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, K2Node_ComponentBoundEvent_bIsSelected) == 0x000058, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::K2Node_ComponentBoundEvent_bIsSelected' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, CallFunc_GetIndexForItem_ReturnValue) == 0x00005C, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::CallFunc_GetIndexForItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, K2Node_ComponentBoundEvent_BtnKey_1) == 0x000060, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::K2Node_ComponentBoundEvent_BtnKey_1' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, K2Node_ComponentBoundEvent_BtnKey) == 0x000068, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::K2Node_ComponentBoundEvent_BtnKey' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, CallFunc_GetNumItems_ReturnValue) == 0x000074, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, CallFunc_Subtract_IntInt_ReturnValue) == 0x000078, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, CallFunc_BP_GetSelectedItem_ReturnValue) == 0x000080, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::CallFunc_BP_GetSelectedItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, CallFunc_GetIndexForItem_ReturnValue_1) == 0x000088, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::CallFunc_GetIndexForItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, CallFunc_IsValid_ReturnValue_1) == 0x00008C, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000090, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, CallFunc_Clamp_ReturnValue) == 0x000094, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, CallFunc_GetNumItems_ReturnValue_1) == 0x000098, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::CallFunc_GetNumItems_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x00009C, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, CallFunc_BP_GetSelectedItem_ReturnValue_1) == 0x0000A0, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::CallFunc_BP_GetSelectedItem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, CallFunc_GetIndexForItem_ReturnValue_2) == 0x0000A8, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::CallFunc_GetIndexForItem_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x0000B0, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, CallFunc_Add_IntInt_ReturnValue) == 0x0000B8, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, CallFunc_Clamp_ReturnValue_1) == 0x0000BC, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::CallFunc_Clamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection, K2Node_MakeArray_Array) == 0x0000C0, "Member 'UIW_HandleCorrection_C_ExecuteUbergraph_UIW_HandleCorrection::K2Node_MakeArray_Array' has a wrong offset!");

// Function UIW_HandleCorrection.UIW_HandleCorrection_C.BndEvt__UIW_HandleCorrection_Btn_NextPage_K2Node_ComponentBoundEvent_9_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_NextPage_K2Node_ComponentBoundEvent_9_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_NextPage_K2Node_ComponentBoundEvent_9_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_NextPage_K2Node_ComponentBoundEvent_9_OnActive__DelegateSignature");
static_assert(sizeof(UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_NextPage_K2Node_ComponentBoundEvent_9_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_NextPage_K2Node_ComponentBoundEvent_9_OnActive__DelegateSignature");
static_assert(offsetof(UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_NextPage_K2Node_ComponentBoundEvent_9_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_NextPage_K2Node_ComponentBoundEvent_9_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_HandleCorrection.UIW_HandleCorrection_C.BndEvt__UIW_HandleCorrection_Btn_PrevPage_K2Node_ComponentBoundEvent_8_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_PrevPage_K2Node_ComponentBoundEvent_8_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_PrevPage_K2Node_ComponentBoundEvent_8_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_PrevPage_K2Node_ComponentBoundEvent_8_OnActive__DelegateSignature");
static_assert(sizeof(UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_PrevPage_K2Node_ComponentBoundEvent_8_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_PrevPage_K2Node_ComponentBoundEvent_8_OnActive__DelegateSignature");
static_assert(offsetof(UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_PrevPage_K2Node_ComponentBoundEvent_8_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_PrevPage_K2Node_ComponentBoundEvent_8_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_HandleCorrection.UIW_HandleCorrection_C.BndEvt__UIW_HandleCorrection_List_Correction_K2Node_ComponentBoundEvent_7_OnListItemSelectionChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_List_Correction_K2Node_ComponentBoundEvent_7_OnListItemSelectionChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_List_Correction_K2Node_ComponentBoundEvent_7_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000008, "Wrong alignment on UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_List_Correction_K2Node_ComponentBoundEvent_7_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(sizeof(UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_List_Correction_K2Node_ComponentBoundEvent_7_OnListItemSelectionChangedDynamic__DelegateSignature) == 0x000010, "Wrong size on UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_List_Correction_K2Node_ComponentBoundEvent_7_OnListItemSelectionChangedDynamic__DelegateSignature");
static_assert(offsetof(UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_List_Correction_K2Node_ComponentBoundEvent_7_OnListItemSelectionChangedDynamic__DelegateSignature, Item) == 0x000000, "Member 'UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_List_Correction_K2Node_ComponentBoundEvent_7_OnListItemSelectionChangedDynamic__DelegateSignature::Item' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_List_Correction_K2Node_ComponentBoundEvent_7_OnListItemSelectionChangedDynamic__DelegateSignature, bIsSelected) == 0x000008, "Member 'UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_List_Correction_K2Node_ComponentBoundEvent_7_OnListItemSelectionChangedDynamic__DelegateSignature::bIsSelected' has a wrong offset!");

// Function UIW_HandleCorrection.UIW_HandleCorrection_C.BndEvt__UIW_HandleCorrection_Btn_Right_K2Node_ComponentBoundEvent_6_OnRepeat__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Right_K2Node_ComponentBoundEvent_6_OnRepeat__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Right_K2Node_ComponentBoundEvent_6_OnRepeat__DelegateSignature) == 0x000008, "Wrong alignment on UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Right_K2Node_ComponentBoundEvent_6_OnRepeat__DelegateSignature");
static_assert(sizeof(UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Right_K2Node_ComponentBoundEvent_6_OnRepeat__DelegateSignature) == 0x000008, "Wrong size on UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Right_K2Node_ComponentBoundEvent_6_OnRepeat__DelegateSignature");
static_assert(offsetof(UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Right_K2Node_ComponentBoundEvent_6_OnRepeat__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Right_K2Node_ComponentBoundEvent_6_OnRepeat__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_HandleCorrection.UIW_HandleCorrection_C.BndEvt__UIW_HandleCorrection_Btn_Right_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Right_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Right_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Right_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature");
static_assert(sizeof(UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Right_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Right_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature");
static_assert(offsetof(UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Right_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Right_K2Node_ComponentBoundEvent_4_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_HandleCorrection.UIW_HandleCorrection_C.BndEvt__UIW_HandleCorrection_Btn_Left_K2Node_ComponentBoundEvent_3_OnRepeat__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Left_K2Node_ComponentBoundEvent_3_OnRepeat__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Left_K2Node_ComponentBoundEvent_3_OnRepeat__DelegateSignature) == 0x000008, "Wrong alignment on UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Left_K2Node_ComponentBoundEvent_3_OnRepeat__DelegateSignature");
static_assert(sizeof(UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Left_K2Node_ComponentBoundEvent_3_OnRepeat__DelegateSignature) == 0x000008, "Wrong size on UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Left_K2Node_ComponentBoundEvent_3_OnRepeat__DelegateSignature");
static_assert(offsetof(UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Left_K2Node_ComponentBoundEvent_3_OnRepeat__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Left_K2Node_ComponentBoundEvent_3_OnRepeat__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_HandleCorrection.UIW_HandleCorrection_C.BndEvt__UIW_HandleCorrection_Btn_Left_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Left_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Left_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Left_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature");
static_assert(sizeof(UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Left_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Left_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature");
static_assert(offsetof(UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Left_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_Btn_Left_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_HandleCorrection.UIW_HandleCorrection_C.BndEvt__UIW_HandleCorrection_List_Correction_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_List_Correction_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_List_Correction_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong alignment on UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_List_Correction_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature");
static_assert(sizeof(UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_List_Correction_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature) == 0x000008, "Wrong size on UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_List_Correction_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature");
static_assert(offsetof(UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_List_Correction_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature, Item) == 0x000000, "Member 'UIW_HandleCorrection_C_BndEvt__UIW_HandleCorrection_List_Correction_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature::Item' has a wrong offset!");

// Function UIW_HandleCorrection.UIW_HandleCorrection_C.BndEvt__Btn_Select_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_HandleCorrection_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HandleCorrection_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_HandleCorrection_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature");
static_assert(sizeof(UIW_HandleCorrection_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_HandleCorrection_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature");
static_assert(offsetof(UIW_HandleCorrection_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_HandleCorrection_C_BndEvt__Btn_Select_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_HandleCorrection.UIW_HandleCorrection_C.BndEvt__Btn_Back_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UIW_HandleCorrection_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HandleCorrection_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature) == 0x000008, "Wrong alignment on UIW_HandleCorrection_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature");
static_assert(sizeof(UIW_HandleCorrection_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature) == 0x000008, "Wrong size on UIW_HandleCorrection_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature");
static_assert(offsetof(UIW_HandleCorrection_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature, BtnKey) == 0x000000, "Member 'UIW_HandleCorrection_C_BndEvt__Btn_Back_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature::BtnKey' has a wrong offset!");

// Function UIW_HandleCorrection.UIW_HandleCorrection_C.HasWeapon&Handle
// 0x0068 (0x0068 - 0x0000)
struct UIW_HandleCorrection_C_HasWeapon_Handle final
{
public:
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0000(0x0018)()
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerInventory*                      CallFunc_GetPlayerInventory_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULUISystem*                             CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ULWeaponItem*>                   CallFunc_GetWeaponItems_SortedByEquipSlot_ReturnValue; // 0x0038(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ULItem*>                         CallFunc_FindHandleItems_ReturnValue;              // 0x0050(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_HandleCorrection_C_HasWeapon_Handle) == 0x000008, "Wrong alignment on UIW_HandleCorrection_C_HasWeapon_Handle");
static_assert(sizeof(UIW_HandleCorrection_C_HasWeapon_Handle) == 0x000068, "Wrong size on UIW_HandleCorrection_C_HasWeapon_Handle");
static_assert(offsetof(UIW_HandleCorrection_C_HasWeapon_Handle, CallFunc_GetGameStrWithName_ReturnValue) == 0x000000, "Member 'UIW_HandleCorrection_C_HasWeapon_Handle::CallFunc_GetGameStrWithName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_HasWeapon_Handle, CallFunc_GetMainWidget_MainWidget) == 0x000018, "Member 'UIW_HandleCorrection_C_HasWeapon_Handle::CallFunc_GetMainWidget_MainWidget' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_HasWeapon_Handle, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'UIW_HandleCorrection_C_HasWeapon_Handle::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_HasWeapon_Handle, CallFunc_GetPlayerInventory_ReturnValue) == 0x000028, "Member 'UIW_HandleCorrection_C_HasWeapon_Handle::CallFunc_GetPlayerInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_HasWeapon_Handle, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000030, "Member 'UIW_HandleCorrection_C_HasWeapon_Handle::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_HasWeapon_Handle, CallFunc_GetWeaponItems_SortedByEquipSlot_ReturnValue) == 0x000038, "Member 'UIW_HandleCorrection_C_HasWeapon_Handle::CallFunc_GetWeaponItems_SortedByEquipSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_HasWeapon_Handle, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000048, "Member 'UIW_HandleCorrection_C_HasWeapon_Handle::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_HasWeapon_Handle, CallFunc_FindHandleItems_ReturnValue) == 0x000050, "Member 'UIW_HandleCorrection_C_HasWeapon_Handle::CallFunc_FindHandleItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_HasWeapon_Handle, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000060, "Member 'UIW_HandleCorrection_C_HasWeapon_Handle::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");

// Function UIW_HandleCorrection.UIW_HandleCorrection_C.MoveLeftTab
// 0x0008 (0x0008 - 0x0000)
struct UIW_HandleCorrection_C_MoveLeftTab final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HandleCorrection_C_MoveLeftTab) == 0x000008, "Wrong alignment on UIW_HandleCorrection_C_MoveLeftTab");
static_assert(sizeof(UIW_HandleCorrection_C_MoveLeftTab) == 0x000008, "Wrong size on UIW_HandleCorrection_C_MoveLeftTab");
static_assert(offsetof(UIW_HandleCorrection_C_MoveLeftTab, BtnKey) == 0x000000, "Member 'UIW_HandleCorrection_C_MoveLeftTab::BtnKey' has a wrong offset!");

// Function UIW_HandleCorrection.UIW_HandleCorrection_C.MoveRightTab
// 0x0008 (0x0008 - 0x0000)
struct UIW_HandleCorrection_C_MoveRightTab final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HandleCorrection_C_MoveRightTab) == 0x000008, "Wrong alignment on UIW_HandleCorrection_C_MoveRightTab");
static_assert(sizeof(UIW_HandleCorrection_C_MoveRightTab) == 0x000008, "Wrong size on UIW_HandleCorrection_C_MoveRightTab");
static_assert(offsetof(UIW_HandleCorrection_C_MoveRightTab, BtnKey) == 0x000000, "Member 'UIW_HandleCorrection_C_MoveRightTab::BtnKey' has a wrong offset!");

// Function UIW_HandleCorrection.UIW_HandleCorrection_C.RefreshTab
// 0x0090 (0x0090 - 0x0000)
struct UIW_HandleCorrection_C_RefreshTab final
{
public:
	TArray<class UUIBP_ListData_WeaponPart_C*>    LocalTabDataList;                                  // 0x0000(0x0010)(Edit, BlueprintVisible)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_WeaponPart_C*            CallFunc_SpawnObject_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerInventory*                      CallFunc_GetPlayerInventory_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerInventory*                      CallFunc_GetPlayerInventory_ReturnValue_1;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ULWeaponItem*>                   CallFunc_GetWeaponItems_SortedByEquipSlot_ReturnValue; // 0x0048(0x0010)(ReferenceParm)
	TArray<class ULItem*>                         CallFunc_FindHandleItems_ReturnValue;              // 0x0058(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_2;         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Item, bool bIsSelected)> K2Node_CreateDelegate_OutputDelegate;              // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_WeaponPart_C*            CallFunc_SpawnObject_ReturnValue_1;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UIW_HandleCorrection_C_RefreshTab) == 0x000008, "Wrong alignment on UIW_HandleCorrection_C_RefreshTab");
static_assert(sizeof(UIW_HandleCorrection_C_RefreshTab) == 0x000090, "Wrong size on UIW_HandleCorrection_C_RefreshTab");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshTab, LocalTabDataList) == 0x000000, "Member 'UIW_HandleCorrection_C_RefreshTab::LocalTabDataList' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshTab, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000010, "Member 'UIW_HandleCorrection_C_RefreshTab::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshTab, CallFunc_MakeLiteralByte_ReturnValue) == 0x000011, "Member 'UIW_HandleCorrection_C_RefreshTab::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshTab, CallFunc_SpawnObject_ReturnValue) == 0x000018, "Member 'UIW_HandleCorrection_C_RefreshTab::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshTab, CallFunc_Array_Add_ReturnValue) == 0x000020, "Member 'UIW_HandleCorrection_C_RefreshTab::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshTab, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000028, "Member 'UIW_HandleCorrection_C_RefreshTab::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshTab, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000030, "Member 'UIW_HandleCorrection_C_RefreshTab::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshTab, CallFunc_GetPlayerInventory_ReturnValue) == 0x000038, "Member 'UIW_HandleCorrection_C_RefreshTab::CallFunc_GetPlayerInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshTab, CallFunc_GetPlayerInventory_ReturnValue_1) == 0x000040, "Member 'UIW_HandleCorrection_C_RefreshTab::CallFunc_GetPlayerInventory_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshTab, CallFunc_GetWeaponItems_SortedByEquipSlot_ReturnValue) == 0x000048, "Member 'UIW_HandleCorrection_C_RefreshTab::CallFunc_GetWeaponItems_SortedByEquipSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshTab, CallFunc_FindHandleItems_ReturnValue) == 0x000058, "Member 'UIW_HandleCorrection_C_RefreshTab::CallFunc_FindHandleItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshTab, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000068, "Member 'UIW_HandleCorrection_C_RefreshTab::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshTab, CallFunc_Array_IsValidIndex_ReturnValue_2) == 0x000069, "Member 'UIW_HandleCorrection_C_RefreshTab::CallFunc_Array_IsValidIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshTab, K2Node_CreateDelegate_OutputDelegate) == 0x00006C, "Member 'UIW_HandleCorrection_C_RefreshTab::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshTab, CallFunc_SpawnObject_ReturnValue_1) == 0x000080, "Member 'UIW_HandleCorrection_C_RefreshTab::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshTab, CallFunc_Array_Add_ReturnValue_1) == 0x000088, "Member 'UIW_HandleCorrection_C_RefreshTab::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function UIW_HandleCorrection.UIW_HandleCorrection_C.ChangeTab
// 0x0020 (0x0020 - 0x0000)
struct UIW_HandleCorrection_C_ChangeTab final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_WeaponPart_C*            K2Node_DynamicCast_AsUIBP_List_Data_Weapon_Part;   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_HandleCorrection_C_ChangeTab) == 0x000008, "Wrong alignment on UIW_HandleCorrection_C_ChangeTab");
static_assert(sizeof(UIW_HandleCorrection_C_ChangeTab) == 0x000020, "Wrong size on UIW_HandleCorrection_C_ChangeTab");
static_assert(offsetof(UIW_HandleCorrection_C_ChangeTab, Item) == 0x000000, "Member 'UIW_HandleCorrection_C_ChangeTab::Item' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ChangeTab, bIsSelected) == 0x000008, "Member 'UIW_HandleCorrection_C_ChangeTab::bIsSelected' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ChangeTab, K2Node_DynamicCast_AsUIBP_List_Data_Weapon_Part) == 0x000010, "Member 'UIW_HandleCorrection_C_ChangeTab::K2Node_DynamicCast_AsUIBP_List_Data_Weapon_Part' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_ChangeTab, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UIW_HandleCorrection_C_ChangeTab::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UIW_HandleCorrection.UIW_HandleCorrection_C.RefreshInventory
// 0x00D8 (0x00D8 - 0x0000)
struct UIW_HandleCorrection_C_RefreshInventory final
{
public:
	TArray<class ULItem*>                         LocalItems;                                        // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<class UUIBP_ListData_Item_C*>          LocalHandleListData;                               // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<class UUIBP_ListData_Weapon_C*>        LocalWeaponListData;                               // 0x0020(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerInventory*                      CallFunc_GetPlayerInventory_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ULWeaponItem*>                   CallFunc_GetWeaponItems_SortedByEquipSlot_ReturnValue; // 0x0048(0x0010)(ReferenceParm)
	class ULItem*                                 CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIBP_ListData_Item_C*                  CallFunc_SpawnObject_ReturnValue;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerInventory*                      CallFunc_GetPlayerInventory_ReturnValue_1;         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ULItem*>                         CallFunc_FindHandleItems_ReturnValue;              // 0x0090(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ListData_Weapon_C*                CallFunc_SpawnObject_ReturnValue_1;                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItem*                                 CallFunc_Array_Get_Item_1;                         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULWeaponItem*                           K2Node_DynamicCast_AsLWeapon_Item;                 // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UIW_HandleCorrection_C_RefreshInventory) == 0x000008, "Wrong alignment on UIW_HandleCorrection_C_RefreshInventory");
static_assert(sizeof(UIW_HandleCorrection_C_RefreshInventory) == 0x0000D8, "Wrong size on UIW_HandleCorrection_C_RefreshInventory");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, LocalItems) == 0x000000, "Member 'UIW_HandleCorrection_C_RefreshInventory::LocalItems' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, LocalHandleListData) == 0x000010, "Member 'UIW_HandleCorrection_C_RefreshInventory::LocalHandleListData' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, LocalWeaponListData) == 0x000020, "Member 'UIW_HandleCorrection_C_RefreshInventory::LocalWeaponListData' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, Temp_int_Array_Index_Variable) == 0x000030, "Member 'UIW_HandleCorrection_C_RefreshInventory::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000038, "Member 'UIW_HandleCorrection_C_RefreshInventory::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, CallFunc_GetPlayerInventory_ReturnValue) == 0x000040, "Member 'UIW_HandleCorrection_C_RefreshInventory::CallFunc_GetPlayerInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, CallFunc_GetWeaponItems_SortedByEquipSlot_ReturnValue) == 0x000048, "Member 'UIW_HandleCorrection_C_RefreshInventory::CallFunc_GetWeaponItems_SortedByEquipSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, CallFunc_Array_Get_Item) == 0x000058, "Member 'UIW_HandleCorrection_C_RefreshInventory::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'UIW_HandleCorrection_C_RefreshInventory::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'UIW_HandleCorrection_C_RefreshInventory::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'UIW_HandleCorrection_C_RefreshInventory::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, Temp_int_Array_Index_Variable_1) == 0x00006C, "Member 'UIW_HandleCorrection_C_RefreshInventory::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, K2Node_SwitchEnum_CmpSuccess) == 0x000070, "Member 'UIW_HandleCorrection_C_RefreshInventory::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, CallFunc_SpawnObject_ReturnValue) == 0x000078, "Member 'UIW_HandleCorrection_C_RefreshInventory::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x000080, "Member 'UIW_HandleCorrection_C_RefreshInventory::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, CallFunc_GetPlayerInventory_ReturnValue_1) == 0x000088, "Member 'UIW_HandleCorrection_C_RefreshInventory::CallFunc_GetPlayerInventory_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, CallFunc_FindHandleItems_ReturnValue) == 0x000090, "Member 'UIW_HandleCorrection_C_RefreshInventory::CallFunc_FindHandleItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, CallFunc_Array_Add_ReturnValue) == 0x0000A0, "Member 'UIW_HandleCorrection_C_RefreshInventory::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, Temp_int_Loop_Counter_Variable_1) == 0x0000A4, "Member 'UIW_HandleCorrection_C_RefreshInventory::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, CallFunc_Less_IntInt_ReturnValue) == 0x0000A8, "Member 'UIW_HandleCorrection_C_RefreshInventory::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000AC, "Member 'UIW_HandleCorrection_C_RefreshInventory::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, CallFunc_SpawnObject_ReturnValue_1) == 0x0000B0, "Member 'UIW_HandleCorrection_C_RefreshInventory::CallFunc_SpawnObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, CallFunc_Array_Get_Item_1) == 0x0000B8, "Member 'UIW_HandleCorrection_C_RefreshInventory::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, K2Node_DynamicCast_AsLWeapon_Item) == 0x0000C0, "Member 'UIW_HandleCorrection_C_RefreshInventory::K2Node_DynamicCast_AsLWeapon_Item' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'UIW_HandleCorrection_C_RefreshInventory::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, CallFunc_Array_Add_ReturnValue_1) == 0x0000CC, "Member 'UIW_HandleCorrection_C_RefreshInventory::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, CallFunc_Array_Length_ReturnValue_1) == 0x0000D0, "Member 'UIW_HandleCorrection_C_RefreshInventory::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UIW_HandleCorrection_C_RefreshInventory, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000D4, "Member 'UIW_HandleCorrection_C_RefreshInventory::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function UIW_HandleCorrection.UIW_HandleCorrection_C.FocusedWeaponParts
// 0x0098 (0x0098 - 0x0000)
struct UIW_HandleCorrection_C_FocusedWeaponParts final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelected;                                       // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItem*                                 LocalLItem;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUIBP_ListData_HandleCorrection_C*> LocalList;                                         // 0x0018(0x0010)(Edit, BlueprintVisible)
