#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Alert_Interaction

#include "Basic.hpp"

#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_Alert_Interaction.UIW_Alert_Interaction_C
// 0x0028 (0x02D0 - 0x02A8)
class UUIW_Alert_Interaction_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           EnableCanvas;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIBP_LRichKeyTextBlock_C*              KeyBindText;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   MsgCode;                                           // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShow;                                            // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UIW_Alert_Interaction(int32 EntryPoint);
	void CompleteTween(class FName CategoryName);
	void Destruct();
	void Construct();
	void Show();
	void Hide();
	void SetInteraction(bool IsValid, class FName MsgCode_0);
	void OnEnableInteraction(bool IsValid);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_Alert_Interaction_C">();
	}
	static class UUIW_Alert_Interaction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Alert_Interaction_C>();
	}
};
static_assert(alignof(UUIW_Alert_Interaction_C) == 0x000008, "Wrong alignment on UUIW_Alert_Interaction_C");
static_assert(sizeof(UUIW_Alert_Interaction_C) == 0x0002D0, "Wrong size on UUIW_Alert_Interaction_C");
static_assert(offsetof(UUIW_Alert_Interaction_C, UberGraphFrame) == 0x0002A8, "Member 'UUIW_Alert_Interaction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_Interaction_C, EnableCanvas) == 0x0002B0, "Member 'UUIW_Alert_Interaction_C::EnableCanvas' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_Interaction_C, KeyBindText) == 0x0002B8, "Member 'UUIW_Alert_Interaction_C::KeyBindText' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_Interaction_C, MsgCode) == 0x0002C0, "Member 'UUIW_Alert_Interaction_C::MsgCode' has a wrong offset!");
static_assert(offsetof(UUIW_Alert_Interaction_C, IsShow) == 0x0002C8, "Member 'UUIW_Alert_Interaction_C::IsShow' has a wrong offset!");

}

