#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_EULA

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UIW_Window_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UIW_EULA.UIW_EULA_C
// 0x0058 (0x03A8 - 0x0350)
class UUIW_EULA_C final : public UUIW_Window_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UIW_EULA_C;                         // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUIW_Btn_Key_C*                         Btn_Agree;                                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_ChangeLanguage;                                // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Decline;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_C*                         Btn_Scroll;                                        // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ContentScrollBox;                                  // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Group_EULAControl;                                 // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_Info;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Title;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             ActiveDispatcher;                                  // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ActiveDispatcher__DelegateSignature(int32 BtnIndex);
	void ExecuteUbergraph_UIW_EULA(int32 EntryPoint);
	void BndEvt__UIW_EULA_Btn_Scroll_K2Node_ComponentBoundEvent_3_OnScroll__DelegateSignature(float Delta);
	void BndEvt__UIW_EULA_Btn_ChangeLanguage_K2Node_ComponentBoundEvent_2_OnActive__DelegateSignature(class UUIW_Btn_Key_C* BtnKey);
	void BndEvt__UIW_EULA_Btn_Decline_K2Node_ComponentBoundEvent_1_OnActive__DelegateSignature(class UUIW_Btn_Key_C* BtnKey);
	void BndEvt__UIW_EULA_Btn_Agree_K2Node_ComponentBoundEvent_0_OnActive__DelegateSignature(class UUIW_Btn_Key_C* BtnKey);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UIW_EULA_C">();
	}
	static class UUIW_EULA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_EULA_C>();
	}
};
static_assert(alignof(UUIW_EULA_C) == 0x000008, "Wrong alignment on UUIW_EULA_C");
static_assert(sizeof(UUIW_EULA_C) == 0x0003A8, "Wrong size on UUIW_EULA_C");
static_assert(offsetof(UUIW_EULA_C, UberGraphFrame_UIW_EULA_C) == 0x000350, "Member 'UUIW_EULA_C::UberGraphFrame_UIW_EULA_C' has a wrong offset!");
static_assert(offsetof(UUIW_EULA_C, Btn_Agree) == 0x000358, "Member 'UUIW_EULA_C::Btn_Agree' has a wrong offset!");
static_assert(offsetof(UUIW_EULA_C, Btn_ChangeLanguage) == 0x000360, "Member 'UUIW_EULA_C::Btn_ChangeLanguage' has a wrong offset!");
static_assert(offsetof(UUIW_EULA_C, Btn_Decline) == 0x000368, "Member 'UUIW_EULA_C::Btn_Decline' has a wrong offset!");
static_assert(offsetof(UUIW_EULA_C, Btn_Scroll) == 0x000370, "Member 'UUIW_EULA_C::Btn_Scroll' has a wrong offset!");
static_assert(offsetof(UUIW_EULA_C, ContentScrollBox) == 0x000378, "Member 'UUIW_EULA_C::ContentScrollBox' has a wrong offset!");
static_assert(offsetof(UUIW_EULA_C, Group_EULAControl) == 0x000380, "Member 'UUIW_EULA_C::Group_EULAControl' has a wrong offset!");
static_assert(offsetof(UUIW_EULA_C, Text_Info) == 0x000388, "Member 'UUIW_EULA_C::Text_Info' has a wrong offset!");
static_assert(offsetof(UUIW_EULA_C, Text_Title) == 0x000390, "Member 'UUIW_EULA_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UUIW_EULA_C, ActiveDispatcher) == 0x000398, "Member 'UUIW_EULA_C::ActiveDispatcher' has a wrong offset!");

}

